Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/dns/*.po
Languages: fr

source: All DNS zones
fr: Toutes les zones DNS

source: Assign additional names to a host.
fr: Assigner des noms supplémentaires à un hôte.

source: Basic settings
fr: Réglages de base

source: Basic values
fr: Valeurs de base

source: Canonical name
fr: Nom canonique

source: Contact person
fr: Personne à contacter

source: DNS: Alias record
fr: DNS : enregistrement d'alias

source: DNS: Forward lookup zone
fr: DNS : zone de recherche directe

source: DNS: Pointer record
fr: DNS : enregistrement de type pointeur (PTR)

source: DNS: Reverse lookup zone
fr: DNS : zone de recherche inversée

source: DNS: Service record
fr: DNS : enregistrement de service

source: Expiry interval
fr: Intervalle d'expiration

source: FQDNs must end with a dot.
fr: Les FQDNs doivent se terminer par '.'

source: General
fr: Général

source: General TXT record settings
fr: Réglages généraux des enregistrements TXT

source: General alias record settings
fr: Réglages généraux des enregistrements d'alias

source: General forward lookup zone settings
fr: Réglages généraux de la zone de recherche directe

source: General host record settings
fr: Réglages généraux des enregistrements hôtes

source: General pointer record settings
fr: Réglages généraux des enregistrements pointeurs

source: General reverse lookup zone settings
fr: Réglages généraux de la zone de recherche inversée

source: General service record settings
fr: Réglages généraux des enregistrements de services

source: Hostname
fr: Nom d'hôte

source: IP Address
fr: Adresse IP

source: IP addresses
fr: Adresses IP

source: IP addresses of the zone
fr: Adresses IP de la zone

source: Location
fr: Emplacement

source: MX records
fr: Enregistrements MX

source: Mail
fr: Courriel

source: Mail exchanger host
fr: Hôte échangeur de courrier (MX)

source: Mail exchanger records
fr: Enregistrements d'échangeur de courrier (MX)

source: Mail exchangers for this host
fr: Échangeurs de courrier pour cet hôte

source: Manage the Domain Name System.
fr: Gérer le système de nom de domaine (DNS).

source: Map IP addresses back to hostnames.
fr: Faire correspondre les adresse IP aux noms d'hôtes.

source: Map names to IP addresses (and other data).
fr: Faire correspondre les noms aux adresses IP (et autres données).

source: Name
fr: Nom

source: Name server
fr: Serveur de noms

source: Negative time to live
fr: Durée de vie (TTL) negative

source: Neither DN nor position given.
fr: Ni nom de domaine, ni emplacement fourni.

source: One or more IP addresses, to which the name is resolved to.
fr: Une ou plusieurs adresses IP vers lesquelles le nom est résolu.

source: One or more arbitrary text strings.
fr: Une ou plusieurs chaînes de texte arbitraires.

source: Optional text
fr: Texte facultatif

source: Pointer record
fr: Enregistrement de pointeur

source: Primary name server information
fr: Informations relatives au serveur de noms principal

source: Refresh interval
fr: Intervalle de rafraîchissement

source: Resolve the symbolic name to IP addresses.
fr: Résoudre le nom symbolique en adresses IP.

source: Resolve the symbolic name to some textual data.
fr: Résoudre le nom symbolique en données de texte.

source: Resolve well-known services to servers providing those services.
fr: Résoudre les services bien connus en serveurs fournissant ces services.

source: Retry interval
fr: Intervalle entre deux essais

source: Reverse address
fr: Adresse IP reverse

source: Reverse zone and IP address are incompatible.
fr: La zone inverse et l'adresse IP ne sont pas compatibles.

source: Serial number
fr: Numéro de série

source: Start of authority
fr: Début d'autorité (SOA)

source: Subnet
fr: Sous-réseau

source: TXT records
fr: Enregistrements TXT

source: Text
fr: Texte

source: Text Record
fr: Enregistrement de texte

source: Text records
fr: Enregistrements de texte

source: The FQDNs of the hosts responsible for receiving mail for this DNS name.
fr: Les noms de domaine pleinement qualifiés (FQDN) des hôtes responsables de la réception du courrier pour ce nom DNS.

source: The FQDNs of the servers serving this zone.
fr: Les noms de domaine pleinement qualifiés (FQDN) des serveurs traitant cette zone.

source: The email address of the person responsible for this zone.
fr: L'adresse électronique de la personne responsable de cette zone.

source: The host part of the IP address in reverse notation (e.g. "172.16.1.2/16" -> "2.1" or "2001:0db8:0100::0007:0008/96" -> "8.0.0.0.7.0.0.0").
fr: La partie "hôte" de l'adresse IP en notation inverse (par exemple "172.16.1.2/16" -> "2.1" ou "2001:0db8:0100::0007:0008/96" -> "8.0.0.0.7.0.0.0").

source: The host providing the service.
fr: L'hôte fournissant ce service.

source: The name and protocol of the service.
fr: Le nom et le protocole de ce service.

source: The name of the domain.
fr: Le nom du domaine.

source: The name of the entry relative to the domain.
fr: Le nom de l'entrée relativement au domaine.

source: The name of the host relative to the domain.
fr: Le nom de l'hôte relativement au domaine.

source: The name this alias points to. A FQDN must end with a dot.
fr: Alias pour cet hôte. Les FQDNs doivent se terminer par '.'

source: The networks address in forward notation.
fr: L'adresse du réseau en notation directe.

source: The sequence number for this zone. Updates automatically.
fr: Le numéro de séquence pour cette zone. Se met à jour automatiquement.

source: The time interval "not found" answers are cached.
fr: L'intervalle de temps durant lequel les réponses "non trouvé" sont mises en cache.

source: The time interval after which secondary DNS servers will expire failed zones.
fr: L'intervalle de temps au delà duquel les serveurs DNS secondaires font expirer les zones ayant échoué.

source: The time interval secondary DNS servers use to check the zone for updates.
fr: L'intervalle de temps utilisé par les serveurs DNS secondaires pour vérifier les mises à jour de la zone.

source: The time interval secondary DNS servers use to retry failed refresh updates.
fr: L'intervalle de temps utilisé par les serveurs DNS secondaires pour retenter des mises à jour de rafraîchissement après un échec.

source: The time this entry may be cached.
fr: La durée durant laquelle cette entrée peut être mise en cache.

source: Time to live
fr: Durée de vie (TTL)

source: Zone name
fr: Nom de la zone

source: Zone time to live
fr: Durée de vie (TTL) de la zone
