Repository: univention/univention-corporate-server
Catalog: management/univention-management-console-module-lib/umc/js/*.po
Languages: de

source: <b>Note:</b> After the restart you will be redirected to the login page.
de: <b>Hinweis:</b> Nach dem Neustart werden Sie zur Login-Seite weitergeleitet werden.

source: Cancel
de: Abbrechen

source: Please confirm to reboot this server. This may take a few minutes.
de: Bitte bestätigen Sie den Neustart dieses Servers. Dies kann einige Minuten dauern.

source: Please confirm to restart UMC server components and the HTTP web server. This will take approximately 10 seconds.
de: Bitte bestätigen Sie den Neustart der UMC-Server-Komponenten und des HTTP-Web-Servers. Dies wird ungefähr 10 Sekunden dauern.

source: Please confirm to shutdown this server. This may take a few minutes.
de: Bitte bestätigen Sie das Herunterfahren dieses Servers. Dies kann einige Minuten dauern.

source: Please wait while UMC server components and HTTP web server are being restarted.
de: Bitte warten Sie während die UMC-Server-Komponenten und der HTTP-Web-Server neu gestartet werden.

source: Reboot
de: Neustart

source: Rebooting server
de: Server-Neustart

source: Restart
de: Neustart

source: Restarting server
de: Server-Neustart

source: Shutdown
de: Herunterfahren

source: Shutting down server
de: Fahre Server herunter

source: The server is being rebooted.
de: Der Server wird neugestartet.

source: The server is shutting down.
de: Der Server wird heruntergefahren.
