Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/users/*.po
Languages: fr

source: %(homeSharePath)s must be given if %(homeShare)s is given.
fr: %(homeSharePath)s doit être indiqué si %(homeShare)s est fourni.

source: %s: Invalid path
fr: %s : chemin invalide

source: Account
fr: Compte

source: Account deactivation
fr: Désactivation du compte

source: Account expiry date
fr: Date d'expiration du compte

source: Account is deactivated
fr: Le compte est désactivé

source: Account settings
fr: Réglages du compte

source: Activate user account starting from
fr: Activer le compte d’utilisateur ou d’utilisatrice à partir de

source: Additional e-mail addresses for which e-mails will be delivered to the "Primary e-mail address". The domain must be one of the UCS hosted e-mail domains.
fr: Adresses e-mail supplémentaires pour lesquelles les e-mails seront délivrés à l’« Adresse e-mail principale ». Le domaine doit être l’un des domaines de messagerie hébergés par UCS.

source: Additional groups
fr: Groupes supplémentaires

source: Advanced settings
fr: Réglages avancés

source: Allow the authentication only on this Microsoft Windows host
fr: Autoriser l'authentification uniquement sur cet hôte Microsoft Windows

source: Basic settings
fr: Réglages de base

source: Birthdate
fr: Date de naissance

source: Business
fr: Professionnel

source: Certificate
fr: Certificat

source: Certificate Issuer Common Name
fr: Nom courant de l'émetteur du certificat

source: Certificate Issuer Country
fr: Pays de l'émetteur du certificat

source: Certificate Issuer Location
fr: Emplacement géographique de l'émetteur du certificat

source: Certificate Issuer Mail
fr: Courriel de l'émetteur du certificat

source: Certificate Issuer Organisation
fr: Organisation de l'émetteur du certificat

source: Certificate Issuer Organisational Unit
fr: Unité d'Organisation de l'émetteur du certificat

source: Certificate Issuer State
fr: État de l'émetteur du certificat

source: Certificate Serial
fr: Numéro de série du certificat

source: Certificate Subject Common Name
fr: Nom courant du sujet du certificat

source: Certificate Subject Country
fr: Pays du sujet du certificat

source: Certificate Subject Location
fr: Emplacement géographique du sujet du certificat

source: Certificate Subject Mail
fr: Courriel du sujet du certificat

source: Certificate Subject Organisation
fr: Organisation du sujet du certificat

source: Certificate Subject Organisational Unit
fr: Unité d'Organisation du sujet du certificat

source: Certificate Subject State
fr: État du sujet du certificat

source: Certificate Version
fr: Version du certificat

source: Certificate valid from
fr: Certificat valide du

source: Certificate valid until
fr: Certificat valide jusqu'au

source: Change password
fr: Changer le mot de passe

source: City
fr: Ville

source: Contact information
fr: Informations de contact

source: Country
fr: Pays

source: DN given as share is not valid.
fr: Le nom distingué donné comme partage n'est pas valide.

source: Date of birth
fr: Date de naissance

source: Deactivation
fr: Désactivation

source: Delivery office name
fr: Nom du bureau de livraison

source: Department number
fr: Numéro de département

source: Disable the user account for Windows, Kerberos and POSIX.
fr: Désactiver le compte d’utilisateur ou utilisatrice pour Windows, Kerberos et POSIX.

source: Display name
fr: Nom affiché

source: E-mail address
fr: Adresse électronique

source: E-mail address that will be used to create the IMAP/POP3 mailbox and that can be used as login for SMTP/IMAP/POP3 connections. The domain must be one of the UCS hosted e-mail domains.
fr: Adresse e-mail qui sera utilisée pour créer la boîte aux lettres IMAP/POP3 et qui peut être utilisée comme identifiant pour les connexions SMTP/IMAP/POP3. Le domaine doit être l’un des domaines de messagerie hébergés par UCS.

source: E-mail alias address
fr: Adresse d’alias de l’e-mail

source: Employee number
fr: Numéro d'employé

source: Employee type
fr: Type d'employé

source: First name
fr: Prénom

source: Forward e-mail address
fr: Adresse e-mail de transfert

source: Forwarding setting
fr: Réglage de transfert

source: General
fr: Général

source: Given DN is no share.
fr: Le nom distingué donné n'est pas un partage.

source: Group ID of the primary group
fr: ID de groupe du groupe principal

source: Groups
fr: Groupes

source: Home share
fr: Répertoire partagé personnel

source: Home share path
fr: Chemin du répertoire partagé personnel

source: If enabled, the user has to change his password the next time when he logs in.
fr: Si cette option est activée, l’utilisateur ou utilisatrice devra modifier son mot de passe lors de sa prochaine connexion.

source: If the account is locked out due to too many login failures, this checkbox allows unlocking.
fr: Si le compte est verrouillé en raison d’un trop grand nombre d’échecs de connexion, cette case à cocher permet de déverrouiller le compte.

source: Incoming e-mails for this user are copied/redirected to the specified forward e-mail addresses. Depending on the forwarding setting, a local copy of each e-mail is kept. If no forwarding e-mail addresses are specified, the e-mails are always kept in the user's mailbox.
fr: Les e-mails arrivant pour cette personne sont copiés/redirigés vers les adresses e-mail de transfert spécifiées. Selon le réglage du transfert, une copie locale de chaque e-mail est conservée ou non. Si aucune adresse e-mail de transfert n’est spécifiée, les e-mails sont toujours conservés dans la boîte aux lettres de la personne.

source: Initials
fr: Initiales

source: Invalid password.
fr: Mot de passe invalide.

source: Issuer
fr: Émetteur

source: Issuer Common Name
fr: Nom courant de l'émetteur

source: Issuer Country
fr: Pays de l'émetteur

source: Issuer Location
fr: Emplacement géographique de l'émetteur

source: Issuer Mail
fr: Courriel de l'émetteur

source: Issuer Organisation
fr: Organisation de l'émetteur

source: Issuer Organisational Unit
fr: Unité d'Organisation de l'émetteur

source: Issuer State
fr: État de l'émetteur

source: Key value pairs storing user preferences for UMC
fr: Paires clé-valeur contenant les préférences utilisateur pour UMC

source: Last name
fr: Nom de famille

source: Locked login
fr: Connexion verrouillée

source: Locked state of account
fr: État verrouillé du compte

source: Lockout till
fr: Verrouillage jusqu’à

source: Lockout time
fr: Durée du verrouillage

source: Login shell
fr: Terminal de connexion

source: Mail
fr: Courriel

source: Mail forwarding
fr: Transfert du courrier

source: Mail home server
fr: Serveur de courriel personnel

source: Mail preferences
fr: Préférences de courriel

source: Manage Samba privileges
fr: Gérer les privilèges Samba

source: Misc
fr: Divers

source: Mobile phone number
fr: Numéro de téléphone portable

source: Name
fr: Nom

source: No check for password quality and minimum length is performed.
fr: Aucune vérification de la qualité ni de la longueur minimale du mot de passe n’est effectuée.

source: No check if the password was already used is performed.
fr: Pas de vérification d’un éventuel emploi antérieur du mot de passe.

source: Override password check
fr: Ignorer la vérification de mot de passe

source: Override password history
fr: Ignorer l'historique de mots de passe

source: PKI user certificate (DER format)
fr: Certificat utilisateur PKI (format DER)

source: POSIX, Samba, Kerberos and mail account
fr: POSIX, Samba, Kerberos et compte de messagerie

source: Pager telephone number
fr: Numéro de téléavertisseur

source: Password
fr: Mot de passe

source: Password expiry date
fr: Date d'expiration du mot de passe

source: Passwords
fr: Mots de passe

source: Path to the home directory on the home share
fr: Chemin vers le répertoire personnel sur le répertoire partagé personnel

source: Permitted times for Windows logins
fr: Horaires autorisés pour l'ouverture de sessions Windows

source: Personal information
fr: Informations personnelles

source: Picture for user account in JPEG format
fr: Image pour le compte utilisateur au format JPEG

source: Picture of the user (JPEG format)
fr: Image de l'utilisateur (format JPEG)

source: Post office box
fr: Boîte postale

source: Postal code
fr: Code postal

source: Preferred delivery method
fr: Méthode de distribution préférée

source: Preferred language
fr: Langue préférée

source: Preferred written or spoken language for the person.
fr: Langue écrite ou parlée préférée pour la personne.

source: Primary e-mail address (mailbox)
fr: Adresse électronique principale (boîte de messagerie)

source: Primary e-mail address must be set, if a copy of forwarded messages should be stored in its mailbox.
fr: L'adresse électronique principale doit être définie si une copie des messages transmis doit être stockée dans la boîte aux lettres associée.

source: Primary e-mail address must be set, if messages should be forwarded for it.
fr: L'adresse électronique principale doit être définie si des messages doivent être transmis pour son compte.

source: Primary group
fr: Groupe principal

source: Private
fr: Personnel

source: Private postal address
fr: Adresse postale personnelle

source: Private telephone number
fr: Numéro de téléphone personnel

source: Public key infrastructure - user certificate
fr: Infrastructure à clés publiques - certificat utilisateur

source: Public key infrastructure account
fr: Compte dans l'infrastructure à clés publiques

source: Relative ID
fr: Identifiant relatif

source: Reset lockout
fr: Réinitialiser le verrouillage

source: Room number
fr: Numéro de salle

source: Samba privilege
fr: Privilèges Samba

source: Self
fr: Soi-même

source: Serial
fr: Numéro de série

source: Share, the user's home directory resides on
fr: Partage dans lequel se trouve le répertoire personnel de l'utilisateur

source: Shows the time when the account gets unlocked again according to policy.
fr: Affiche l’heure à laquelle le compte sera à nouveau déverrouillé conformément à la stratégie.

source: Simple authentication account
fr: Compte à authentification simple

source: Simple authentication accounts
fr: Comptes d’authentification simple

source: Specified the date from when the user must change his password. Enter date as "day.month.year".
fr: Spécifie la date à partir de laquelle l’utilisateur ou l’utilisatrice doit changer son mot de passe. Saisissez la date au format « jour.mois.année ».

source: Specifies if a local copy of each incoming e-mail is kept for this user. If no forwarding e-mail addresses are specified, the e-mails are always kept in the user's mailbox.
fr: Spécifie si une copie locale de chaque e-mail entrant est conservée pour cette utilisatrice ou cet utilisateur. Si aucune adresse e-mail de transfert n’est spécifiée, les e-mails sont toujours conservés dans sa boîte aux lettres.

source: Specifies the date from when the user is not allowed to login anymore. Enter date as "day.month.year".
fr: Spécifie la date à partir de laquelle l’utilisateur ou l’utilisatrice n’est plus autorisé·e à se connecter. Saisissez la date au format « jour.mois.année ».

source: Street
fr: Rue

source: Subject
fr: Sujet

source: Subject Common Name
fr: Nom courant du sujet

source: Subject Country
fr: Pays du sujet

source: Subject Location
fr: Emplacement géographique du sujet

source: Subject Mail
fr: Courriel du sujet

source: Subject Organisation
fr: Organisation du sujet

source: Subject Organisational Unit
fr: Unité d'Organisation du sujet

source: Subject State
fr: État du sujet

source: Superior
fr: Supérieur

source: Telephone number
fr: Numéro de téléphone

source: The directory path (resolvable by windows clients) e.g. %LOGONSERVER%\%USERNAME%\windows-profiles\default which is used to configure a roaming profile.
fr: Le chemin d’accès au répertoire (lisible par les clients Windows), par exemple %LOGONSERVER%\%USERNAME%\windows-profiles\default, qui est utilisé pour configurer un profil itinérant.

source: The directory path which is used as the user's Windows home directory, e.g. \\ucs-file-server\smith.
fr: Le chemin d’accès au répertoire utilisé comme répertoire personnel Windows de l’utilisateur ou utilisatrice, par exemple \\ucs-file-server\smith.

source: The drive letter (with trailing colon) where the Windows home directory of this user lies, e.g. M:. Needs only be specified if it is different to the Samba configuration.
fr: La lettre du lecteur (avec deux-points de fin) où se trouve le répertoire personnel Windows de cet utilisateur ou utilisatrice, par exemple « M: ». Ne doit être spécifiée que si elle diffère de la configuration Samba.

source: The password is too short, at least %d characters needed!
fr: Le mot de passe est trop court, il doit comporter au moins %d caractères !

source: The relative ID (RID) is the local part of the SID and will be assigned automatically to next available RID. It can not be subsequently changed. Valid values are numbers upwards 1000. RIDs below 1000 are reserved to standard groups and other special objects.
fr: L’ID relatif (RID) est la partie locale du SID et sera automatiquement assigné au prochain RID disponible. Il ne peut plus être modifié par la suite. Les valeurs valides sont des nombres supérieurs à 1000. Les RID inférieurs à 1000 sont réservés aux groupes standard et autres objets spéciaux.

source: The user-specific logon script relative to the NETLOGON share, e.g. user.bat.
fr: Le script d’ouverture de session spécifique à l’utilisateur ou à l’utilisatrice relatif au partage NETLOGON, par exemple « utilisateur.bat ».

source: This disables the account until the specified time.
fr: Ceci désactive le compte jusqu’à l’heure spécifiée.

source: This e-mail address serves only as contact information. This address has no effect on the UCS mail stack and is not related to a local mailbox.
fr: Cette adresse e-mail sert uniquement d’information de contact. Cette adresse n’a aucun effet sur la pile de messagerie UCS et n’est reliée à aucune boîte de messagerie locale.

source: This indicates if the account is locked out due to too many authentication failures.
fr: Ceci indique si le compte est verrouillé en raison d’un trop grand nombre d’échecs d’authentification.

source: This user object can only simply do an LDAP bind. It is intended for functional purposes and is not counted as user object in the license.
fr: Cet objet utilisateur ne peut qu’effectuer une liaison LDAP. Il est destiné à des fins fonctionnelles et n’est pas compté comme objet utilisateur dans la licence.

source: Timestamp when account lockout happened.
fr: Horodatage au moment du verrouillage du compte.

source: Title
fr: Titre

source: UMC preferences
fr: Préférences UMC

source: UMC user preferences
fr: Préférences d’utilisation UMC

source: Unix home directory
fr: Répertoire personnel UNIX

source: Unlock account
fr: Déverrouiller le compte

source: User
fr: Utilisateur ou utilisatrice

source: User ID
fr: ID d’utilisation

source: User account
fr: Compte d’utilisation

source: User has to change password on next login
fr: La personne devra changer son mot de passe à la prochaine connexion

source: User name
fr: Identifiant

source: User: Password
fr: Utilisateur ou utilisatrice : mot de passe

source: User: Self
fr: Utilisateur ou utilisatrice : Self

source: Users
fr: Utilisateurs et utilisatrices

source: Valid from
fr: Valide à partir du

source: Valid until
fr: Valide jusqu'au

source: Validity
fr: Validité

source: Windows home drive
fr: Lecteur personnel Windows

source: Windows home path
fr: Chemin personnel Windows

source: Windows logon script
fr: Script de connexion Windows

source: Windows profile directory
fr: Répertoire de profil Windows

source: unlimited
fr: illimité
