Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/settings/*.po
Languages: fr

source: A bitfield to indicate complexity and storage restrictions.
fr: Un champ binaire servant à indiquer la complexité et les restrictions de stockage.

source: A longer descriptive text, which is shown as a bubble-help in the UMC
fr: Un texte descriptif long, apparaissant dans la console UMC sous forme d'infobulle d'aide.

source: A short descriptive text which is used as label in the UMC
fr: Un texte descriptif court servant d'étiquette dans la console UMC

source: A value for this extended attribute is required and must be given
fr: Une valeur est requise et doit être fournie pour cet attribut étendu

source: ACL data
fr: Données de l'ACL

source: ACL file name
fr: Nom de fichier de l'ACL

source: ACL name
fr: Nom de l'ACL

source: Account
fr: Compte

source: Account deactivation
fr: Désactivation du compte

source: Account settings
fr: Réglages du compte

source: Activated
fr: Activé

source: Active
fr: Actif

source: Add an empty value to choice list
fr: Ajouter une valeur vide à la liste de choix

source: Advanced
fr: Avancé

source: An LDAP attribute is required of which the information will be stored.
fr: Un attribut LDAP est requis pour enregistrer l'information.

source: App identifier
fr: Identifiant d'app

source: Appearance
fr: Apparence

source: Attribute layout
fr: Présentation de l'attribut

source: Authorization
fr: Autorisation

source: Background
fr: Arrière-plan

source: Background image of the Portal
fr: Image d'arrière-plan du portail

source: Bad Lockout Attempts
fr: Tentatives de verrouillage ayant échoué

source: Bad lockout attempts
fr: Tentatives de verrouillage ayant échoué

source: Base DN
fr: Nom distingué de base

source: Base DN the license is valid for
fr: Base du nom distingué pour lequel la licence est valide

source: Basic values
fr: Valeurs de base

source: Business
fr: Professionnel

source: CSS background
fr: Arrière-plan CSS

source: Category
fr: Catégorie

source: Change password on next login
fr: Changer le mot de passe à la prochaine ouverture de session

source: City
fr: Ville

source: Computer Link
fr: Lien ordinateur

source: Computer Links
fr: Liens ordinateurs

source: Configuration Name
fr: Nom de la configuration

source: Configuration of LDAP object class and LDAP attribute
fr: Configuration de la classe d'objet LDAP et de l'attribut LDAP

source: Configuration of the modules to be extended
fr: Configuration des modules à étendre

source: Connection
fr: Connexion

source: Contact Information
fr: Informations de contact

source: Corporate clients
fr: Clients d'entreprise

source: Country
fr: Pays

source: DHCP Link
fr: Lien DHCP

source: DHCP Links
fr: Liens DHCP

source: DNS Link
fr: Lien DNS

source: DNS Links
fr: Liens DNS

source: DVS clients
fr: Clients DVS

source: DVS users
fr: Utilisateurs DVS

source: Data type
fr: Type de donnée

source: Data type definition
fr: Définition du type de donnée

source: Default
fr: Par défaut

source: Default Group for Managed Nodes
fr: Groupe par défaut des Managed Nodes

source: Default Group for Replica Directory Nodes
fr: Groupe par défaut des Replica Directory Nodes

source: Default KDE Profiles
fr: Profils KDE par défaut

source: Default Primary Group
fr: Groupe principal par défaut

source: Default container description
fr: Description des conteneurs par défaut

source: Default long description
fr: Description longue par défaut

source: Default settings description
fr: Description des réglages par défaut

source: Default short description
fr: Description courte par défaut

source: Default value
fr: Valeur par défaut

source: Default value which is set for this extended attribute when a new object is created
fr: Valeur par défaut fixée pour cet attribut étendu lorsqu'un nouvel objet est créé

source: Defines a specific flavor of the UMC module. If given the operations are permitted only if the flavor matches.
fr: Définit une variété particulière du module UMC. Lorsque cette information est fournie, les opérations ne sont autorisées que si la variété correspond.

source: Department number
fr: Numéro de département

source: Description of the entry. At least one entry; strongly encouraged to have one for en_US
fr: Description de l'entrée. Au moins une entrée : il est fortement recommandé d'avoir une entrée pour en_US.

source: Disconnect Time
fr: Heure de déconnexion

source: Disconnect time
fr: Heure de déconnexion

source: Display
fr: Affichage

source: Display Name
fr: Nom de l'affichage

source: Display name
fr: Nom de l'affichage

source: Displayed Attributes
fr: Attributs affichés

source: Displayed LDAP Attributes
fr: Attributs LDAP affichés

source: Do not show this extended attribute in the UMC
fr: Ne pas afficher cet attribut étendu dans la console UMC

source: E-mail address
fr: Adresse électronique

source: Editable
fr: Modifiable

source: Editable after creation
fr: Modifiable après création

source: Employee number
fr: Numéro d'employé

source: Employee type
fr: Type d'employé

source: Enable option by default.
fr: Activer l'option par défaut.

source: Entry options
fr: Options d'entrée

source: Exclude from UMC search
fr: Exclure de la recherche UMC

source: Expiry date
fr: Date d'expiration

source: Extended attribute description
fr: Description de l'attribut étendu

source: Extending the users module is only possible if a default value for a required value is given.
fr: Pour étendre le module utilisateurs, il est nécessaire de fournir une valeur par défaut pour les valeurs requises.

source: Favorite
fr: Favorit

source: Flavor
fr: Variété

source: GNU message catalog for translations
fr: Catalogue de messages GNU pour la traduction

source: General
fr: Général

source: General Content
fr: Contenu général

source: General LDAP ACL extension settings
fr: Réglages généraux de l'extension LDAP ACL

source: General LDAP schema extension settings
fr: Réglages généraux de l'extension de schéma LDAP

source: General Samba configuration settings
fr: Réglages généraux de configuration de Samba

source: General Samba domain settings
fr: Réglages généraux du domaine Samba

source: General UDM hook settings
fr: Réglages généraux des points d'interfaçage avec UDM

source: General UDM module settings
fr: Réglages généraux du module UDM

source: General UDM syntax settings
fr: Réglages généraux de la syntaxe UDM

source: General UMC operation set settings
fr: Réglages généraux des opérations UMC

source: General extended attribute settings
fr: Réglages généraux des attributs étendus

source: General extended options settings
fr: Réglages généraux des options étendues

source: General license settings
fr: Réglages généraux de licence

source: General lock settings
fr: Réglages généraux de verrouillage

source: General package list settings
fr: Réglages généraux des listes de paquetages

source: General printer URI list settings
fr: Réglages généraux de la liste des URIs d'imprimantes

source: General printer driver list settings
fr: Réglages généraux de la liste des pilotes d'imprimantes

source: General prohibited user names settings
fr: Réglages généraux relatifs aux noms d'utilisateurs interdits

source: General service settings
fr: Réglages généraux des services

source: General settings
fr: Réglages généraux

source: General syntax definition settings
fr: Réglages généraux des définitions de syntaxe

source: General user template settings
fr: Réglages généraux des modèles utilisateurs

source: Group Link
fr: Lien de groupe

source: Group Links
fr: Liens de groupes

source: Group Memberships
fr: Appartenance à des groupes

source: Group layout
fr: Présentation du groupe

source: Group name
fr: Nom du groupe

source: Group ordering number
fr: Numéro d'ordonnancement du groupe

source: Groups
fr: Groupes

source: Headline of the entry. At least one entry; strongly encouraged to have one for en_US
fr: En-tête de l'entrée. Au moins une entrée : il est fortement recommandé d'avoir une entrée pour en_US.

source: Headline of the portal. At least one entry; strongly encouraged to have one for en_US
fr: En-tête du portail. Au moins une entrée : il est fortement recommandé d'avoir une entrée pour en_US.

source: Home share
fr: Répertoire personnel partagé

source: Home share path
fr: Chemin du répertoire personnel partagé

source: Hook class
fr: Classe d'interfaçage

source: Icon
fr: Icône

source: If a tab with the given name already exists, it is replaced by a new tab only containing extended attributes
fr: S'il existe déjà un onglet portant ce nom, il est remplacé par un nouvel onglet contenant les attributs étendus

source: If possible, the LDAP object class is removed when this extended attribute gets unset
fr: Si possible, la classe d'objets LDAP est supprimée lorsque cet attribut étendu est réinitialisé

source: Internal name
fr: Nom interne

source: Is not based on the user's account name. Contains at least six characters. Contains characters from three of the following four categories: Uppercase alphabet characters (A-Z), Lowercase alphabet characters (a-z), Arabic numerals (0-9), Nonalphanumeric characters (for example, !$#,%)
fr: N'est pas dérivé du nom du compte utilisateur. Contient au moins six caractères. Contient des caractères dans trois des quatre catégories suivantes : lettres majuscules (A-Z), lettres minuscules (a-z), chiffres (0-9), caractères spéciaux (par exemple !$#,%).

source: KDE Profiles
fr: Profils KDE

source: Key ID
fr: Identifiant de clé

source: Key ID of this license.
fr: Identifiant de clé de cette licence.

source: LDAP Base
fr: Base LDAP

source: LDAP Search Filter
fr: Filtre de recherche LDAP

source: LDAP attribute
fr: Attribut LDAP

source: LDAP mapping
fr: Correspondance LDAP

source: LDAP object class
fr: Classe d'objet LDAP

source: License
fr: Licence

source: License Expiration Date
fr: Date d'expiration de la licence

source: License Link
fr: Lien licence

source: License Links
fr: Liens licences

source: Licensing Information
fr: Informations de licence

source: Link
fr: Lien

source: List of Operations for UMC
fr: Liste des opérations pour UMC

source: List of Packages for UCS Systems
fr: Liste des paquetages pour les systèmes UCS

source: List of UMC command names or patterns
fr: Listes des noms et motifs de commandes UMC

source: List of URIs for printers
fr: Liste des URIs des imprimantes

source: List of drivers for printers
fr: Liste des pilotes d'imprimantes

source: List of modules this option applies to.
fr: Liste des modules auxquels s'applique cette option.

source: Lock Information
fr: Informations de verrouillage

source: Lock Time
fr: Heure de verrouillage

source: Lock objects
fr: Objets verrous

source: Locked until
fr: Verrouillé jusqu'à

source: Locking and deactivation
fr: Verrouillage et désactivation

source: Lockout Duration Minutes
fr: Durée du verrouillage en minutes

source: Lockout duration minutes
fr: Durée du verrouillage en minutes

source: Login shell
fr: Terminal de connexion

source: Logo image for the portal.
fr: Image à utiliser pour le logo du portail.

source: Long Description
fr: Description longue

source: Long description
fr: Description longue

source: Long description for the option as shown on the Option tab.
fr: Description longue des options, telle qu'elle apparaît dans l'onglet Options.

source: Mail Link
fr: Lien courriel

source: Mail Links
fr: Liens courriel

source: Managed Clients
fr: Clients gérés

source: Mapping to LDAP objectClasses
fr: Correspondance avec les classes d'objets LDAP

source: Max. clients
fr: Clients max

source: Max. desktops
fr: Bureaux max

source: Max. groupware accounts
fr: Comptes de collecticiel max

source: Max. user accounts
fr: Comptes d'utilisateurs max

source: Maximal UCS version
fr: Version UCS maximale

source: Maximum Password Age
fr: Âge maximum du mot de passe

source: Maximum number of DVS clients this license allows.
fr: Nombre maximum de clients DVS autorisés par cette licence.

source: Maximum number of DVS users this license allows.
fr: Nombre maximum d'utilisateurs DVS autorisés par cette licence.

source: Maximum number of Univention desktop accounts managed with the UCS infrastructure
fr: Nombre maximum de comptes de bureau Univention gérés par cette infrastructure UCS.

source: Maximum number of client hosts managed with the UCS infrastructure
fr: Nombre maximum d'hôtes clients gérés par l'infrastructure UCS

source: Maximum number of corporate clients this license allows.
fr: Nombre maximum de clients d'entreprise autorisés par cette licence.

source: Maximum number of groupware accounts managed with the UCS infrastructure
fr: Nombre maximum de comptes de collecticiel gérés par l'infrastructure UCS

source: Maximum number of managed clients this license allows.
fr: Nombre maximum de clients gérés autorisés par cette licence.

source: Maximum number of servers this license allows.
fr: Nombre maximum de serveurs autorisés par cette licence.

source: Maximum number of user accounts managed with the UCS infrastructure
fr: Nombre maximum de comptes d'utilisateurs gérés par l'infrastructure UCS

source: Maximum number of users this license allows.
fr: Nombre maximum d'utilisateurs autorisés par cette licence.

source: Maximum password age
fr: Âge maximum du mot de passe

source: Metadata
fr: Métadonnées

source: Minimal UCS version
fr: Version UCS minimale

source: Minimum Password Age
fr: Âge minimum du mot de passe

source: Minimum password age
fr: Âge minimum du mot de passe

source: Module the license is valid for
fr: Module pour lequel la licence est valide

source: Modules this extended attribute is added to, e.g. "users/user" or "computers/windows"
fr: Modules auxquels cet attribut étendu est ajouté, par exemple "users/user" ou "computers/windows"

source: Modules to be extended
fr: Modules à étendre

source: Multi value
fr: Valeurs multiples

source: Name
fr: Nom

source: Name of a Python class implementing the univention.admin.hook interface, which can be used to execute additional actions when an object is created, modified or deleted
fr: Nom d'une classe Python mettant en œuvre l'interface univention.admin.hook qui peut être utilisée pour exécuter des actions supplémentaires lorsqu'un objet est créé, modifié ou supprimé.

source: Name of the tab in the UMC on which this extended attribute is be placed. A new tab is created automatically if no tab with the name exists
fr: Nom de l'onglet de la console UMC dans lequel est placé cet attribut étendu. Un nouvel onglet est créé automatiquement si aucun onglet portant ce nom n'existe.

source: Name which by default is used by UDM CLI and internally to identify the extended attribute
fr: Nom utilisé par défaut par la ligne de commande UDM et en interne pour identifier l'attribut étendu.

source: Needed module
fr: Module requis

source: Network Link
fr: Lien réseau

source: Network Links
fr: Liens réseaux

source: Next RID
fr: RID suivant

source: Next group RID
fr: RID de groupe suivant

source: Next user RID
fr: RID utilisateur suivant

source: OEM Product types this license allows.
fr: Types de produits OEM autorisés par cette licence.

source: Object that feeds everything in https://fqdn/univention/portal
fr: Objet alimentant tout le contenu de https://fqdn/univention/portal

source: One link in https://fqdn/univention/portal. Belongs to one (or more) settings/portal
fr: Un lien dans https://fqdn/univention/portal. Appartient à un (ou plusieurs) réglages/portail.

source: Option may be repeatedly turned on and off.
fr: L'option peut être activée et désactivée de manière répétée.

source: Options for extended attributes
fr: Options des attributs étendus

source: Ordering number
fr: Numéro d'ordonnancement

source: Overwrite existing tab
fr: Écraser l'onglet existant

source: Overwrite existing widget
fr: Écraser le champ existant

source: Package List
fr: Liste de paquetages

source: Password
fr: Mot de passe

source: Password History
fr: Historique du mot de passe

source: Password Length
fr: Longueur du mot de passe

source: Password history
fr: Historique du mot de passe

source: Password length
fr: Longueur du mot de passe

source: Password properties
fr: Propriétés du mot de passe

source: Passwords must meet complexity requirements
fr: Les mots de passe doivent répondre aux exigences de complexité

source: Path to the home directory on the home share
fr: Chemin vers le répertoire personnel sur le répertoire personnel partagé

source: Personal information
fr: Informations personnelles

source: Policy Link
fr: Lien stratégie

source: Policy Links
fr: Liens stratégies

source: Portal logo
fr: Logo du portail

source: Portal options
fr: Options du portail

source: Portal: Entry
fr: Portail : Entrée

source: Portal: Portal
fr: Portail : Portail

source: Portals
fr: Portails

source: Postal code
fr: Code postal

source: Preferences
fr: Préférences

source: Preferences: Default
fr: Préférences : par défaut

source: Preferences: Default Container
fr: Préférences : conteneur par défaut

source: Premium Support
fr: Assistance premium

source: Primary Groups
fr: Groupes principaux

source: Primary group
fr: Groupe principal

source: Printer Link
fr: Lien imprimante

source: Printer List
fr: Liste des imprimantes

source: Printer Model
fr: Modèle d'imprimante

source: Printer URI
fr: URI imprimante

source: Printers Links
fr: Liens imprimantes

source: Product type
fr: Type de produit

source: Product type this license allows.
fr: Type de produit autorisé par cette licence.

source: Product types this license allows.
fr: Types de produits autorisés par cette licence.

source: Prohibited user name
fr: Nom d'utilisateur interdit

source: Prohibited user names
fr: Noms d'utilisateurs interdits

source: Put this extended attribute under "Advanced settings". No autonomous tab will be created
fr: Placez cet attribut étendu dans les « Réglages avancés ». Aucun onglet indépendant ne sera créé.

source: Refuse Machine Password Change
fr: Refuser de changer les mots de passe des ordinateurs

source: Refuse machine password change
fr: Refuser le changement des mots de passe des ordinateurs

source: Related properties can be grouped. This field specifies the name of the group in which this extended attribute is put in. If no name is given, no group is used
fr: Des propriétés liées peuvent être regroupées. Ce champ définit le nom du groupe dans lequel cet attribut étendu doit figurer. Si aucun nom n'est indiqué, aucun regroupement n'est utilisé.

source: Remove object class if the attribute is removed
fr: Supprimer la classe d'objets si l'attribut est supprimé

source: Reset Count Minutes
fr: Durée avant réinitialisation du décompte

source: Reset count minutes
fr: Durée avant réinitialisation du décompte

source: Room number
fr: Numéro de salle

source: Samba SID
fr: SID Samba

source: Samba domain name
fr: Nom de domaine Samba

source: Schema data
fr: Données du schéma

source: Schema file name
fr: Nom de fichier du schéma

source: Schema name
fr: Nom du schéma

source: Servers
fr: Serveurs

source: Servers with premium support.
fr: Serveurs avec assistance premium.

source: Servers with standard support
fr: Serveurs avec assistance standard

source: Servers with standard support.
fr: Serveurs avec assistance standard.

source: Service Name
fr: Nom du service

source: Settings for UMC
fr: Réglages pour UMC

source: Settings: Extended attribute
fr: Réglages : attribut étendu

source: Settings: LDAP ACL Extension
fr: Réglages : extension LDAP ACL

source: Settings: LDAP Schema Extension
fr: Réglages : extension de schéma LDAP

source: Settings: License
fr: Réglages : licence

source: Settings: Lock
fr: Réglages : verrouillage

source: Settings: Package List
fr: Réglages : liste des paquetages

source: Settings: Printer Driver List
fr: Réglages : liste des pilotes d'imprimantes

source: Settings: Printer URI List
fr: Réglages : liste des URIs d'imprimantes

source: Settings: Prohibited user names
fr: Réglages : noms d'utilisateurs interdits

source: Settings: Samba Configuration
fr: Réglages : configuration Samba

source: Settings: Samba Domain
fr: Réglages : domaine Samba

source: Settings: Service
fr: Réglages : service

source: Settings: Syntax Definition
fr: Réglages : définition de syntaxe

source: Settings: UDM Hook
fr: Réglages : point d'interfaçage avec UDM

source: Settings: UDM Module
fr: Réglages : module UDM

source: Settings: UDM Syntax
fr: Réglages : syntaxe UDM

source: Settings: UMC operation set
fr: Réglages : jeu d'opérations UMC

source: Settings: User Template
fr: Réglages : modèle utilisateur

source: Share Link
fr: Lien partage

source: Share, the user's home directory resides on
fr: Partage dans lequel se trouve le répertoire personnel de l'utilisateur

source: Shares Links
fr: Liens partages

source: Short description
fr: Description courte

source: Short description for the option as shown on the Option tab.
fr: Description courte de l'option, telle qu'elle apparaît dans l'onglet Options.

source: Show Only
fr: Afficher uniquement

source: Show apps
fr: Afficher les apps

source: Show login
fr: Afficher l'outil de connexion

source: Show menu
fr: Afficher le menu

source: Show search
fr: Afficher l'outils de recherche

source: Show servers
fr: Afficher les serveurs

source: Shown in the favorite section
fr: Afficher dans la section des favoris

source: Shown on portals
fr: Afficher dans les portails

source: Shows links to all UCS servers
fr: Afficher les liens vers tous les serveurs UCS

source: Shows links to locally installed Apps
fr: Afficher les liens vers toutes les Apps installées localement

source: Software package
fr: Paquetage logiciel

source: Software package version
fr: Version du paquetage logiciel

source: Span both columns
fr: Occuper les deux colonnes

source: Storage
fr: Stockage

source: Store plaintext passwords
fr: Enregistrer les mots de passe en texte en clair

source: Store plaintext passwords where account have "store passwords with reversible encryption" set.
fr: Enregistrer les mots de passe en texte en clair si le compte est configuré pour « Enregistrer les mots de passe avec chiffrement réversible »

source: Stored Attribute
fr: Attribut enregistré

source: Stored LDAP Attribute
fr: Attribut LDAP enregistré

source: Street
fr: Rue

source: Superior
fr: Supérieur

source: Syntax Description
fr: Description de syntaxe

source: Syntax Name
fr: Nom de la syntaxe

source: Syntax class
fr: Classe de la syntaxe

source: Tab layout
fr: Disposition de l'onglet

source: Tab name
fr: Nom de l'onglet

source: Tab with advanced settings
fr: Onglet avec réglages avancés

source: Telephone number
fr: Numéro de téléphone

source: Template name
fr: Nom du modèle

source: The ABI number used by this extended attribute
fr: Le numéro ABI utilisé par cet attribut étendu

source: The extended attribute is not shown in the UMC. It can only be used from the UDM CLI or the Python interface
fr: L'attribut étendu n'est pas affiché dans la console UMC. Il ne peut être utilisé que depuis la ligne de commande UDM ou l'interface Python.

source: The layout element used to represent this extended attribute in the UMC spans both columns
fr: L'élément de mise en page utilisé pour représenter cet attribut étendu dans la console UMC occupe les deux colonnes.

source: The name for the extended attribute as used by UDM CLI
fr: Le nom de l'attribut étendu tel qu'il est utilisé par la ligne de commande UDM

source: This Signature is used to verify the authenticity of the license.
fr: Cette signature est utilisée pour vérifier l'authenticité de la licence.
