Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/settings/*.po
Languages: fr

source: This extended attribute can not be changed through UMC or UDM CLI, but only through the Python API or by hooks
fr: L'attribut étendu ne peut pas être modifié à travers la console UMC ou la ligne de commande UDM, mais seulement à travers l'API Python ou via les points d'interfaçage.

source: This extended attribute can still be modified after the object has been created
fr: Cet attribut étendu peut toujours être modifié une fois l'objet créé.

source: This extended attribute can store multiple values instead of only a single value
fr: Cet attribut étendu peut stocker plusieurs valeurs au lieu d'une seule.

source: This extended attribute is only used when at least one of these options is enabled, e.g. "posix" or "samba"
fr: Cet attribut étendu n'est utilisé que lorsqu'une de ces options au moins est activée, par exemple "posix" ou "samba".

source: This number specifies the position on which this extended attributes is placed on the tab or in the group. The numeration starts at 1
fr: Ce nombre indique la position à laquelle figure cet attribut étendu dans l'onglet ou dans le groupe. La numérotation commence à 1.

source: This number specifies the position on which this group is placed on the tab. The numbering starts at 1
fr: Ce nombre indique la position à laquelle figure ce groupe dans l'onglet. La numérotation commence à 1.

source: Title
fr: Titre

source: Translations of group name
fr: Traductions du nom de groupe

source: Translations of long description
fr: Traductions de la description longue

source: Translations of short description
fr: Traductions de la description courte

source: Translations of tab name
fr: Traductions du nom de l'onglet

source: Translations of the group name for other languages
fr: Traductions du nom de groupe vers d'autres langues

source: Translations of the long description for the option as shown on the Option tab
fr: Traductions de la description longue pour l'option telle qu'elle apparaît dans l'onglet Options

source: Translations of the long descriptive text for other languages
fr: Traductions du texte de description longue vers d'autres langues

source: Translations of the name of the tab for other languages
fr: Traductions du nom de l'onglet vers d'autres langues

source: Translations of the short description for other languages
fr: Traductions de la description courte vers d'autres langues

source: Translations of the short description for the option as shown on the Option tab
fr: Traductions de la description courte pour l'option telle qu'elle apparaît dans l'onglet Options

source: UCS Version Dependencies
fr: Dépendances de version UCS

source: UDM CLI name
fr: Nom de ligne de commande UDM

source: UDM hook data
fr: Données du point d'interfaçage avec UDM

source: UDM hook file name
fr: Nom de fichier d'interfaçage avec UDM

source: UDM hook name
fr: Nom d'interfaçage avec UDM

source: UDM module data
fr: Données du module UDM

source: UDM module file name
fr: Nom de fichier du module UDM

source: UDM module name
fr: Nom du module UDM

source: UDM syntax data
fr: Données de syntaxe UDM

source: UDM syntax file name
fr: Nom de fichier de la syntaxe UDM

source: UDM syntax name
fr: Nom de la syntaxe UDM

source: UMC Operation Set
fr: Jeu d'opérations UMC

source: UMC commands
fr: Commandes UMC

source: UMC icon
fr: Icône UMC

source: UMC registration data
fr: Données d'enregistrement UMC

source: Unique name
fr: Nom unique

source: Univention Corporate Server provides its own LDAP scheme for customer extensions. The LDAP object class univentionFreeAttributes can be used for extended attributes without restrictions. It offers 20 freely usable attributes (univentionFreeAttribute1 to univentionFreeAttribute20) and can be used in connection with any LDAP object (e.g., a user object)
fr: Univention Corporate Server fournit son propre schéma LDAP pour les extensions client. Vous pouvez utiliser la classe d'objets LDAP univentionFreeAttributes pour étendre les attributs sans restriction. Elle propose 20 attributs utilisables à votre guise (univentionFreeAttribute1 à univentionFreeAttribute20) et peut être utilisée conjointement à tout objet LDAP (par exemple un objet utilisateur).

source: Univention License
fr: Licence Univention

source: Univention Prohibited user names
fr: Noms d'utilisateur interdits dans Univention

source: Univention Settings
fr: Réglages Univention

source: Unix home directory
fr: Répertoire personnel UNIX

source: User Link
fr: Lien utilisateur

source: User Links
fr: Liens utilisateurs

source: User account
fr: Compte utilisateur

source: User must Logon to Change Password
fr: L'utilisateur doit se connecter pour changer son mot de passe

source: User must logon to change password
fr: L'utilisateur doit se connecter pour changer son mot de passe

source: Users
fr: Utilisateurs

source: Valid OEM product types
fr: Types de produits OEM valides

source: Valid product types
fr: Types de produits valides

source: Value is only managed internally
fr: La valeur est gérée en interne seulement

source: Value required
fr: Valeur requise

source: Values of this extended attribute are not available for searching in the UMC
fr: Les valeurs de cet attribut étendu ne peuvent pas faire l'objet d'une recherche dans la console UMC

source: Version 1 license
fr: Licence version 1

source: Version 1 license informations
fr: Informations sur la licence version 1

source: Version 2 license
fr: Licence version 2

source: Version 2 license informations
fr: Informations sur la licence version 2

source: Version format of this license.
fr: Format de version pour cette licence.

source: Version of extended attribute
fr: Version de l'attribut étendu

source: When values are entered, the UMC performs a syntax check. Apart from standard syntax definitions (string) and (integer), there are three possibilities for expressing a binary condition. The syntax TrueFalse is represented at LDAP level using the strings true and false, the syntax TrueFalseUpper corresponds to the OpenLDAP boolean values TRUE and FALSE and the syntax boolean does not save any value or the string 1
fr: Lorsque des valeurs sont saisies, UMC vérifie la syntaxe. Outre les définitions de syntaxe standard (string) et (integer), trois possibilités permettent d'exprimer une condition binaire. La syntaxe TrueFalse est représentée au niveau LDAP au moyen des chaînes de caractères true et false. La syntaxe TrueFalseUpper correspond aux valeurs booléennes OpenLDAP TRUE et FALSE. Enfin, la syntaxe boolean n'enregistre pas de valeur ou bien la chaîne de caractères 1.

source: Windows home drive
fr: Lecteur personnel Windows

source: Windows home path
fr: Chemin personnel Windows

source: Windows logon path
fr: Chemin de connexion Windows

source: Windows profile directory
fr: Répertoire de profil Windows

source: packageversion: Version must not be lower than the current one.
fr: Version du paquetage : la version ne peut pas être inférieure à la version actuelle.
