Repository: univention/univention-corporate-server
Catalog: management/univention-management-console-module-udm/umc/js/*.po
Languages: fr

source: Please select an LDAP destination for the mail object:
fr: Veuillez choisir la destination LDAP de l'objet courrier :

source: Please select an LDAP destination for the network object:
fr: Veuillez choisir la destination LDAP de l'objet réseau :

source: Please select an LDAP destination for the policy:
fr: Veuillez choisir la destination LDAP de la stratégie :

source: Please select an LDAP destination for the portal object:
fr: Veuillez choisir une destination LDAP pour l’objet de portail :

source: Please select an LDAP destination for the printer:
fr: Veuillez choisir la destination LDAP de l'imprimante :

source: Please select an LDAP destination for the share:
fr: Veuillez choisir la destination LDAP du partage :

source: Please select an LDAP destination for the user:
fr: Veuillez choisir la destination LDAP de l'utilisateur :

source: Please use the Active Directory administration utilities to create new domain %s.
fr: Veuillez utiliser les outils d'administration Active Directory pour créer le nouveau domaine %s.

source: Please use the Active Directory administration utilities to create new domain LDAP objects of this type.
fr: Veuillez utiliser les outils d'administration Active Directory pour créer de nouveaux objets de domaines LDAP de ce type.

source: Policies
fr: Stratégies

source: Policies managed here are used by the application "%(name)s" which is currently not installed.
fr: Les stratégies gérées ici sont utilisées par l'application « %(name)s », qui n'est actuellement pas installée.

source: Policy template
fr: Modèle de stratégie

source: Press <i>Next</i> to create %s only available on UCS systems.
fr: Cliquez sur <i>Suivant</i> pour créer %s uniquement sur les systèmes UCS.

source: Press <i>Next</i> to create an LDAP object of this type only available on UCS systems.
fr: Cliquez sur <i>Next</i> pour créer un objet LDAP de ce type, disponible uniquement sur les systèmes UCS.

source: Printer template
fr: Modèle d'imprimante

source: Printers
fr: Imprimantes

source: Printers managed here are used by the application "%(name)s" which is currently not installed.
fr: Les imprimantes gérées ici sont utilisées par l'application « %(name)s », qui n'est actuellement pas installée.

source: Properties inherited from policies
fr: Propriétés héritées des stratégies

source: Property
fr: Propriété

source: Property value
fr: Valeur de la propriété

source: Reload
fr: Recharger

source: Remove certificate
fr: Supprimer le certificat

source: Report for DHCP object
fr: Rapport pour un objet DHCP

source: Report for DNS object
fr: Rapport pour un objet DNS

source: Report for LDAP object
fr: Rapport pour un objet LDAP

source: Report for Nagios object
fr: Rapport pour un objet Nagios

source: Report for computer
fr: Rapport pour un ordinateur

source: Report for group
fr: Rapport pour un groupe

source: Report for mail object
fr: Rapport pour un objet courrier

source: Report for network object
fr: Rapport pour un objet réseau

source: Report for policy
fr: Rapport pour une stratégie

source: Report for printer
fr: Rapport pour une imprimante

source: Report for share
fr: Rapport pour un partage

source: Report for user
fr: Rapport pour un utilisateur

source: Save
fr: Enregistrer

source: Search DHCP objects...
fr: Chercher des objets DHCP...

source: Search DNS objects...
fr: Chercher des objets DNS...

source: Search LDAP objects...
fr: Chercher des objets LDAP...

source: Search Nagios objects...
fr: Chercher des objets Nagios...

source: Search computers...
fr: Chercher des ordinateurs...

source: Search groups...
fr: Chercher des groupes...

source: Search in:
fr: Rechercher dans :

source: Search mail objects...
fr: Chercher des objets courriers...

source: Search network objects...
fr: Chercher des objets réseaux...

source: Search policies...
fr: Chercher des stratégies...

source: Search portal objects...
fr: Chercher des objets de portail…

source: Search printers...
fr: Chercher des imprimantes...

source: Search shares...
fr: Chercher des partages...

source: Search users...
fr: Chercher des utilisateurs...

source: Select policies that should be directly linked to the current LDAP object
fr: Choisissez des stratégies qui doivent être directement liées à l'objet LDAP courant

source: Select policy configuration
fr: Choisissez la configuration de la stratégie

source: Server error message:
fr: Message d'erreur du serveur :

source: Share template
fr: Modèle de partage

source: Shares
fr: Partages

source: Shares managed here are used by the application "%(name)s" which is currently not installed.
fr: Les partages gérés ici sont utilisés par l'application « %(name)s », qui n'est actuellement pas installée.

source: Simplified options
fr: Options simplifiées

source: Superordinate
fr: Objet de niveau supérieur

source: The %s has been created.
fr: L'objet %s a été créé.

source: The DHCP object "%s" is part of the Active Directory domain.
fr: L’objet DHCP « %s » fait partie du domaine Active Directory.

source: The DNS object "%s" is part of the Active Directory domain.
fr: L’objet DNS « %s » fait partie du domaine Active Directory.

source: The LDAP object "%s" is part of the Active Directory domain.
fr: L’objet LDAP « %s » fait partie du domaine Active Directory.

source: The LDAP object could not be saved: %(details)s
fr: L'objet LDAP n'a pas pu être enregistré : %(details)s

source: The Nagios object "%s" is part of the Active Directory domain.
fr: L’objet Nagios « %s » fait partie du domaine Active Directory.

source: The changes have been successfully applied.
fr: Les modifications ont été appliquées avec succès.

source: The computer "%s" is part of the Active Directory domain.
fr: L’ordinateur « %s » fait partie du domaine Active Directory.

source: The container in which the LDAP object shall be created.
fr: Le conteneur dans lequel sera créé l'objet LDAP.

source: The exact object type of the new LDAP object.
fr: Le type d'objet exact du nouvel objet LDAP.

source: The following LDAP objects could not be saved:
fr: Les objets LDAP suivants n'ont pas pu être enregistrés :

source: The following empty properties were set to default values in the form. These values will be applied when saving.
fr: Pour les propriétés vides suivantes, des valeurs par défaut ont été définies dans le formulaire. Ces valeurs seront appliquées à l'enregistrement.

source: The following object(s) could not be deleted:
fr: Les objets suivants n'ont pas pu être supprimés :

source: The following properties could not be validated:
fr: Les propriétés suivantes n'ont pas pu être validées :

source: The following properties need to be specified or are invalid:
fr: Les propriétés suivantes doivent être renseignées ou ne sont pas valides :

source: The group "%s" is part of the Active Directory domain.
fr: Le groupe « %s » fait partie du domaine Active Directory.

source: The import of the license failed. Check the integrity of the original file given to you. If this error persists, please contact Univention or your Univention partner.
fr: L'importation de la licence a échoué. Vérifiez l'intégrité du fichier d'origine en votre possession. Si cette erreur persiste, veuillez contacter Univention ou votre partenaire Univention.

source: The license has already been activated.
fr: La licence a déjà été activée.

source: The license has been imported successfully.
fr: La licence a été importée avec succès.

source: The license type "Free for personal use" can be upgraded to the latest <a href="https://www.univention.com/downloads/license-models/ucs-core-edition" target="_blank">UCS Core Edition license</a> allowing an unlimited amount of user and computer accounts. To upgrade, follow the instructions in the <a href="http://sdb.univention.de/1324" target="_blank">Univention Support Database</a>.
fr: Vous pouvez passer votre licence de type « Gratuit pour un utilisation privée » en <a href="https://www.univention.com/downloads/license-models/ucs-core-edition" target="_blank">licence UCS Core Edition</a>, qui autorise un nombre illimité de comptes d'utilisateurs et d'ordinateurs. Pour mettre à niveau votre licence, suivez les instructions disponibles dans la<a href="http://sdb.univention.de/1324" target="_blank">Base de données d'assistance technique Univention</a>.

source: The mail object "%s" is part of the Active Directory domain.
fr: L’objet courrier « %s » fait partie du domaine Active Directory.

source: The network object "%s" is part of the Active Directory domain.
fr: L’objet réseau « %s » fait partie du domaine Active Directory.

source: The policy "%s" is part of the Active Directory domain.
fr: La stratégie « %s » fait partie du domaine Active Directory.

source: The portal object "%s" is part of the Active Directory domain.
fr: L’objet de portail « %s » fait partie du domaine Active Directory.

source: The printer "%s" is part of the Active Directory domain.
fr: L’imprimante « %s » fait partie du domaine Active Directory.

source: The report template that should be used for the report.
fr: Le modèle à utiliser pour les rapports.

source: The share "%s" is part of the Active Directory domain.
fr: La ressource partagée « %s » fait partie du domaine Active Directory.

source: The text field is empty. Please copy all lines of the license file into the text field and retry to import the data.
fr: Le champ de texte est vide. Veuillez copier toutes les lignes du fichier de licence dans le champ de texte, puis tentez à nouveau d'importer les données.

source: The user "%s" is part of the Active Directory domain.
fr: L’utilisateur « %s » fait partie du domaine Active Directory.

source: There are unsaved changes. Are you sure to cancel?
fr: Certaines modifications n'ont pas été enregistrées. Voulez-vous vraiment annuler ?

source: This UCS system is part of an Active Directory domain
fr: Ce système UCS fait partie d'un domaine Active Directory

source: This may take a while.
fr: Ceci peut prendre un certain temps.

source: Toggle visual presentation
fr: Afficher / masquer la présentation graphique

source: UCS License
fr: Licence UCS

source: UCS license import
fr: Importation de licence UCS

source: Updating session data...
fr: Mise à jour des données de session...

source: Updating the license information has failed
fr: La mise à jour des informations de licence a échoué

source: Upload certificate
fr: Transférer le certificat

source: Upload profile image
fr: Envoyer une image pour le profil

source: User accounts
fr: Comptes utilisateurs

source: User template
fr: Modèle d'utilisateur

source: Users
fr: Utilisateurs

source: Users managed here are used by the application "%(name)s" which is currently not installed.
fr: Les utilisateurs gérés ici sont utilisés par l'application « %(name)s », qui n'est actuellement pas installée.

source: Valid product types
fr: Types de produits valides

source: Value
fr: Valeur

source: Value of the LDAP object.
fr: Valeur de l'objet LDAP.

source: You are currently editing a policy. Changing its properties affects all referenced objects and may affect your system globally.
fr: Vous êtes en train de modifier une stratégie. Changer ses propriétés affecte tous les objets référencés et peut affecter votre système dans sa globalité.

source: You are using a GPL license which is not eligible for maintenance or support claims.
fr: Vous utilisez une licence GPL qui ne vous donne pas droit à la maintenance ou à l'assistance technique.

source: computer
fr: ordinateur

source: computers
fr: ordinateurs

source: edit
fr: modifier

source: group
fr: groupe

source: groups
fr: groupes

source: in {size} objects
fr: dans {size} objets

source: mail object
fr: objet courrier électronique

source: mail objects
fr: objets courrier électronique

source: network object
fr: objet réseau

source: network objects
fr: objets réseaux

source: not defined
fr: non défini

source: number exceeded configured limit
fr: nombre dépassant la limite configurée

source: policies
fr: stratégies

source: policy
fr: stratégie

source: printer
fr: imprimante

source: printers
fr: imprimantes

source: share
fr: partage

source: shares
fr: partages

source: unlimited
fr: illimité

source: user
fr: utilisateur

source: users
fr: utilisateurs
