Repository: univention/univention-corporate-server
Catalog: management/univention-management-console-module-udm/umc/js/*.po
Languages: fr

source: UCS can only change certain attributes.
fr: UCS ne peut modifier que certains attributs.

source: You can install the application using the %(link)s
fr: Vous pouvez installer l'application en utilisant %(link)s

source: %(limit)s (used: %(used)s)
fr: %(limit)s (utilisé : %(used)s)

source: (multi-edit)
fr: (édition multiple)

source: <b>Position</b>: <i>%(path)s</i>
fr: <b>Emplacement<b> : <i>%(path)s</i>

source: <b>Warning!</b>
fr: <b>Avertissement !</b>

source: <b>Warning:</b> The user name is longer than {length} characters which makes a login on Windows clients impossible. Please consider shortening the user name.
fr: <b>Attention :</b> Le nom d’utilisateur contient plus de {length} caractères, ce qui rend impossible une connexion sur les clients Windows. Veuillez envisager de raccourcir le nom d’utilisateur.

source: <p><b>Add and modify are disabled in this session.</b></p><p>You have too many user accounts for your license. Carry out the following steps to re-enable editing:</p><ol><li>Disable or delete user accounts</li><li>Re-login to UMC for changes to take effect</li></ol><p>If a new license is needed, contact your UCS partner.</p>
fr: <p><b>L'ajout et la modification sont désactivés pendant cette session.</b></p> <p>Vous avez trop de comptes utilisateurs pour votre licence. Pour réactiver l'édition, veuillez effectuer les opérations suivantes :</p> <ol><li>Désactivez ou supprimez des comptes utilisateurs.</li> <li>Reconnectez-vous à UMC pour que les modifications prennent effet.</li></ol> <p>Si une nouvelle licence est nécessaire, contactez votre partenaire UCS.</p>

source: <p>The LDAP object will be created in the container:</p><p><i>%s</i></p>
fr: <p>L'objet LDAP sera créé dans le conteneur :</p><p><i>%s</i></p>

source: <p>The LDAP object will be created underneath of <i>%s</i>.</p>
fr: <p>L'objet LDAP sera créé dans le conteneur : <i>%s</i></p>

source: A portal category has to be selected
fr: Une catégorie de portail doit être sélectionnée

source: A template defines rules for default object properties.
fr: Un modèle définit les règles relatives aux propriétés par défaut des objets.

source: Account disabled
fr: Compte désactivé

source: Activate apps and options
fr: Activer des applications et des options

source: Activated Apps
fr: Apps activées

source: Activation of UCS
fr: Activation d'UCS

source: Add
fr: Ajouter

source: Add a new DHCP object.
fr: Ajouter un nouvel objet DHCP.

source: Add a new DNS object.
fr: Ajouter un nouvel objet DNS.

source: Add a new LDAP object.
fr: Ajouter un nouvel objet LDAP.

source: Add a new Nagios object.
fr: Ajouter un nouvel objet Nagios.

source: Add a new computer.
fr: Ajouter un nouvel ordinateur.

source: Add a new group.
fr: Ajouter un nouveau groupe.

source: Add a new mail object.
fr: Ajouter un nouvel objet courrier électronique.

source: Add a new network object.
fr: Ajouter un nouvel objet réseau.

source: Add a new policy.
fr: Ajouter une nouvelle stratégie.

source: Add a new portal object.
fr: Ajouter un nouvel objet portail.

source: Add a new printer.
fr: Ajouter une nouvelle imprimante.

source: Add a new share.
fr: Ajouter une nouvelle ressource partagée.

source: Add a new user.
fr: Ajouter un nouvel utilisateur.

source: Advanced
fr: Avancé

source: Advanced Search
fr: Recherche avancée

source: Advanced options
fr: Options avancées

source: Advanced settings
fr: Réglages avancés

source: All containers
fr: Tous les conteneurs

source: All types
fr: Tous les types

source: Back
fr: Retour

source: Cancel
fr: Annuler

source: Click to edit the inherited properties of the policy
fr: Cliquez pour modifier les propriétés héritées de la stratégie

source: Close
fr: Fermer

source: Computer template
fr: Modèle d'ordinateur

source: Computers
fr: Ordinateurs

source: Computers managed here are used by the application "%(name)s" which is currently not installed.
fr: Les ordinateurs gérés ici sont utilisés par l'application « %(name)s », qui n'est actuellement pas installée.

source: Container
fr: Conteneur

source: Continue editing
fr: Poursuivre les modifications

source: Copy
fr: Copier

source: Corporate Clients
fr: Clients d'entreprise

source: Create
fr: Créer

source: Create DHCP object
fr: Créer un objet DHCP

source: Create DNS object
fr: Créer un objet DNS

source: Create LDAP object
fr: Créer un objet LDAP

source: Create Nagios object
fr: Créer un objet Nagios

source: Create a copy of the LDAP object.
fr: Créer une copie de l’objet LDAP.

source: Create computer
fr: Créer un ordinateur

source: Create group
fr: Créer un groupe

source: Create mail object
fr: Créer un objet courrier électronique

source: Create network object
fr: Créer un objet réseau

source: Create new policy
fr: Créer une nouvelle stratégie

source: Create policy
fr: Créer une nouvelle stratégie

source: Create portal
fr: Créer un portail

source: Create portal category
fr: Créer une catégorie de portail

source: Create portal entry
fr: Créer une entrée de portail

source: Create printer
fr: Créer une imprimante

source: Create report
fr: Créer un rapport

source: Create share
fr: Créer un partage

source: Create user
fr: Créer un utilisateur

source: Creating the report...
fr: Création du rapport…

source: Customize this page
fr: Personnaliser cette page

source: DHCP object
fr: Objet DHCP

source: DHCP object template
fr: Modèle d'objet DHCP

source: DHCP objects
fr: Objets DHCP

source: DHCP objects managed here are used by the application "%(name)s" which is currently not installed.
fr: Les objets DHCP gérés ici sont utilisés par l'application « %(name)s », qui n'est actuellement pas installée.

source: DHCP services
fr: Services DHCP

source: DNS object
fr: Objet DNS

source: DNS object template
fr: Modèle d'objet DNS

source: DNS objects
fr: Objets DNS

source: DNS objects managed here are used by the application "%(name)s" which is currently not installed.
fr: Les objets DNS gérés ici sont utilisés par l'application « %(name)s », qui n'est actuellement pas installée.

source: DNS zones
fr: Zones DNS

source: Default properties
fr: Propriétés par défaut

source: Delete
fr: Supprimer

source: Delete objects
fr: Supprimer les objets

source: Delete referring objects.
fr: Supprimer les objets référents.

source: Delete the selected DHCP objects.
fr: Supprimer les objets DHCP sélectionnés.

source: Delete the selected DNS objects.
fr: Supprimer les objets DNS sélectionnés.

source: Delete the selected LDAP objects.
fr: Supprimer les objets LDAP sélectionnés.

source: Delete the selected Nagios objects.
fr: Supprimer les objets Nagios sélectionnés.

source: Delete the selected computers.
fr: Supprimer les ordinateurs sélectionnés.

source: Delete the selected groups.
fr: Supprimer les groupes sélectionnés.

source: Delete the selected mail objects.
fr: Supprimer les objets courriers sélectionnés.

source: Delete the selected network objects.
fr: Supprimer les objets réseaux sélectionnés.

source: Delete the selected policies.
fr: Supprimer les stratégies sélectionnées.

source: Delete the selected portal object.
fr: Supprimer l’objet de portail sélectionné.

source: Delete the selected printers.
fr: Supprimer les imprimantes sélectionnées.

source: Delete the selected shares.
fr: Supprimer les partages sélectionnés.

source: Delete the selected users.
fr: Supprimer les utilisateurs sélectionnés.

source: Desktops
fr: Bureaux

source: Discard changes
fr: Ignorer les modifications

source: Edit
fr: Modifier

source: Edit in new tab
fr: Modifier dans un nouvel onglet

source: Edit policy
fr: Modifier la stratégie

source: Edit the DHCP object.
fr: Modifier l'objet DHCP.

source: Edit the DNS object.
fr: Modifier l'objet DNS.

source: Edit the LDAP object.
fr: Modifier l'objet LDAP.

source: Edit the Nagios object.
fr: Modifier l'objet Nagios.

source: Edit the computer.
fr: Modifier l'ordinateur.

source: Edit the group.
fr: Modifier le groupe.

source: Edit the mail object.
fr: Modifier l'objet courrier.

source: Edit the network object.
fr: Modifier l'objet réseau.

source: Edit the policy.
fr: Modifier la stratégie.

source: Edit the portal object.
fr: Modifier l’objet de portail.

source: Edit the printer.
fr: Modifier l'imprimante.

source: Edit the share.
fr: Modifier le partage.

source: Edit the user.
fr: Modifier l'utilisateur.

source: Error
fr: Erreur

source: Expiry date
fr: Date d'expiration

source: Failed to move the following objects:
fr: Les objets suivants n'ont pas pu être déplacés :

source: Failed to retrieve the DHCP object from the server.
fr: Échec de la récupération de l'objet DHCP depuis le serveur.

source: Failed to retrieve the DNS object from the server.
fr: Échec de la récupération de l'objet DNS depuis le serveur.

source: Failed to retrieve the LDAP object from the server.
fr: Échec de la récupération de l'objet LDAP depuis le serveur.

source: Failed to retrieve the Nagios object from the server.
fr: Échec de la récupération de l'objet Nagios depuis le serveur.

source: Failed to retrieve the computer from the server.
fr: Échec de la récupération de l'ordinateur depuis le serveur.

source: Failed to retrieve the group from the server.
fr: Échec de la récupération du groupe depuis le serveur.

source: Failed to retrieve the mail object from the server.
fr: Échec de la récupération de l'objet courrier depuis le serveur.

source: Failed to retrieve the network object from the server.
fr: Échec de la récupération de l'objet réseau depuis le serveur.

source: Failed to retrieve the policy from the server.
fr: Échec de la récupération de la stratégie depuis le serveur.

source: Failed to retrieve the portal object from the server.
fr: Impossible de récupérer l’objet de portail depuis le serveur.

source: Failed to retrieve the printer from the server.
fr: Échec de la récupération de l'imprimante depuis le serveur.

source: Failed to retrieve the share from the server.
fr: Échec de la récupération du partage depuis le serveur.

source: Failed to retrieve the user from the server.
fr: Échec de la récupération de l'utilisateur depuis le serveur.

source: Failed to upload certificate
fr: L'envoi du certificat a échoué

source: Further settings
fr: Autres réglages

source: Generating DHCP object report for one object.
fr: Génération du rapport d’objet DHCP pour un objet.

source: Generating DNS object report for one object.
fr: Génération du rapport d’objet DNS pour un objet.

source: Generating LDAP object report for one object.
fr: Génération du rapport d’objet LDAP pour un objet.

source: Generating Nagios object report for one object.
fr: Génération du rapport d’objet Nagios pour un objet.

source: Generating computer report for one object.
fr: Génération du rapport d’ordinateur pour un objet.

source: Generating group report for one object.
fr: Génération du rapport de groupe pour un objet.

source: Generating mail object report for one object.
fr: Génération du rapport d’objet courrier pour un objet.

source: Generating network object report for one object.
fr: Génération du rapport d’objet réseau pour un objet.

source: Generating policy report for one object.
fr: Génération du rapport de stratégie pour un objet.

source: Generating printer report for one object.
fr: Génération du rapport d’imprimante pour un objet.

source: Generating share report for one object.
fr: Génération du rapport de partage pour un objet.

source: Generating user report for one object.
fr: Génération du rapport d’utilisation pour un objet.

source: Group template
fr: Modèle de groupe

source: Groups
fr: Groupes

source: Groups managed here are used by the application "%(name)s" which is currently not installed.
fr: Les groupes gérés ici sont utilisés par l'application « %(name)s », qui n'est actuellement pas installée.

source: Help
fr: Aide

source: Here you can activate the user for one of the installed apps. The user can then log on to the app and use it.
fr: Ici, vous pouvez activer l’utilisateur ou l’utilisatrice pour l’une des applications installées. L’utilisatrice ou utilisateur pourra alors se connecter à l’application et s’en servir.

source: Import from file...
fr: Importer depuis le fichier...

source: Import from text field
fr: Importer depuis le champ texte

source: Import new license
fr: Importer la nouvelle licence

source: Importing license data...
fr: Importation des données de licence en cours...

source: Include hidden objects
fr: Inclure les objets cachés

source: Information about the <a href="https://www.univention.com/downloads/license-models/ucs-core-edition" target="_blank">terms of use</a> for this free license can be found on the Univention website. Information about the <a href="https://www.univention.com/enterprise-subscriptions" target="_blank">UCS Enterprise Subscriptions</a> can also be found there.
fr: Vous pouvez trouver davantage d'informations sur les <a href="https://www.univention.com/downloads/license-models/ucs-core-edition" target="_blank">conditions d'utilisation</a> de cette licence gratuite sur le site web d'Univention. Vous pourrez également y trouver des informations sur les <a href="https://www.univention.com/enterprise-subscriptions" target="_blank">abonnements UCS Enterprise</a>.

source: Information about the current UCS license
fr: Informations sur la licence UCS actuelle

source: Invite user via e-mail. Password will be set by the user
fr: Inviter l’utilisateur ou l’utilisatrice par e-mail. La personne invitée choisira elle-même son mot de passe

source: Key ID
fr: Identifiant de clé

source: LDAP Objects
fr: Objets LDAP

source: LDAP base
fr: Base LDAP

source: LDAP object
fr: Objet LDAP

source: LDAP object template
fr: Modèle d'objet LDAP

source: LDAP objects
fr: Objets LDAP

source: LDAP objects managed here are used by the application "%(name)s" which is currently not installed.
fr: Les objets LDAP gérés ici sont utilisés par l'application « %(name)s », qui n'est actuellement pas installée.

source: License
fr: Licence

source: License information
fr: Informations relatives à la licence

source: License type
fr: Type de licence

source: List of all object properties that are inherited by policies. The values cannot be edited directly. By clicking on "Create new policy", a new tab with a new policy will be opened. If an attribute is already set, the corresponding policy can be edited in a new tab by clicking on the "edit" link.
fr: Liste de toutes les propriétés des objets dont héritent les stratégies. Les valeurs ne peuvent pas être modifiées directement. Un clic sur « Créer une nouvelle stratégie » ouvre un nouvel onglet comportant une nouvelle stratégie. Si un attribut est déjà défini, la stratégie correspondante peut être modifiée dans un nouvel onglet en cliquant sur le lien « modifier ».

source: Loading DHCP object...
fr: Chargement de l'objet DHCP...

source: Loading DNS object...
fr: Chargement de l'objet DNS...

source: Loading LDAP object...
fr: Chargement de l'objet LDAP...

source: Loading Nagios object...
fr: Chargement de l'objet Nagios...

source: Loading computer...
fr: Chargement de l'ordinateur...

source: Loading group...
fr: Chargement du groupe...

source: Loading mail object...
fr: Chargement de l'objet courrier...

source: Loading network object...
fr: Chargement de l'imprimante...

source: Loading policy...
fr: Chargement de la stratégie...

source: Loading printer...
fr: Chargement de l'imprimante...

source: Loading share...
fr: Chargement du partage...

source: Loading user...
fr: Chargement de l'utilisateur...

source: Mail address to which the invitation link is sent to
fr: Adresse électronique à laquelle le lien d’invitation est envoyé

source: Mail object template
fr: Modèle d'objet courrier

source: Mail objects
fr: Objets courriers

source: Mail objects managed here are used by the application "%(name)s" which is currently not installed.
fr: Les objets courriers gérés ici sont utilisés par l'application « %(name)s », qui n'est actuellement pas installée.

source: Managed Clients
fr: Clients gérés

source: Move DHCP object
fr: Déplacer l'objet DHCP

source: Move DNS object
fr: Déplacer l'objet DNS

source: Move LDAP object
fr: Déplacer l'objet LDAP

source: Move Nagios object
fr: Déplacer l'objet Nagios

source: Move computer
fr: Déplacer l'ordinateur

source: Move group
fr: Déplacer le groupe

source: Move mail object
fr: Déplacer l'objet courrier

source: Move network object
fr: Déplacer l'objet réseau

source: Move objects to a different LDAP position.
fr: Déplacer les objets vers une autre position LDAP.

source: Move policy
fr: Déplacer la stratégie

source: Move portal object
fr: Déplacer l’objet de portail

source: Move printer
fr: Déplacer l'imprimante

source: Move share
fr: Déplacer le partage

source: Move to...
fr: Déplacer vers...

source: Move user
fr: Déplacer l'utilisateur

source: Nagios object
fr: Objet Nagios

source: Nagios object template
fr: Modèle d'objet Nagios

source: Nagios objects
fr: Objets Nagios

source: Nagios objects managed here are used by the application "%(name)s" which is currently not installed.
fr: Les %(objectNamePlural)s gérés ici sont utilisés par l'application "%(name)s", qui n'est actuellement pas installée.

source: Name
fr: Nom

source: Name of the LDAP object.
fr: Nom de l'objet LDAP.

source: Network object template
fr: Modèle d'objet réseau

source: Network objects
fr: Objets réseaux

source: Network objects managed here are used by the application "%(name)s" which is currently not installed.
fr: Les %(objectNamePlural)s gérés ici sont utilisés par l'application "%(name)s" qui n'est actuellement pas installée.

source: New license keys can be imported here. You receive these keys after the activation of UCS or after a license purchase. The key can either be uploaded directly as file or it can be imported via copy and paste into the text field.
fr: Vous pouvez importer ici de nouvelles clés de licences. Vous recevez ces clés après avoir activé UCS ou après avoir acheté une licence. Vous pouvez envoyer la clé soit en transférant directement le fichier, soit en copiant/collant le contenu dans le champ de texte.

source: Newly created %s will only be available on UCS systems and not in the Active Directory domain.
fr: L'objet %s nouvellement créé ne sera disponible que sur les systèmes UCS et non dans le domaine Active Directory.

source: Newly created LDAP objects of this type will only be available on UCS systems and not in the Active Directory domain.
fr: Les objets LDAP nouvellement créés ne seront disponibles que sur les systèmes UCS et non dans le domaine Active Directory.

source: Next
fr: Suivant

source: No DHCP objects could be found.
fr: Aucun objet DHCP trouvé.

source: No DNS objects could be found.
fr: Aucun objet DNS trouvé.

source: No LDAP objects could be found.
fr: Aucun objet LDAP trouvé.

source: No LDAP position has been selected.
fr: Aucune position LDAP n'a été sélectionnée.

source: No Nagios objects could be found.
fr: Aucun objet Nagios trouvé.

source: No computers could be found.
fr: Aucun ordinateur trouvé.

source: No groups could be found.
fr: Aucun groupe trouvé.

source: No mail objects could be found.
fr: Aucun objet courrier trouvé.

source: No network objects could be found.
fr: Aucun objet réseau trouvé.

source: No policies could be found.
fr: Aucune stratégie trouvée.

source: No portal object could be found.
fr: Aucun objet de portail n’a été trouvé.

source: No printers could be found.
fr: Aucune imprimante trouvée.

source: No referencing objects
fr: Pas d’objets référents

source: No shares could be found.
fr: Aucun partage trouvé.

source: No users could be found.
fr: Aucun utilisateur trouvé.

source: None
fr: Aucun

source: Note that moving a container can take some time.
fr: Notez que le déplacement d'un conteneur peut prendre un certain temps.

source: Object property
fr: Propriété d'objet

source: One DHCP object of %d selected.
fr: Un objet DHCP sélectionné sur %d.

source: One DNS object of %d selected.
fr: Un objet DNS sélectionné sur %d.

source: One LDAP object of %d selected.
fr: Un objet LDAP sélectionné sur %d.

source: One Nagios object of %d selected.
fr: Un objet Nagios sélectionné sur %d.

source: One computer of %d selected.
fr: Un ordinateur sélectionné sur %d.

source: One group of %d selected.
fr: Un groupe sélectionné sur %d.

source: One mail object of %d selected.
fr: Un objet courrier sélectionné sur %d.

source: One network object of %d selected.
fr: Un objet réseau sélectionné sur %d.

source: One policy of %d selected.
fr: Une stratégie sélectionnée sur %d.

source: One portal object of %d selected.
fr: Un objet de portail sur %d est sélectionné.

source: One printer of %d selected.
fr: Une imprimante sélectionnée sur %d.

source: One share of %d selected.
fr: Un partage sélectionné sur %d.

source: One user of %d selected.
fr: Un utilisateur sélectionné sur %d.

source: Only objects of the same type can be edited together
fr: Seuls des objets de même type peuvent être modifiés en même temps

source: Open a new tab in order to edit the UDM-object
fr: Ouvrir un nouvel onglet pour modifier l'objet UDM

source: Options describing the basic features of the LDAP object
fr: Options décrivant les propriétés de base de l'objet LDAP

source: Overwrite
fr: Écraser

source: Parent container
fr: Conteneur parent

source: Path
fr: Chemin

source: Path of the LDAP object.
fr: Chemin de l'objet LDAP.

source: Please confirm the removal of the DHCP object:
fr: Veuillez confirmer la suppression de l’objet DHCP :

source: Please confirm the removal of the DNS object:
fr: Veuillez confirmer la suppression de l’objet DNS :

source: Please confirm the removal of the LDAP object:
fr: Veuillez confirmer la suppression de l’objet LDAP :

source: Please confirm the removal of the Nagios object:
fr: Veuillez confirmer la suppression de l’objet Nagios :

source: Please confirm the removal of the computer:
fr: Veuillez confirmer la suppression de l’ordinateur :

source: Please confirm the removal of the group:
fr: Veuillez confirmer la suppression du groupe :

source: Please confirm the removal of the mail object:
fr: Veuillez confirmer la suppression de l’objet courrier :

source: Please confirm the removal of the network object:
fr: Veuillez confirmer la suppression de l’objet réseau :

source: Please confirm the removal of the policy:
fr: Veuillez confirmer la suppression de la stratégie :

source: Please confirm the removal of the portal object:
fr: Veuillez confirmer la suppression de l’objet portail :

source: Please confirm the removal of the printer:
fr: Veuillez confirmer la suppression de l’imprimante :

source: Please confirm the removal of the share:
fr: Veuillez confirmer la suppression du partage :

source: Please confirm the removal of the user:
fr: Veuillez confirmer la suppression de l’utilisateur :

source: Please select a container in the LDAP directory tree. The new object will be placed at this location.
fr: Veuillez choisir un conteneur dans l'arborescence des répertoires LDAP. Le nouvel objet sera créé à cet emplacement.

source: Please select an LDAP destination for the DHCP object:
fr: Veuillez choisir la destination LDAP de l'objet DHCP :

source: Please select an LDAP destination for the DNS object:
fr: Veuillez choisir la destination LDAP de l'objet DNS :

source: Please select an LDAP destination for the LDAP object:
fr: Veuillez choisir la destination LDAP de l'objet LDAP :

source: Please select an LDAP destination for the Nagios object:
fr: Veuillez choisir la destination LDAP de l'objet Nagios :

source: Please select an LDAP destination for the computer:
fr: Veuillez choisir la destination LDAP de l'ordinateur :

source: Please select an LDAP destination for the group:
fr: Veuillez choisir la destination LDAP du groupe :
