Repository: univention/univention-corporate-server
Catalog: virtualization/univention-virtual-machine-manager-schema/modules/univention/admin/handlers/uvmm/*.po
Languages: de

source: Active VNC remote access
de: Aktiviert den VNC Fernzugriff

source: Add the listed images to the list of selectable images
de: Fügt die aufgelisteten Abbilder zur Liste der auswählbaren Abbilder hinzu

source: Amount of disk space
de: Größe der Festplatte

source: Amount of memory
de: Größe des Speichers

source: Architecture
de: Architektur

source: Architecture of the virtual machine
de: Architektur der virtuellen Maschine

source: Automatic
de: Automatisch

source: Boot configuration
de: Bootkonfiguration

source: Boot devices
de: Boot-Device

source: CDROM drive
de: CDROM-Laufwerk

source: CPU model
de: CPU Modell

source: CPU model name from e.g. `virsh cpu-models x86_64`
de: CPU Modellname z.B. von `virsh cpu-models x86_64`

source: CPUs
de: Prozessoren

source: Cloud Connection
de: Cloud-Verbindung

source: Cloud Connection parameters
de: Parameter der Cloud-Verbindunge

source: Cloud Connections
de: Cloud-Verbindungen

source: Cloud Type
de: Cloud-Typ

source: Cloud Types
de: Cloud-Typen

source: Contact
de: Kontakt

source: Coordinated Universal Time
de: Koordinierte Weltzeit

source: Description
de: Beschreibung

source: Description of virtual machine
de: Beschreibung der virtuellen Maschine

source: Disk cache
de: Festplatten Cache

source: Disk cache handling on host
de: Festplatten-Cacheverwaltung des Hosts

source: Disk space
de: Festplatten Speicherplatz

source: Full virtualization (KVM)
de: Volle Virtualisierung (KVM)

source: General
de: Allgemein

source: Hypervisor default
de: Hypervisor-Standard

source: Initramfs disk
de: Iinitramfs Disk

source: Key-value pair storing needed parameters for the Cloud Connection
de: Schlüssel-Wert-Paar zur Speicherung der benötigten Parameter für die Cloud-Verbindung

source: Keyboard layout
de: Tastaturlayout

source: Local time zone
de: Lokale Zeitzone

source: Machine information
de: Informationen zur Maschine

source: Manually specify the kernel configuration for paravirtualized machines or use pyGrub as bootloader
de: Entweder kann manuell die Kernelkonfiguration für die paravirtualisierte Maschine angegeben werden oder es wird pyGrub als Bootloder verwendet

source: Memory
de: Speicher

source: Name and/or email address of a contact person
de: Name und/oder E-Mail-Adresser einer Kontaktperson

source: Name of the operation system
de: Name des Betriebssystem

source: Name prefix
de: Namenspräfix

source: Network
de: Netzwerk

source: Network interface
de: Netz-Interface

source: No host caching, forced sync
de: Kein Host-Caching, erzwungenes sync

source: No host caching, no forced sync
de: Kein Host-Caching, kein erzwungenes sync

source: Number of virtual CPUs
de: Anzahl der Prozessoren

source: Offset of instances Real Time Clock to host computers clock
de: Versatz der Realzeituhr der Instanz gegenüber der Uhr der Virtualisierungsservers

source: Operating system
de: Betriebssystem

source: Order of boot devices
de: Reihenfolge der Boot-Devices

source: Pattern for filtering images
de: Suchmuster für Abbilder

source: Prefix for the name of virtual machines
de: Präfix für den Namen von virtuellen Maschinen

source: Profile
de: Profil

source: Profiles
de: Profile

source: Read caching, forced sync
de: Lese-Caching, erzwungenes sync

source: Read/write caching, no forced sync
de: Lese-/Schreib-Caching, kein erzwungenes sync

source: Read/write caching, sync filtered out
de: Lese-/Schreib-Caching, herausgefiltertes sync

source: Real Time Clock offset
de: Realzeituhrversatz

source: Reference to the profile used for defining this VM
de: Referenz auf das bei der Definition genutzte Profil

source: Reference to the type of the cloud connection
de: Referenz auf den Typ der Cloud-Verbindung

source: Remote access
de: Fernzugriff

source: Show UCS images when creating a new instance
de: Zeige UCS Abbilder an beim Anlegen neuer Instanzen

source: The specified images are added to the list of selectable images in the instance wizard
de: Die angegeben Abbilder werden zur Liste der auswählbaren Abbilder beim Instanz-Assistenten hinzugefügt

source: The unique identifier used by libvirt to identify the VM
de: Der eindeutige Bezeicher, wie er von libvirt zu Identifikation der VM verwendet wird

source: UVMM: Cloud Connection
de: UVMM: Cloud-Verbindung

source: UVMM: Cloud Type
de: UVMM: Cloud-Typ

source: UVMM: Cloud Types
de: UVMM: Cloud-Typen

source: UVMM: Machine information
de: UVMM: Informationen zur Maschine

source: UVMM: Profile
de: UVMM: Profil

source: Use advanced kernel configuration
de: Verwende erweiterte Kernelkonfiguration

source: Use para-virtual driver for CDROM drives
de: Verwende paravirtualisierte Treiber für CDROM-Laufwerke

source: Use para-virtual driver for hard drives
de: Verwende paravirtualisierte Treiber für Festplatten

source: Use para-virtual driver for network interface
de: Verwende paravirtualisierte Treiber für Netzwerkkarten

source: Value must be an positive capacity (xx.x [kmgtp][[i]B])
de: Wert muss eine positive Kapazität enthalten (xx.x [kmgtp][[i]B])

source: Virtual hardware
de: Virtuelle Hardware

source: Virtual machine cloud connection
de: Verbindungen der Cloud

source: Virtual machine cloud type
de: Typ der Cloud

source: Virtual machine information
de: Informationen zur virtuelle Maschine

source: Virtual machine profile
de: Profil für eine virtuelle Maschine

source: Virtualisation Technology
de: Virtualisierungstechnologie

source: When creating new instances, this pattern is used to further filter all available Images
de: Beim Anlegen von neuen Instanz wird dieses Suchmuster verwendet, um die Liste der verfügbaren Abbilder zu filtern

source: hard drive
de: Festplatte
