Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/virtualization/univention-virtual-machine-manager-daemon/umc/js/*.po
Languages: fr

source: Settings for devices
fr: Réglages des périphériques

source: Should the %d network interfaces be removed?
fr: Voulez-vous supprimer les %d interfaces réseau ?

source: Should the network interface be removed?
fr: Voulez-vous supprimer l'interface réseau ?

source: Should the selected drive be deleted or detached from the virtual machine?
fr: Le disque sélectionné doit-il être supprimé ou détaché de la machine virtuelle ?

source: Should the selected instance {label} be deleted?
fr: L'instance {label} sélectionnée doit-elle être supprimée ?

source: Should the selected virtual machine {label} be removed?
fr: La machine virtuelle {label} sélectionnée doit-elle être supprimée ?

source: Show this warning again
fr: Continuer à afficher cet avertissement

source: Shut off the virtual machine
fr: Arrêter la machine virtuelle

source: Shutdown
fr: Éteindre

source: Shutdown (soft)
fr: Demander l'extinction

source: Simple format (raw)
fr: Format simple (brut)

source: Size
fr: Taille

source: Size (default unit MB)
fr: Taille (l'unité par défaut est le Mo)

source: Slovene
fr: Slovène

source: Snapshots
fr: Instantanés

source: Snapshots settings
fr: Réglages des instantanés

source: Spanish
fr: Espagnol

source: Specify the capacity for the new volume
fr: Précisez la capacité du nouveau volume

source: Start
fr: Démarrer

source: Start the instance
fr: Démarrer l'instance

source: Start the virtual machine
fr: Démarrer la machine virtuelle

source: State: {state}<br>Server: {node}<br>{vnc_port}
fr: État : {state}<br>Serveur : {node}<br>{vnc_port}

source: Stop
fr: Arrêter

source: Stopping the virtual machine will turn it off without shutting down the operating system. Should the operation be continued?
fr: L'arrêt de la machine virtuelle l'éteindra sans arrêter le système d'exploitation. Voulez-vous effectuer cette action ?

source: Suspend
fr: Suspendre

source: Swedish
fr: Suédois

source: Tenant
fr: Titulaire

source: Thai
fr: Thaïlandais

source: The UVMM service is currently not available. Please trigger a search to refresh the view.
fr: Le service UVMM est actuellement indisponible. Veuillez lancer une recherche pour rafraîchir la vue.

source: The device cannot be modified by the guest.
fr: Le périphérique ne peut pas être modifié par l'invité.

source: The entered data is not valid. Please correct your input.
fr: Les données saisies sont invalides. Veuillez corriger votre saisie.

source: The following settings were read from the selected profile and can be modified now.
fr: Les réglages suivants ont été lus depuis le profil sélectionné et peuvent maintenant être modifiés.

source: The given volume capacity exceeds the available storage pool capacity
fr: La capacité du volume donné dépasse la capacité disponible du groupe de stockage.

source: The instance {label} is still not running. Please wait and to update the view, click on "Search".
fr: L'instance {label} n'est pas démarrée. Veuillez patienter, et, afin de rafraîchir la vue, cliquez sur « Chercher ».

source: The memory size is invalid (e.g. 3GB or 1024 MB), minimum 4 MB
fr: La taille de la mémoire n'est pas valide (ex : 3Go or 1024 Mo), avec un minimum à 4 Mo

source: The number of virtual machines changed. To update the view, click on "Search".
fr: Le nombre de machines virtuelles a changé. Pour rafraîchir la vue, cliquez sur « Chercher ».

source: The selected drive is a CD-ROM and should be detached from the virtual machine. If the volume is delete no other machine can use it anymore.
fr: Le disque sélectionné est un CD-ROM et doit être détaché de la machine virtuelle. Si le volume est supprimé, plus aucune autre machine ne pourra l'utiliser.

source: The selected drive is a floppy and should be detached from the virtual machine. If the volume is delete no other machine can use it anymore.
fr: Le disque sélectionné est une disquette et doit être détaché de la machine virtuelle. Si le volume est supprimé, plus aucune autre machine ne pourra l'utiliser.

source: The selected drive seems to be attached to other virtual machines and therefore should not be deleted.
fr: Le disque sélectionné semble être attaché à d'autres machines virtuelles et ne peut, par conséquent, pas être supprimé.

source: The selected virtual machines are not all located on the same physical server. The migration will not be performed.
fr: Les machines virtuelles sélectionnées ne sont pas toutes situées sur le même serveur physique. La migration ne peut s'effectuer.

source: The source is the name of the network interface on the physical server that is configured for bridging. By default it is br0.
fr: La source est le nom de l'interface réseau configurée sur le serveur physique comme un pont. La valeur par défaut est « br0 ».

source: The state of the selected virtual machines can not be changed
fr: L'état des machines virtuelles sélectionnées ne peut être modifié

source: The url is invalid!<br/>Expected format is: <i>http(s)://</i>
fr: L'URL est invalide !<br/>Le format attendu est : <i>http(s)://</i>

source: The volume capacity is invalid
fr: La capacité du volume est invalide

source: The volume capacity must be specified
fr: La capacité du volume doit être précisée

source: To bind the drive to a local device the filename of the associated block device must be specified.
fr: Pour lier un disque à un périphérique local, le nom du fichier du périphérique par bloc associé doit être précisé.

source: To finalize the creation of the virtual machine, please add one or more drives by clicking on "Add drive".
fr: Pour finaliser la création de la machine virtuelle, veuillez ajouter un ou plusieurs disques en cliquant sur « Ajouter un disque ».

source: Turkish
fr: Turc

source: Two types of network interfaces are supported. The first one is <i>Bridge</i> that requires a static network connection on the physical server that is configured to be used for bridging. By default the network interface called br0 is setup for such a case on each UVMM node. If a virtual machine should have more than one bridging network interface, additional network interfaces on the physical server must be configured first. The second type is <i>NAT</i> provides a private network for virtual machines on the physical server and permits access to the external network. This network type is useful for computers with varying network connections like notebooks. For such an interface the network configuration of the UVMM node needs to be modified. This is done automatically by the UVMM service when starting the virtual machine. Further details about the network configuration can be found in <a target="_blank" href="https://docs.software-univention.de/manual-%s.html#uvmm:networkinterfaces">the manual</a>.
fr: Deux types d'interfaces réseaux sont pris en charge. Le premier est le <i>Pont réseau</i>, qui suppose qu'une connexion réseau statique sur le serveur physique est configurée spécialement en pont réseau. Par défaut, l'interface réseau nommée « br0 » est mise en place pour ce cas d'utilisation sur chaque nœud UVMM. Si une machine virtuelle comporte plusieurs interfaces réseaux servant de pont réseau, des interfaces réseaux supplémentaires devront être tout d'abord configurées sur le serveur physique. Le second type est le <i>NAT</i> et fournit un réseau privé pour les machines virtuelles hébergées sur le serveur physique et permet l'accès au réseau extérieur. Ce type de réseau est utile pour les ordinateurs ayant des connexions réseaux variables, comme les portables. Pour ce type d'interface, la configuration du réseau du nœud UVMM doit être modifiée. Ceci est fait automatiquement par le service UVMM au démarrage de la machine virtuelle. Des informations supplémentaires sur la configuration du réseau peuvent être trouvées dans <a target="_blank" href="https://docs.software-univention.de/manual-%s.html#uvmm:networkinterfaces">le manuel</a>.

source: Unknown
fr: Inconnu

source: Use a local device
fr: Utiliser un périphérique local

source: Use the following authentication type
fr: Utiliser le type d'authentification suivant

source: Username
fr: Nom d'utilisateur

source: VNC Port
fr: Port VNC

source: VNC password
fr: Mot de passe VNC

source: VNC-Port: %s
fr: Port VNC : %s

source: View
fr: Vue

source: Virtual machine
fr: Machine virtuelle

source: Virtual machine shutdown
fr: Arrêt d'une machine virtuelle

source: Virtual machine: %s
fr: Machine virtuelle : %s

source: What type of drive should be created?
fr: Quel type de disque doit être créé ?

source: When creating new cloud instances with this connection, only images that match the pattern are available. "*" finds all images.
fr: Lors de la création de nouvelles instances sur le cloud avec cette connexion, seules les images correspondantes au motif sont disponibles. « * » trouve toutes les images.

source: Where should the virtual machine instance be created
fr: Où les instances de machines virtuelles doivent être créées

source: Which type of connection should be created
fr: Quel type de connexion doit être créé

source: automatic
fr: automatique

source: more information
fr: plus d'informations

source: paused
fr: mise en pause

source: pending
fr: en attente

source: running
fr: en cours d'exécution

source: running (idle)
fr: en cours d'exécution (inactive)

source: shut off
fr: arrêtée

source: shut off (crashed)
fr: arrêtée (plantée)

source: suspended
fr: suspendue

source: terminated
fr: terminée

source: unknown
fr: inconnu

source: {volumeFilename} (Pool: {pool})
fr: {volumeFilename} (groupe : {pool})
