Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/virtualization/univention-virtual-machine-manager-daemon/umc/js/*.po
Languages: fr

source: ({avail} free)
fr: ({avail} disponible)

source: %s domain
fr: domaine %s

source: (saved state)
fr: (état enregistré)

source: <p>For fail over the virtual machine can be migrated to another physical server re-using the last known configuration and all disk images. This can result in <strong>data corruption</strong> if the images are <strong>concurrently used</strong> by multiple running machines! Therefore the failed server <strong>must be blocked from accessing the image files</strong>, for example by blocking access to the shared storage or by disconnecting the network.</p><p>When the server is restored, all its previous virtual machines will be shown again. Any duplicates have to be cleaned up manually by migrating the machines back to the server or by deleting them. Make sure that shared images are not delete.</p>
fr: <p>Pour permettre le basculement en cas de panne, la machine virtuelle peut être migrée vers un autre serveur physique réutilisant la dernière configuration connue et toutes les images des disques. Il peut cependant en résulter une <strong>corruption des données</strong> si les images sont <strong>utilisées simultanément</strong> par plusieurs machines en fonction ! Par conséquent, le serveur en échec <strong>ne doit pas accéder aux fichiers d'images</strong>, par exemple en bloquant l'accès au stockage partagé, ou en déconnectant le réseau.</p> <p>Lorsque le serveur sera restauré, toutes ses machines virtuelles précédentes seront de nouveau affichées. Tout doublon devra être nettoyé en migrant manuellement les machines vers ce serveur ou en les supprimant. Veuillez vous assurer que les images partagées ne sont pas supprimées.</p>

source: <p>Shutting down virtual machines cleanly required the cooperation of their guest operating system.</p><p>For KVM ACPI must be enabled.</p><p>If the operating system does not cooperate, "Stop" can be used to forcefully turn off the virtual machine.</p>
fr: <p>L'arrêt correct des machines virtuelles requiert la coopération du système d'exploitation invité.</p><p>L'ACPI doit être activée pour KVM.</p><p>Si le système d'exploitation ne coopère pas, l'action « Arrêt » peut être utilisée pour forcer l'arrêt d'une machine virtuelle.</p>

source: A connection to a virtualization infrastructure could not be established. You can either connect to a public or private cloud. Alternatively you can install a hypervisor on this or on any other UCS server in this domain. Further details about the virtualization can be found in <a target="_blank" href="https://docs.software-univention.de/manual-%s.html#uvmm:chapter">the manual</a>.
fr: Impossible d'établir une connexion à l'infrastructure de virtualisation. Vous devez vous connecter sur un cloud public ou privé. Il est également possible d'installer un hyperviseur sur ce serveur sur n'importe quel autre serveur UCS de ce domaine. Des informations supplémentaires sur la virtualisation sont disponibles dans <a target="_blank" href="http://docs.univention.de/manual-%s.html#uvmm:chapter">le manuel</a>.

source: A key pair consists of a public and private key to log in using SSH. The configuration of all keys takes place directly via the administration page of the cloud. The key creation or upload has to be done at the provider's administration interface.
fr: Une paire de clés se compose d'une clé publique et d'une clé privée permettant de s'authentifier par le biais de SSH. La configuration de toutes les clés s'effectue directement dans la page d'administration du cloud. Les clés doivent être créées et envoyées sur l'interface d'administration du fournisseur.

source: A name for the virtual machine is required and should not be the same as the given name prefix
fr: Le nom de la machine virtuelle est requis et ne peut être identique au préfixe du nom donné

source: A security group acts as a virtual firewall that controls the traffic of the instance. To enable access, correct rules have to be configured (for example, a UCS instance needs at least TCP ports 22 (ssh) and 443 (https)). The security group configuration has to be done at the provider's administration interface.
fr: Un groupe de sécurité fonctionne comme un pare-feu virtuel contrôlant le trafic de l'instance. Pour activer l'accès, des règles correctes doivent être mises en place (par exemple, une instance UCS doit au moins disposer des ports TCP 22 (SSH) et 443 (HTTPS)). Le groupe de sécurité doit être configuré sur l'interface d'administration du fournisseur.

source: A valid clone name cannot contain "/" and may not start with "." .
fr: Un nom de clone valide ne peut contenir un « / » et ne peut commencer par « . ».

source: A valid filename cannot contain "/", may not start with "." and may not already exist in the storage pool.
fr: Un nom de fichier valide ne peut contenir un « / », ne peut commencer par « . » et ne peut pas déjà exister dans le groupe de stockage.

source: A valid snapshot name cannot contain "/", "&" or "<", and may not start with "." .
fr: Un nom d'instantané valide ne peut contenir les caractères « / », « & » ou « < », et ne peut commencer par un « . »..

source: API Key
fr: Clé d'API

source: Access Key ID
fr: Id. de la clé d'accès

source: Add
fr: Ajouter

source: Add a new drive
fr: Ajouter un nouveau lecteur

source: Add drive
fr: Ajouter un lecteur

source: Add network interface
fr: Ajouter une interface réseau

source: Advanced
fr: Avancé

source: Advanced settings
fr: Réglages avancés

source: All image files are stored in so-called storage pools. They can be stored in a local directory, an LVM partition or a share (e.g. using iSCSI, NFS or CIFS).
fr: Tous les fichiers d'images sont stockés dans ce que l'on appelle des groupes de stockage. Ils peuvent être stockés dans un répertoire local, une partition LVM ou un partage (par exemple utilisant iSCSI, NFS ou CIFS).

source: An error occurred during processing your request.
fr: Une erreur est apparue lors du traitement de votre requête.

source: Arabic
fr: Arabe

source: Are you sure to delete the selected %s snapshots?
fr: Vous-vous vraiment supprimer les %s instantanés sélectionnés ?

source: Are you sure to delete the selected snapshot?
fr: Vous-vous vraiment supprimer l'instantané sélectionné ?

source: Are you sure to revert to the selected snapshot?
fr: Vous-vous vraiment retourner à l'instantané sélectionné ?

source: Authentication URL endpoint
fr: URL du point d'accès d'authentification

source: Back to overview
fr: Retour vers la vue globale

source: Boot order
fr: Séquence de démarrage

source: Bridge
fr: Pont

source: By default the private network is 192.168.122.0/24.
fr: Le réseau privé est par défaut 192.168.122.0/24.

source: CD/DVD-ROM drive
fr: Lecteur CD / DVD-ROM

source: CDROM drive
fr: Lecteur CD-ROM

source: CPU usage
fr: Utilisation du processeur

source: Caching
fr: Mise en cache

source: Cancel
fr: Annuler

source: Change medium
fr: Modifier le médium

source: Choose an AMI
fr: Choisissez une AMI

source: Choose an Image
fr: Choisissez une image

source: Choose an Instance Size
fr: Choisissez une taille d'instance

source: Choose existing image
fr: Choisissez une image existante

source: Clone
fr: Dupliquer

source: Cloud connections
fr: Connexions au cloud

source: Cloud instance
fr: Instance dans le cloud

source: Configure Network
fr: Configurer le réseau

source: Configure Security Group
fr: Configurer le groupe de sécurité

source: Configure Subnet
fr: Configurer le sous-réseau

source: Configure cache behavior of host.
fr: Configurer le comportement du cache de l'hôte.

source: Connection to server {node} failed.
fr: Échec de la connexion au serveur {node}.

source: Coordinated Universal Time
fr: Temps universel coordonné

source: Create
fr: Créer

source: Create a clone
fr: Créer un clone

source: Create a new cloud connection service account.
fr: Créer un nouveau compte de service de connexion au cloud.

source: Create a new cloud connection.
fr: Créer une nouvelle connexion au cloud.

source: Create a new image
fr: Créer une nouvelle image

source: Create a new virtual machine instance.
fr: Créer une nouvelle instance de machine virtuelle.

source: Create a virtual machine
fr: Créer une machine virtuelle

source: Create a virtual machine (profile: %s)
fr: Créer une machine virtuelle (profil : %s)

source: Create a virtual machine or a cloud connection
fr: Créer une machine virtuelle ou une connexion au cloud

source: Create new snapshot
fr: Créer un nouvel instantané

source: Creating a snapshot is not possible, because the domain contains writeable raw images!
fr: Impossible de créer un instantané, car le domaine contient des images brutes modifiables !

source: Creating a snapshot is not possible, because the domain does not have at least one qcow2 image!
fr: Impossible de créer un instantané, car le domaine ne comporte pas au moins une image qcow2 !

source: Creating a snapshot is not possible, because the domain is currently suspended!
fr: Impossible de créer un instantané, car le domaine est actuellement suspendu !

source: Croatian
fr: Croate

source: Danish
fr: Danois

source: Default (RealTek RTL-8139)
fr: Par défaut (RealTek RTL-8139)

source: Delete
fr: Supprimer

source: Delete a virtual machine
fr: Supprimer une machine virtuelle

source: Delete an instance
fr: Supprimer une instance

source: Detach
fr: Détacher

source: Device filename
fr: Nom du fichier de périphérique

source: Devices
fr: Périphériques

source: Direct access (VNC)
fr: Accès direct (VNC)

source: Displayed type
fr: Type affiché

source: Drive image
fr: Image du lecteur

source: Drive type
fr: Type de lecteur

source: Driver
fr: Pilote

source: Drives
fr: Lecteurs

source: Dutch
fr: Néerlandais

source: Dutch-Belgium
fr: Néerlandais (Belgique)

source: EC2 Region
fr: Région EC2

source: Each image is located within a so called storage pool, which might be a local directory, a device, an LVM volume or any type of share (e.g. mounted via iSCSI, NFS or CIFS).
fr: Chaque image est stockée dans ce que l'on appelle un groupe de stockage, qui peut consister en un répertoire local, un périphérique, un volume LVM ou un partage (par exemple monté par le biais de iSCSI, NFS ou CIFS).

source: Each image is located within a so called storage pool, which might be a local directory, a device, an LVM volume or any type of share (e.g. mounted via iSCSI, NFS or CIFS). When selecting a storage pool the list of available images is updated.
fr: Chaque image est stockée dans ce que l'on appelle un groupe de stockage, qui peut consister en un répertoire local, un périphérique, un volume LVM ou un partage (par exemple monté par le biais de iSCSI, NFS ou CIFS). Lors de la sélection d'un groupe de stockage, la liste des images disponibles est actualisée.

source: Edit
fr: Modifier

source: Edit drive
fr: Modifier le lecteur

source: Edit network interface
fr: Modifier l'interface réseau

source: Edit the configuration of the virtual machine
fr: Modifier la configuration de la machine virtuelle

source: English-America
fr: Anglais (États-Unis)

source: English-Britain
fr: Anglais (Grande-Bretagne)

source: Estonian
fr: Estonien

source: Extended format (qcow2)
fr: Format étendu (qcow2)

source: Faroese
fr: Féroïen

source: Filename
fr: Nom de fichier

source: Finish
fr: Terminer

source: Finnish
fr: Finnois

source: Floppy drive
fr: Lecteur de disquettes

source: For the drive a new image can be created or an existing one can be chosen. An existing image should only be used by one virtual machine at a time.
fr: Pour le disque, une nouvelle image peut être créée ou une image existante peut être choisie. Une image existante ne peut être utilisée que par une machine virtuelle à la fois.

source: French
fr: Français

source: French-Belgium
fr: Français (Belgique)

source: French-Canada
fr: Français (Canada)

source: French-Switzerland
fr: Français (Suisse)

source: General
fr: Général

source: General settings
fr: Réglages généraux

source: Generate new MAC addresses
fr: Générer de nouvelles adresses MAC

source: German
fr: Allemand

source: German-Switzerland
fr: Allemand (Suisse)

source: Globally available
fr: Disponible partout

source: Guest controlled
fr: Contrôlé par l'invité

source: Hard drive
fr: Disque dur

source: Hard drive images can be administrated in two ways on KVM systems; by default images are saved in the <i>Extended format (qcow2)</i>. This format supports copy-on-write which means that changes do not overwrite the original version, but store new versions in different locations. The internal references of the file administration are then updated to allow both access to the original and the new version. This technique is a prerequisite for efficiently managing snapshots of virtual machines. Alternatively, you can also access a hard drive image in <i>Simple format (raw)</i>. Snapshots can only be created when using hard drive images in <i>Extended format</i>.
fr: Les images de disques durs peuvent être administrées de deux manières sur les systèmes KVM : par défaut, les images sont enregistrées en utilisant le <i>Format étendu (qcow2)</i>. Ce format gère la copie à l'écriture, ce qui signifie que les modifications n'écrasent pas la version originale, mais stockent de nouvelles versions à des emplacements différents. Les références internes de l'administration des fichiers sont ensuite actualisées pour permettre l'accès à la version originale ainsi qu'à la nouvelle. Cette technique est un prérequis pour gérer efficacement les instantanés des machines virtuelles. Il est aussi possible d'accéder aux images de disques durs par le biais du <i>Format simple (brut)</i>. Les images ne peuvent être créées que sur les images de disques durs utilisant le <i>Format étendu</i>.

source: Hungarian
fr: Hongrois

source: Hypervisor default
fr: Défaut de l'hyperviseur

source: ISO format (iso)
fr: Format ISO (iso)

source: Icelandic
fr: Islandais

source: If the required image is not found it might be added by copying the file into the storage pool, e.g. to /var/lib/libvirt/images/ which is the directory of the storage pool local directory. After that go to the previous page and return to this one. The image should now be listed.
fr: Si l'image requise n'est pas trouvée, elle peut être ajoutée en copiant le fichier dans le groupe de stockage, c'est à dire vers « /var/lib/libvirt/images/ », qui représente le répertoire local du groupe de stockage. Après cela, retournez à la page précédente puis sur celle-ci à nouveau. L'image apparaîtra maintenant dans la liste.

source: Image format
fr: Format d'image

source: Inherit MAC addresses
fr: Hériter des adresses MAC

source: Instance Name
fr: Nom de l'instance

source: Instance size
fr: Taille de l'instance

source: Invalid MAC address: The address must be unicast and should have the form "02:23:45:67:89:AB".
fr: Adresse MAC invalide : l'adresse doit être de point à point et de la forme « 02:23:45:67:89:AB ».

source: Italian
fr: Italien

source: Japanese
fr: Japonais

source: Keyboard layout
fr: Disposition du clavier

source: Keypair
fr: Paire de clés

source: Latvian
fr: Letton

source: Launch into default Network
fr: Lancer dans le réseau par défaut

source: Lithuanian
fr: Lituanien

source: Local time zone
fr: Fuseau horaire local

source: MAC address
fr: Adresse MAC

source: MAC addresses
fr: Adresses MAC

source: Macedonian
fr: Macédonien

source: Memory
fr: Mémoire

source: Memory (default unit MB)
fr: Mémoire (l'unité par défaut est le Mo)

source: Memory usage
fr: Utilisation de la mémoire

source: Migrate
fr: Migrer

source: Migrate domain
fr: Migrer le domaine

source: Name
fr: Nom

source: Name: {name}<br>State: {state}<br>Server: {node}<br>Description: {description}<br>{vnc_port}
fr: Nom : {name}<br>État : {state}<br>Serveur : {node}<br>Description : {description}<br>{vnc_port}

source: Network
fr: Réseau

source: Network interfaces
fr: Interfaces réseau

source: Next
fr: Suivant

source: No host caching, forced sync (direct-sync)
fr: Pas de mise en cache sur l'hôte, synchronisation forcée (synchronisation directe)

source: No host caching, no forced sync (none)
fr: Pas mise en cache sur l'hôte, pas de synchronisation forcée (aucune)

source: No media
fr: Aucun média

source: No snapshots have been selected!
fr: Aucun instantané n'a été sélectionné !

source: Norwegian
fr: Norvégien

source: Not removable
fr: Non amovible

source: Number of CPUs
fr: Nombre de processeurs

source: Open a view to the virtual machine
fr: Ouvrir une vue vers la machine virtuelle

source: Open a view to the virtual machine {label} on {nodeName}
fr: Ouvrir une vue vers la machine virtuelle {label} sur {nodeName}

source: Operating system
fr: Système d'exploitation

source: Optional. By default, all UCS images are shown when creating a new cloud instance. If a search pattern is specified, AMIs matching this pattern are also available. "*" finds all images, but the list of available AMIs may get very long and take a considerable amount of time to load.
fr: Optionnel. Par défaut, toutes les images UCS sont affichées à la création d'une nouvelle instance dans le cloud. Si un motif de recherche est défini, les AMI correspondantes à ce motif seront aussi disponibles. « * » cherche toutes les images, mais la liste des AMI disponibles risque d'être très longue et prendra un temps important à se charger.

source: Paravirtual device (virtio)
fr: Périphérique paravirtualisé (« virtio »)

source: Paravirtual drive
fr: Disque paravirtualisé (« virtio »)

source: Paravirtualization is a special variant of virtualization in which the virtualized operating system is adapted to the underlying virtualization technology. This improves the performance. Linux systems usually support paravirtualization out of the box. For Windows systems additional support drivers need to be installed, see the <a href="https://wiki.univention.de/index.php?title=UVMM_Technische_Details">Univention wiki</a> for details (currently only available in German).
fr: La paravirtualisation est une alternative spéciale à la virtualisation dans laquelle le système d'exploitation virtualisé est adapté à la technologie de virtualisation sous-jacente. Elle améliore les performances. Les systèmes Linux gèrent la paravirtualisation par défaut. Les systèmes Windows ont besoin de l'installation de pilotes de prise en charge supplémentaires, veuillez consulter le <a href="https://wiki.univention.de/index.php?title=UVMM_Technische_Details">wiki Univention</a> pour plus de détails (uniquement en allemand pour le moment).

source: Password
fr: Mot de passe

source: Pause
fr: Mettre en pause

source: Physical server
fr: Serveur physique

source: Physical servers
fr: Serveurs physiques

source: Please enter the corresponding credentials for the cloud connection. <a href="https://docs.aws.amazon.com/AWSSimpleQueueService/latest/SQSGettingStartedGuide/AWSCredentials.html" target=_blank>Use this link to get information about AWS credentials</a>
fr: Veuillez saisir les preuves d'identité pour la connexion au cloud. <a href="https://docs.aws.amazon.com/AWSSimpleQueueService/latest/SQSGettingStartedGuide/AWSCredentials.html" target=_blank>Utilisez ce lien pour obtenir des informations sur les preuves d'identité d'AWS</a>

source: Please enter the corresponding credentials for the cloud connection:
fr: Veuillez saisir les preuves d'identité pour la connexion au cloud :

source: Please enter the corresponding details for the virtual machine instance.
fr: Veuillez saisir les détails de l'instance de machine virtuelle.

source: Please enter the corresponding details for the virtual machine instance. <a href="https://aws.amazon.com/documentation/ec2/" target=_blank>Use this link for more information about Amazon EC2</a>
fr: Veuillez saisir les détails de l'instance de machine virtuelle. <a href="https://aws.amazon.com/documentation/ec2/" target=_blank>Utilisez ce lien pour obtenir des informations sur Amazon EC2</a>

source: Please enter the name for the clone:
fr: Veuillez saisir le nom de ce clone :

source: Please enter the name for the snapshot:
fr: Veuillez saisir le nom de cet instantané :

source: Please select a valid search type.
fr: Veuillez sélectionner un type de recherche valide.

source: Please select the destination server:
fr: Veuillez sélectionner le serveur de destination :

source: Please wait, your requests are being processed...
fr: Veuillez patienter, vos requêtes sont en cours de traitement...

source: Polish
fr: Polonais

source: Pool
fr: Groupe

source: Portuguese
fr: Portugais

source: Portuguese-Brasil
fr: Portugais (Brésil)

source: Private IP address
fr: Adresse IP privée

source: Profile
fr: Profil

source: Public IP address
fr: Adresse IP publique

source: Query pattern
fr: Motif de requête

source: RTC reference
fr: Référence RTC

source: Read caching, forced sync (write-through)
fr: Cache de lecture, synchronisation forcée (écriture immédiate)

source: Read only
fr: Lecture seule

source: Read/write caching, no forced sync (write-back)
fr: Cache de lecture et d'écriture, aucune synchronisation forcée (écriture différée)

source: Read/write caching, sync filtered out (unsafe)
fr: Cache de lecture et d'écriture, synchronisation évincée (risqué)

source: Reload
fr: Recharger

source: Remote access
fr: Accès à distance

source: Remove
fr: Supprimer

source: Request virtual machine shutdown using ACPI
fr: Demander un arrêt de la machine virtuelle par ACPI

source: Restart (hard)
fr: Forcer le redémarrage

source: Restart (soft)
fr: Demander le redémarrage

source: Revert
fr: Revenir à la version précédente

source: Russian
fr: Russe

source: Save
fr: Enregistrer

source: Search pattern for AMIs
fr: Motif de recherche pour les AMI

source: Search pattern for images
fr: Motif de recherche pour les images

source: Secret Access Key
fr: Clé d'accès secrète

source: Security group
fr: Groupe de sécurité

source: Select a key pair
fr: Sélectionnez une paire de clés

source: Select a network in which the new virtual machine instance should be launched. The network configuration has to be done at the provider's administration interface. <a href="https://aws.amazon.com/documentation/vpc/" target="_blank">Use this link for more information about Amazon VPC</a> and <a href="https://console.aws.amazon.com/vpc/home?#s=vpcs" target="_blank">this link to configure VPC</a>.
fr: Sélectionnez un réseau dans lequel la nouvelle instance de machine virtuelle sera exécutée. La configuration du réseau doit s'effectuer sur l'interface d'administration du fournisseur. <a href="https://aws.amazon.com/documentation/vpc/" target="_blank">Utilisez ce lien pour obtenir plus d'informations sur Amazon VPC</a> et <a href="https://console.aws.amazon.com/vpc/home?#s=vpcs" target="_blank">ce lien pour configurer VPC</a>.

source: Select if you want to create a new machine using an established connection, or if you want to create a new cloud connection to a specific provider.
fr: Sélectionnez cette option si vous souhaitez créer une nouvelle machine utilisant une connexion existante, ou si vous voulez créer une nouvelle connexion au cloud vers un fournisseur particulier

source: Select the cloud in which a new virtual machine instance is going to be created. Alternatively, it is possible to register a new cloud connection.
fr: Sélectionnez le cloud dans lequel la nouvelle instance de machine virtuelle sera créée. Il est également possible d'indiquer une nouvelle connexion au cloud.

source: Send email
fr: Envoyer un courriel

source: Service URL endpoint
fr: URL du point d'accès au service

source: Service name
fr: Nom du service

source: Service region
fr: Région du service

source: Service type
fr: Type de service

source: Settings
fr: Réglages
