Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-management-console-module-lib/umc/js/*.po
Languages: fr

source: <b>Note:</b> After the restart you will be redirected to the login page.
fr: <b>Remarque :</b> après le redémarrage, vous serez redirigé vers la page d'authentification.

source: Cancel
fr: Annuler

source: Please confirm to reboot this server. This may take a few minutes.
fr: Veuillez confirmer le redémarrage du serveur. Cette action peut prendre quelques minutes.

source: Please confirm to restart UMC server components and the HTTP web server. This will take approximately 10 seconds.
fr: Veuillez confirmer le redémarrage des composants UMC du serveur et du serveur HTTP. Cette action prend environ 10 secondes.

source: Please confirm to shutdown this server. This may take a few minutes.
fr: Veuillez confirmer l'arrêt du serveur. Cette action peut prendre quelques minutes.

source: Please wait while UMC server components and HTTP web server are being restarted.
fr: Veuillez patienter pendant le redémarrage des composants du serveur UMC et du serveur HTTP.

source: Reboot
fr: Redémarrer

source: Rebooting server
fr: Redémarrage du serveur

source: Restart
fr: Redémarrer

source: Restarting server
fr: Redémarrage du serveur

source: Shutdown
fr: Arrêter

source: Shutting down server
fr: Arrêt du serveur

source: The server is being rebooted.
fr: Le serveur est en cours de redémarrage.

source: The server is shutting down.
fr: Le serveur est en cours d'arrêt.
