Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-management-console-module-adtakeover/umc/js/*.po
Languages: fr

source: <p>A <i>{ad_os}</i> Active Directory domain with the domainname <i>{ad_domain}</i> has been found. The server <i>{ad_hostname} ({ad_ip})</i> will be used as Active Directory Domain Controller for the takeover.</p><p>The following accounts have been found in the Active Directory domain:<ul><li>{users} users</li><li>{groups} groups</li><li>{computers} computers</li></ul>Click "Next" to start with the migration.</p>
fr: <p>Un domaine Active Directory <i>{ad_os}</i> de nom de domaine <i>{ad_domain}</i> a été trouvé. Le serveur <i>{ad_hostname} ({ad_ip})</i> sera utilisé comme contrôleur de domaine Active Directory pour la prise de contrôle. </p><p>Les comptes suivants ont été trouvés dans le domaine Active Directory :<ul><li>utilisateurs {users}</li><li>groupes {groups}</li> <li>ordinateurs {computers}</li></ul>Cliquez sur « Suivant » pour démarrer la migration.</p>

source: <p>A previous Active Directory takeover was detected.</p><p>In order to start another takeover process, click "Next".</p>
fr: <p>Une prise de contrôle Active Directory précédente a été détectée.</p> <p>Pour démarrer un nouveau processus de prise de contrôle, cliquez sur « Suivant ».</p>

source: <p>All Windows domain accounts have been successfully transferred.</p><p>As next step, group policies must be copied from the Active Directory SYSVOL share to Univention Corporate Server. We recommend using robocopy from a Windows client or Windows server which is joined to the domain:</p>
fr: <p>Tous les comptes du domaine Windows ont été transférés avec succès.</p> <p>L'étape suivante requiert de copier les stratégies de groupe depuis le partage Active Directory SYSVOL vers Univention Corporate Server. Nous recommandons d'utiliser robocopy depuis un client ou un serveur Windows faisant partie du domaine :</p>

source: <p>Congratulations, the Active Directory Takeover wizard has been successfully completed and all Windows domain accounts have been transferred to Univention Corporate Server.</p><p>The domain is now ready for usage without any further changes.</p>
fr: <p>Félicitations, le processus guidé par l'assistant Active Directory Takeover s'est terminé avec succès et tous les comptes du domaine Windows ont été transférés vers Univention Corporate Server.</p><p>Le domaine est maintenant prêt à être utilisé sans autre modification.</p>

source: <p>The group policies have been transferred successfully.</p><p>In order to complete the takeover process, all previous Active Directory Domain Controllers need to be switched off now. Click "Next" as soon as all Domain Controllers are shutdown completely.</p>
fr: <p>Les stratégies de groupe ont été transférées avec succès.</p> <p>Pour terminer le processus de prise de contrôle, tous les contrôleurs de domaines Active Directory doivent maintenant être éteints. Cliquez sur « Suivant » dès que les contrôleurs de domaine sont intégralement éteints.</p>

source: Active Directory Administrator account
fr: Compte Administrateur Active Directory

source: Active Directory Administrator password
fr: Mot de passe Administrateur Active Directory

source: Completion of the Active Directory Takeover
fr: Avancement d'Active Directory Takeover

source: Import statistics
fr: Statistiques d'importation

source: Name or address of the Domain Controller
fr: Nom ou adresse du contrôleur de domaine

source: Previous takeover detected
fr: Prise de contrôle précédente détectée

source: Takeover of the Windows domain
fr: Prise de contrôle du domaine Windows

source: This module guides through the migration from a Windows Active Directory domain to Univention Corporate Server. All user, group and computer accounts along with their passwords and group policies are transferred. After the migration, the Windows clients are directly operable without the need of a domain rejoin.
fr: Ce module vous guide dans la migration d'un domaine Windows Active Directory vers Univention Corporate Server. Tous les comptes utilisateurs, groupes et ordinateurs, ainsi que les mots de passe et stratégies de groupes associés sont transférés. Après la migration, les clients Windows peuvent fonctionner directement sans qu'ils soit nécessaire de leur faire rejoindre le domaine.

source: Transfer of group policies
fr: Transfert des stratégies de groupes

source: Windows domain authentication
fr: Authentification sur un domaine Windows
