Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/policies/*.po
Languages: fr

source: <p>Policies are objects that can be connected with other objects in the directory tree. Connected policies allow to define object properties in a unified manner. Policies that are connected with containers or organizational units are inherited by all objects located below.</p><p>More information can be found in the <a href="https://docs.software-univention.de/manual-5.0.html#central:policies" target="_blank">online documentation for UCS</a>.</p>
fr: <p>Les stratégies sont des objets qui peuvent être connectés à d’autres objets dans l’arborescence des répertoires. Les stratégies connectées permettent de définir les propriétés des objets de manière uniformisée. Les stratégies connectées à des conteneurs ou à des unités d’organisation sont héritées par tous les objets des niveaux inférieurs.</p><p>Vous trouverez plus d’informations à ce sujet dans la <a href="https://docs.software-univention.de/manual-5.0.html#central:policies" target="_blank">documentation en ligne d’UCS</a>.</p>

source: Activate release updates (Errata updates are activated by default).
fr: Activer les mises à niveau de version (les correctifs sont activés par défaut).

source: Add hostnames to leases
fr: Incorporer les noms d'hôtes aux baux

source: Allow/Deny
fr: Autoriser/Interdire

source: Allow/Deny/Ignore statements
fr: Autoriser/Interdire/Ignorer les déclarations

source: Allowed UMC operation sets
fr: Jeux d'opérations UMC autorisées

source: Attempt to do a DNS update when a DHCP lease is confirmed
fr: Tentative de mise à jour DNS tandis qu'un bail DHCP est confirmé

source: Attempt to update a DHCP client's A record when the client acquires or renews a lease
fr: Tentative de mise à jour de l'enregistrement A d'un client DHCP tandis que le client obtient ou renouvelle un bail

source: Authoritative
fr: Faisant autorité

source: Automatic updates
fr: Mises à jour automatiques

source: Automatic updates policies
fr: Stratégies de mises à jour automatiques

source: Automatic updates policy
fr: Stratégie de mises à jour automatiques

source: Available Univention Directory Manager modules
fr: Modules d’Univention Directory Manager disponibles

source: Basic DNS settings
fr: Réglages DNS de base

source: Basic settings
fr: Réglages de base

source: Boot
fr: Amorçage

source: Boot filename
fr: Nom du fichier d'amorçage

source: Boot parameters
fr: Paramètres d'amorçage

source: Boot server
fr: Serveur d'amorçage

source: Boot settings
fr: Réglages de l'amorçage

source: Boot unknown clients
fr: Amorcer les clients inconnus

source: Booting
fr: Amorçage en cours

source: Client updates
fr: Mises à jour des clients

source: Configuration Registry
fr: Univention Configuration Registry

source: DDNS domain name
fr: Nom de domaine DDNS

source: DDNS forward update
fr: Mise à jour directe DDNS

source: DDNS hostname
fr: Nom d'hôte DDNS

source: DDNS reverse domain name
fr: Nom de domaine inverse DDNS

source: DDNS update style
fr: Style de mise à jour DDNS

source: DDNS updates
fr: Mises à jour DDNS

source: DHCP Allow/Deny policies
fr: Stratégies d’autorisation/interdiction DHCP

source: DHCP Allow/Deny policy
fr: Stratégie d’autorisation/interdiction DHCP

source: DHCP Boot policies
fr: Stratégies de démarrage DHCP

source: DHCP Boot policy
fr: Stratégie de démarrage DHCP

source: DHCP DNS policies
fr: Stratégies DNS DHCP

source: DHCP DNS policy
fr: Stratégie DNS DHCP

source: DHCP Dynamic DNS policies
fr: Stratégies de DNS dynamique DHCP

source: DHCP Dynamic DNS policy
fr: Stratégie de DNS dynamique DHCP

source: DHCP NetBIOS policies
fr: Stratégies NetBIOS DHCP

source: DHCP NetBIOS policy
fr: Stratégie NetBIOS DHCP

source: DHCP lease time
fr: Durée du bail DHCP

source: DHCP lease time policies
fr: Stratégies de durée du bail DHCP

source: DHCP lease time policy
fr: Stratégie de durée du bail DHCP

source: DHCP routing
fr: Routage DHCP

source: DHCP routing policies
fr: Stratégies de routage DHCP

source: DHCP routing policy
fr: Stratégie de routage DHCP

source: DHCP statement
fr: Déclaration DHCP

source: DHCP statements
fr: Déclarations DHCP

source: DHCP statements policies
fr: Stratégies de déclarations DHCP

source: DHCP statements policy
fr: Stratégie de déclarations DHCP

source: DNS Update
fr: Mise à jour DNS

source: Day
fr: Jour

source: Day of week
fr: Jour de la semaine

source: Declines
fr: Décline

source: Default lease time
fr: Durée du bail par défaut

source: Default quota for each user on a share
fr: Quota par défaut pour chaque utilisateur sur un partage

source: Define the name of the DHCP server
fr: Définir le nom du serveur DHCP

source: Defines a set of allowed UMC operations
fr: Définit un jeu d'opérations UMC autorisées

source: Desktop language
fr: Langue du bureau

source: Desktop policies
fr: Stratégies de bureau

source: Desktop policy
fr: Stratégie de bureau

source: Desktop profile
fr: Profil de bureau

source: Desktop settings
fr: Réglages du bureau

source: Do DNS updates for clients even if their IP addresses are assigned using fixed addresses
fr: Effectuer les mises à jour DNS pour les clients même si leurs adresses IP ont été assignées au moyen d'adresses statiques

source: Domain name
fr: Nom de domaine

source: Domain name servers
fr: Serveurs de noms de domaine

source: Domain name that will be appended to the client's hostname to form a fully-qualified domain-name (FQDN)
fr: Nom de domaine qui sera ajouté au nom d'hôte du client pour former un nom de domaine pleinement qualifié (Fully Qualified Domain Name, FQDN)

source: Domain name that will be appended to the client's hostname to produce a name for use in the client's PTR record
fr: Nom de domaine qui sera ajouté au nom d'hôte du client pour former un nom à utiliser dans l'enregistrement PTR du client

source: Duplicated variables not allowed: %s
fr: Les variables en doublon ne sont pas autorisées : %s

source: Duplicates
fr: Doublons

source: Dynamic DNS
fr: DNS dynamique

source: Dynamic DNS update
fr: Mise à jour du DNS dynamique

source: Dynamically assign addresses to unknown clients. Allowed by default. This option should not be used anymore.
fr: Affectation d'adresses dynamiques à des clients inconnus. Autorisé par défaut. Cette option ne devrait plus être utilisée.

source: Enable clients for which there is no host declaration to obtain IP addresses. Allow and deny statements within pool declarations will still be respected.
fr: Activer l'obtention d'adresses IP par les clients pour lesquels il n'y a pas de déclaration d'hôte. Les déclarations d'autorisation et d'interdiction au sein des déclarations de réservoirs continueront d'être respectées.

source: Enables/disables password quality checks for example dictionary entries
fr: Active / désactive les vérifications du niveau de sécurité des mots de passe, par exemple les comparaisons avec le dictionnaire

source: First send an ICMP Echo request (a ping) when considering dynamically allocating an IP address. Should only be disabled if the delay of one second introduced by this is a problem for a client.
fr: En premier lieu, envoyer une requête ICMP Echo (ping) lorsque l'allocation dynamique d'une adresse IP est envisagée. Ne doit être désactivé que si le délai d'une seconde introduit par cette procédure pose un problème au client.

source: General
fr: Général

source: General DHCP DNS settings
fr: Réglages généraux DHCP DNS

source: General DHCP NetBIOS settings
fr: Réglages généraux DHCP NetBIOS

source: General DHCP allow/deny settings
fr: Réglages généraux d'autorisation / d'interdiction DHCP

source: General DHCP boot settings
fr: Réglages généraux d'amorçage DHCP

source: General DHCP dynamic DNS settings
fr: Réglages généraux DHCP DNS dynamique

source: General DHCP lease time settings
fr: Réglages généraux de durée des baux DHCP

source: General DHCP routing settings
fr: Réglages généraux de routage DHCP

source: General DHCP statements settings
fr: Réglages généraux des déclarations DHCP

source: General LDAP server settings
fr: Réglages généraux du serveur LDAP

source: General Managed Node packages settings
fr: Réglages généraux des paquetages des Managed Nodes

source: General NFS mounts settings
fr: Réglages généraux des montages NFS

source: General Primary/Backup Node packages settings
fr: Réglages généraux des paquetages des Primary/Backup Nodes

source: General Replica Node packages settings
fr: Réglages généraux des paquetages des Replica Nodes

source: General UMC settings
fr: Réglages généraux d’UMC

source: General Univention Configuration Registry settings
fr: Réglages généraux Univention Configuration Registry

source: General Univention Directory Manager container settings
fr: Réglages généraux du conteneur Univention Directory Manager

source: General automatic updates settings
fr: Réglages généraux des mises à jour automatiques

source: General desktop settings
fr: Réglages généraux de bureau

source: General maintenance settings
fr: Réglages généraux de maintenance

source: General passwords settings
fr: Réglages généraux des mots de passe

source: General print server settings
fr: Réglages généraux des serveurs d'impression

source: General repository server settings
fr: Réglages généraux des serveurs de dépôt

source: General repository synchronisation settings
fr: Réglages généraux de synchronisation des dépôts

source: General user quota settings
fr: Réglages généraux des quotas d'utilisateur

source: Hard limit
fr: Limite dure

source: Hard limit (Files)
fr: Limite dure (fichiers)

source: Hard limit. Can not be exceeded.
fr: Limite dure. Ne peut être dépassée.

source: Hard limit. Can not be exceeded. Values may be entered with one of the following units as postfix: B (default), kB, MB, GB
fr: Limite dure. Ne peut être dépassée. Les valeurs peuvent être saisies avec l'une des unités suivantes : B (valeur par défaut), kB, MB, GB

source: History length
fr: Longueur de l'historique

source: Honor DHCPDECLINE messages. deny/ignore will prevent malicious or buggy clients from completely exhausting the DHCP server's allocation pool.
fr: Honorer les messages DHCPDECLINE. Autoriser / ignorer évitera qu'un client malveillant ou défectueux n'épuise totalement le réservoir d'allocation du serveur DHCP.

source: Honor the client's intention to do its own update of its A record
fr: Respecter le souhait du client de faire la mise à jour de son propre enregistrement A

source: Hostname that will be used for the client's A and PTR records
fr: Nom d'hôte à utiliser pour les enregistrements A et PTR du client

source: Hour
fr: Heure

source: If a request is received from a client that matches the MAC address of a host declaration, any other leases matching that MAC address will be discarded by the server, if this is set to deny. Allowed by default. Setting this to deny violates the DHCP protocol.
fr: Si cette valeur est fixée à « interdire », lorsqu'une requête est reçue d'un client correspondant à l'adresse MAC d'une déclaration d'hôte, tout autre bail correspondant à cette adresse MAC sera abandonné par le serveur. La valeur par défaut est d'autoriser. Fixer la valeur à « interdire » viole le protocole DHCP.

source: Initial boot file to be loaded by a client
fr: Fichier d'amorçage initial à charger par un client

source: LDAP Server
fr: Serveur LDAP

source: LDAP server
fr: Serveur LDAP

source: LDAP server policies
fr: Stratégies de serveur LDAP

source: LDAP server policy
fr: Stratégie de serveur LDAP

source: Lease Time
fr: Durée du bail

source: Lease time
fr: Durée du bail

source: Lease time used if the client does not request a specific expiration time
fr: Durée du bail utilisée si le client ne demande pas une durée d'expiration particulière

source: List of Univention Directory Manager modules
fr: Liste des modules d’Univention Directory Manager

source: List of WINS servers listed in order of preference
fr: Liste des serveurs WINS, par ordre de préférence

source: List of allowed UMC operation sets
fr: Liste des jeux d'opérations UMC autorisées

source: Logon scripts
fr: Scripts de connexion

source: Logout scripts
fr: Scripts de déconnexion

source: Look up the domain name corresponding to the IP address of each address in the lease pool and use that address for the DHCP hostname option. Disabled by default.
fr: Rechercher le nom de domaine correspondant à l'adresse IP de chaque adresse du réservoir de baux (lease pool) et utiliser cette adresse pour l'option DHCP hostname. Désactivé par défaut.

source: Maintenance policies
fr: Stratégies de maintenance

source: Maintenance policy
fr: Stratégie de maintenance

source: Maintenance settings
fr: Réglages de maintenance

source: Managed Node packages policies
fr: Stratégies de paquetages des Managed Nodes

source: Managed Node packages policy
fr: Stratégie de paquetages des Managed Nodes

source: Maximum lease time
fr: Durée maximale de bail

source: Maximum lease time that the server will accept if asked for
fr: Durée maximal de bail que le serveur acceptera si le client en fait la demande

source: Minimal amount of characters
fr: Nombre minimal de caractères

source: Minimum granted lease time
fr: Durée de bail minimale accordée

source: Minimum lease time
fr: Durée de bail minimale

source: Miscellaneous DHCP statements
fr: Déclarations DHCP diverses

source: Month
fr: Mois

source: Mount NFS shares
fr: Monter les partages NFS

source: NFS mounts
fr: Montages NFS

source: NFS mounts policies
fr: Stratégies de montages NFS

source: NFS mounts policy
fr: Stratégie de montages NFS

source: NFS shares to mount
fr: Partages NFS à monter

source: Name
fr: Nom

source: NetBIOS name servers
fr: Serveurs de noms NetBIOS

source: NetBIOS node type
fr: Type de nœud NetBIOS

source: NetBIOS over TCP/IP scope parameter
fr: Paramètre de portée NetBIOS over TCP/IP

source: NetBIOS scope
fr: Portée NetBIOS

source: Number of days after which the password has to be changed
fr: Nombre de jours au delà desquels le mot de passe doit être modifié

source: Numeric IP address or name of the server from which the initial boot file is retrieved.
fr: Adresse IP numérique ou nom du serveur depuis lequel le fichier d'amorçage initial est récupéré.

source: Package installation list
fr: Liste de paquetages à installer

source: Package removal list
fr: Liste de paquetages à supprimer

source: Packages for Managed Nodes
fr: Paquetages des Managed Nodes

source: Packages for Primary/Backup Nodes
fr: Paquetages des Primary/Backup Nodes

source: Packages for Replica Nodes
fr: Paquetages des Replica Nodes

source: Password expiry interval
fr: Intervalle d'expiration du mot de passe

source: Password length
fr: Longueur du mot de passe

source: Password quality check
fr: Vérification de la qualité du mot de passe

source: Passwords
fr: Mots de passe

source: Passwords policies
fr: Stratégies de mots de passe

source: Passwords policy
fr: Stratégie de mots de passe

source: Perform maintenance after system startup
fr: Réaliser la maintenance après le démarrage du système

source: Perform maintenance before system shutdown
fr: Réaliser la maintenance avant l'arrêt du système

source: Ping check
fr: Vérification par ping

source: Policies
fr: Stratégies

source: Policy
fr: Stratégie

source: Policy: Automatic updates
fr: Stratégie : mises à jour automatiques

source: Policy: DHCP Allow/Deny
fr: Stratégie : autorisations / interdictions DHCP

source: Policy: DHCP Boot
fr: Stratégie : amorçage DHCP

source: Policy: DHCP DNS
fr: Stratégie : DHCP DNS

source: Policy: DHCP Dynamic DNS
fr: Stratégie : DHCP DNS dynamique

source: Policy: DHCP NetBIOS
fr: Stratégie : DHCP NetBIOS

source: Policy: DHCP lease time
fr: Stratégie : durée de bail DHCP

source: Policy: DHCP routing
fr: Stratégie : routage DHCP

source: Policy: DHCP statements
fr: Stratégie : déclarations DHCP

source: Policy: Desktop
fr: Stratégie : bureau

source: Policy: LDAP server
fr: Stratégie : serveur LDAP

source: Policy: Maintenance
fr: Stratégie : maintenance

source: Policy: NFS mounts
fr: Stratégie : montages NFS

source: Policy: Packages for Managed Nodes
fr: Stratégie : paquetages des Managed Nodes

source: Policy: Packages for Primary/Backup Nodes
fr: Stratégie : paquetages des Primary/Backup Nodes

source: Policy: Packages for Replica Nodes
fr: Stratégie : paquetages des Replica Nodes

source: Policy: Passwords
fr: Stratégie : mots de passe

source: Policy: Print server
fr: Stratégie : serveur d'impression

source: Policy: Repository server
fr: Stratégie : serveur de dépôt

source: Policy: Repository synchronisation
fr: Stratégie : synchronisation des dépôts

source: Policy: UMC
fr: Stratégie : UMC

source: Policy: Univention Configuration Registry
fr: Stratégie : Univention Configuration Registry

source: Policy: Univention Directory Manager container settings
fr: Stratégie : réglages du conteneur d’Univention Directory Manager

source: Policy: User quota
fr: Stratégie : quotas d'utilisateur

source: Primary/Backup Node packages policies
fr: Stratégies de paquetages des Primary/Backup Nodes

source: Primary/Backup Node packages policy
fr: Stratégie de paquetages des Primary/Backup Nodes

source: Print server
fr: Serveur d'impression

source: Print server policies
fr: Stratégies de serveur d’impression

source: Print server policy
fr: Stratégie de serveur d’impression

source: Reapply settings on every login
fr: Appliquer les réglages à chaque ouverture de session

source: Reapply the mountpoint specific user quota policies on each user login. If not set, the initially configured quota settings will not be overwritten.
fr: Appliquer à chaque ouverture de session les stratégies de quotas utilisateur propres au point de montage. Si cette valeur n'est pas définie, les réglages de quotas configurés initialement ne seront pas écrasés.

source: Reboot after maintenance
fr: Redémarrer après une opération de maintenance

source: Release Version
fr: Version

source: Replica Node packages policies
fr: Stratégies de paquetages des Replica Nodes

source: Replica Node packages policy
fr: Stratégie de paquetages des Replica Nodes

source: Repository server
fr: Serveur de dépôt

source: Repository server policies
fr: Stratégies de serveur de dépôt

source: Repository server policy
fr: Stratégie de serveur de dépôt

source: Repository synchronisation
fr: Synchronisation des dépôts

source: Repository synchronisation policies
fr: Stratégies de synchronisation des dépôts

source: Repository synchronisation policy
fr: Stratégie de synchronisation des dépôts

source: Repository synchronisation settings
fr: Réglages de synchronisation des dépôts

source: Respond to BOOTP queries. Allowed by default.
fr: Répondre aux requêtes BOOTP. Autorisé par défaut.

source: Respond to queries from a particular client. Has meaning only when it appears in a host declaration. Allowed by default.
fr: Répondre aux requêtes d'un client donné. Cela n'a de sens que lorsque cela apparaît dans une déclaration d'hôte. Autorisé par défaut.

source: Routers
fr: Routeurs

source: Routing
fr: Routage

source: SMB/CIFS name resolution
fr: Résolution de noms SMB/CIFS

source: Send DHCPNAK messages to misconfigured clients. Disabled by default.
fr: Envoyer des messages DHCP NAK aux clients mal configurés. Désactivé par défaut.

source: Server identifier
fr: Identifiant du serveur

source: Server name
fr: Nom du serveur

source: Soft limit
fr: Limite douce

source: Soft limit (Files)
fr: Limite douce (fichiers)

source: Soft limit. If exceeded users can be warned.
fr: Limite douce. En cas de dépassement, les utilisateurs peuvent être avertis.

source: Soft limit. If exceeded users can be warned. Values may be entered with one of the following units as postfix: B (default), kB, MB, GB
fr: Limite douce. En cas de dépassement, les utilisateurs peuvent être avertis. Les valeurs peuvent être saisies avec l'une des unités suivantes : B (valeur par défaut), kB, MB, GB

source: Specify the DDNS Update Style to use for a DHCP Service
fr: Définit le type de mise à jour DDNS à utiliser pour un service DHCP

source: The IP address identifying the DHCP server that should be used by the clients. Use this only if auto-detection fails for servers with multiple IP addresses.
fr: L'adresse IP identifiant le serveur DHCP devant être utilisé par les clients. N'utilisez cette option que si la détection automatique échoue pour les serveurs possédant plusieurs adresses IP.

source: The node type of clients for NetBIOS over TCP/IP
fr: Type de noeud des clients pour NetBIOS over TCP/IP

source: These configuration settings will be set on the local UCS system.
fr: Ces réglages de configuration seront appliqués au système UCS local.

source: This number indicates after how many changes the user may reuse the old password again
fr: Ce nombre indique après combien de changements l’ancien mot de passe peut être réutilisé

source: UCR Variables
fr: Variables UCR

source: UMC policies
fr: Stratégies UMC

source: UMC policy
fr: Stratégie UMC

source: Univention Configuration Registry policies
fr: Stratégies de Univention Configuration Registry

source: Univention Configuration Registry policy
fr: Stratégie de Univention Configuration Registry

source: Univention Directory Manager container settings
fr: Réglages du conteneur d’Univention Directory Manager

source: Univention Directory Manager container settings policies
fr: Stratégies de réglages de conteneur d’Univention Directory Manager

source: Univention Directory Manager container settings policy
fr: Stratégie de réglages de conteneur d’Univention Directory Manager

source: Univention Directory Manager settings
fr: Réglages d’Univention Directory Manager

source: Unknown clients
fr: Clients inconnus

source: Update
fr: Mise à jour

source: Update static leases
fr: Mise à jour des baux statiques

source: Update to this UCS version
fr: Mettre à jour vers cette version d'UCS

source: Use Cron settings
fr: Utiliser les réglages cron

source: User quota
fr: Quota utilisateur

source: User quota policies
fr: Stratégies de quota d’utilisation

source: User quota policy
fr: Stratégie de quota d’utilisation

source: Without specifying the most recent version will be used
fr: Si rien n'est indiqué, la version la plus récente sera utilisée
