Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/*.po
Languages: fr

source: DNS alias is already in use.
fr: Cet alias DNS est déjà utilisé.

source: Destination object can't have sub objects.
fr: L'objet de destination ne peut pas comporter de sous-objets.

source: Moving into one's own sub container not allowed.
fr: Il n'est pas possible de se déplacer vers son propre sous-conteneur.

source: Moving not possible: old and new DN are identical.
fr: Déplacement impossible : l'ancien et le nouveau nom distingué (ND) sont identiques.

source: Neither DN nor position given.
fr: Ni nom de domaine, ni emplacement fourni.

source: No superordinate object given
fr: Aucun objet de rang supérieur fourni

source: Objects from Active Directory can not be moved.
fr: Les objets d'Active Directory ne peuvent pas être déplacés.

source: Objects from Active Directory can not be removed.
fr: Les objets d'Active Directory ne peuvent pas être supprimés.

source: Objects of the "%s" object type can not be created.
fr: Les objets du type d’objet « %s » ne peuvent pas être créés.

source: Objects of the "%s" object type can not be modified.
fr: Les objets du type d’objet « %s » ne peuvent pas être modifiés.

source: Objects of the "%s" object type can not be moved.
fr: Les objets du type d’objet « %s » ne peuvent pas être déplacés.

source: Objects of the "%s" object type can not be removed.
fr: Les objets du type d’objet « %s » ne peuvent pas être supprimés.

source: Reverse zone and IP address are incompatible.
fr: La zone inverse et l'adresse IP ne sont pas compatibles.

source: The DHCP entry for this host should contain the zone LDAP-DN, the IP address and the MAC address.
fr: L'entrée DHCP pour cet hôte doit contenir le nom distingué (ND) LDAP de la zone, l'adresse IP et l'adresse MAC.

source: The DN must be underneath of the superordinate.
fr: Le nom de domaine doit être en dessous de l'objet de rang supérieur.

source: The DNS alias entry for this host should contain the zone name, the alias zone container LDAP-DN and the alias.
fr: L'entrée DHCP pour cet hôte doit contenir le nom de la zone, le nom distingué (ND) LDAP du conteneur de zone d'alias et l'alias.

source: The following properties are missing: %s
fr: Les propriétés suivantes manquent : %s

source: The given %r superordinate is expected to be of type %s.
fr: L'objet de rang supérieur fourni %r est censé être de type %s.

source: The own object cannot be moved.
fr: Le propre objet ne peut pas être déplacé.

source: The own object cannot be removed.
fr: Le propre objet ne peut pas être supprimé.

source: The position must be in the subtree of the superordinate.
fr: La position doit être dans un sous-arbre de l'objet de rang supérieur.

source: The property %s is required
fr: La propriété %s est requise

source: The property %s must be a list
fr: La propriété %s doit être une liste

source: Unable to move object %(name)s (%(type)s) in subtree, trying to revert changes.
fr: Impossible de déplacer l'objet %(name)s (%(type)s) vers la sous-arborescence, tentative d'annulation des modifications.

source: key=%(key)s old=%(old)s new=%(new)s
fr: clé=%(key)s ancien=%(old)s nouveau=%(new)s
