Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-appcenter/python/*.po
Languages: fr

source: %s could not be downloaded. This seems to be a problem with the App Center server. Please try again later.
fr: Impossible de télécharger %s. Il semble que le problème soit lié au serveur d'App Center. Veuillez réessayer ultérieurement.

source: An error occurred!
fr: Une erreur s'est produite !

source: Error while contacting Docker registry server %s
fr: Erreur lors du contact du service d'enregistrement Docker %s

source: Manifest checksum mismatch
fr: Différences dans la somme de contrôle du manifeste

source: Setup script failed!
fr: Le script d'installation a échoué

source: The application needs a %(needs)s-bit operating system. This server is running a %(has)s-bit operating system.
fr: L'application a besoin d'un système d'exploitation %(needs)s bits. Le serveur est exécuté sur un système d'exploitation %(has)s bits.

source: The docker container could not be started!
fr: Le conteneur Docker n'a pas pu être lancé !

source: There is a problem with the certificate of the App Center server %s.
fr: Il y a un problème avec le certificat du serveur d'App Center %s.

source: There was a problem with the HTTP response of the server (BadStatusLine). Please try again later.
fr: Un problème est survenu au niveau de la réponse HTTP du serveur (BadStatusLine). Veuillez réessayer ultérieurement.

source: This is a problem with the App Center server. Please try again later.
fr: Ce problème provient du serveur d'App Center. Veuillez réessayer ultérieurement.

source: This is probably due to the DNS settings of your server. You may find help at %s.
fr: Ceci est probablement lié aux réglages DNS de votre serveur. Vous pouvez trouver de l'aide à l'adresse %s.

source: This may be a problem with the firewall or proxy of your system. You may find help at %s.
fr: Le problème provient peut-être du pare-feu ou du serveur mandataire de votre système. Vous pouvez trouver de l'aide à l'adresse %s.

source: We are sorry for the inconvenience. Please help us to improve the AppCenter and the Apps by sending us the information below.
fr: Nous sommes désolés de ce désagrément. Merci de nous aider à améliorer l'AppCenter et les Apps en nous transmettant les informations ci-dessous.
