Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/*/univention-system-activation/www/*.po
Languages: fr

source: %(appliance_name)s Appliance is now activated. Click "Finish" to access the management interface (which may take a while).
fr: L'appareil %(appliance_name)s est maintenant activé. Cliquez sur « Terminer » pour accéder à l'interface de gestion (cela peut prendre un certain temps).

source: A license file has been sent to <strong class="email-address">%s</strong>. This file is necessary to activate the system. For this, please carry out the following steps: <ol><li>Open the email.</li><li>Save the attachment (ucs.license) on your computer.</li><li>Click the button 'Upload license file'.</li><li>Select the file (ucs.license) you just saved.</li><li>Confirm the selection.</li></ol>Once the activation has been finished your email address will be sent to the app provider. The app provider may contact you.
fr: Un fichier de licence a été envoyé à <strong class="email-address">%s</strong>.Ce fichier est nécessaire pour activer le système. Pour cela, veuillez effectuer les actions suivantes : <ol><li>Ouvrez le courriel.</li><li>Enregistrez la pièce jointe (ucs.license) sur votre ordinateur.</li><li>Cliquez sur le bouton « Envoyer un fichier de licence ».</li><li>Choisissez le fichier que vous venez d'enregistrer (ucs.license).</li><li>Confirmez l'envoi.</li></ol>Une fois l'activation terminée, votre adresse électronique sera transmise au fournisseur d'apps. Le fournisseur d'apps pourra être amené à vous contacter.

source: Activation of %(appliance_name)s Appliance
fr: Activation de l'appareil %(appliance_name)s

source: Activation successful!
fr: Activation réussie !

source: An unknown error has occurred.
fr: Une erreur inconnue s'est produite.

source: E-mail address
fr: Adresse électronique

source: Error
fr: Erreur

source: If you already have a license file you can <a href="#upload">skip this step and upload the license</a>.
fr: Si vous disposez déjà d'un fichier de licence, vous pouvez <a href="#upload">sauter cette étape et transférer la licence</a>.

source: If you did not receive an email, please check your SPAM directory or <a href="#register"> request the email again</a>.
fr: Si vous n'avez pas reçu le courriel, veuillez vérifier votre dossier de pourriels ou <a href="#register">demander à renvoyer le courriel</a>.

source: More details about the activation can be found in the <a href="https://docs.software-univention.de/manual-%s.html#central:license" target="_blank">UCS manual</a>.
fr: Vous pouvez trouver davantage d'informations sur l'activation dans le <a href="https://docs.software-univention.de/manual-%s.html#central:license" target="_blank">Manuel UCS</a>.

source: No valid email address.
fr: Aucune adresse électronique valide.

source: Please enter a valid email address in order to activate %(appliance_name)s Appliance. The activation is mandatory to deploy the system. In the next step you can upload the license file that has been sent to your email address.
fr: Veuillez saisir une adresse électronique valide pour activer l'appareil %(appliance_name)s. L'activation est obligatoire pour déployer le système. À l'étape suivante, vous pourrez transférer le fichier de licence qui aura été envoyé à votre adresse électronique.

source: Request activation
fr: Demander l'activation

source: Switch language
fr: Changer de langue

source: The following error occurred:
fr: L'erreur suivante s'est produite :

source: The server is not responding. Please restart the system.
fr: Le serveur ne répond pas. Veuillez redémarrer le système.

source: Upload license file
fr: Envoyer le fichier de licence

source: your email address
fr: votre adresse électronique
