Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/appendix.po
Languages: de

source: Defines the system that provides the Kerberos admin server. See :ref:`domain-kerberos-admin-server`.
de: Definiert das System, das den Kerberos-Adminserver bereitstellt. Siehe :ref:`domain-kerberos-admin-server`.

source: Contains the reference to the KDC. Typically, a UCS system selects the KDC to be used from a DNS service record. With this variable administrators can configure an alternative KDC.
de: Enthält den Verweis auf den KDC. Normalerweise wählt ein UCS-System den zu verwendende KDC aus einem DNS-Diensteintrag aus. Mit dieser Variable können Administratoren einen alternativen KDC konfigurieren.

source: Contains the name of the Kerberos realm. See :ref:`domain-kerberos`.
de: Enthält den Namen des Kerberos-Realms. Siehe :ref:`domain-kerberos`.

source: Defines additional Linux kernel modules that need to be loaded during system boot. Single items must be separated with a semicolon (``;``). For more information, see :ref:`computers-hardware-drivers-kernel-modules`.
de: Definiert zusätzliche Linux-Kernelmodule, die während des Systemstarts geladen werden müssen. Einzelne Elemente müssen durch ein Semikolon (``;``) getrennt werden. Für weitere Informationen, siehe :ref:`computers-hardware-drivers-kernel-modules`.

source: Defines Linux kernel modules that must not be loaded during system boot. Single items must be separated with a semicolon (``;``). For more information, see :ref:`computers-hardware-drivers-kernel-modules`.
de: Definiert Linux-Kernel-Module, die beim Systemstart nicht geladen werden dürfen. Einzelne Einträge müssen mit einem Semikolon (``;``) getrennt werden. Für weitere Informationen, siehe :ref:`computers-hardware-drivers-kernel-modules`.

source: List of group distinguished names (DN) that have read access to all objects under the container ``cn=blocklists`` in the internal database. For more information, see :ref:`udm-blocklists-ldap-acl`.
de: Liste der DNs von Gruppen, die Lesezugriff auf alle Objekte unter dem Container ``cn=blocklists`` in der internen Datenbank haben. Für weitere Informationen, siehe :ref:`udm-blocklists-ldap-acl`.

source: List of group distinguished names (DN) that have write access to all objects under the container ``cn=blocklists`` in the internal database. For more information, see :ref:`udm-blocklists-ldap-acl`.
de: Liste der DNs von Gruppen, die Schreibzugriff auf alle Objekte unter dem Container ``cn=blocklists`` in der internen Datenbank haben. Für weitere Informationen, siehe :ref:`udm-blocklists-ldap-acl`.

source: Controls if the LDAP server allows anonymous access to the LDAP directory. In the default configuration the LDAP server doesn't allow anonymous access to the LDAP directory.
de: Steuert, ob der LDAP-Server anonymen Zugriff auf das LDAP-Verzeichnis zulässt. In der Standardkonfiguration lässt der LDAP-Server keinen anonymen Zugriff auf das LDAP-Verzeichnis zu.

source: A list of IP addresses for which the LDAP server allows anonymous access. See :ref:`domain-ldap-acls`.
de: Eine Liste von IP-Adressen, für die der LDAP-Server anonymen Zugriff erlaubt. Siehe :ref:`domain-ldap-acls`.

source: Controls if nested groups are allowed. Per default nested groups are activated. See :ref:`domain-ldap-acls`.
de: Steuert, ob verschachtelte Gruppen erlaubt sind. Standardmäßig sind verschachtelte Gruppen aktiviert. Siehe :ref:`domain-ldap-acls`.

source: Use a different group from the default ``User Password Admins`` group to reset user passwords. The value is a distinguished name (DN) to a user group. See :ref:`domain-ldap-delegation-of-the-priviledge-to-reset-user-passwords`.
de: Verwenden Sie eine andere Gruppe als die Standardgruppe ``User Password Admins``, um Benutzerpasswörter zurückzusetzen. Der Wert ist ein Distinguished Name (DN) für eine Benutzergruppe. Siehe :ref:`domain-ldap-delegation-of-the-priviledge-to-reset-user-passwords`.

source: If users that are allowed to change other users' passwords need access to additional LDAP attributes needed for the password change, configure them in this variable. For more information, see :ref:`domain-ldap-delegation-of-the-priviledge-to-reset-user-passwords`.
de: Wenn Benutzer, die die Passwörter anderer Benutzer ändern dürfen, Zugriff auf zusätzliche LDAP-Attribute benötigen, die für die Passwortänderung erforderlich sind, konfigurieren Sie diese in dieser Variablen. Weitere Informationen finden Sie unter :ref:`domain-ldap-delegation-of-the-priviledge-to-reset-user-passwords`.

source: Configures users with their user id to exclude them from user password resets by administrators allowed to change user passwords. Separate multiple values with a comma. For more information, see :ref:`domain-ldap-delegation-of-the-priviledge-to-reset-user-passwords`.
de: Konfiguriert Benutzer mit ihrer Benutzerkennung, um sie vom Zurücksetzen von Benutzerpasswörtern durch Administratoren, die Benutzerpasswörter ändern dürfen, auszuschließen. Trennen Sie mehrere Werte mit einem Komma. Weitere Informationen finden Sie unter :ref:`domain-ldap-delegation-of-the-priviledge-to-reset-user-passwords`.

source: Configures groups with their group id to exclude them from user password resets by administrators allowed to change user passwords. Separate multiple values with a comma. For more information, see :ref:`domain-ldap-delegation-of-the-priviledge-to-reset-user-passwords`.
de: Konfiguriert Gruppen mit ihrer Gruppenkennung, um sie vom Zurücksetzen von Benutzerpasswörtern durch Administratoren, die Benutzerpasswörter ändern dürfen, auszuschließen. Trennen Sie mehrere Werte mit einem Komma. Weitere Informationen finden Sie unter :ref:`domain-ldap-delegation-of-the-priviledge-to-reset-user-passwords`.

source: Configures a time period in seconds after which the LDAP connection is cut off on the server side. See :ref:`domain-ldap-timeout-for-inactive-ldap-connections`.
de: Konfiguriert eine Zeitspanne in Sekunden, nach der die LDAP-Verbindung auf der Serverseite unterbrochen wird. Siehe :ref:`domain-ldap-timeout-for-inactive-ldap-connections`.

source: Exclude individual areas of the directory service from logging. See :ref:`domain-ldap-directory-logger`.
de: Einzelne Bereiche des Verzeichnisdienstes von der Protokollierung ausschließen. Siehe :ref:`domain-ldap-directory-logger`.

source: See :envvar:`ldap/logging/exclude1`.
de: Siehe :envvar:`ldap/logging/exclude1`.

source: Adds the transaction ID of an entry to the directory log. Possible values are the default ``yes`` and ``no``. See :ref:`domain-ldap-directory-logger`.
de: Fügt die Transaktions-ID eines Eintrags in das Verzeichnisprotokoll ein. Mögliche Werte sind der Standardwert ``yes`` und ``no``. Siehe :ref:`domain-ldap-directory-logger`.

source: Contains the FQDN of the domain's |UCSPRIMARYDN| system.
de: Enthält den FQDN des |UCSPRIMARYDN| in der Domäne.

source: To activate the ``lastbind`` overlay module for the LDAP server, set the value to ``yes``. For more information, see :ref:`users-lastbind-overlay-module`.
de: Um das ``lastbind``-Overlay-Modul für den LDAP-Server zu aktivieren, setzen Sie den Wert auf ``yes``. Für weitere Informationen, siehe :ref:`users-lastbind-overlay-module`.

source: Configures the time in seconds that has to pass before the ``authTimestamp`` is updated again by the ``lastbind`` overlay. For more information, see :ref:`users-lastbind-overlay-module`.
de: Legt die Zeit in Sekunden fest, die vergehen muss, bevor der ``authTimestamp`` durch das ``lastbind``-Overlay wieder aktualisiert wird. Für weitere Informationen, siehe :ref:`users-lastbind-overlay-module`.

source: Time interval to write profile based UCR variables to a UCS system. The default value is one hour. For more information, see :ref:`ucr-templates-policy`.
de: Zeitintervall für das Schreiben profilbasierter UCR-Variablen in ein UCS-System. Der Standardwert ist eine Stunde. Für weitere Informationen, siehe :ref:`ucr-templates-policy`.

source: To enable automatic account locking, set the value to ``yes``. For more information, see :ref:`users-faillog-openldap`.
de: Um die automatische Kontosperrung zu aktivieren, setzen Sie den Wert auf ``yes``. Für weitere Informationen, siehe :ref:`users-faillog-openldap`.

source: Activates :program:`bcrypt` as password hashing method when set to ``true``. See :ref:`domain-password-hashes`.
de: Aktiviert :program:`bcrypt` als Passworthash-Methode, wenn auf ``true`` gesetzt. Siehe :ref:`domain-password-hashes`.

source: Additional LDAP server a UCS system can query for information in the directory service.
de: Zusätzlicher LDAP-Server, den ein UCS-System nach Informationen im Verzeichnisdienst abfragen kann.

source: The LDAP server the system queries for information in the directory service.
de: Der LDAP-Server, den das System nach Informationen im Verzeichnisdienst abfragt.

source: Defines the detail level for log messages of the listener to :file:`/var/log/univention/listener.log`. The possible values are from 0 (only error messages) to 4 (all status messages). Once the debug level has been changed, the |UCSUDL| must be restarted.
de: Legt die Detailebene für Protokollmeldungen des Listeners in :file:`/var/log/univention/listener.log` fest. Die möglichen Werte reichen von 0 (nur Fehlermeldungen) bis 4 (alle Statusmeldungen). Nach einer Änderung des Debug-Levels muss der |UCSUDL| neu gestartet werden.

source: Contents of existing share directories are moved, when the path to a share is modified and the value is set to ``yes``. For more information, see :numref:`shares-management-general-tab-table` in :ref:`shares-management-general-tab`.
de: Inhalte bestehender Freigabeverzeichnisse werden verschoben, wenn der Pfad zu einer Freigabe geändert wird und der Wert auf ``yes`` gesetzt wird. Für weitere Informationen, siehe :numref:`shares-management-general-tab-table` in :ref:`shares-management-general-tab`.

source: Activates and deactivates the local repository. For more information see :ref:`software-create-repo`.
de: Aktiviert und deaktiviert das lokale Repository. Für weitere Informationen, siehe :ref:`software-create-repo`.

source: Controls, if rotated log files are zipped with :command:`gzip`. For more information, see :ref:`computers-log-files`.
de: Steuert, ob rotierte Protokolldateien mit :command:`gzip` komprimiert werden. Für weitere Informationen, siehe :ref:`computers-log-files`.

source: Configures the log file rotation interval on a UCS system in weeks. The default value is ``12`` weeks. For more information, see :ref:`computers-log-files`.
de: Konfiguriert das Rotationsintervall der Protokolldateien auf einem UCS-System in Wochen. Der Standardwert ist ``12`` Wochen. Für weitere Informationen, siehe :ref:`computers-log-files`.

source: Configures the log file rotation according to the file size, for example ``size 50M``. For more information, see :ref:`computers-log-files`.
de: Konfiguriert die Rotation der Protokolldateien entsprechend der Dateigröße, zum Beispiel ``size 50M``. Für weitere Informationen, siehe :ref:`computers-log-files`.

source: Define the length for the computer password, also called *machin secret*. Default value is ``20``. For more information, see :ref:`computers-hostaccounts`.
de: Definieren Sie die Länge des Computer-Passworts, auch *machine secret* genannt. Der Standardwert ist ``20``. Für weitere Informationen, siehe :ref:`computers-hostaccounts`.

source: Configures the size of emails that are scanned for Spam by SpamAssassin. The default value is 300 kilobytes. For more information, see :ref:`mail-spam`.
de: Legt die Größe der E-Mails fest, die von SpamAssassin auf Spam untersucht werden. Der Standardwert ist 300 Kilobytes. Für weitere Informationen, siehe :ref:`mail-spam`.

source: Configures the evaluation of ham emails in the ham folder for daily evaluation. The evaluation is activate per default. For more information, see :ref:`mail-spam`.
de: Konfiguriert die Auswertung von Ham E-Mails im Ham-Ordner für die tägliche Auswertung. Die Auswertung ist standardmäßig aktiviert. Für weitere Informationen, siehe :ref:`mail-spam`.

source: Configures the threshold in points when an email is classified as spam. The default value is ``5``. For more information, see :ref:`mail-spam`.
de: Legt den Schwellenwert in Punkten fest, ab dem eine E-Mail als Spam eingestuft wird. Der Standardwert ist ``5``. Für weitere Informationen, siehe :ref:`mail-spam`.

source: To deactivate virus and malware detection for incoming and outgoing emails, set the value to ``no``. For more information, see :ref:`mail-virus`.
de: Um die Viren- und Schadsoftware-Erkennung für ein- und ausgehende E-Mails zu deaktivieren, setzen Sie den Wert auf ``no``. Für weitere Informationen, siehe :ref:`mail-virus`.

source: Configures, if spam filtering is running. To deactivate spam filtering, set the value to ``no``. For more information, see :ref:`mail-virus`.
de: Legt fest, ob der Spam-Filter aktiv ist. Um die Spam-Filterung zu deaktivieren, setzen Sie den Wert auf ``no``. Für weitere Informationen, siehe :ref:`mail-virus`.

source: Configures Postfix to send all incoming and outgoing emails as blind copy to this email address for archive purposes. The variable isn't set per default. For more information, see :ref:`mail-serverconfig-archive-folder`.
de: Konfiguriert Postfix so, dass alle ein- und ausgehenden E-Mails zu Archivierungszwecken als Blindkopie an diese E-Mail-Adresse gesendet werden. Die Variable ist standardmäßig nicht gesetzt. Für weitere Informationen, siehe :ref:`mail-serverconfig-archive-folder`.

source: Configures the expiration time of the authentication cache in Dovecot for the mail service. For more information, see :ref:`mail-management-users`.
de: Konfiguriert die Ablaufzeit des Authentifizierungscaches in Dovecot für den E-Mail-Dienst. Weitere Informationen finden Sie unter :ref:`mail-management-users`.

source: Configures the name of the folder for emails that SpamAssissin considers as *ham*. The default value is ``Ham``. For more information, see :ref:`mail-spam`.
de: Legt den Namen des Ordners für E-Mails fest, die SpamAssissin als *ham* betrachtet. Der Standardwert ist ``Ham``. Für weitere Informationen, siehe :ref:`mail-spam`.

source: Configures the name of the folder where SpamAssissin moves emails classified as spam. The default value is ``Spam``. For more information, see :ref:`mail-spam`.
de: Legt den Namen des Ordners fest, in den SpamAssissin als Spam eingestufte E-Mails verschiebt. Der Standardwert ist ``Spam``. Für weitere Informationen, siehe :ref:`mail-spam`.

source: Controls the IMAP protocol service in the Dovecot IMAP service. To deactivate access to emails through IMAP, set the value to ``no``. For more information, see :ref:`mail-general`.
de: Steuert den IMAP-Protokolldienst im Dovecot IMAP-Dienst. Um den Zugriff auf E-Mails über IMAP zu deaktivieren, setzen Sie den Wert auf ``no``. Für weitere Informationen, siehe :ref:`mail-general`.

source: Configures different connection limits for the Dovecot service. For more information, see :ref:`mail-serverconfig-limits`.
de: Konfiguriert verschiedene Verbindungsgrenzen für den Dovecot-Dienst. Für weitere Informationen, siehe :ref:`mail-serverconfig-limits`.

source: Configures the Dovecot service to use an index separated from the email message storage location. To activate the separate index, set the value to ``yes``. Dovecot writes the index to :file:`/var/lib/dovecot/index/`. For more information, see :ref:`mail-serverconfig-nfs`.
de: Konfiguriert den Dovecot-Dienst so, dass er einen vom Speicherort der E-Mail-Nachrichten getrennten Index verwendet. Um den separaten Index zu aktivieren, setzen Sie den Wert auf ``yes``. Dovecot schreibt den Index in :file:`/var/lib/dovecot/index/`. Für weitere Informationen, siehe :ref:`mail-serverconfig-nfs`.

source: Configures how the Dovecot services reacts on changes of the primary email address. The default value is ``yes`` and it changes the name of the user's IMAP mailbox. For more information about the values, see :ref:`mail-renamed-users`.
de: Legt fest, wie die Dovecot-Dienste auf Änderungen der primären E-Mail-Adresse reagieren. Der Standardwert ist ``yes`` und ändert den Namen des IMAP-Postfachs des Benutzers. Für weitere Informationen über die Werte, siehe :ref:`mail-renamed-users`.

source: Shared folders are not renamed. For more information, see :ref:`mail-management-shared-folder`.
de: Gemeinsame Ordner werden nicht umbenannt. Weitere Informationen finden Sie unter :ref:`mail-management-shared-folder`.

source: Configures the deletion of an IMAP mailbox. The default value is ``no`` and keeps the mailbox. For more information, see :ref:`mail-renamed-users`.
de: Konfiguriert die Löschung eines IMAP-Postfachs. Der Standardwert ist ``no`` und behält die Mailbox. Für weitere Informationen, siehe :ref:`mail-renamed-users`.

source: The value also affects shared IMAP folders. For more information, see :ref:`mail-management-shared-folder`.
de: Der Wert wirkt sich auch auf freigegebene IMAP-Ordner aus. Für weitere Informationen, siehe :ref:`mail-management-shared-folder`.

source: Controls the POP3 protocol service in the Dovecot IMAP service. To deactivate access to emails through POP3, set the value to ``no``. For more information, see :ref:`mail-general`.
de: Steuert den POP3-Protokolldienst im Dovecot IMAP-Dienst. Um den Zugriff auf E-Mails über POP3 zu deaktivieren, setzen Sie den Wert auf ``no``. Für weitere Informationen, siehe :ref:`mail-general`.

source: Controls the lock method for *lockd*. For more information, see :ref:`mail-serverconfig-nfs`.
de: Steuert die Sperrmethode für *lockd*. Für weitere Informationen, siehe :ref:`mail-serverconfig-nfs`.

source: Configures the Dovecot service to flush NFS caches after writing index files when set to ``yes``. For more information, see :ref:`mail-serverconfig-nfs`.
de: Konfiguriert den Dovecot-Dienst so, dass er nach dem Schreiben von Indexdateien die NFS-Zwischenspeicher leert, wenn er auf ``yes`` gesetzt ist. Für weitere Informationen, siehe :ref:`mail-serverconfig-nfs`.

source: Configures the Dovecot service to flush NFS caches when set to ``yes``. For more information, see :ref:`mail-serverconfig-nfs`.
de: Konfiguriert den Dovecot-Dienst so, dass er die NFS-Caches leert, wenn er auf ``yes`` gesetzt ist. Für weitere Informationen, siehe :ref:`mail-serverconfig-nfs`.

source: Allows mail storage on NFS. For more information, see :ref:`mail-serverconfig-nfs`.
de: Erlaubt die Speicherung von E-Mails auf NFS. Für weitere Informationen, siehe :ref:`mail-serverconfig-nfs`.

source: Configures the subject for the email to the user that exceeds the configured quota limit. For more information, see :ref:`mail-quota`.
de: Legt den Betreff für die E-Mail an den Benutzer fest, der die konfigurierte Quotengrenze überschreitet. Für weitere Informationen, siehe :ref:`mail-quota`.

source: Configures the email text body for the email to the user that exceeds the configured quota limit. Percentage values can have different texts. For example, to configure a text for 50% of the quota, set :samp:`mail/dovecot/quota/warning/text/50={your text}`.
de: Konfiguriert den E-Mail-Textkörper für die E-Mail an den Benutzer, der die konfigurierte Quotengrenze überschreitet. Prozentuale Werte können unterschiedliche Texte haben. Um z.B. einen Text für 50 % des Kontingents zu konfigurieren, setzen Sie :samp:`mail/dovecot/quota/warning/text/50={Ihr Text}`.

source: For more information, see :ref:`mail-quota`.
de: Für weitere Informationen, siehe :ref:`mail-quota`.

source: Configures the mail domains managed by UCS. For more information, see :ref:`mail-management-domains`.
de: Konfiguriert die von UCS verwalteten Mail-Domänen. Für weitere Informationen, siehe :ref:`mail-management-domains`.

source: Configures the maximum size of an email in bytes for incoming and outgoing emails. The default setting is ``10240000`` bytes. For more information, see :ref:`mail-serverconfig-mailsize`.
de: Legt die maximale Größe einer E-Mail in Bytes für eingehende und ausgehende E-Mails fest. Die Standardeinstellung ist ``10240000`` Bytes. Für weitere Informationen, siehe :ref:`mail-serverconfig-mailsize`.

source: To enable authentication for the submission of emails on port 25, set the value to ``yes``. For more information, see :ref:`mail-serverconfig-smtp-ports`.
de: Um die Authentifizierung für die Übermittlung von E-Mails an Port 25 zu aktivieren, setzen Sie den Wert auf ``yes``. Für weitere Informationen, siehe :ref:`mail-serverconfig-smtp-ports`.

source: To restrict the circle of persons who can send emails to mailing lists, set the value to ``yes`` and restart the Postfix service. For more information, see :ref:`mail-management-mailinglists` and :ref:`mail-management-mailgroups`.
de: Um den Personenkreis einzuschränken, der E-Mails an Mailinglisten senden darf, setzen Sie den Wert auf ``yes`` und starten Sie den Postfix-Dienst neu. Für weitere Informationen, siehe :ref:`mail-management-mailinglists` und :ref:`mail-management-mailgroups`.

source: A prefix of variables to configure :program:`postscreen`. For more information, see :ref:`mail-serverconfig-postscreen`.
de: Ein Präfix von Variablen zur Konfiguration von :program:`postscreen`. Für weitere Informationen, siehe :ref:`mail-serverconfig-postscreen`.

source: To activate postscreen for eligibility checks on incoming emails, set the value to ``yes``. For more information, see :ref:`mail-serverconfig-postscreen`.
de: Um den Postscreen für die Überprüfung der Berechtigung eingehender E-Mails zu aktivieren, setzen Sie den Wert auf ``yes``. Für weitere Informationen, siehe :ref:`mail-serverconfig-postscreen`.

source: Configures DNS-based Blackhole List (DNSBL) for Postfix in the format :samp:`mail/postfix/smtpd/restrictions/recipient/{SEQUENCE}={RULE}`.
de: Konfiguriert die DNS-basierte Blackhole-Liste (DNSBL) für Postfix im Format :samp:`mail/postfix/smtpd/restrictions/recipient/{SEQUENCE}={REGEL}`.

source: For example:
de: Zum Beispiel:

source: For more information, see :ref:`mail-dnsbl`.
de: Für weitere Informationen, siehe :ref:`mail-dnsbl`.

source: To never return emails after a mail bounce, set the value to ``yes``. For more information, see :ref:`mail-serverconfig-softbounce`.
de: Um E-Mails nach einem Mail-Bounce nicht zurückzusenden, setzen Sie den Wert auf ``yes``. Für weitere Informationen, siehe :ref:`mail-serverconfig-softbounce`.

source: For more information, see :ref:`mail-serverconfig-relay`.
de: Für weitere Informationen, siehe :ref:`mail-serverconfig-relay`.

source: If authentication for the mail relay is needed, set the value to ``yes`` and add the credentials to :file:`/etc/postfix/smtp_auth`. For more information, see :ref:`mail-serverconfig-relay`.
de: Wenn eine Authentifizierung für das Mail-Relay erforderlich ist, setzen Sie den Wert auf ``yes`` und fügen Sie die Anmeldedaten in :file:`/etc/postfix/smtp_auth` ein. Für weitere Informationen, siehe :ref:`mail-serverconfig-relay`.

source: Configures the fully qualified domain name (FQDN) of a mail relay server. For more information, see :ref:`mail-serverconfig-relay`.
de: Konfiguriert den voll qualifizierten Domänennamen (FQDN) eines Mail-Relay-Servers. Für weitere Informationen, siehe :ref:`mail-serverconfig-relay`.

source: Defines the first *Domain DNS Server*. For more information, see :ref:`computers-configuring-the-name-servers`.
de: Definiert den ersten *Domain DNS Server*. Weitere Informationen finden Sie unter :ref:`computers-configuring-the-name-servers`.

source: Defines the second *Domain DNS Server*. For more information, see :ref:`computers-configuring-the-name-servers`.
de: Definiert den zweiten *Domain DNS Server*. Weitere Informationen finden Sie unter :ref:`computers-configuring-the-name-servers`.
