Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/appendix.po
Languages: de

source: Bibliography
de: Literaturverzeichnis

source: Chapter contents:
de: Kapitelinhalte:

source: Appendix
de: Anhang

source: Indices
de: Stichwortverzeichnis

source: The :ref:`genindex` provides direct links to curated content topics. It contains the terms from the word list in bold face.
de: Das :ref:`genindex` bietet direkt Links zu den Inhaltsthemen. Sie enthält die Begriffe aus der Wortliste in Fettschrift.

source: This appendix lists the |UCSUCRVs| mentioned in the document.
de: Dieser Anhang listet |UCSUCRVs| auf, die im Handbuch erwähnt werden.

source: Configures the automatic locking of users after failed login attempts in the PAM stack. To activate, set the value to ``yes``. For more information, see :ref:`users-faillog-pam`.
de: Konfiguriert das automatische Sperren von Benutzern nach fehlgeschlagenen Anmeldungen im PAM Stack. Zum Aktivieren, setze den Wert auf ``yes``. Für mehr Informationen, siehe :ref:`users-faillog-pam`.

source: Configures the upper limit of failed login attempts for a user account lockout. For more information, see :ref:`users-faillog-pam`.
de: Konfiguriert die Obergrenze an fehlerhaften Anmeldeversuchen für eine Benutzerkontosperre. Für mehr Informationen, siehe :ref:`users-faillog-pam`.

source: Configure on |UCSPRIMARYDN| and |UCSBACKUPDN| to create a failed login account lockout globally and store it in the LDAP directory. For more information, see :ref:`users-faillog-pam`.
de: Konfiguriert auf |UCSPRIMARYDN| und |UCSBACKUPDN| eine globale Sperre nach fehlerhaften Anmeldeversuchen im LDAP-Verzeichnis. Für mehr Informationen, siehe :ref:`users-faillog-pam`.

source: To make the user account ``root`` subject of the PAM stack account lockout, set the value to ``yes``. It defaults to ``no``. For more information, see :ref:`users-faillog-pam`.
de: Um das Benutzerkonto ``root`` der Sperrung des PAM-Stack-Kontos zu unterwerfen, setzen Sie den Wert auf ``yes``. Die Voreinstellung ist ``no``. Für weitere Informationen, siehe :ref:`users-faillog-pam`.

source: Configure a time interval to unlock an account lockout. The value is defined in seconds. The value ``0`` resets the lock immediately. For more information, see :ref:`users-faillog-pam`.
de: Legen Sie ein Zeitintervall fest, in dem eine Kontosperre aufgehoben wird. Der Wert wird in Sekunden angegeben. Der Wert ``0`` setzt die Sperre sofort zurück. Für weitere Informationen, siehe :ref:`users-faillog-pam`.

source: To prohibit SSH login for the user ``root`` completely, set the value ``no``. For more information, see :ref:`computers-ssh-login-to-systems`.
de: Um die SSH-Anmeldung für den Benutzer ``root`` komplett zu verbieten, setzen Sie den Wert auf ``no``. Für weitere Informationen, siehe :ref:`computers-ssh-login-to-systems`.

source: Defines how long a UCS system keeps old backup files of the LDAP data. Allowed values are integer numbers and they define days. The system doesn't delete backup files when the variable is not set. See :ref:`domain-ldap-nightly-backup`.
de: Legt fest, wie lange ein UCS-System alte Sicherungsdateien der LDAP-Daten aufbewahrt. Erlaubte Werte sind ganzzahlige Zahlen und definieren Tage. Das System löscht keine Sicherungsdateien, wenn die Variable nicht gesetzt ist. Siehe :ref:`domain-ldap-nightly-backup`.

source: Configures the LDAP DN of a privileged replication user. For more information, see :ref:`ad-connector-ad-member-setup` and :ref:`ad-connector-ad-password`.
de: Konfiguriert den LDAP-DN eines privilegierten Replikationsbenutzers. Für weitere Informationen, siehe :ref:`ad-connector-ad-member-setup` und :ref:`ad-connector-ad-password`.

source: Configures the password of a privileged replication user. For more information, see :ref:`ad-connector-ad-member-setup` and :ref:`ad-connector-ad-password`.
de: Legt das Passwort eines privilegierten Replikationsbenutzers fest. Für weitere Informationen, siehe :ref:`ad-connector-ad-member-setup` und :ref:`ad-connector-ad-password`.

source: To deactivate encrypted communication between the UCS system and Active Directory set the value to ``no``. For more information, see :ref:`ad-connector-ad-certificate`.
de: Um die verschlüsselte Kommunikation zwischen dem UCS System und Active Directory zu deaktivieren, setzen Sie den Wert auf ``no``. Für weitere Informationen, siehe :ref:`ad-connector-ad-certificate`.

source: Configures the mapping for group name conversion in anglophone AD domains. For more information, see :ref:`ad-connector-groups`.
de: Konfiguriert die Zuordnung für die Umwandlung von Gruppennamen in anglophonen AD Domänen. Für weitere Informationen, siehe :ref:`ad-connector-groups`.

source: Configures the interval to poll for changes in the AD domain. The default is ``5`` seconds. For more information, see :ref:`ad-connector-ad-connector-setup`.
de: Konfiguriert das Intervall für die Abfrage nach Änderungen in der AD-Domäne. Die Voreinstellung ist ``5`` Sekunden. Für weitere Informationen, siehe :ref:`ad-connector-ad-connector-setup`.

source: Configures the number of cycles that the UCS AD Connector attempts to synchronize an object from the AD domain when it can't be synchronized. The default value is ``10`` cycles. For more information, see :ref:`ad-connector-ad-connector-setup`.
de: Konfiguriert die Anzahl der Zyklen, die der UCS AD Connector versucht, ein Objekt aus der AD-Domäne zu synchronisieren, wenn es nicht synchronisiert werden kann. Der Standardwert ist ``10`` Zyklen. Für weitere Informationen, siehe :ref:`ad-connector-ad-connector-setup`.

source: Configures the target directory for the *Generic CUPS-PDF Printer* for anonymous print jobs. It defaults to the value :file:`/var/spool/cups-pdf/`. For more information, see :ref:`pdf-printer`.
de: Legt das Zielverzeichnis für den *Generic CUPS-PDF Printer* für anonyme Druckaufträge fest. Standardmäßig ist dies der Wert :file:`/var/spool/cups- pdf/`. Für weitere Informationen, siehe :ref:`pdf-printer`.

source: To cleanup outdated print jobs of the *Generic CUPS-PDF Printer*, set the value to ``true``. For the storage time, see :envvar:`cups/cups-pdf/cleanup/keep`. For more information, see :ref:`pdf-printer`.
de: Um veraltete Druckaufträge des *Generic CUPS-PDF Printer* zu bereinigen, setzen Sie den Wert auf ``true``. Für die Speicherzeit, siehe :envvar:`cups/cups-pdf/cleanup/keep`. Für weitere Informationen, siehe :ref:`pdf-printer`.

source: Configures the storage time in days for PDF files from the *Generic CUPS-PDF Printer*. For more information, see :ref:`pdf-printer`.
de: Legt die Speicherzeit in Tagen für PDF-Dateien aus dem *Generic CUPS-PDF Printer* fest. Für weitere Informationen, siehe :ref:`pdf-printer`.

source: Configures the target directory for the *Generic CUPS-PDF Printer*. It defaults to the value :file:`/var/spool/cups-pdf/%U` and uses a different directory for each user. For more information, see :ref:`pdf-printer`.
de: Legt das Zielverzeichnis für den *Generic CUPS-PDF Printer* fest. Standardmäßig ist dies der Wert :file:`/var/spool/cups-pdf/%U` und verwendet für jeden Benutzer ein anderes Verzeichnis. Für weitere Informationen, siehe :ref:`pdf-printer`.

source: To automatically retry unsuccessful print jobs every 30 seconds, set the value to ``retry-job``. For more information, see :ref:`print-services-configuration`.
de: Um fehlgeschlagene Druckaufträge automatisch alle 30 Sekunden zu wiederholen, setzen Sie den Wert auf ``retry-job``. Für weitere Informationen, siehe :ref:`print-services-configuration`.

source: To include configuration from :file:`/etc/cups/cupsd.local.conf`, set the value to ``true``. For more information, see :ref:`print-services-configuration`.
de: Um die Konfiguration aus :file:`/etc/cups/cupsd.local.conf` einzubeziehen, setzen Sie den Wert auf ``true``. Für weitere Informationen, siehe :ref:`print-services-configuration`.

source: Defines the print server to be used by a UCS system. For more information, see :ref:`computers-configure-print-server`.
de: Definiert den Druckserver, der von einem UCS-System verwendet werden soll. Für weitere Informationen, siehe :ref:`computers-configure-print-server`.

source: This variable determines how often UDM searches and removes the expired block list entries. The value follows the :ref:`cron syntax <cron-syntax>` for the time definition. The default value is daily at 8:00 in the morning. For more information, see :ref:`udm-blocklists-expired-entries`.
de: Diese Variable bestimmt, wie oft UDM nach abgelaufenen Blocklisteneinträge sucht und diese entfernt. Der Wert folgt der :ref:`cron Syntax <cron-syntax>` für die Zeitdefinition. Der Standardwert ist auf täglich um 8:00 Uhr morgens gesetzt. Weitere Informationen finden Sie unter :ref:`udm-blocklists-expired-entries`.

source: Activates the management of block list entries in UDM. Default value is ``false``. For information about how to activate, see :ref:`udm-blocklists-activate`.
de: Aktiviert die Verwaltung von Blocklisteneinträgen in UDM. Der Standardwert ist ``false``. Für Informationen über die Aktivierung, siehe :ref:`udm-blocklists-activate`.

source: Define an allowlist of characters that are not removed by the ``:alphanum`` option for the value definition in user templates. For more information, see :ref:`users-templates`.
de: Definieren Sie eine Erlaubnisliste von Zeichen, die nicht durch die Option ``:alphanum`` für die Wertedefinition in Benutzervorlagen entfernt werden. Für weitere Informationen, siehe :ref:`users-templates`.

source: Controls if UCS prevents users with the same username as existing groups. To deactivate the check for uniqueness, set the value to ``false``. For more information see :numref:`users-management-table-general-tab`.
de: Steuert, ob UCS Benutzer mit demselben Benutzernamen wie bestehende Gruppen verhindert. Um die Prüfung auf Eindeutigkeit zu deaktivieren, setzen Sie den Wert auf ``false``. Für weitere Informationen, siehe :numref:`users-management-table-general-tab`.

source: To disable the simplified wizard for computer management, set this variable to ``true``. For more information, see :ref:`computers-hostaccounts`.
de: Um den vereinfachten Assistenten für die Computerverwaltung zu deaktivieren, setzen Sie diese Variable auf ``true``. Für weitere Informationen, siehe :ref:`computers-hostaccounts`.

source: Controls the check for circular dependencies regarding nested groups. To disable, set the value to ``no``. For more information, see :ref:`groups-nested`.
de: Steuert die Prüfung auf zirkuläre Abhängigkeiten bei verschachtelten Gruppen. Um sie zu deaktivieren, setzen Sie den Wert auf ``no``. Für weitere Informationen, siehe :ref:`groups-nested`.

source: Deactivates the simplified wizard to create users when the value is set to ``true``. In the default setting the wizard is activated. For more information see :ref:`users-management`.
de: Deaktiviert den vereinfachten Assistenten zum Anlegen von Benutzern, wenn der Wert auf ``true`` gesetzt ist. In der Standardeinstellung ist der Assistent aktiviert. Für weitere Informationen, siehe :ref:`users-management`.

source: Defines the path and name to an image file for usage as logo in a Univention Directory report PDF file. For more information see :ref:`central-management-umc-adjustment-expansion-of-directory-reports`.
de: Definiert den Pfad und den Namen einer Bilddatei zur Verwendung als Logo in einer Univention Directory Report PDF-Datei. Für weitere Informationen, siehe :ref:`central-management-umc-adjustment-expansion-of-directory-reports`.

source: To deactivate the DNS zone transfer when using the OpenLDAP backend, set the value to ``none``. For more information, see :ref:`ip-config-configuration-of-zone-transfers`.
de: Um den DNS-Zonentransfer bei Verwendung des OpenLDAP-Backends zu deaktivieren, setzen Sie den Wert auf ``none``. Für weitere Informationen, siehe :ref:`ip-config-configuration-of-zone-transfers`.

source: Configures the DNS backend. For more information, see :ref:`ip-config-dns-backend`.
de: Konfiguriert das DNS-Backend. Für weitere Informationen, siehe :ref:`ip-config-dns-backend`.

source: Configures the debug level for BIND. For more information, see :ref:`ip-config-bind-debug`.
de: Konfiguriert den Debug-Level für BIND. Für weitere Informationen, siehe :ref:`ip-config-bind-debug`.

source: Configures the debug level for the Samba DNS backend. For more information, see :ref:`ip-config-bind-debug`.
de: Konfiguriert den Debug-Level für das Samba DNS Backend. Für weitere Informationen, siehe :ref:`ip-config-bind-debug`.

source: Defines the first *external DNS server*. For more information, see :ref:`computers-configuring-the-name-servers`.
de: Definiert den ersten *externen DNS-Server*. Weitere Informationen finden Sie unter :ref:`computers-configuring-the-name-servers`.

source: Defines the second *external DNS server*. For more information, see :ref:`computers-configuring-the-name-servers`.
de: Definiert den zweiten *externen DNS-Server*. Weitere Informationen finden Sie unter :ref:`computers-configuring-the-name-servers`.

source: Defines the third *external DNS server*. For more information, see :ref:`computers-configuring-the-name-servers`.
de: Definiert den dritten *externen DNS-Server*. Weitere Informationen finden Sie unter :ref:`computers-configuring-the-name-servers`.

source: Controls the automatic start of Fetchmail. To disable Fetchmail, set the value to ``false``. For more information, see :ref:`mail-fetchmail`.
de: Steuert den automatischen Start von Fetchmail. Um Fetchmail zu deaktivieren, setzen Sie den Wert auf ``false``. Für weitere Informationen, siehe :ref:`mail-fetchmail`.

source: Configures the debug level or verbosity for logging messages of FreeRADIUS. For more information, see :ref:`ip-config-radius-debugging`.
de: Konfiguriert den Debug-Level oder die Ausführlichkeit für die Protokollierung von FreeRADIUS-Meldungen. Für weitere Informationen, siehe :ref:`ip-config-radius-debugging`.

source: Configures if Radius allows the MAC address as username and password for 802.1X authentication. Default value is ``false``. For more information, see :ref:`ip-config-radius-configuration-mab`.
de: Konfiguriert, ob Radius die MAC-Adresse als Benutzernamen und Passwort für die 802.1X-Authentifizierung zulässt. Der Standardwert ist ``false``. Für weitere Informationen, siehe :ref:`ip-config-radius-configuration-mab`.

source: Configures the regular expression for the MAC address for the Radius server. The regular expression must contain six groups, each group representing a byte of the MAC address.
de: Konfiguriert den regulären Ausdruck für die MAC-Adresse für den Radius Server. Der reguläre Ausdruck muss sechs Gruppen enthalten, wobei jede Gruppe ein Byte der MAC-Adresse darstellt.

source: The default value is the regular expression: ``([0-9a-f]{2})[^0-9a-f]?([0-9a-f]{2})[^0-9a-f]?([0-9a-f]{2})[^0-9a-f]?([0-9a-f]{2})[^0-9a-f]?([0-9a-f]{2})[^0-9a-f]?([0-9a-f]{2})``
de: Der Standardwert ist der reguläre Ausdruck: ``([0-9a-f]{2})[^0-9a-f]?([0-9a-f]{2})[^0-9a-f]?([0-9a-f]{2})[^0-9a-f]?([0-9a-f]{2})[^0-9a-f]?([0-9a-f]{2})[^0-9a-f]?([0-9a-f]{2})``

source: With :uv:erratum:`5.0x1011` the Radius server can handle different formats of the MAC addresses for the username when using MAB.
de: Mit :uv:erratum:`5.0x1011` kann der Radius-Server mit verschiedenen Formaten der MAC-Adressen für den Benutzernamen bei Verwendung von MAB umgehen.

source: For more information and effects, see :ref:`ip-config-radius-configuration-mab`.
de: Für weitere Informationen und Effekte, siehe :ref:`mail-serverconfig-relay`.

source: Configures the maximum TLS version the server will attempt to use. Some operating systems might not support the latest version, see :ref:`ip-config-radius-disable-tls-1-3`.
de: Konfiguriert die maximale TLS Version, die der Server zu verwenden versucht. Einige Betriebssysteme unterstützen möglicherweise nicht die neueste Version, siehe :ref:`ip-config-radius-disable-tls-1-3`.

source: Configures the fallback value for VLAN ID for users that aren't member of a group with a VLAN ID. For more information, see :ref:`ip-config-radius-configuration-vlanid-configuration`.
de: Konfiguriert den Ersatzwert für die VLAN-ID für Benutzer, die nicht Mitglied einer Gruppe mit einer VLAN-ID sind. Für weitere Informationen, siehe :ref:`ip-config-radius-configuration-vlanid-configuration`.

source: Configures the IPv4 network gateway. For more information, see :ref:`computers-ipv4`.
de: Konfiguriert das IPv4-Netzwerk-Gateway. Für weitere Informationen, siehe :ref:`computers-ipv4`.

source: Configures the LDAP attributes of a user account that Google Apps for Work Connector synchronizes, but fills with random data. The value is a comma-separated list of LDAP attributes. For more information, see :ref:`idmcloud-gsuite-config`.
de: Konfiguriert die LDAP-Attribute eines Benutzerkontos, das Google Apps for Work Connector synchronisiert, aber mit zufälligen Daten füllt. Der Wert ist eine kommagetrennte Liste von LDAP-Attributen. Für weitere Informationen, siehe :ref:`idmcloud-gsuite-config`.

source: Defines a mapping of UCS LDAP attributes of a user account for synchronization to Google Apps attributes. The default settings usually suffice most environment needs. For more information, see :ref:`idmcloud-gsuite-config`.
de: Definiert eine Zuordnung von UCS LDAP-Attributen eines Benutzerkontos für die Synchronisation zu Google Apps Attributen. Die Standardeinstellungen reichen in der Regel für die meisten Umgebungsanforderungen aus. Für weitere Informationen, siehe :ref:`idmcloud-gsuite-config`.

source: Configures the LDAP attributes of a user account that the Google Apps for Work Connector never synchronizes, even if mentioned in :envvar:`google-apps/attributes/mapping/.*` or :envvar:`google-apps/attributes/anonymize`. The value is a comma-separated list of LDAP attributes. For more information, see :ref:`idmcloud-gsuite-config`.
de: Konfiguriert die LDAP-Attribute eines Benutzerkontos, das der Google Apps for Work Connector nie synchronisiert, auch wenn sie in :envvar:`google-apps/attributes/mapping/.*` oder :envvar:`google-apps/attributes/anonymize` erwähnt werden. Der Wert ist eine kommagetrennte Liste von LDAP-Attributen. Weitere Informationen finden Sie unter :ref:`idmcloud-gsuite-config`.

source: Configure additional debug error messages for the Google Apps for Work. For more information, see :ref:`idmcloud-gsuite-debug`.
de: Konfigurieren Sie zusätzliche Debugausgaben für Google Apps for Work. Für weitere Informationen, siehe :ref:`idmcloud-gsuite-debug`.

source: Enables the synchronization of groups of the Google Apps for Work user groups with the value ``yes``. For more information, see :ref:`idmcloud-gsuite-config`.
de: Ermöglicht die Synchronisation von Gruppen der Google Apps for Work Benutzergruppen mit dem Wert ``yes``. Für weitere Informationen, siehe :ref:`idmcloud-gsuite-config`.

source: Configures the default group name for the domain administrator group. The value might be changed during an AD Takeover. For more information, see :ref:`windows-ad-takeover-migrate`.
de: Konfiguriert den Standardgruppennamen für die Domänenadministratorgruppe. Der Wert kann während einer AD-Übernahme geändert werden. Für weitere Informationen, siehe :ref:`windows-ad-takeover-migrate`.

source: Defines Linux kernel boot options that the GRUB boot loader passes to the Linux kernel for system boot. For more information, see :ref:`grub`.
de: Definiert Linux-Kernel-Boot-Optionen, die der GRUB-Bootloader an den Linux-Kernel zum Systemstart weitergibt. Für weitere Informationen, siehe :ref:`grub`.

source: To deactivate the splash screen during system boot, set the value to ``nosplash``. For more information, see :ref:`grub`.
de: Um den Splash-Screen beim Systemstart zu deaktivieren, setzen Sie den Wert auf ``nosplash``. Für weitere Informationen, siehe :ref:`grub`.

source: Defines screen size and color depth for the GRUB boot menu. For more information, see :ref:`grub`.
de: Legt die Bildschirmgröße und Farbtiefe für das GRUB-Bootmenü fest. Für weitere Informationen, siehe :ref:`grub`.

source: Defines the waiting period in seconds in the GRUB boot menu. During this waiting time alternative boot menu entries can be selected. The default value is ``5`` seconds. For more information, see :ref:`grub`.
de: Legt die Wartezeit in Sekunden im GRUB-Bootmenü fest. Während dieser Wartezeit können alternative Bootmenüeinträge ausgewählt werden. Der Standardwert ist ``5`` Sekunden. Für weitere Informationen, siehe :ref:`grub`.

source: Defines options that are passed to the Xen hypervisor. For more information, see :ref:`grub`.
de: Legt Optionen fest, die an den Xen-Hypervisor übergeben werden. Weitere Informationen finden Sie unter :ref:`grub`.

source: Defines the network IPv4 address for the interface :samp:`eth{X}`. Replace :samp:`{X}` with the actual value for the interface. For more information, see :ref:`computers-ipv4`.
de: Legt die Netzwerk-IPv4-Adresse für die Schnittstelle :samp:`eth{X}` fest. Ersetzen Sie :samp:`{X}` durch den tatsächlichen Wert für die Schnittstelle. Für weitere Informationen, siehe :ref:`computers-ipv4`.

source: Defines the network mask for the interface :samp:`eth{X}`. Replace :samp:`{X}` with the actual value for the interface. For more information, see :ref:`computers-ipv4`.
de: Definiert die Netzwerkmaske für die Schnittstelle :samp:`eth{X}`. Ersetzen Sie :samp:`{X}` durch den tatsächlichen Wert für die Schnittstelle. Für weitere Informationen, siehe :ref:`computers-ipv4`.

source: Defines the network interface type for the interface :samp:`eth{X}`. Replace :samp:`{X}` with the actual value for the interface. For more information, see :ref:`computers-ipv4`.
de: Legt den Netzwerkschnittstellentyp für die Schnittstelle :samp:`eth{X}` fest. Ersetzen Sie :samp:`{X}` durch den tatsächlichen Wert für die Schnittstelle. Für weitere Informationen, siehe :ref:`computers-ipv4`.

source: Defines an additional virtual interface. Replace :samp:`{X}` and :samp:`{Y}` with the actual value for the interface. For more information, see :ref:`computers-ipv4`.
de: Definiert eine zusätzliche virtuelle Schnittstelle. Ersetzen Sie :samp:`{X}` und :samp:`{Y}` durch den tatsächlichen Wert für die Schnittstelle. Für weitere Informationen, siehe :ref:`computers-ipv4`.

source: Defines the network IPv6 address for the interface :samp:`eth{X}`. Replace :samp:`{X}` with the actual value for the interface. For more information, see :ref:`computers-ipv6`.
de: Legt die Netzwerk-IPv6-Adresse für die Schnittstelle :samp:`eth{X}` fest. Ersetzen Sie :samp:`{X}` durch den tatsächlichen Wert für die Schnittstelle. Für weitere Informationen, siehe :ref:`computers-ipv6`.

source: Defines the network IPv6 prefix for the interface :samp:`eth{X}`. Replace :samp:`{X}` with the actual value for the interface. For more information, see :ref:`computers-ipv6`.
de: Legt das Netzwerk-IPv6-Präfix für die Schnittstelle :samp:`eth{X}` fest. Ersetzen Sie :samp:`{X}` durch den tatsächlichen Wert für die Schnittstelle. Für weitere Informationen, siehe :ref:`computers-ipv6`.

source: Activates stateless address autoconfiguration (SLAAC) for the interface :samp:`eth{X}`. Replace :samp:`{X}` with the actual value for the interface. For more information, see :ref:`computers-ipv6`.
de: Aktiviert die zustandslose Adressautokonfiguration (SLAAC) für die Schnittstelle :samp:`eth{X}`. Ersetzen Sie :samp:`{X}` durch den tatsächlichen Wert für die Schnittstelle. Für weitere Informationen, siehe :ref:`computers-ipv6`.

source: Configures the IPv4 network gateway. For more information, see :ref:`computers-ipv6`.
de: Konfiguriert das IPv4-Netzwerk-Gateway. Für weitere Informationen, siehe :ref:`computers-ipv6`.
