Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/appendix.po
Languages: de

source: Defines the UCS system where the backend of the :program:`Self Service` app is installed. For more information, see :ref:`user-management-password-changes-by-users-self-service`.
de: Definiert das UCS-System, auf dem das Backend der Anwendung :program:`Self Service` installiert ist. Weitere Informationen finden Sie unter :ref:`user-management-password-changes-by-users-self-service`.

source: Enables or disables the password rotation on a UCS system. Per default the password rotation is activated. For more information, see :ref:`computers-hostaccounts`.
de: Aktiviert oder deaktiviert die Passwortrotation auf einem UCS-System. Standardmäßig ist die Passwortrotation aktiviert. Für weitere Informationen, siehe :ref:`computers-hostaccounts`.

source: Defines the interval in days to regenerate the computer account password. The default is set to 21 days. For more information, see :ref:`computers-hostaccounts`.
de: Legt das Intervall in Tagen fest, in dem das Passwort des Computerkontos neu generiert wird. Der Standardwert ist auf 21 Tage eingestellt. Weitere Informationen finden Sie unter :ref:`computers-hostaccounts`.

source: Contains the name of the UCS system's server role. For more information, see :ref:`system-roles`.
de: Enthält den Namen der Serverrolle des UCS-Systems. Für weitere Informationen, siehe :ref:`system-roles`.

source: To limit the access to the Squid web proxy, define a list of group names separated by semicolon (``;``). For more information, see :ref:`proxy-userauth`.
de: Um den Zugriff auf den Squid-Webproxy zu beschränken, definieren Sie eine Liste von Gruppennamen, die durch Semikolon (``;``) getrennt sind. Für weitere Informationen, siehe :ref:`proxy-userauth`.

source: Configures additional networks to allow access to the Squid web proxy. Separate the entries with blank spaces and use the CIDR notation, for example :samp:`192.0.2.0/24`. For more information, see :ref:`ip-config-restriction-of-access-to-permitted-networks`.
de: Konfiguriert zusätzliche Netzwerke, um den Zugriff auf den Squid-Webproxy zu ermöglichen. Trennen Sie die Einträge mit Leerzeichen und verwenden Sie die CIDR-Notation, zum Beispiel :samp:`192.0.2.0/24`. Weitere Informationen finden Sie unter :ref:`ip-config-restriction-of-access-to-permitted-networks`.

source: To activate direct authentication for the Squid web proxy against the LDAP server, set the value to ``yes`` and restart Squid. For more information, see :ref:`proxy-userauth`.
de: Um die direkte Authentifizierung für den Squid-Webproxy gegenüber dem LDAP-Server zu aktivieren, setzen Sie den Wert auf ``yes`` und starten Sie Squid neu. Für weitere Informationen, siehe :ref:`proxy-userauth`.

source: To deactivate the caching function of the Squid web proxy, set the value to ``no``. For more information, see :ref:`ip-config-caching-of-web-content`.
de: Um die Caching-Funktion des Squid-Webproxies zu deaktivieren, setzen Sie den Wert auf ``no``. Für weitere Informationen, siehe :ref:`ip-config-caching-of-web-content`.

source: Configures the port for Squid web proxy, where the daemon listens for incoming connections. The default value is ``3128``. For more information, see :ref:`proxy-port`.
de: Konfiguriert den Port für Squid Web Proxy, an dem der Daemon auf eingehende Verbindungen wartet. Der Standardwert ist ``3128``. Für weitere Informationen, siehe :ref:`proxy-port`.

source: To activate authentication through Kerberos for the Squid web proxy, set the value to ``yes`` and restart Squid. For more information, see :ref:`proxy-userauth`.
de: Um die Authentifizierung über Kerberos für den Squid-Webproxy zu aktivieren, setzen Sie den Wert auf ``yes`` und starten Sie Squid neu. Für weitere Informationen, siehe :ref:`proxy-userauth`.

source: To activate authentication for the Squid web proxy against the NTLM interface, set the value to ``yes`` and restart Squid. For more information, see :ref:`proxy-userauth`.
de: Um die Authentifizierung für den Squid-Webproxy über die NTLM-Schnittstelle zu aktivieren, setzen Sie den Wert auf ``yes`` und starten Sie Squid neu. Für weitere Informationen, siehe :ref:`proxy-userauth`.

source: To deactivate further NTML authentication for subsequent HTML requests to the same website, set the value to ``yes``. For more information, see :ref:`proxy-userauth`.
de: Um weitere NTML-Authentifizierung für nachfolgende HTML-Anfragen an dieselbe Website zu deaktivieren, setzen Sie den Wert auf ``yes``. Für weitere Informationen, siehe :ref:`proxy-userauth`.

source: Configures the list of permitted ports for the Squid web proxy. Separate entries with blank spaces. For more information, see :ref:`ip-config-permitted-ports`.
de: Konfiguriert die Liste der zulässigen Ports für den Squid-Webproxy. Trennen Sie die Einträge durch Leerzeichen. Für weitere Informationen, siehe :ref:`ip-config-permitted-ports`.

source: Configures how the SSH daemon permits login for the user ``root``. The value ``without-password`` does not ask for the password interactively. The login requires the public SSH key. For more information, see :ref:`computers-ssh-login-to-systems`.
de: Konfiguriert, wie der SSH-Daemon die Anmeldung für den Benutzer ``root`` erlaubt. Der Wert ``without-password`` fragt nicht interaktiv nach dem Passwort. Die Anmeldung erfordert den öffentlichen SSH-Schlüssel. Für weitere Informationen, siehe :ref:`computers-ssh-login-to-systems`.

source: Configure the port that the SSH daemon uses to listen for connection. The default value is ``22``. For more information, see :ref:`computers-ssh-login-to-systems`.
de: Konfigurieren Sie den Port, den der SSH-Daemon benutzt, um auf Verbindungen zu warten. Der Standardwert ist ``22``. Für weitere Informationen, siehe :ref:`computers-ssh-login-to-systems`.

source: Configures, if the SSH daemon allows X11 forwarding. Valid values are ``yes`` and ``no``. For more information, see :ref:`computers-ssh-login-to-systems`.
de: Legt fest, ob der SSH-Daemon X11-Weiterleitung erlaubt. Gültige Werte sind ``yes`` und ``no``. Für weitere Informationen, siehe :ref:`computers-ssh-login-to-systems`.

source: Records the expiry date of the local computer certificate on each UCS system. The value reflects the number of days since the 1970-01-01.
de: Zeichnet das Ablaufdatum des Zertifikats des lokalen Computers auf jedem UCS-System auf. Der Wert gibt die Anzahl der Tage seit dem *1. Januar 1970* an.

source: Records the expiry date of the root certificate on each UCS system. The value reflects the number of days since the 1970-01-01.
de: Zeichnet das Ablaufdatum des Stammzertifikats auf jedem UCS-System auf. Der Wert gibt die Anzahl der Tage seit dem *1. Januar 1970* an.

source: Defines the warning period for the expiration check of the SSL/TLS root certificate. The default value is ``30`` days. See :ref:`domain-ssl`.
de: Legt den Warnzeitraum für die Ablaufprüfung des SSL/TLS-Root-Zertifikats fest. Der Standardwert ist ``30`` Tage. Siehe :ref:`domain-ssl`.

source: Enables or disables the logging of the system status. The default value is ``yes``. For more information, see :ref:`computers-logging-the-system-status`.
de: Aktiviert oder deaktiviert die Protokollierung des Systemstatus. Der Standardwert ist ``yes``. Für weitere Informationen, siehe :ref:`computers-logging-the-system-status`.

source: Configures the run times when :command:`univention-system-stats` is run. The value follows the :ref:`cron syntax <cron-syntax>`. For more information, see :ref:`computers-logging-the-system-status`.
de: Legt die Laufzeiten fest, wann :command:`univention-system-stats` ausgeführt wird. Der Wert folgt der :ref:`cron-Syntax <cron-syntax>`. Für weitere Informationen, siehe :ref:`computers-logging-the-system-status`.

source: Configures the first external NTP timeserver. For more information, see :ref:`basicservices-ntp`.
de: Konfiguriert den ersten externen NTP-Zeitserver. Für weitere Informationen, siehe :ref:`basicservices-ntp`.

source: Configures the second external NTP timeserver. For more information, see :ref:`basicservices-ntp`.
de: Konfiguriert den zweiten externen NTP-Zeitserver. Für weitere Informationen, siehe :ref:`basicservices-ntp`.

source: Configures the third external NTP timeserver. For more information, see :ref:`basicservices-ntp`.
de: Konfiguriert den dritten externen NTP-Zeitserver. Für weitere Informationen, siehe :ref:`basicservices-ntp`.

source: Select the theme for |UCSWEB|. The value corresponds to a CSS file under :file:`/usr/share/univention-web/themes/` with the same name without filename extension.
de: Wählen Sie das Thema für |UCSWEB|. Der Wert entspricht einer CSS-Datei unter :file:`/usr/share/univention-web/themes/` mit demselben Namen ohne Erweiterung für den Dateinamen.

source: To activate the :program:`Self Service` deregistration, set the variable to ``True``. For more information, see :ref:`user-management-password-changes-by-users-selfderegistration`.
de: Um die :program:`Self Service`-Deregistrierung zu aktivieren, setzen Sie die Variable auf ``True``. Weitere Informationen finden Sie unter :ref:`user-management-password-changes-by-users-selfderegistration`.

source: Enables or disables the account verification and request of new verification tokens for the :program:`Self Service`. For more information, see :ref:`user-management-password-changes-by-users-selfregistration-account-verification`.
de: Aktiviert oder deaktiviert die Kontoverifizierung und die Anforderung neuer Verifizierungstokens für den :program:`Self Service`. Weitere Informationen finden Sie unter :ref:`user-management-password-changes-by-users-selfregistration-account-verification`.

source: Configures the default user name for the domain administrator. The value might be changed during an AD Takeover. For more information, see :ref:`windows-ad-takeover-migrate`.
de: Legt den Standardbenutzernamen für den Domänenadministrator fest. Der Wert kann während einer AD-Übernahme geändert werden. Für weitere Informationen, siehe :ref:`windows-ad-takeover-migrate`.

source: Configures the time out period in seconds for the browser session after which the UCS management system requires a renewed sign in. The default value is ``28800`` seconds for 8 hours.
de: Konfiguriert die Zeitspanne in Sekunden für die Browser-Sitzung, nach der das UCS-Managementsystem eine erneute Anmeldung verlangt. Der Standardwert ist ``28800`` Sekunden für 8 Stunden.

source: If activated with ``true``, the UMC first tries a single sign-on login through OpenID Connect before using the regular login. For more information, refer to :ref:`central-management-umc-login`.
de: Wenn mit ``true`` aktiviert, versucht UMC zuerst eine Single Sign-On Anmeldung über OpenID Connect, bevor es die normale Anmeldung verwendet. Weitere Informationen finden Sie unter :ref:`central-management-umc-login`.

source: Configures the OIDC identity provider for the UMC OIDC authentication. If the variable is unset, the value ``https://ucs-sso-ng.ucs.test/realms/ucs`` is used. For more information, refer to :ref:`central-management-umc-login`.
de: Konfiguriert den OIDC Identity Provider für die UMC OIDC Authentifizierung. Falls die Variable nicht gesetzt ist, wird der Wert ``https://ucs-sso-ng.ucs.test/realms/ucs`` verwendet. Weitere Informationen finden Sie unter :ref:`central-management-umc-login`.

source: Defines the FQDN of the relying party for UMC. If the variable is unset, the FQDN of the UCS system and all IP addresses are used. For more information, refer to :ref:`central-management-umc-login`
de: Definiert den FQDN der *Relying Party* für UMC. Falls die Variable nicht gesetzt ist, wird der FQDN des UCS System verwendet. Weitere Informationen finden Sie unter :ref:`central-management-umc-login`.

source: If activated with ``true``, the UMC first tries a single sign-on login through SAML before using the regular login. For more information, refer to :ref:`central-management-umc-login`.
de: Wenn mit ``true`` aktiviert, versucht UMC zuerst eine Single Sign-On Anmeldung über SAML, bevor es die normale Anmeldung verwendet. Weitere Informationen finden Sie unter :ref:`central-management-umc-login`.
