Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/appendix.po
Languages: de

source: Defines the third *Domain DNS Server*. For more information, see :ref:`computers-configuring-the-name-servers`.
de: Definiert den dritten *Domain DNS Server*. Weitere Informationen finden Sie unter :ref:`computers-configuring-the-name-servers`.

source: Defines the detail level for log messages of the notifier to :file:`/var/log/univention/notifier.log`. The possible values are from 0 (only error messages) to 4 (all status messages). Once the debug level has been changed, the |UCSUDN| must be restarted.
de: Legt die Detailebene für die Protokollmeldungen des Notifiers in :file:`/var/log/univention/notifier.log` fest. Die möglichen Werte reichen von 0 (nur Fehlermeldungen) bis 4 (alle Statusmeldungen). Nach einer Änderung des Debug-Levels muss der |UCSUDN| neu gestartet werden.

source: Defines the detail level for log messages of the NSCD. For more information, see :ref:`computers-nscd`.
de: Legt die Detailebene für Protokollmeldungen des NSCD fest. Für weitere Informationen, siehe :ref:`computers-nscd`.

source: Configures the hash table size of the NSCD for groups. For more information, see :ref:`computers-nscd`.
de: Konfiguriert die Größe der Hash-Tabelle des NSCD für Gruppen. Für weitere Informationen, siehe :ref:`computers-nscd`.

source: Configures the time that a resolved group is kept in the cache of NSCD. The default is one hour in seconds (``3600``). For more information, see :ref:`computers-nscd`.
de: Legt die Zeit fest, die eine aufgelöste Gruppe im Cache von NSCD gehalten wird. Die Voreinstellung ist eine Stunde in Sekunden (``3600``). Für weitere Informationen, siehe :ref:`computers-nscd`.

source: Configures the hash table size of the NSCD for hosts. The default value is ``6007``. For more information, see :ref:`computers-nscd`.
de: Konfiguriert die Größe der Hash-Tabelle des NSCD für Hosts. Der Standardwert ist ``6007``. Für weitere Informationen, siehe :ref:`computers-nscd`.

source: Configures the time that a resolved hostname is kept in the cache of NSCD. The default is one hour in seconds (``3600``). For more information, see :ref:`computers-nscd`.
de: Legt die Zeit fest, die ein aufgelöster Hostname im Cache von NSCD gehalten wird. Die Voreinstellung ist eine Stunde in Sekunden (``3600``). Für weitere Informationen, siehe :ref:`computers-nscd`.

source: Configures the hash table size of the NSCD for usernames. The default value is ``6007``. For more information, see :ref:`computers-nscd`.
de: Konfiguriert die Größe der Hash-Tabelle des NSCD für Benutzernamen. Der Standardwert ist ``6007``. Für weitere Informationen, siehe :ref:`computers-nscd`.

source: Configures the time that a resolved username is kept in the cache of NSCD. The default is ten minutes in seconds (``600``). For more information, see :ref:`computers-nscd`.
de: Legt die Zeit fest, die ein aufgelöster Benutzername im Cache von NSCD gehalten wird. Die Voreinstellung ist zehn Minuten in Sekunden (``600``). Für weitere Informationen, siehe :ref:`computers-nscd`.

source: Configures the number of threads that NSCD uses. Default value is ``5``. For more information, see :ref:`computers-nscd`.
de: Konfiguriert die Anzahl der Threads, die NSCD verwendet. Der Standardwert ist ``5``. Für weitere Informationen, siehe :ref:`computers-nscd`.

source: When activated with ``true``, the cron job script for exporting the local group cache also checks, if the group members are still present in the LDAP directory. For more information, see :ref:`groups-cache`.
de: Wenn mit ``true`` aktiviert, prüft das Cronjob Skript zum Exportieren des lokalen Gruppen-Caches auch, ob die Gruppenmitglieder noch im LDAP-Verzeichnis vorhanden sind. Für weitere Informationen, siehe :ref:`groups-cache`.

source: Defines the invalidation interval to control when the local group cache is considered invalid and a new export is run. For more information, see :ref:`groups-cache`.
de: Legt das Intervall fest, das bestimmt, wann der lokale Gruppen-Cache als ungültig gilt und ein neuer Export durchgeführt wird. Für weitere Informationen, siehe :ref:`groups-cache`.

source: Activates or deactivates the listener to invalidate the local group cache. To activate the listener, set the value to ``true``. Else, set it to ``false``. For more information, see :ref:`groups-cache`.
de: Aktiviert oder deaktiviert den Listener, um den lokalen Gruppencache ungültig zu machen. Um den Listener zu aktivieren, setzen Sie den Wert auf ``true``. Andernfalls setzen Sie den Wert auf ``false``. Für weitere Informationen, siehe :ref:`groups-cache`.

source: Controls the measures that the UCS system takes when the LDAP server cannot be reached. See :ref:`domain-ldap-name-service-switch-ldap-nss-module`.
de: Steuert die Maßnahmen, die das UCS-System ergreift, wenn der LDAP-Server nicht erreichbar ist. Siehe :ref:`domain-ldap-name-service-switch-ldap-nss-module`.

source: The NTP server replies with requests that are signed by Samba/AD when the value is set to ``yes``. For more information, see :ref:`basicservices-ntp`.
de: Der NTP-Server antwortet mit Anfragen, die von Samba/AD signiert sind, wenn der Wert auf ``yes`` gesetzt ist. Für weitere Informationen, siehe :ref:`basicservices-ntp`.

source: Defines the Azure AD connection alias that is used by the next run of the Microsoft 365 Configuration Wizard. For more information, see :ref:`idmcloud-o365-multipleconnections`.
de: Definiert den Azure AD-Verbindungsalias, der bei der nächsten Ausführung des Microsoft 365-Konfigurationsassistenten verwendet wird. Für weitere Informationen, siehe :ref:`idmcloud-o365-multipleconnections`.

source: Configures the LDAP attributes of a user account that the Microsoft 365 connector synchronizes, but fills with random data. The value is a comma-separated list of LDAP attributes. For more information, see :ref:`idmcloud-o365-users`.
de: Konfiguriert die LDAP-Attribute eines Benutzerkontos, das der Microsoft 365 Connector synchronisiert, aber mit zufälligen Daten füllt. Der Wert ist eine kommagetrennte Liste von LDAP-Attributen. Weitere Informationen finden Sie unter :ref:`idmcloud-o365-users`.

source: Defines a mapping of UCS LDAP attributes of a user account for synchronization to Azure attributes. The default settings usually suffice most environment needs. For more information, see :ref:`idmcloud-o365-users`.
de: Definiert eine Zuordnung von LDAP-Attributen eines Benutzerkontos für die Synchronisierung mit Azure Attributen. Die Standardeinstellungen reichen in der Regel für die meisten Umgebungsanforderungen aus. Für weitere Informationen, siehe :ref:`idmcloud-o365-users`.

source: Configures the LDAP attributes of a user account that the Microsoft 365 connector never synchronizes, even if mentioned in :envvar:`office365/attributes/sync` or :envvar:`office365/attributes/anonymize`. The value is a comma-separated list of LDAP attributes. For more information, see :ref:`idmcloud-o365-users`.
de: Konfiguriert die LDAP-Attribute eines Benutzerkontos, das der Microsoft 365-Connector nie synchronisiert, auch wenn es in :envvar:`office365/attributes/sync` oder :envvar:`office365/attributes/anonymize` erwähnt wird. Der Wert ist eine kommagetrennte Liste von LDAP-Attributen. Weitere Informationen finden Sie unter :ref:`idmcloud-o365-users`.

source: Configures LDAP attributes for synchronization with predefined values. For more information, see :ref:`idmcloud-o365-users`.
de: Konfiguriert LDAP-Attribute für die Synchronisierung mit vordefinierten Werten. Weitere Informationen finden Sie unter :ref:`idmcloud-o365-users`.

source: Configures the LDAP attributes of a user account that the Microsoft 365 connector synchronizes. The value is a comma-separated list of LDAP attributes. For more information, see :ref:`idmcloud-o365-users`.
de: Konfiguriert die LDAP-Attribute eines Benutzerkontos, das der Microsoft 365 Connector synchronisiert. Der Wert ist eine kommagetrennte Liste von LDAP-Attributen. Weitere Informationen finden Sie unter :ref:`idmcloud-o365-users`.

source: Configures the default country for the user in Microsoft 365. Values are 2-character abbreviations for countries. For more information, see :ref:`idmcloud-o365-users`.
de: Legt das Standardland für den Benutzer in Microsoft 365 fest. Die Werte sind 2-Zeichen-Abkürzungen für Länder. Weitere Informationen finden Sie unter :ref:`idmcloud-o365-users`.

source: Configure additional debug error for the Microsoft 365 connector. For more information, see :ref:`idmcloud-o365-debug`.
de: Konfigurieren Sie zusätzliche Fehlerbehebungen für den Microsoft 365 Connector. Für weitere Informationen, siehe :ref:`idmcloud-o365-debug`.

source: Configures the default connection alias for Microsoft 365 enabled users and groups. For more information, see :ref:`idmcloud-o365-multipleconnections`.
de: Konfiguriert den Standardverbindungsalias für Microsoft 365-aktivierte Benutzer und Gruppen. Weitere Informationen finden Sie unter :ref:`idmcloud-o365-multipleconnections`.

source: Enables the synchronization of groups of the Microsoft 365 users. To use teams, set the value to ``yes``. For more information, see :ref:`idmcloud-o365-teams`.
de: Aktiviert die Synchronisierung von Gruppen der Microsoft 365-Benutzer. Um Teams zu verwenden, setzen Sie den Wert auf ``yes``. Für weitere Informationen, siehe :ref:`idmcloud-o365-teams`.

source: Defines the :program:`bcrypt` cost factor and defaults to ``12``. See :ref:`domain-password-hashes`.
de: Definiert den :program:`bcrypt` Kostenfaktor und ist standardmäßig auf ``12`` eingestellt. Siehe :ref:`domain-password-hashes`.

source: Defines the :program:`bcrypt` prefix and defaults to ``2b``. See :ref:`domain-password-hashes`.
de: Definiert das Präfix :program:`bcrypt` und ist standardmäßig auf ``2b`` eingestellt. Siehe :ref:`domain-password-hashes`.

source: Defines the hashing method for the password hashes. The default is ``SHA-512``. See :ref:`domain-password-hashes`.
de: Legt die Hash-Methode für die Passwort-Hashes fest. Die Voreinstellung ist ``SHA-512``. Siehe :ref:`domain-password-hashes`.

source: Defines the minimum required number of digits for a password. For more information, see :ref:`users-passwords`.
de: Legt die Mindestanzahl von Zeichen für ein neues Passwort fest. Für weitere Informationen, siehe :ref:`users-passwords`.

source: Defines the minimum required number of lowercase letters in the password. For more information, see :ref:`users-passwords`.
de: Legt die Mindestanzahl von benötigten Kleinbuchstaben im neuen Passwort fest. Für weitere Informationen, siehe :ref:`users-passwords`.

source: Defines the minimum required number of characters in the password which are neither letters nor digits. For more information, see :ref:`users-passwords`.
de: Legt die Mindestanzahl der nötigen Zeichen im neuen Passwort fest, die weder Buchstaben noch Ziffern sind. Für weitere Informationen, siehe :ref:`users-passwords`.

source: Defines the minimum required number of uppercase letters in the password. For more information, see :ref:`users-passwords`.
de: Legt die Mindestanzahl von benötigten Großbuchstaben im neuen Passwort fest. Für weitere Informationen, siehe :ref:`users-passwords`.

source: Defines the characters and digits not allowed for passwords. For more information, see :ref:`users-passwords`.
de: Definiert die Zeichen und Ziffern, die für Passwörter nicht erlaubt sind. Für weitere Informationen, siehe :ref:`users-passwords`.

source: Defines the minimum required default length for a password on a per UCS system basis for users not subject to a UDM password policy. The value ``yes`` applies checks from the :program:`python-cracklib`. The value ``sufficient`` doesn't include :program:`python-cracklib` checks. For more information, see :ref:`users-passwords`.
de: Legt die Mindestlänge für ein Passwort pro UCS-System für Benutzer fest, die nicht einer UDM-Passwortrichtlinie unterliegen. Der Wert ``yes`` wendet die Prüfungen der :program:`python-cracklib` an. Der Wert ``sufficient`` beinhaltet keine :program:`python-cracklib`-Prüfungen. Für weitere Informationen, siehe :ref:`users-passwords`.

source: Defines the standard Microsoft password complexity criteria.
de: Definiert die standardmäßigen Microsoft-Kennwortkomplexitätskriterien.

source: The values ``yes``, ``1`` or ``true`` activate the standard Microsoft password complexity criteria in addition to the other criteria validated with :program:`python-cracklib`.
de: Die Werte ``yes``, ``1`` oder ``true`` aktivieren die Standard Microsoft Passwortkomplexitätskriterien zusätzlich zu den anderen Kriterien, die mit :program:`python-cracklib` überprüft werden.

source: The value ``sufficient`` only applies the standard Microsoft password complexity criteria without :program:`python-cracklib`.
de: Der Wert ``sufficient`` wendet nur die Standard Microsoft Passwortkomplexitätskriterien ohne :program:`python-cracklib` an.

source: The default value is unset and corresponds to the value ``false``.
de: Der Standardwert ist nicht gesetzt und entspricht dem Wert ``false``.

source: For more information, see :ref:`users-passwords`.
de: Für weitere Informationen, siehe :ref:`users-passwords`.

source: Defines individual characters that are required for passwords. For more information, see :ref:`users-passwords`.
de: Definiert einzelne Zeichen, die für Passwörter notwendig sind. Für weitere Informationen, siehe :ref:`users-passwords`.

source: Controls if a UCS system stores installation processes in the software monitor. To turn it off, set the value ``no``. For more information see :ref:`computers-software-monitor`.
de: Steuert, ob ein UCS-System Installationsprozesse im Softwaremonitor speichert. Um dies zu deaktivieren, setzen Sie den Wert ``no``. Für weitere Informationen, siehe :ref:`computers-software-monitor`.

source: Defines the authentication mode for the UCS portal. Set it to ``saml``, if you want to activate SAML for single sign-on login. For more information see :ref:`central-management-umc-login`.
de: Legt den Authentifizierungsmodus für das UCS-Portal fest. Setzen Sie ihn auf ``saml``, wenn Sie SAML für die Single Sign-On Anmeldung aktivieren wollen. Für weitere Informationen, siehe :ref:`central-management-umc-login`.

source: Defines the LDAP DN of the portal object that holds the data for the portal. After changing the variable value, run :command:`univention-portal update`. For more information, see :ref:`central-portal`.
de: Legt den LDAP-DN des Portalobjekts fest, das die Daten für das Portal enthält. Führen Sie nach der Änderung des Variablenwerts den Befehl :command:`univention-portal update` aus. Weitere Informationen finden Sie unter :ref:`central-portal`.

source: Defines the HTTP proxy server on the UCS host system. For more information, see :ref:`computers-configuring-proxy-access`.
de: Legt den HTTP-Proxyserver auf dem UCS-Hostsystem fest. Für weitere Informationen, siehe :ref:`computers-configuring-proxy-access`.

source: Defines the HTTPS proxy server on the UCS host system. For more information, see :ref:`computers-configuring-proxy-access`.
de: Legt den HTTPS-Proxyserver auf dem UCS-Hostsystem fest. Für weitere Informationen, siehe :ref:`computers-configuring-proxy-access`.

source: Defines a list of domains that are not used over a HTTP proxy. Entries are separated by commas. For more information, see :ref:`computers-configuring-proxy-access`.
de: Legt eine Liste von Domänen fest, die nicht über einen HTTP-Proxy verwendet werden. Die Einträge werden durch Kommas getrennt. Weitere Informationen finden Sie unter :ref:`computers-configuring-proxy-access`.

source: To log the activation of quotas to a file, specify the file in this variable. For more information, see :ref:`shares-quota-apply`.
de: Um die Aktivierung von Quotas in einer Datei zu protokollieren, geben Sie die Datei in dieser Variablen an. Für weitere Informationen, siehe :ref:`shares-quota-apply`.

source: To disable the evaluation of user quota during login, set the value to ``no``. For more information, see :ref:`shares-quota-apply`.
de: Um die Auswertung der Benutzerquoten während der Anmeldung zu deaktivieren, setzen Sie den Wert auf ``no``. Für weitere Informationen, siehe :ref:`shares-quota-apply`.

source: To only allow specific network devices access to a network through RADIUS, set the value to ``true``. For more information, see :ref:`ip-config-radius-configuration-mac-filtering`.
de: Um nur bestimmten Netzwerkgeräten den Zugang zu einem Netzwerk über RADIUS zu erlauben, setzen Sie den Wert auf ``true``. Für weitere Informationen, siehe :ref:`ip-config-radius-configuration-mac-filtering`.

source: To use a dedicated user password for RADIUS instead of the domain password, set the value to ``true``. For more information, see :ref:`ip-config-radius-configuration-service-specific-password`.
de: Um ein spezielles Benutzerpasswort für RADIUS anstelle des Domänenpassworts zu verwenden, setzen Sie den Wert auf ``true``. Für weitere Informationen, siehe :ref:`ip-config-radius-configuration-service-specific-password`.

source: Defines another repository server as source for the local mirror. Default value: ``updates.software-univention.de``. For more information see :ref:`software-create-repo`.
de: Legt einen anderen Repository-Server als Quelle für den lokalen Spiegel fest. Standardwert: ``updates.software-univention.de``. Für weitere Informationen, siehe :ref:`software-create-repo`.

source: ``DEPRECATED!`` Defines how to deal with unmaintained packages from additional repositories. To activate, set the value to ``yes``. For more information see :ref:`software-config-repo`.
de: ``DEPRECATED!`` Legt fest, wie mit nicht gewarteten Paketen aus zusätzlichen Repositories verfahren werden soll. Um dies zu aktivieren, setzen Sie den Wert auf ``yes``. Für weitere Informationen, siehe :ref:`software-config-repo`.

source: The repository server used to check for updates and download packages. Default value: ``updates.software-univention.de``. For more information see :ref:`computers-configuration-via-univention-configuration-registry`.
de: Der Repository-Server, der verwendet wird, um nach Updates zu suchen und Pakete herunterzuladen. Standardwert: ``updates.software-univention.de``. Für weitere Informationen, siehe :ref:`computers-configuration-via-univention-configuration-registry`.

source: To enable Microsoft Distributed File System (MSDFS), set the value to ``yes`` and restart Samba. For more information, see :ref:`shares-msdfs`.
de: Um das Microsoft Distributed File System (MSDFS) zu aktivieren, setzen Sie den Wert auf ``yes`` und starten Sie Samba neu. Für weitere Informationen, siehe :ref:`shares-msdfs`.

source: Configures the file service protocol that Samba uses on UCS. The allowed values ``NT1``, ``SMB2``, and ``SMB3``. For more information, see :ref:`windows-samba4-fileservices`.
de: Konfiguriert das Dateidienstprotokoll, das Samba auf dem UCS verwendet. Die erlaubten Werte sind ``NT1``, ``SMB2`` und ``SMB3``. Für weitere Informationen, siehe :ref:`windows-samba4-fileservices`.

source: Defines the system architecture for the print spooler in Samba. Set the values to ``Windows x64`` when your environment contains 64-bit version of Microsoft Windows. For more information, see :ref:`print-services-winclients`.
de: Definiert die Systemarchitektur für den Druckspooler in Samba. Setzen Sie die Werte auf ``Windows x64``, wenn Ihre Umgebung eine 64-Bit-Version von Microsoft Windows enthält. Für weitere Informationen, siehe :ref:`print-services-winclients`.

source: Configures the synchronization time interval between Samba/AD domain controllers for the SYSVOL share. Default value is five minutes. For more information, see :ref:`windows-sysvolshare`.
de: Legt das Zeitintervall für die Synchronisierung zwischen Samba/AD-Domänencontrollern für die SYSVOL-Freigabe fest. Der Standardwert ist fünf Minuten. Für weitere Informationen, siehe :ref:`windows-sysvolshare`.

source: Allows Kerberos authentication at the SAML identity provider. Change to ``univention-negotiate`` to activate. The default is ``univention-ldap``. For more information, see :ref:`domain-saml`.
de: Erlaubt Kerberos-Authentifizierung beim SAML-Identitätsanbieter. Ändern Sie auf ``univention-negotiate`` um zu aktivieren. Die Voreinstellung ist ``univention-ldap``. Für weitere Informationen, siehe :ref:`domain-saml`.

source: Activates additional local identity providers for SAML on a UCS system serving as UCS Identity provider. To activate set the value to ``true``. For more information see :ref:`domain-saml-extended-configuration`.
de: Aktiviert zusätzliche lokale Identitätsanbieter für SAML auf einem UCS-System, das als UCS-Identitätsanbieter dient. Zum Aktivieren setzen Sie den Wert auf ``true``. Für weitere Informationen, siehe :ref:`domain-saml-extended-configuration`.

source: Allows to restrict the Kerberos authentication at the SAML identity provider to certain IP subnetworks in the `CIDR notation <w-classless-inter-domain-routing_>`_, for example :samp:`127.0.0.0/16,192.168.0.0/16`. For more information, see :ref:`domain-saml`.
de: Ermöglicht es, die Kerberos-Authentifizierung beim SAML-Identitätsanbieter auf bestimmte IP-Subnetze in der `CIDR-Notation <w-classless- inter-domain-routing_>`_ zu beschränken, zum Beispiel :samp:`127.0.0.0/16,192.168.0.0/16`. Für weitere Informationen, siehe :ref:`domain-saml`.

source: Configures the error message description text for the :program:`Self Service`. The text shows up for users that login through SSO with an unverified and self registered user account. For more information, see :ref:`user-management-password-changes-by-users-selfregistration-account-verification`.
de: Konfiguriert den Beschreibungstext der Fehlermeldung für das :program:`Self Service`. Der Text wird für Benutzer angezeigt, die sich über SSO mit einem nicht verifizierten und selbst registrierten Benutzerkonto anmelden. Weitere Informationen finden Sie unter :ref:`user-management-password-changes-by-users-selfregistration-account-verification`.

source: Configures the error message title for the :program:`Self Service`. The title shows up for users that login through SSO with an unverified and self registered user account. For more information, see :ref:`user-management-password-changes-by-users-selfregistration-account-verification`.
de: Konfiguriert den Titel der Fehlermeldung für das :program:`Self Service`. Der Titel wird für Benutzer angezeigt, die sich über SSO mit einem nicht verifizierten und selbst registrierten Benutzerkonto anmelden. Weitere Informationen finden Sie unter :ref:`user-management-password-changes-by-users-selfregistration-account-verification`.

source: Controls if the SSO login denies logins from unverified and self registered user accounts. For more information, see :ref:`user-management-password-changes-by-users-selfregistration-account-verification`.
de: Steuert, ob die Single Sign-On Anmeldungen von nicht verifizierten und selbst registrierten Benutzerkonten verweigert wird. Weitere Informationen finden Sie unter :ref:`user-management-password-changes-by-users-selfregistration-account-verification`.

source: To disable Univention firewall, set the value to ``true``. For more information, see :ref:`ip-config-packet-filter-with-univention-firewall`.
de: Um Univention Firewall zu deaktivieren, setzen Sie den Wert auf ``true``. Für weitere Informationen, siehe :ref:`ip-config-packet-filter-with-univention-firewall`.
