Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/central-management-umc.po
Languages: de

source: Consent for using Cookies
de: Zustimmung zur Verwendung von Cookies

source: Both the UCS Portal and the Univention Management Console (UMC) use cookies and store them on the user's computer. Depending on your use case and the public presence of your UCS Portal, you may have to inform the user about the use of cookies.
de: Sowohl das UCS Portal, als auch die Univention Management Console (UMC), verwenden Cookies und speichern diese auf dem Computer des Benutzers. Abhängig von Ihrem Anwendungsfall und der öffentlichen Präsenz Ihres UCS Portals müssen Sie den Benutzer über die Verwendung von Cookies informieren.

source: When enabled, both the UCS Portal and the UMC show a cookie consent banner that the user must accept to continue. You can configure the content using |UCSUCRVs|.
de: Wenn das Cookie-Banner aktiviert ist, zeigen sowohl UCS-Portal, als auch UMC, ein Banner für die Zustimmung von Cookies an, das der Benutzer akzeptieren muss, um fortzufahren. Sie können den Inhalt mit |UCSUCRVs| konfigurieren.

source: Usage of the cookie consent banner
de: Verwendung des Banners für Zustimmung von Cookies

source: To enable and customize the content of the cookie consent banner, use the following steps:
de: Gehen Sie wie folgt vor, um den Inhalt des Banners für die Zustimmung von Cookies zu aktivieren und anzupassen:

source: To enable the cookie consent banner, set the UCR variable :envvar:`umc/cookie-banner/show` to ``true``. The banner then shows the default content.
de: Um das Cookie-Banner zu aktivieren, setzen Sie die UCR-Variable :envvar:`umc/cookie-banner/show` auf ``true``. Das Banner zeigt dann den Standardinhalt an.

source: To customize the title and the text, set the UCR variables :envvar:`umc/cookie-banner/title` and :envvar:`umc/cookie-banner/text` to your liking.
de: Um den Titel und den Text anzupassen, setzen Sie die UCR-Variablen :envvar:`umc/cookie-banner/title` und :envvar:`umc/cookie-banner/text` nach Ihren Wünschen.

source: Note that both settings allow a language-specific configuration. For more information, see the section :ref:`banner-reference`.
de: Beachten Sie, dass beide Einstellungen eine sprachspezifische Konfiguration ermöglichen. Weitere Informationen finden Sie im Abschnitt :ref:`banner-reference`.

source: You can also optionally set the following variables:
de: Sie können optional auch die folgenden Variablen setzen:

source: The name of the cookie as UCS stores it on the user's system with :envvar:`umc/cookie-banner/cookie`.
de: Der Name des Cookies, wie UCS es auf dem System des Benutzers speichert: :envvar:`umc/cookie-banner/cookie`.

source: The domains for which UCS shows the cookie consent banner with :envvar:`umc/cookie-banner/domains`.
de: Die Domänen, für die UCS das Cookie-Banner anzeigt: :envvar:`umc/cookie-banner/domains`.

source: Setting the appropriate UCR variables is sufficient to enable and customize the cookie consent banner.
de: Das Setzen der entsprechenden UCR-Variablen reicht aus, um das Cookie-Banner zu aktivieren und anzupassen.

source: To restore the default texts, unset the :envvar:`umc/cookie-banner/title` and :envvar:`umc/cookie-banner/text` UCR variables. To turn off the cookie banner completely, set :envvar:`umc/cookie-banner/show` to ``false``.
de: Um die Standardtexte wiederherzustellen, deaktivieren Sie die UCR-Variablen :envvar:`umc/cookie-banner/title` und :envvar:`umc/cookie-banner/text`. Um das Cookie-Banner komplett abzuschalten, setzen Sie :envvar:`umc/cookie-banner/show` auf ``false``.

source: UCR reference for cookie consent banner
de: UCR Referenz für Cookie-Banner

source: Use the following UCR variables to configure the cookie banner dialog.
de: Verwenden Sie die folgenden UCR-Variablen, um das Banner zur Zustimmung von Cookies zu konfigurieren.

source: The variable sets the name of the cookie. In the default setting, the value is empty. UCS then uses the name ``univentionCookieSettingsAccepted`` for the cookie.
de: Die Variable legt den Namen des Cookies fest. In der Voreinstellung ist der Wert leer. UCS verwendet dann den Namen ``univentionCookieSettingsAccepted`` für das Cookie.

source: Optional setting for the domains for which the cookie consent banner dialog is active. The value is a comma-separated list of domain names, for which UCS shows the cookie consent banner. For an empty list, UCS shows the banner for all domain names. The domain matches from the end of the string.
de: Optionale Einstellung für die Domänen, für die das Cookie-Banner aktiv ist. Der Wert ist eine durch Kommata getrennte Liste von Domänennamen, für die UCS das Cookie-Banner anzeigt. Bei einer leeren Liste zeigt UCS das Banner für alle Domänennamen an. Die Domäne wird vom Ende der Zeichenkette ausgewertet.

source: Examples:
de: Beispiele:

source: The value ``example.com`` matches ``portal.example.com`` and ``sso.example com``. UCS shows the banner for both domain names.
de: Der Wert ``example.com`` passt zu ``portal.example.com`` und ``sso.example com``. UCS zeigt das Banner für beide Domänennamen an.

source: For the value ``portal.example.com`` UCS doesn't show the cookie consent banner for ``sso.example.com``, but for ``portal.example.com``.
de: Für den Wert ``portal.example.com`` zeigt UCS das Cookie-Banner nicht für ``sso.example.com``, sondern für ``portal.example.com`` an.

source: The variable controls, if the browser shows the cookie consent banner. The default value is ``false``. To show the cookie consent banner, set the variable to ``true``.
de: Die Variable steuert, ob der Browser das Cookie-Banner anzeigt. Der Standardwert ist ``false``. Um das Cookie-Banner anzuzeigen, setzen Sie die Variable auf ``true``.

source: Sets the title for the consent banner dialog. In the default setting, the value is empty and UCS provides a default title for English and German. Use :samp:`umc/cookie-banner/title/{LANGUAGE}` with a two letter language code from `ISO 639-1 <w-iso-639-1_>`_ for :samp:`{LANGUAGE}` to set titles for different languages.
de: Legt den Titel für das Cookie-Banner fest. In der Standardeinstellung ist der Wert leer und UCS bietet einen Standardtitel für Englisch und Deutsch. Verwenden Sie :samp:`umc/cookie-banner/title/{LANGUAGE}` mit einem zweistelligen Sprachcode aus `ISO 639-1 <w-iso-639-1_>`_ für :samp:`{LANGUAGE}`, um die Titel für verschiedene Sprachen festzulegen.

source: Sets the text for the cookie consent banner dialog. In the default setting, the value is empty and UCS provides a default text for English and German. Use :samp:`umc/cookie-banner/text/{LANGUAGE}` with a two letter language code from `ISO 639-1 <w-iso-639-1_>`_ for :samp:`{LANGUAGE}` to set text content for different languages.
de: Legt den Text für das Cookie-Banner fest. In der Standardeinstellung ist der Wert leer und UCS bietet einen Standardtext für Englisch und Deutsch. Verwenden Sie :samp:`umc/cookie-banner/text/{LANGUAGE}` mit einem zweistelligen Sprachcode aus `ISO 639-1 <w-iso-639-1_>`_ für :samp:`{LANGUAGE}`, um Textinhalte für verschiedene Sprachen festzulegen.

source: Delegated administration for UMC modules
de: Delegierte Administration für UMC-Module

source: By default only the members of the ``Domain Admins`` group can access all UMC modules. Policies can be used to configure the access to UMC modules for groups or individual users. For example, this can be used to assign a helpdesk team the authority to manage printers without giving them complete access to the administration of the domain.
de: In der Grundeinstellung können nur die Mitglieder der Gruppe ``Domain Admins`` alle UMC-Module aufrufen. Über Richtlinien kann für Gruppen oder einzelne Benutzer der Zugriff auf UMC-Module konfiguriert werden. Dies kann beispielsweise verwendet werden, um einem Helpdesk-Team die Berechtigung zu erteilen Drucker zu verwalten ohne ihnen Vollzugriff auf die Administration der Domäne zu erteilen.

source: UMC modules are assigned via a *UMC* policy which can be assigned to user and group objects. The evaluation is performed additively, i.e., general access rights can be assigned via ACLs assigned to groups and these rights can be extended via ACLs bound to user (see :ref:`central-policies`).
de: Die Zuweisung von UMC-Modulen erfolgt über eine *UMC*-Richtlinie (siehe auch :ref:`central-policies`), die Benutzer- und Gruppenobjekten zugewiesen werden kann. Die Auswertung erfolgt dabei additiv, d.h. man kann allgemeine Zugriffsrechte durch ACLs auf Gruppenmitgliedschaften erteilen und durch ACLs auf Benutzer ergänzen.

source: In addition to the assignment of UMC policies, LDAP access rights need to be taken into account, as well, for modules that manage data in the LDAP directory. All LDAP modifications are applied to the whole UCS domain. Therefore by default only members of the ``Domain Admins`` group and some internally used accounts have full access to the UCS LDAP. If a module is granted via a UMC policy, the LDAP access must also be allowed for the user/group in the LDAP ACLs. Further information on LDAP ACLs can be found in :ref:`domain-ldap-acls`.
de: Zusätzlich zu der Zuweisung von UMC-Richtlinien, müssen für UMC-Module, die Daten des LDAP-Verzeichnisses verwalten, ebenfalls LDAP-Zugriffsrechte berücksichtigt werden. Alle im LDAP vorgenommenen Änderungen gelten für die gesamte UCS-Domäne. Daher haben in der Grundeinstellung nur Mitglieder der Gruppe ``Domain Admins`` sowie einige intern genutzte Konten Vollzugriff auf das UCS-LDAP. Wird ein Modul über eine UMC-Richtlinie freigegeben, muss für den Benutzer/die Gruppe zusätzlich der Zugriff in den LDAP-ACLs freigegeben werden. Weitere Hinweis zu LDAP-ACLs finden sich in :ref:`domain-ldap-acls`.

source: Policy *UMC*
de: Richtlinie *UMC*

source: Attribute
de: Attribut

source: Description
de: Beschreibung

source: List of allowed UCS operation sets
de: Liste der erlaubten Operationen

source: All the UMC modules defined here are displayed to the user or group to which this ACL is applied. The names of the domain modules begin with ``UDM``.
de: Alle hier definierten UMC-Module werden dem Benutzer oder der Gruppen angezeigt, auf die diese ACL angewendet wird. Die Namen von Domänen-Modulen beginnen mit ``UDM``.

source: For access to UMC modules, only policies are considered that are assigned to groups or directly to user and computer accounts. Nested group memberships (i.e., groups in groups) are not evaluated.
de: Für den Zugriff auf UMC-Module werden nur Richtlinien ausgewertet, die Gruppen oder aber direkt Benutzer- sowie Rechnerkonten zugewiesen sind. Eine Auswertung von verschachtelten Gruppenmitgliedsschaften (also Gruppen in Gruppen) findet nicht statt.

source: Evaluation of data from the LDAP directory with Univention Directory Reports
de: Auswertung von Daten aus dem LDAP-Verzeichnis mit Univention Directory Reports

source: Univention Directory Reports offers the possibility of creating predefined reports for any objects to be managed in the directory service.
de: Univention Directory Reports bietet die Möglichkeit vordefinierte Reports zu beliebigen im Verzeichnisdienst verwalteten Objekten zu erstellen.

source: The structure of the reports is defined using templates. The specification language developed for this purpose allows the use of wildcards, which can be replaced with values from the LDAP directory. Any number of report templates can be created. This allows users to select very detailed reports or just create simple address lists, for example.
de: Die Struktur der Reports wird dabei durch Vorlagen definiert. Die dafür entwickelte Beschreibungssprache ermöglicht die Verwendung von Platzhaltern, die durch die Werte aus dem LDAP-Verzeichnis ersetzt werden. Es können dabei beliebig viele Reportvorlagen vorgegeben werden. So können beispielsweise für Benutzer wahlweise sehr detaillierte Reports oder nur einfache Adresslisten erstellt werden.

source: The creation of the reports is directly integrated in the UMC modules :guilabel:`Users`, :guilabel:`Groups` and :guilabel:`Computers`. Alternatively, the command line program :command:`univention-directory-reports` can be used.
de: Die Erstellung von Reports ist direkt in die UMC-Module :guilabel:`Benutzer`, :guilabel:`Gruppen` und :guilabel:`Rechner` integriert. Alternativ kann das Kommandozeilenprogramm :command:`univention-directory-reports` verwendet werden.

source: Six report templates are already provided with the delivered Univention Directory Reports, which can be used for users, groups and computers. Three templates create PDF documents and three CSV files, which can be used as an import source for other programs. Further templates can be created and registered.
de: Im Auslieferungszustand werden sechs Reportvorlagen von Univention Directory Reports bereitgestellt, die für Benutzer, Gruppen und Rechner verwendet werden können. Drei Vorlagen erzeugen PDF-Dokumente und drei Vorlagen CSV-Dateien, die als Import-Quelle für andere Programme verwendet werden können. Weitere Vorlagen können erstellt und registriert werden.

source: Creating reports via |UCSUMC| modules
de: Erstellen von Reports in |UCSUMC|-Modulen

source: To create a report, you need to open the UMC module :guilabel:`Users`, :guilabel:`Groups` or :guilabel:`Computers`. Then all the objects which should be covered by the report must be selected (you can select all objects by clicking the checkbox the left of *Name*). Clicking on :menuselection:`More --> Create report` allows to choose between the *Standard Report* in PDF format and the *Standard CSV Report* in CSV format.
de: Um einen Report zu erstellen, muss das UMC-Modul :guilabel:`Benutzer`, :guilabel:`Gruppen` oder :guilabel:`Rechner` geöffnet werden. Anschließend müssen alle vom Report erfassten Objekte ausgewählt werden (durch einen Klick auf die Checkbox links von *Name* können alle Objekte ausgewählt werden). Ein Klick auf :menuselection:`Mehr --> Report erstellen` ermöglicht die Auswahl zwischen dem *Standard-Report* im PDF-Format und dem *CSV-Report* im CSV-Format.

source: Creating a report
de: Erstellen eines Reports

source: The reports created via a UMC module are stored for 12 hours and then deleted by a cron job. The settings for when the cron job should run and how long the reports should be stored for can be defined via two |UCSUCR| variables:
de: Die über die UMC-Module erzeugten Reports werden für 12 Stunden aufbewahrt und danach durch einen Cron-Job entfernt. Die Einstellungen, wann dieser Cron-Job laufen soll und wie lange diese Reports aufbewahrt werden sollen, kann über zwei |UCSUCR|-Variablen definiert werden:

source: Defines when the cron job should be run.
de: Definiert den Zeitpunkt zu dem der Cron-Job ausgeführt werden soll.

source: Defines the maximum age of a report document in seconds before it is deleted.
de: Bestimmt das maximale Alter eines Report-Dokumentes in Sekunden bevor es gelöscht wird.

source: Creating reports on the command line
de: Erstellen von Reports auf der Kommandozeile

source: Reports can also be created via the command line with the :command:`univention-directory-reports` program. Information on the use of the program can be viewed using the ``--help`` option.
de: Reports können auch über die Kommandozeile mit dem Programm :command:`univention-directory-reports` erstellt werden. Informationen zur Verwendung des Programm können über die Option ``--help`` abgefragt werden.

source: The following command can be used to list the report templates available to users, for example:
de: Mit dem folgenden Befehl können beispielsweise die verfügbaren Reportvorlagen für Benutzer aufgelistet werden:

source: Adjustment/expansion of Univention Directory Reports
de: Anpassung/Erweiterung von Univention Directory Reports

source: Existing reports can be created directly with the presettings. Some presettings can be adapted using |UCSUCR|. For example, it is possible to replace the logo that appears in the header of each page of a PDF report. To do so, the value of the |UCSUCRV| :envvar:`directory/reports/logo` can include the name of an image file. The usual image formats such as JPEG, PNG and GIF can be used. The image is automatically adapted to a fixed width of 5.0 cm.
de: Schon vorhandene Reports können direkt mit den Voreinstellungen erstellt werden. Einige Voreinstellungen können mittels |UCSUCR| angepasst werden. Beispielsweise ist es möglich, das Logo, dass in der Kopfzeile jeder Seite eines PDF-Reports angezeigt wird, zu ersetzen. Dafür kann der Wert der |UCSUCRV| :envvar:`directory/reports/logo` den Namen einer Bilddatei enthalten. Dabei können gängigen Bildformate wie JPEG, PNG oder GIF verwendet werden. Das Bild wird automatisch auf eine feste Breite von 5.0 cm angepasst.

source: In addition to the logo, the contents of the report can also be adapted by defining new report templates.
de: Neben dem Logo kann auch der Inhalt der Reports angepasst werden, indem neue Reportvorlagen definiert werden.

source: Expansion of UMC modules with extended attributes
de: Erweiterung von UMC-Modulen mit erweiterten Attributen

source: The domain management UMC modules allow the comprehensive management of the data in a domain. *Extended attributes* offer the possibility of integrating new attributes in the domain management which are not covered by the UCS standard scope. Extended attributes are also employed by third party vendors for the integration of solutions in UCS.
de: Die UMC-Module für die Domänenverwaltung ermöglichen die umfassende Verwaltung der Daten einer Domäne. *Erweiterte Attribute* bieten eine Möglichkeit, neue Attribute in die Domänenverwaltung zu integrieren, die durch den UCS-Standardumfang nicht abgedeckt sind. Erweiterte Attribute werden auch von Drittanbietern für die Integration von Lösungen in UCS eingesetzt.

source: Extended attributes are managed in the UMC module :guilabel:`LDAP directory`. There one needs to switch to the ``univention`` container and then to the ``custom attributes`` subcontainer. Existing attributes can be edited here or a new *Settings: extended attribute* object created here with :guilabel:`Add`.
de: Erweiterte Attribute werden über das Modul :guilabel:`LDAP-Verzeichnis` verwaltet. Sie befinden sich im Container ``univention`` und dessen Untercontainer ``custom attributes``. Hier können bestehende Attribute bearbeitet werden oder mit :guilabel:`Hinzufügen` ein Objekt vom Typ *Einstellungen: Erweitertes Attribut* angelegt werden.

source: Extended attribute for managing a car license
de: Erweitertes Attribut zur Verwaltung von KFZ-Kennzeichen

source: Extended attributes can be internationalized. In this case, the name and description should be compiled in English as this is the standard language for UMC modules.
de: Erweiterte Attribute können internationalisiert werden. In diesem Fall sollten Namen und Beschreibungen in Englisch verfasst werden, da dies der Standardsprache von UMC-Modulen entspricht.

source: Extended attributes - General tab
de: Erweiterte Attribute - Reiter Allgemein

source: *General* tab
de: Reiter *Allgemein*

source: Unique name
de: Eindeutiger Name

source: The name of the LDAP object which will be used to store the extended attribute. Within a container, the name has to be unique.
de: Der Name des LDAP-Objektes, als welches das erweiterte Attribut gespeichert wird. Innerhalb eines Containers muss der Name eindeutig sein.

source: The specified attribute name should be used when employing the command line interface |UCSUDM|. When the extended attribute is saved, the *Unique name* of the *General* tab is automatically adopted and can be subsequently modified.
de: Der angegebene Attributname ist bei der Verwendung der Kommandozeilenschnittstelle |UCSUDM| zu verwenden. Beim Anlegen des erweiterten Attributs wird hier automatisch *Eindeutiger Name* von der Karteikarte *Allgemein* übernommen und kann nachträglich modifiziert werden.

source: Short description
de: Kurzbeschreibung

source: Used as title of the input field in UMC modules or as the attribute description in the command line interface.
de: Wird als Überschrift des Eingabefelds in UMC-Modulen oder als Attribut-Beschreibung in der Kommandozeilenschnittstelle verwendet.

source: Translations of short description
de: Übersetzungen der Kurzbeschreibung

source: Translated short descriptions can be saved in several languages so that the title of extended attributes is also output with other language settings in the respective national language. This can be done by assigning the respective short description to a language code (e.g., ``de_DE`` or ``fr_FR``) in this input field.
de: Damit der Titel von erweiterten Attributen auch mit anderen Spracheinstellungen in der jeweiligen Landessprache ausgegeben wird, können übersetzte Kurzbeschreibungen für mehrere Sprachen hinterlegt werden. Dazu kann in diesem Eingabefeld über einen Sprachcode (z.B. ``de_DE`` oder ``fr_FR``) die entsprechend übersetzte Kurzbeschreibung zugeordnet werden.

source: Long description
de: Ausführliche Beschreibung

source: This long description is shown as a tool tip in the input fields in UMC modules.
de: Diese erweiterte Beschreibung wird für die Eingabefelder in UMC-Modulen als Tooltip angezeigt.

source: Translations of long description
de: Übersetzungen der ausführlichen Beschreibung

source: Additional information displayed in the tool tip for an extended attribute can also be saved for several languages. This can be done by assigning the respective long description to a language code (e.g., ``de_DE`` or ``fr_FR``) in this input field.
de: Zusätzliche Hinweise, die im Tooltip für ein erweitertes Attribut angezeigt werden, können ebenfalls für mehrere Sprachen hinterlegt werden. Dazu kann in diesem Eingabefeld über einen Sprachcode (z.B. ``de_DE`` oder ``fr_FR``) die entsprechend übersetzte Langbeschreibung zugeordnet werden.

source: Extended attributes - Module tab
de: Erweiterte Attribute - Reiter Modul

source: *Module* tab
de: Reiter *Modul*

source: Modules to be extended
de: Zu erweiternde Module

source: The |UCSUDM| module which is to be expanded with the extended attribute. An extended attribute can apply for multiple modules.
de: Das |UCSUDM|-Modul, welches durch das erweiterte Attribut ergänzt werden soll. Ein erweitertes Attribut kann auch für mehrere Module gelten.

source: Required options/object classes
de: Benötigte Optionen/Objektklassen

source: Some extended attributes can only be used practically if certain object classes are activated on the :guilabel:`Options` tab. One or more options can optionally be saved in this input field so that this extended attribute is displayed or editable.
de: Einige erweiterte Attribute können nur sinnvoll verwendet werden, wenn auf der Karteikarte *(Optionen)* bestimmte Objektklassen aktiviert sind. In diesem Eingabefeld können optional eine oder mehrere Optionen hinterlegt werden, die am betreffenden Objekt aktiviert sein müssen, damit dieses erweiterte Attribut angezeigt wird oder editierbar ist.

source: Hook class
de: Hook-Klasse

source: The functions of the hook class specified here are used during saving, modifying and deleting the objects with extended attributes. Additional information can be found in :cite:t:`developer-reference`.
de: Die Funktionen der hier angegebenen Hook-Klasse werden während des Anlegens, Modifizierens und Löschens von Objekten mit dem erweitertem Attribut aufgerufen. Weiterführende Dokumentation findet sich in der Entwickler-Dokumentation :cite:t:`developer-reference`.

source: Extended attributes - LDAP mapping tab
de: Erweiterte Attribute - Reiter LDAP-Abbildung

source: *LDAP mapping* tab
de: Reiter *LDAP-Abbildung*

source: LDAP object class
de: LDAP-Objektklasse
