Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/central-management-umc.po
Languages: de

source: To customize a theme for |UCSWEB|\ s don't edit the files :file:`/usr/share/univention-web/themes/dark.css` and :file:`/usr/share/univention-web/themes/light.css`, because UCS upgrades can overwrite your changes. Instead, copy one of these files to, for example, :file:`/usr/share/univention-web/themes/mytheme.css` and set the |UCSUCRV| :envvar:`ucs/web/theme` to ``mytheme``.
de: Um ein Thema für |UCSWEB|\ n anzupassen, bearbeiten Sie nicht die Dateien :file:`/usr/share/univention-web/themes/dark.css` und :file:`/usr/share /univention-web/themes/light.css`, da UCS Upgrades die Änderungen überschreiben können. Kopieren Sie stattdessen eine dieser Dateien z.B. nach :file:`/usr/share/univention-web/themes/mytheme.css` und setzen Sie die |UCSUCRV| :envvar:`ucs/web/theme` auf ``mytheme``.

source: The files :file:`/usr/share/univention-web/themes/dark.css` and :file:`/usr/share/univention-web/themes/light.css` contain the same list of `CSS variables <mozilla-css-custom-properties_>`_. Other CSS files use these CSS variables. These CSS variables are the supported layer of configurability for |UCSWEB|\ s. The names and use cases for these variables don't change between UCS upgrades, but Univention may add additional names and use cases.
de: Die Dateien :file:`/usr/share/univention-web/themes/dark.css` und :file:`/usr/share/univention-web/themes/light.css` enthalten die gleiche Liste von `CSS Variablen <mozilla-css-custom-properties_>`_. Andere CSS Dateien verwenden diese CSS Variablen. Diese CSS Variablen sind die unterstützte Konfigurationsschicht für |UCSWEB|\ n. Die Namen und Anwendungsfälle für diese Variablen ändern sich nicht zwischen UCS Upgrades, aber Univention kann zusätzliche Namen und Anwendungsfälle hinzufügen.

source: Some |UCSWEB|\ s import their own local :file:`custom.css` file which you can use to adjust the design of the following pages:
de: Einige |UCSWEB|\ s importieren ihre eigene lokale :file:`custom.css` Datei, die Sie verwenden können, um das Design der folgenden Seiten anzupassen:

source: For :ref:`domain-saml-sso-login`: :file:`/usr/share/univention-management-console-login/css/custom.css`
de: Für :ref:`domain-saml-sso-login`: :file:`/usr/share/univention-management-console-login/css/custom.css`

source: For :ref:`central-portal`: :file:`/usr/share/univention-portal/css/custom.css`
de: Für :ref:`central-portal`: :file:`/usr/share/univention-portal/css/custom.css`

source: The files are empty during the installation of UCS. UCS updates don't change these files.
de: Die Dateien sind bei der Installation von UCS leer. UCS-Updates ändern diese Dateien nicht.

source: Be aware, however, that a given `CSS selector <mozilla-css-selectors_>`_ may break when installing a UCS update.
de: Beachten Sie jedoch, dass bestimmte `CSS-Selektoren <mozilla-css-selectors_>`_ bei der Installation eines UCS-Updates kaputt gehen kann.

source: Feedback on UCS
de: Feedback zu UCS

source: By choosing the :menuselection:`Help --> Feedback` option in the upper right menu, you can provide feedback on UCS via a web form.
de: Durch die Auswahl des Menüeintrages :menuselection:`Hilfe --> Feedback` in dem oberen, rechten Menü kann über ein Webformular Feedback zu UCS gegeben werden.

source: Collection of usage statistics
de: Erfassung von Nutzungsstatistiken

source: Anonymous usage statistics on the use of the |UCSWEB| are collected when using the *core edition* version of UCS (which is generally used for evaluating UCS). Further information can be found in :uv:kb:`Data collection in Univention Corporate Server <6701>`.
de: Bei Verwendung der *Core Edition* von UCS (wird generell zur Evaluierung von UCS verwendet) werden anonyme Nutzungsstatistiken zur Verwendung der |UCSWEB| erzeugt. Weitere Informationen finden sich in :uv:kb:`Data collection in Univention Corporate Server <6701>`.

source: LDAP directory browser
de: LDAP-Verzeichnis-Browser

source: The UMC module :guilabel:`LDAP directory` can be used to navigate through the LDAP directory. When doing so, new objects can be created, modified or deleted in the LDAP directory.
de: Über das UMC-Modul :guilabel:`LDAP-Verzeichnis` kann durch das LDAP-Verzeichnis navigiert werden. Dabei können auch Objekte im LDAP-Verzeichnis erzeugt, modifiziert oder gelöscht werden.

source: Navigating the LDAP directory
de: Navigation im LDAP-Verzeichnis

source: The left half of the screen shows the LDAP directory as a tree structure whose elements can be shown and hidden using the arrow icons.
de: In der linken Bildschirmhälfte ist das LDAP-Verzeichnis in einer Baumstruktur dargestellt, deren Unterelemente durch die Pfeilsymbole ein- und ausgeblendet werden können.

source: Clicking on an element of the tree structure switches to this LDAP position and displays the objects at this LDAP position in the in the right side of the screen. The *Type* selection list can be used to limit the display to selected attributes.
de: Durch Klick auf ein Element der Baumstruktur wird an diese LDAP-Position gewechselt und in der Übersichtsliste auf der rechten Bildschirmhälfte, die an dieser LDAP-Position befindlichen Objekte angezeigt. Über die Auswahlliste *Typ* kann die Anzeige auf ausgewählte Attribute eingeschränkt werden.

source: The :guilabel:`Add` button can be used to add new objects here too. Similar to the control elements described in :ref:`central-user-interface`, existing objects can also be edited, deleted or moved here.
de: Mit der Schaltfläche :guilabel:`Hinzufügen` können hier auch neue Objekte eingefügt werden. Analog zu den in :ref:`central-user-interface` beschriebenen Bedienelementen können hier auch bestehende Objekte editiert, gelöscht oder verschoben werden.

source: Editing LDAP container settings
de: Bearbeiten von LDAP-Container-Einstellungen

source: Right-clicking on an element in the tree structure allows editing the properties of the container or the LDAP base with :guilabel:`Edit`.
de: Durch Rechtsklick auf ein Element der Baumstruktur können über :guilabel:`Bearbeiten` die Eigenschaften des Containers oder der LDAP-Basis bearbeitet werden.

source: Let's Encrypt is a non-profit certificate authority that provides X.509 certificates for TLS encryption at no charge. It is the world's largest certificate authority with the goal of all websites being secure and using HTTPS.
de: Let's Encrypt ist eine gemeinnützige Zertifizierungsstelle, die kostenlos X.509 Zertifikate für TLS Verschlüsselung anbietet. Es ist die weltgrößte Zertifizierungsstelle mit dem Ziel, dass alle Webseiten mit HTTPS abgesichert sind.

source: The :program:`Let's Encrypt` app in Univention App Center offers a largely automated integration of the *acme-tiny Let's Encrypt client* in UCS. The supported services in UCS are the Apache Web server, the Postfix SMTP mail server and the Dovecot IMAP mail server.
de: Die :program:`Let's Encrypt` App im Univention App Center bietet eine weitgehend automatisierte Integration des *acme-tiny Let's Encrypt Clients* in UCS. Unterstützte Dienste in UCS sind der Apache Webserver, der Postfix SMTP Mailserver und der Dovecot IMAP Mailserver.

source: Login
de: Anmelden

source: UCS provides a central login page. You can sign in to the |UCSWEB| with the credentials of the respective domain account. On the portal at :samp:`https://{FQDN}/univention/portal/` you can use the following ways to sign in:
de: UCS stellt eine zentrale Anmeldeseite zur Verfügung. Sie können sich an der |UCSWEB| mit den Anmeldedaten des jeweiligen Domänenkontos anmelden. Auf dem Portal unter :samp:`https://{FQDN}/univention/portal/` können Sie sich auf folgende Weise anmelden:

source: Click the tile :guilabel:`Login` on the portal page.
de: Klicken Sie auf die Kachel :guilabel:`Login` auf der Portalseite.

source: Go to :menuselection:`Menu --> Login`.
de: Gehen Sie zu :menuselection:`Menu --> Login`.

source: It opens the login page as shown in :numref:`umc-login`.
de: Das öffnet die Anmeldeseite wie in :numref:`umc-login` gezeigt.

source: UCS sign-in page
de: UCS Anmeldeseite

source: If a page in the management system, such as a UMC module, requires a login, your browser redirects you to the central login page.
de: Wenn eine Seite im UCS Managementsystem, z. B. ein UMC-Modul, eine Anmeldung erfordert, leitet Ihr Browser Sie zur zentralen Anmeldeseite weiter.

source: When you sign in at the local UCS system, the browser session closes by default after 8 hours of inactivity. You can change the timeout through the UCR variable :envvar:`umc/http/session/timeout`. To get a new the session, the user must sign in again.
de: Wenn Sie sich am lokalen UCS-System anmelden, wird die Sitzung im Browser standardmäßig nach 8 Stunden Inaktivität geschlossen. Sie können den Timeout über die UCR-Variable :envvar:`umc/http/session/timeout` ändern. Um eine neue Sitzung zu erhalten, muss sich der Benutzer erneut anmelden.

source: To sign out of the management system, click :guilabel:`Logout` in the user menu.
de: Um sich aus vom UCS Managementsystem abzumelden, klicken Sie im Benutzermenü auf :guilabel:`Abmelden`.

source: By installing a third-party application, such as :program:`privacyIDEA`, it's possible to extend the |UCSWEB| authentication with a two-factor authentication (2FA).
de: Durch die Installation einer Anwendung von Drittanbietern, wie z. B. :program:`privacyIDEA`, ist es möglich, die |UCSWEB|-Authentifizierung um eine Zwei-Faktor-Authentifizierung (2FA) zu erweitern.

source: Refresh portal tabs on logout
de: Portal Tabs bei Abmeldung aktualisieren

source: All browser tabs where the user is logged into the portal will automatically refresh when a logout is detected. This feature is deactivated by default and can be toggled through the UCR Variable :envvar:`portal/reload-tabs-on-logout`.
de: Alle Browser Tabs, in denen der Benutzer im Portal eingeloggt ist, werden automatisch aktualisiert, wenn eine Abmeldung erkannt wird. Diese Funktion ist standardmäßig deaktiviert und kann über die UCR-Variable :envvar:`portal/reload-tabs-on-logout` umgeschaltet werden.

source: Choose the right user account
de: Wählen Sie das richtige Benutzerkonto

source: To sign in, enter the *Username* and *Password* of the corresponding domain account in the login mask.
de: Um sich anzumelden, geben Sie in der Anmeldemaske den *Benutzernamen* und das *Passwort* des entsprechenden Domänenkontos ein.

source: When you sign in with the ``Administrator`` account on a |UCSPRIMARYDN| or |UCSBACKUPDN|, the UCS management system shows the UMC modules for the administration and configuration of the local system, as well as, UMC modules for the administration of data in the domain.
de: Wenn Sie sich mit dem Konto ``Administrator`` auf einem |UCSPRIMARYDN| oder |UCSBACKUPDN| anmelden, zeigt das UCS-Managementsystem die UMC-Module für die Verwaltung und Konfiguration des lokalen Systems, sowie die UMC-Module für die Verwaltung der Daten in der Domäne an.

source: You specified the initial password for the ``Administrator`` account in the setup wizard during installation. The password corresponds to the initial password of the local ``root`` account. Use the ``Administrator`` account for the initial sign in at a newly installed |UCSPRIMARYDN|.
de: Sie haben das initiale Passwort für das ``Administrator`` Konto während der Installation im Setup-Assistenten festgelegt. Das Passwort entspricht dem initialen Passwort des lokalen ``root`` Kontos. Verwenden Sie das ``Administrator`` Konto für die Erstanmeldung an einem neu installierten |UCSPRIMARYDN|.

source: In some cases, it might be necessary to sign in with the system's local ``root`` account. For more information, refer to :ref:`computers-rootaccount`. The ``root`` account only enables access to UMC modules for the administration and configuration of the local system.
de: In einigen Fällen kann es notwendig sein, sich mit dem lokalen ``root`` Konto des Systems anzumelden. Weitere Informationen hierzu finden Sie unter :ref:`computers-rootaccount`. Das ``root`` Konto ermöglicht nur den Zugriff auf UMC-Module für die Verwaltung und Konfiguration des lokalen Systems.

source: Other user accounts
de: Andere Benutzerkonten

source: When you sign in with another user account, the UCS management system shows the UMC modules approved for the user. For additional information on allowing further modules, refer to :ref:`delegated-administration`.
de: Wenn Sie sich mit einem anderen Benutzerkonto anmelden, zeigt das UCS Managementsystem die für den Benutzer zugelassenen UMC-Module an. Weitere Informationen zur Zulassung weiterer Module finden Sie unter :ref:`delegated-administration`.

source: By default, the login page for the portal has single sign-on deactivated. The following sections describe how to activate single sign-on. After a successful sign in, the session is valid for all UCS systems of the domain, as well as, for third party apps, if the apps support web based single sign-on.
de: Standardmäßig ist Single Sign-On auf der Anmeldeseite für das Portal deaktiviert. Die folgenden Abschnitte beschreiben, wie Sie Single Sign-On aktivieren können. Nach erfolgreicher Anmeldung ist die Sitzung für alle UCS-Systeme der Domäne sowie für Applikationen von Drittanbietern gültig, wenn diese webbasiertes Single Sign-On unterstützen.

source: For sign-in through single sing-on, the browser session closes for 8 hours of inactivity. To get a fresh session, the user must sign in again.
de: Bei der einmaligen Anmeldung wird die Browser-Sitzung nach 8 Stunden Inaktivität geschlossen. Um eine frische Sitzung zu erhalten, muss sich der Benutzer erneut anmelden.

source: It's possible to enforce the sign in on the local system by clicking the link :guilabel:`Login without Single Sign On` on the login page, as show in :numref:`umc-login-sso`.
de: Es ist möglich, die Anmeldung auf dem lokalen System zu erzwingen, indem Sie auf den Link :guilabel:`Anmeldung ohne Single Sign On` auf der Anmeldeseite klicken, wie :numref:`umc-login-sso` zu sehen.

source: UCS sign-in page for single sign-on
de: UCS Anmeldeseite für Single Sign-On

source: SAML for single sign-on
de: SAML für Single Sign-On

source: UCS has SAML activated by default. This section describes how to activate it for the *Login* buttons in the Portal. For more information about SAML, refer to :ref:`domain-saml`.
de: Bei UCS ist SAML standardmäßig aktiviert. Dieser Abschnitt beschreibt, wie man es für die *Anmeldung* Schaltflächen im Portal aktiviert. Weitere Informationen zu SAML finden Sie unter :ref:`domain-saml`.

source: Activate
de: Aktivieren

source: To activate single sign-on through SAML, use the following steps:
de: Um Single Sign-On über SAML zu aktivieren, gehen Sie wie folgt vor:

source: Ensure that all users in your domain who want to use the portal and the UCS management system with single sign-on can reach :samp:`ucs-sso.{[Domain Name]}`.
de: Stellen Sie sicher, dass alle Benutzer in Ihrer Domäne, die das Portal und das UCS-Managementsystem mit Single Sign-On nutzen wollen, :samp:`ucs-sso.{[Domänenname]}` erreichen können.

source: Change the |UCSUCRV| :envvar:`portal/auth-mode` to ``saml`` with :option:`ucr set`. The default value was ``ucs``.
de: Ändern Sie den |UCSUCRV| :envvar:`portal/auth-mode` auf ``saml`` mit :option:`ucr set`. Der Standardwert war ``ucs``.

source: For the change to take effect, restart the portal server with the following command:
de: Damit die Änderung wirksam wird, starten Sie den Portal Server mit dem folgenden Befehl neu:

source: Update sign-in links
de: Anmeldelinks aktualisieren

source: Restarting the portal server automatically updates the *Login* link in the user menu. You must manually update the portal tile. The default portal has a preconfigured single sign-on login tile. Use the portal edit mode to enable it. To replace the *Login* tile with the single sign-on tile, follow these steps:
de: Der Neustart des Portal Servers aktualisiert automatisch den Link *Anmelden* im Benutzermenü. Sie müssen die Kachel im Portal manuell aktualisieren. Das Standardportal hat eine vorkonfigurierte Kachel zur Anmeldung mit Single Sign-On. Verwenden Sie den Bearbeitungsmodus des Portals, um sie zu aktivieren. Um die Kachel *Anmeldung* durch die Kachel für die einmalige Anmeldung zu ersetzen, führen Sie die folgenden Schritte aus:

source: In *Univention Management Console* open the UMC Module Portal: :menuselection:`Domain --> Portal`.
de: Öffnen Sie in der *Univention Management Console* das UMC-Modul Portal: :menuselection:`Domäne --> Portal`.

source: To activate the preconfigured sign in tile for SAML, edit the entry ``login-saml``, scroll down to the section *Advanced* and activate the checkbox :guilabel:`Advanced`.
de: Um die vorkonfigurierte Kachel zur Anmeldung für SAML zu aktivieren, bearbeiten Sie den Eintrag ``login-saml``, scrollen Sie nach unten zum Abschnitt *Erweitert* und aktivieren Sie die Checkbox :guilabel:`Erweitert`.

source: To deactivate the default sign in tile, edit the entry ``login-ucs``, scroll down to the section *Advanced* and deactivate the checkbox :guilabel:`Advanced`.
de: Um die Standard-Kachel zur Anmeldung zu deaktivieren, bearbeiten Sie den Eintrag ``login-ucs``, scrollen Sie nach unten zum Abschnitt *Advanced* und deaktivieren Sie die Checkbox :guilabel:`Advanced`.

source: To change back to the default sign-in in UCS without single sign-on, you need to revert the steps for updating the portal tile and set the UCR variable :envvar:`portal/auth-mode` to ``ucs``.
de: Um zur Standardanmeldung in UCS ohne Single Sign-On zurückzukehren, müssen Sie müssen Sie die Schritte zum Aktualisieren der Kachel im Portal rückgängig machen und die UCR Variable :envvar:`portal/auth-mode` auf ``ucs`` setzen.

source: OpenID Connect for single sign-on
de: OpenID Connect für Single Sign-On

source: With :uv:erratum:`5.0x1118` the portal and the UCS management system have the capability to allow single sign-on with OpenID Connect. The capability is deactivated by default.
de: Mit :uv:erratum:`5.0x1118` haben das Portal und das UCS Management System die Möglichkeit, Single Sign-On mit OpenID Connect durchzuführen. Die Fähigkeit ist standardmäßig deaktiviert.

source: OpenID Connect (OIDC) is a protocol that allows single sign-on. OIDC is a more lightweight protocol than SAML. It's one variant for using single sign-on in the portal and the UCS management system. This section describes how to use it with UCS.
de: OpenID Connect (OIDC) ist ein Protokoll, das Single Sign-On ermöglicht. OIDC ist ein einfacheres Protokoll als SAML. Es ist eine Variante für die Verwendung von Single Sign-On im Portal und im UCS-Managementsystem. Dieser Abschnitt beschreibt, wie Sie es mit UCS verwenden.

source: Requirements
de: Anforderungen

source: Before you can use OIDC for single sign-on, you must meet the following requirements:
de: Bevor Sie OIDC für Single Sign-On verwenden können, müssen Sie die folgenden Voraussetzungen erfüllen:

source: You must at least have :uv:erratum:`5.0x1118` installed throughout your UCS domain.
de: Sie müssen mindestens :uv:erratum:`5.0x1118` überall in Ihrer UCS-Domäne installiert haben.

source: For information about how to upgrade, refer to :ref:`software-ucs-updates`.
de: Informationen zum Upgrade finden Sie unter :ref:`software-ucs-updates`.

source: You must have the app :program:`Keycloak` installed in your UCS domain.
de: Sie müssen die App :program:`Keycloak` in Ihrer UCS-Domäne installiert haben.

source: For information about the installation of :program:`Keycloak`, refer to :external+uv-keycloak-ref:ref:`app-installation` in :cite:t:`ucs-keycloak-doc`.
de: Informationen über die Installation von :program:`Keycloak` finden Sie in :external+uv-keycloak-ref:ref:`app-installation` in :cite:t:`ucs-keycloak-doc`.

source: Activation
de: Aktivierung

source: First, you need to decide on which UCS systems you want to enable single sign-on using OpenID Connect. Second, you need to apply the following steps to each of those UCS systems.
de: Zunächst müssen Sie entscheiden, auf welchen UCS-Systemen Sie Single Sign-On mit OpenID Connect aktivieren möchten. Zweitens müssen Sie die folgenden Schritte auf jedem dieser UCS-Systeme anwenden.

source: Deactivate SAML for portal sign-in through the UCR variable :envvar:`umc/web/sso/enabled` so that the automatic to sign in again doesn't try SAML first, but instead uses OIDC directly.
de: Deaktivieren Sie SAML für die Anmeldung am Portal über die UCR-Variable :envvar:`umc/web/sso/enabled`, damit die automatische Neuanmeldung nicht zuerst SAML ausprobiert, sondern direkt OIDC verwendet.

source: Change the |UCSUCRV| :envvar:`umc/web/oidc/enabled` to ``true`` with :option:`ucr set`.
de: Ändern Sie die |UCSUCRV| :envvar:`umc/web/oidc/enabled` auf ``true`` mit :option:`ucr set`.

source: Run the join script for the UMC web server:
de: Führen Sie das Join-Skript für den UMC Webserver aus:

source: Change the |UCSUCRV| :envvar:`portal/auth-mode` to ``oidc`` with :option:`ucr set`. The default value was ``ucs``.
de: Ändern Sie den |UCSUCRV| :envvar:`portal/auth-mode` auf ``oidc`` mit :option:`ucr set`. Der Standardwert war ``ucs``.

source: Create sign-in links
de: Anmeldelinks erstellen

source: Restarting the portal server automatically updates the *Login* link in the user menu. You can optionally create a portal tile for the sign-in with OpenID Connect on the |UCSPRIMARYDN| with the commands in :numref:`central-management-umc-login-single-sign-on-oidc-sign-in-links-listing`.
de: Durch einen Neustart des Portal Servers wird der *Login*-Link im Benutzermenü automatisch aktualisiert. Optional können Sie mit den Befehlen in :numref:`central-management-umc-login-single-sign-on-oidc-sign-in-links-listing` eine Kachel im Portal für die Anmeldung mit OpenID Connect auf dem |UCSPRIMARYDN| erstellen.

source: Create portal tile for sign-in with OpenID Connect
de: Portal Kachel für die Anmeldung mit OpenID Connect erstellen

source: Verification and log files
de: Verifizierung und Logdateien

source: To verify that the setup works, open the URL :samp:`https://{FQDN}/univention/oidc` in a web browser, such as Mozilla Firefox, and sign in. Open a UMC module, such as *Users*, and perform a search.
de: Um zu überprüfen, ob die Einrichtung funktioniert, öffnen Sie die URL :samp:`https://{FQDN}/univention/oidc` in einem Webbrowser, z. B. Mozilla Firefox, und melden Sie sich an. Öffnen Sie ein UMC-Modul, z. B. *Users*, und führen Sie eine Suche durch.

source: You find relevant logging information in the following locations:
de: Entsprechende Informationen zur Protokollierung finden Sie an den folgenden Stellen:

source: Log file: :file:`/var/log/univention/management-console.server.log`
de: Logdatei: :file:`/var/log/univention/management-console.server.log`

source: To reflect the changes for the login method in the portal, you need to edit the *Login* tile manually, similar to the setup with :ref:`central-management-umc-login-single-sign-on-saml`. The link must point to ``/univention/oidc/``.
de: Um die Änderungen für die Anmeldemethode im Portal zu übernehmen, müssen Sie die Kachel *Anmelden* manuell bearbeiten, ähnlich wie bei der Einrichtung mit :ref:`central-management-umc-login-single-sign-on-saml`. Der Link muss auf ``/univention/oidc/`` zeigen.

source: Deactivate
de: Deaktivieren

source: First, you need to decide on which UCS systems you want to deactivate single sign-on using OpenID Connect. Second, you need to apply the following steps to each of those UCS systems.
de: Zunächst müssen Sie entscheiden, für welche UCS-Systeme Sie Single Sign-On über OpenID Connect deaktivieren möchten. Zweitens müssen Sie die folgenden Schritte auf jedem dieser UCS-Systeme anwenden.
