Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/central-management-umc.po
Languages: de

source: Unset the |UCSUCRV| :envvar:`umc/web/oidc/enabled` with :option:`ucr unset`:
de: Deaktivieren Sie die |UCSUCRV| :envvar:`umc/web/oidc/enabled` mit :option:`ucr unset`:

source: Remove the :external+uv-keycloak-ref:term:`OIDC RP` from Keycloak with the following command:
de: Entfernen Sie das :external+uv-keycloak-ref:term:`OIDC RP` aus Keycloak mit dem folgenden Befehl:

source: Unset all |UCSUCRVs| that you can find with the following searches:
de: Setzen Sie alle |UCSUCRVs| zurück, die Sie mit den folgenden Suchen finden können:

source: Remove the OIDC secret from the system and restart affected services:
de: Entfernen Sie das OIDC-Geheimnis aus dem System und starten Sie die betroffenen Dienste neu:

source: $ rm -f \ /etc/umc-oidc.secret \ /usr/share/univention-management-console/oidc/http* $ systemctl restart slapd univention-management-console-server
de: $ rm -f \ /etc/umc-oidc.secret \ /usr/share/univention-management-console/oidc/http* $ systemctl restart slapd univention-manangement-console

source: Manually update the portal tile for *Login*, so that the link points to ``/univention/login/``.
de: Aktualisieren Sie manuell die *Anmelden* Kachel im Portal, so dass der Link auf ``/univention/login/`` zeigt.

source: Change the |UCSUCRV| :envvar:`portal/auth-mode` to ``ucs`` with :option:`ucr set` and restart the portal server.
de: Ändern Sie den |UCSUCRV| :envvar:`portal/auth-mode` auf ``ucs`` mit :option:`ucr set` und starten Sie den Portal Server neu.

source: Identity Provider with non-standard FQDN
de: Identity Provider mit nicht standardmäßigem FQDN

source: By default, the FQDN for the :program:`Keycloak` identity provider is ``ucs-sso-ng.$domainname``. However, it's possible to configure a different FQDN for the identity provider. For more information, see :external+uv-keycloak-ref:ref:`use-case-custom-fqdn-idp` in :cite:t:`ucs-keycloak-doc`.
de: Standardmäßig ist der FQDN des :program:`Keycloak` Identity Provider ``ucs-sso-ng.$domainname``. Jedoch ist es möglich einen anderen FQDN für den Identity Provider zu konfigurieren. Für weitere Informationen, siehe :external+uv-keycloak-ref:ref:`use-case-custom-fqdn-idp` in :cite:t:`ucs-keycloak-doc`.

source: If you have such a setup, you have to configure the identity provider for the OpenID Connect authentication in UMC on each UCS system. Change the |UCSUCRV| :envvar:`umc/oidc/issuer` to the FQDN of your :program:`Keycloak` identity provider and run the join script of the UMC web server again, as shown in :numref:`central-management-umc-login-single-sign-on-oidc-sign-in-non-standard-fqdn-idp-listing`.
de: Wenn Sie ein solches Setup haben, müssen Sie den Identity Provider für die OpenID-Connect Authentifizierung in UMC auf jedem UCS-System konfigurieren. Ändern Sie die |UCSUCRV| :envvar:`umc/oidc/issuer` in den FQDN Ihres :program:`Keycloak` Identity Provider und führen Sie das Join-Skript des UMC Webservers erneut aus, wie in :numref:`central-management-umc-login-single-sign-on-oidc-sign-in-non-standard-fqdn-idp-listing` gezeigt.

source: Set non-standard FQDN for identity provider :program:`Keycloak`
de: Nicht standardmäßiger FQDN des :program:`Keycloak` Identity Provider

source: Non-standard FQDN for the Univention Portal and UMC
de: Univention Portal und UMC mit nicht standardmäßigem FQDN

source: By default, the UMC is available under the FQDN ``$hostname.$domainname``. If you have a setup with a different FQDN for the UMC you have to change the |UCSUCRV| :envvar:`umc/oidc/rp/server` to the FQDN of the UMC, and run the join script of the UMC web server again, as shown in :numref:`central-management-umc-login-single-sign-on-oidc-sign-in-non-standard-fqdn-portal-listing`.
de: Standardmäßig ist die UMC über den FQDN ``$hostname.$domainname`` erreichbar. Falls Sie ein Setup haben, in dem die UMC über einen anderen FQDN erreichbar ist, müssen Sie die |UCSUCRV| :envvar:`umc/oidc/rp/server` auf diesen Wert setzen und das Join-Skript des UMC Webservers nochmals ausführen, siehe :numref:`central-management-umc-login-single-sign-on-oidc-sign-in-non-standard-fqdn-portal-listing`.

source: Set non-standard FQDN for the portal and UMC
de: Nicht standardmäßigem FQDN für das Portal und die UMC konfigurieren

source: If you want to run multiple Portal/UMC servers behind a load balancer, you need to run these commands on all UCS systems.
de: Wenn Sie mehrere Portal/UMC-Server hinter einem *Load Balancer* betreiben möchten, müssen Sie diese Befehle auf allen UCS-Systemen ausführen.

source: Since all the systems use the same OIDC client in this setup, make sure that the file :file:`/etc/umc-oidc.secret` has the same contents on each system and matches the client secret in :program:`Keycloak` for that client.
de: Da alle Systeme in diesem Setup denselben OIDC-Client verwenden, stellen Sie sicher, dass die Datei :file:`/etc/umc-oidc.secret` auf jedem System denselben Inhalt hat und mit dem Passwort dieses Clients in :program:`Keycloak` übereinstimmt.

source: Back-channel sign-out
de: Back-Channel Abmeldung

source: If you use OIDC back-channel sign-out together with multiprocessing of the UMC, the UMC needs a database for session storage to handle the session logout correctly. You have enabled multiprocessing in UMC if the |UCSUCRV| :envvar:`umc/http/processes` has a value greater than one (``> 1``).
de: Wenn Sie die OIDC Back-Channel Abmeldung zusammen mit Multiprocessing der UMC verwenden, benötigt UMC eine Datenbank für die Sitzungsspeicherung, um die Abmeldung korrekt abzuwickeln. Sie haben Multiprocessing in UMC aktiviert, wenn die |UCSUCRV| :envvar:`umc/http/processes` einen Wert größer als eins (``> 1``) hat.

source: If you have only one UMC server without UMC multiprocessing, you don't need to change the configuration.
de: Wenn Sie nur einen UMC-Server ohne UMC Multiprocessing haben, können Sie die Konfiguration unverändert belassen.

source: To keep track of the sessions in the database for UMC, you need to configure the database connection string with the :program:`univention-mangement-console-settings` script, as shown in :numref:`central-management-umc-login-single-sign-on-oidc-back-channel-sign-out-sql-connection-listing`.
de: Damit die UMC die Sitzungen in der Datenbank verwalten kann, müssen Sie die Datenbankverbindung mit dem Skript :program:`univention-mangement-console-settings` konfigurieren, wie in :numref:`central-management-umc-login-single-sign-on-oidc-back-channel-sign-out-sql-connection-listing` gezeigt.

source: However, if the Univention Portal or UMC uses multiple UCS servers for load balancing, or if UMC has a configuration for multiprocessing, it's necessary to use a :program:`PostgreSQL` database that all the UCS systems can access. In these cases, you must consider the following aspects:
de: Wenn das Univention Portal oder die UMC jedoch mehrere UCS-Server zum Lastenausgleich verwenden oder wenn Multiprocessing für UMC konfiguriert sind, ist es notwendig, eine :program:`PostgreSQL` Datenbank zu verwenden, auf die alle UCS-Systeme zugreifen können. In diesen Fällen müssen Sie die folgenden Aspekte berücksichtigen:

source: PostgreSQL database server:
de: PostgreSQL Datenbankserver:

source: You either need to provide a :program:`PostgreSQL` database yourself that all the UMC servers have access to.
de: Sie müssen entweder selbst eine :program:`PostgreSQL` Datenbank bereitstellen, auf die alle UMC-Server Zugriff haben.

source: Or you install and configure :program:`PostgreSQL` on one of the UCS servers. As shown in the example in :numref:`central-management-umc-login-single-sign-on-oidc-back-channel-sign-out-postgres-install-listing`, you can freely choose the values for ``db_user``, ``db_name``, and ``db_password``. ``db_host`` is the UCS system with :program:`PostgreSQL` running.
de: Oder Sie installieren und konfigurieren :program:`PostgreSQL` auf einem der UCS-Systeme wie im Beispiel in :numref:`central-management-umc-login-single-sign-on-oidc-back-channel-sign-out-postgres-install-listing` gezeigt. Die Werte für ``db_user``, ``db_name`` und ``db_password`` können Sie frei wählen. ``db_host`` ist das UCS-System, auf dem :program:`PostgreSQL` läuft.

source: Example for installation of :program:`PostgreSQL`
de: Beispiel für die Installation von :program:`PostgreSQL`

source: Set the SQL connection URI on the |UCSPRIMARYDN|:
de: Konfiguration der URI für die SQL-Verbindung auf dem |UCSPRIMARYDN|:

source: Set SQL connection URI
de: Konfiguration der URI für die SQL-Verbindung

source: Restart the UMC on all UCS servers:
de: Neustart der UMC auf allen UCS-Servern:

source: The feature for the refresh of the portal tabs on sign-out or session timeout requires :program:`PostgreSQL`.
de: Das automatische Aktualisieren der Portal Tabs bei der Abmeldung oder dem Timeout der Sitzung erfordert :program:`PostgreSQL`.

source: You can also use a local :program:`SQLite` database for one UMC server with multiprocessing, or you can use :program:`MariaDB` as central database for multiple load-balancing UMC servers. In both cases, the refresh of the portal tabs isn't supported and won't work, as it requires a :program:`PostgreSQL` database.
de: Sie können auch eine lokale :program:`SQLite` Datenbank für einen UMC-Server mit Multiprocessing verwenden, oder Sie können :program:`MariaDB` als zentrale Datenbank für mehrere UMC-Server mit Lastausgleich verwenden. In beiden Fällen wird das Aktualisieren der Portal Tabs nicht unterstützt und funktioniert nicht, da hierfür eine :program:`PostgreSQL` Datenbank erforderlich ist.

source: Policies
de: Richtlinien

source: *Policies* describe administrative settings which can practically be used on more than one object. They facilitate the administration as they can be connected to containers and then apply to all the objects in the container in question and the objects in sub containers. The values are applied according to the inheritance principle. For every object, the applied value is always that which lies closest to the object in question.
de: *Richtlinien* beschreiben administrative Einstellungen, die sinnvoll auf mehr als ein Objekt angewendet werden können. Sie erleichtern die Administration, in dem sie an Container gebunden werden und dann für alle in dem betreffenden Container befindlichen Objekte, sowie die in Unterordnern befindlichen Objekte gelten. Die Einstellungen werden nach dem Prinzip der Vererbung angewendet. Auf ein Objekt wird immer der Wert angewandt, der dem Objekt am nächsten liegt.

source: If, for example, the same password expiry interval is to be defined for all users of a location, then a special container can be created for these users. After moving the user objects into the container, a password policy can be linked to the container. This policy is valid for all user objects within the container.
de: Soll z.B. für alle Benutzer eines Standorts das gleiche Passwortablaufintervall definiert werden, kann für diese Benutzer ein eigener Container angelegt werden. Nachdem die Benutzer-Objekte in den Container verschoben wurden, kann eine Passwort-Richtlinie mit dem Container verknüpft werden. Diese Richtlinie gilt für alle enthaltenen Benutzer-Objekte.

source: An exception to this rule is a value which was defined in a policy in the form of *fixed attributes*. Such values cannot be overwritten by subordinate policies.
de: Eine Ausnahme bilden Werte, die in einer Richtlinie als *festgelegte Attribute* gesetzt wurden. Diese können von nachgeordneten Richtlinien nicht überschrieben werden.

source: The command line program :command:`univention-policy-result` can be used to show in detail which policy applies to which directory service object.
de: Mit dem Kommandozeilenprogramm :command:`univention-policy-result` kann detailliert angezeigt werden, welche Richtlinie auf ein Verzeichnisdienstobjekt greift.

source: Every policy applies to a certain type of UMC domain object, e.g., for users or DHCP subnets.
de: Jede Richtlinie gilt für einen bestimmten UMC-Domänenobjekttyp, also z.B. für Benutzer oder DHCP-Subnetze.

source: Creating a policy
de: Anlegen einer Richtlinie

source: Policies can be managed via the UMC module :guilabel:`Policies`. The operation is the same as for the functions described in :ref:`central-user-interface`.
de: Richtlinien können über das :guilabel:`Richtlinien`-Modul der |UCSUMC| verwaltet werden. Die Bedienung erfolgt analog zu den in :ref:`central-user-interface` beschriebenen Funktionen.

source: The attributes and properties of the policies are described in the corresponding chapters, e.g. the DHCP policies in the network chapter.
de: Die Attribute und Eigenschaften der Richtlinien sind in den entsprechenden Kapiteln beschrieben, also die DHCP-Richtlinien beispielsweise im Netzwerk-Kapitel.

source: The names of policies must not contain any umlauts.
de: Die Namen von Richtlinien dürfen keine Umlaute enthalten.

source: *Referencing objects* provides a list of all containers or LDAP objects for which this policy currently applies.
de: Unter *Referenzierende Objekte* findet sich eine Aufstellung aller Container oder LDAP-Objekte, mit denen diese Richtlinie aktuell verknüpft ist.

source: The expanded settings host some general policy options which are generally only required in special cases.
de: In den erweiterten Einstellungen einer Richtlinie können einige allgemeine Richtlinien-Optionen gesetzt werden, die in der Regel nur für Sonderfälle nötig sind.

source: A LDAP filter expression can be specified here, which an object must match for this policy to get applied.
de: Ein LDAP Filter Ausdruck kann hier angegeben werden, der die Anwendung der Richtlinie auf solche Objekte einschränkt, die dem angegebenen Filter genügen.

source: Required object classes
de: Benötigte Objektklassen

source: Here you can specify LDAP object classes that an object must possess for the policy to apply to this object. If, for example, a user policy is only relevant for Windows environments, the ``sambaSamAccount`` object class could be demanded here.
de: Hier können LDAP-Objektklassen angegeben werden, die ein Objekt besitzen muss, damit die Richtlinie auf dieses Objekt greift. Wenn etwa eine Benutzerrichtlinie nur für Windows-Umgebungen relevant ist, könnte hier die Objektklasse ``sambaSamAccount`` erzwungen werden.

source: Excluded object classes
de: Ausgeschlossene Objektklassen

source: Similar to the configuration of the required object classes, you can also list object classes here which should be excluded.
de: Analog zur Konfiguration der benötigten Objektklassen können hier Objektklassen aufgeführt werden, die ausgeschlossen werden sollen.

source: Fixed attributes
de: Festgelegte Attribute

source: Attributes can be selected here, the values of which may not be changed by subordinate policies.
de: Hier können Attribute ausgewählt werden, deren Werte von nachgeordneten Richtlinien nicht verändert werden dürfen.

source: Empty attributes
de: Leere Attribute

source: Attributes can be selected here, which are to be set to empty in the policy, meaning they will be stored without containing a value. This can be useful for removing values inherited by an object from a superordinate policy. In subordinate policies, new values can be assigned to the attributes in question.
de: Hier können Attribute ausgewählt werden, die in der Richtlinie leergesetzt, also ohne Wert gespeichert werden sollen. Dadurch können Werte, die ein Objekt von einer übergeordneten Richtlinie ererbt hat, entfernt werden. In nachgeordneten Richtlinien können den Attributen wieder Werte zugewiesen werden.

source: Applying policies
de: Zuweisung von Richtlinien

source: Policies can be assigned in two ways:
de: Richtlinien werden Objekten auf zwei unterschiedlichen Arten zugewiesen:

source: A policy can be assigned to the LDAP base or a container/OU. To do so, the :guilabel:`Policies` tab in the properties of the LDAP object must be opened in the navigation (see :ref:`central-navigation`).
de: Eine Richtlinie kann der LDAP-Basis oder einem Container/OU zugewiesen werden. Dazu muss im LDAP-Verzeichnis-Browser (siehe :ref:`central-navigation`) in den Eigenschaften des LDAP-Objekts der Reiter :guilabel:`Richtlinien` geöffnet werden.

source: A *Policies* tab is shown in the UMC modules of LDAP directory objects for which there are policies available (e.g., for users). A particular policy for a user can be specified at this place.
de: In den einzelnen UMC Modulen der LDAP-Verzeichnisobjekte - sofern es für den Typ Richtlinien gibt (z.B. für Benutzer) - wird ein Reiter :guilabel:`Richtlinien` angezeigt. Eine abweichende Richtlinie für einen Benutzer kann an dieser Stelle festgelegt werden.

source: The *Policies* configuration dialogue is functionally identical; however, all policy types are offered when assigning policies to a LDAP container, whilst only the policy types applicable for the object type in question are offered when assigning policies to an LDAP object.
de: Der *Richtlinien*-Konfigurationsdialog ist funktional identisch; allerdings werden bei der Zuweisung von Richtlinien an einem LDAP-Container alle Richtlinien-Typen angeboten, während bei der Zuweisung an einem LDAP-Objekt nur die für diesen Objekt-Typ gültigen Richtlinien angeboten werden.

source: A policy can be assigned to the LDAP object or container under *Policies*. The values resulting from this policy are displayed directly. The *Inherited* setting means that the settings are adopted from a superordinate policy again - when one exists.
de: Unter *Richtlinien-Konfiguration* kann dem LDAP-Objekt oder dem Container eine Richtlinie zugewiesen werden. Die aus dieser Richtlinie resultierenden Werte werden direkt angezeigt. Die Einstellung *Ererbt* bedeutet, dass die Einstellungen wieder aus einer übergeordneten Richtlinie - sofern vorhanden - übernommen werden.

source: If an object is linked to a policy, or inherits policy settings which cannot be applied to the object, the settings remain without effect for the object. This makes it possible, for example, to assign a policy to the base entry of the LDAP directory, which is then valid for all the objects of the domain which can apply this policy. Objects which cannot apply to this policy are not affected.
de: Wenn ein Objekt mit einer Richtlinie verbunden ist oder Richtlinien-Einstellungen erbt, die auf das Objekt nicht angewandt werden können, bleiben die Einstellungen ohne Auswirkung für das Objekt. Dadurch ist es z.B. möglich, eine Richtlinie mit der Wurzel des LDAP-Verzeichnisses zu verbinden, die dann für alle Objekte der Domäne, die diese Richtlinie anwenden können, gültig ist. Objekte, die diese Richtlinie nicht anwenden können, werden nicht beeinflusst.

source: Editing a policy
de: Bearbeiten einer Richtlinie

source: Policies can be edited and deleted in the UMC module :guilabel:`Policies`. The interface is described in :ref:`central-user-interface`.
de: Richtlinien können im UMC-Modul :guilabel:`Richtlinien` bearbeitet und gelöscht werden. Die Bedienung ist in :ref:`central-user-interface` beschrieben.

source: When editing a policy, the settings for all the objects linked to this policy are changed! The values from the changed policy apply to objects already registered in the system and linked to the policy, in the same way as to objects added in the future.
de: Beim Bearbeiten einer Richtlinie werden die Einstellungen für alle Objekte, die mit dieser Richtlinie verbunden sind, verändert! Diese Werte aus der geänderten Richtlinie gelten also nicht nur für Objekte, die in der Zukunft hinzugefügt werden, sondern auch für diejenigen, die bereits im System eingetragen und mit der Richtlinie verbunden sind.

source: The policy tab of the individual LDAP objects also includes the :guilabel:`edit` option, which can be used to edit the policy currently applicable for this object.
de: Im Richtlinien-Reiter der einzelnen LDAP-Objekte findet sich außerdem die Schaltfläche :guilabel:`Bearbeiten`, mit der die aktuell für dieses Objekt gültige Richtlinie bearbeitet werden kann.

source: Portal pages offer a central view of all available services in a UCS domain. Requirements strongly differ from small to large environments in organizations, public authorities, or even schools. Therefore, UCS implemented a very flexible and individually customizable concept for portal pages.
de: Die Portalseiten dienen der zentralen Darstellung aller verfügbaren Dienste in einer UCS-Domäne. Da sich die Anforderung von kleinen bis hin zu großen Umgebungen in Organisationen, Behörden oder auch im Schulbetrieb stark voneinander unterscheiden, bringt UCS ein sehr flexibles und individuell anpassbares Konzept für Portalseiten mit.

source: The Univention Portal is part of Univention Nubus. For more information about Nubus, refer to :ref:`introduction-nubus`
de: Das Univention Portal ist Teil von Univention Nubus. Weitere Informationen über Nubus finden Sie unter :ref:`introduction-nubus`

source: As illustrated in :numref:`portal-schema`, portal entries (i.e., links to applications/Apps/services; UDM object type ``portals/entry``) can be assigned to none, one or multiple portal categories. A portal category (UDM object type ``portals/category``) can be assigned to none, one or multiple portals. A portal itself (UDM object type ``portals/portal``) renders all portal categories which are assigned to it.
de: Wie in :numref:`portal-schema` dargestellt, können Portaleinträge (also Verweise auf Applikationen/Apps/Dienste; UDM-Objekttyp ``portals/entry``) keinem, einem oder mehreren Portal-Kategorien zugeordnet werden. Eine Portal-Kategorie (UDM-Objekttyp ``portals/category``) kann keinem, einem oder mehreren Portalen zugeordnet werden. Ein Portal selbst (UDM-Objekttyp ``portals/portal``) stellt alle Portal-Kategorien dar, die mit ihm verknüpft sind.

source: In addition, you can create portal announcements (UDM object type ``portals/announcement``) and use them to announce, for example, maintenance windows or service outages. They can have a severity level, such as *information* or *warning*, a start and end date and a visibility limitation to a specific group of users. A portal announcement shows up at the top of each portal on all portals.
de: Darüber hinaus können Sie *Portal Announcements* (Ankündigungen; UDM-Objekttyp ``portals/announcement``) erstellen und damit zum Beispiel Wartungsfenster oder Serviceausfälle ankündigen. Ankündigungen können einen Schweregrad wie *Information* oder *Warnung*, ein Start- und Enddatum und eine Einschränkung der Sichtbarkeit auf eine bestimmte Gruppe von Benutzern haben. Eine Ankündigung wird im Portal im oberen Bereich jedes Portals auf allen Portalen angezeigt.

source: The portal *domain*, shipped with every installation, is configured on each server by default. In addition to all installed applications of the domain, links to |UCSUMC| as well as the server overview are shown on this portal page.
de: Das Portal *domain*, das mit jeder Installation mitgebracht wird, ist zunächst auf allen UCS-Systemen vorkonfiguriert. Neben allen installierten Applikationen in der Domäne werden hier auch Verweise zu |UCSUMC| sowie zur Serverübersicht angezeigt.

source: To change the displayed portal, adjust the |UCSUCRV| :envvar:`portal/default-dn` and run the command :command:`univention-portal update`.
de: Um das anzuzeigende Portal zu ändern, passen Sie die |UCSUCRV| :envvar:`portal/default-dn` an und führen Sie den Befehl :command:`univention-portal update` aus.

source: Custom portals and portal entries can be defined and managed either via the UMC module :guilabel:`Portal` or directly on the portal site.
de: Eigene Portale und Portaleinträge können entweder über das UMC-Modul :guilabel:`Portal` oder direkt auf der Portalseite angelegt und verwaltet werden.
