Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/central-management-umc.po
Languages: de

source: The current license status can be shown by clicking the :guilabel:`License info` button.
de: Der aktuelle Lizenzstatus kann mit einem Klick auf :guilabel:`Lizenzinfo` angezeigt werden.

source: Displaying the UCS license
de: Anzeige der UCS-Lizenz

source: The button :guilabel:`Import a license` opens a dialogue in which a new license key can be activated (otherwise the core edition license is used as default license). A license file can be selected and imported via the button :guilabel:`Import from file...`. Alternatively, the license key can also be copied into the input field below and activated with :guilabel:`Import from text field`.
de: Der Schaltfläche :guilabel:`Lizenz importieren` öffnet einen Dialog, über den ein neuer UCS-Lizenzschlüssel aktiviert werden kann (ansonsten greift die standardmäßig installierte Core-Edition-Lizenz). Über die Schaltfläche :guilabel:`Importieren aus Datei...` kann eine Lizenz-Datei ausgewählt und importiert werden. Alternativ kann der Lizenz-Schlüssel auch in das darunter liegende Eingabefeld kopiert und dann über die Schaltfläche :guilabel:`Importieren aus Textfeld` eingespielt werden.

source: Installation of most of the applications in the Univention App Center requires a personalized license key. UCS core edition licenses can be converted by clicking :guilabel:`Request a new license`. The current license key is sent to Univention and the updated key returned to a specified email address within a few minutes. The new key can be imported directly. The conversion does not affect the scope of the license.
de: Die Installation der meisten Anwendungen aus dem Univention App Center erfordert einen individuell ausgestellten Lizenzschlüssel mit eindeutiger Schlüsselidentifikation. UCS-Core-Edition-Lizenzen können mit einem Klick auf :guilabel:`Neue Lizenz anfordern` aktualisiert werden. Der aktuelle Lizenzschlüssel wird dabei an Univention geschickt und der aktualisierte Schlüssel nach einigen Minuten an eine angegebene E-Mail-Adresse versendet. Der neue Schlüssel kann dann direkt eingespielt werden. Der Lizenzumfang bleibt durch die Konvertierung unverändert.

source: If the number of licensed user or computer objects is exceeded, it is not possible to create any additional objects in UMC modules or edit any existing ones unless an extended license is imported or no longer required users or computers are deleted. A corresponding message is displayed when opening a UMC module if the license is exceeded.
de: Ist die Anzahl der lizenzierten Benutzer- oder Rechner-Objekte überschritten, können keine weiteren Objekte in UMC-Modulen mehr angelegt oder bestehende editiert werden, solange keine erweiterte Lizenz eingespielt wird, oder nicht mehr benötigte Benutzer oder Rechner entfernt werden. Beim Öffnen eines UMC-Moduls wird bei überschrittener Lizenz ein entsprechender Hinweis angezeigt.

source: Operating instructions for modules to administrate LDAP directory data
de: Bedienung der Module zur Verwaltung von LDAP-Verzeichnisdaten

source: All UMC modules for managing LDAP directory objects such as user, group and computer accounts or configurations for printers, shares, mail and policies are controlled identically from a structural perspective. The following examples are presented using the user management but apply equally for all modules. The operation of the DNS and DHCP modules is slightly different. Further information can be found in :ref:`ip-config-dns-umc` and :ref:`networks-dhcp-general`.
de: Alle UMC-Module zur Verwaltung von LDAP-Objekten wie z.B. Benutzer-, Gruppen- und Rechnerkonten oder Einstellungen für Drucker, Freigaben, Mail und Richtlinien werden strukturell identisch bedient. Die folgenden Beispiele werden anhand der Benutzerverwaltung dargestellt, gelten aber analog für alle Module. Die Bedienung der DNS- und DHCP-Module weicht etwas ab, weitere Hinweise finden sich in :ref:`ip-config-dns-umc` und :ref:`networks-dhcp-general`.

source: Module overview
de: Modulübersicht

source: The configuration properties/possibilities of the modules are described in the following chapters:
de: Die inhaltlichen Eigenschaften/Konfigurationsmöglichkeiten der Module ist in folgenden Kapiteln beschrieben:

source: Users - :ref:`users-general`
de: Benutzer - :ref:`users-general`

source: Groups - :ref:`groups`
de: Gruppen - :ref:`groups`

source: Computers - :ref:`computers-general`
de: Rechner - :ref:`computers-general`

source: Networks - :ref:`networks-general`
de: Netzwerke - :ref:`networks-general`

source: Shares - :ref:`shares-general`
de: Freigaben - :ref:`shares-general`

source: Printers - :ref:`print-general`
de: Drucker - :ref:`print-general`

source: The use of policies (:ref:`central-policies`) and the LDAP navigation (:ref:`central-navigation`) are described separately.
de: Die Verwendung von Richtlinien (:ref:`central-policies`) und das direkte Durchsuchen des LDAP-Verzeichnisbaums (:ref:`central-navigation`) werden separat beschrieben.

source: Searching for objects
de: Suche nach Objekten

source: The module overview lists all the objects managed by this module. *Search* performs a search for a selection of important attributes (e.g., for user objects by first and last name, primary email address, description, employee number and username). A wildcard search is also possible, e.g., ``m*``.
de: In der Modul-Übersicht werden alle von diesem Modul verwalteten Objekte aufgeführt. Mit :guilabel:`Suche` erfolgt eine Suche über eine Auswahl wichtiger Attribute (z.B. für Benutzerobjekte nach Vor- und Nachname, primärer E-Mail-Adresse, Beschreibung, Mitarbeiternummer und Benutzername). Es kann auch mit Wildcards gesucht werden, z.B. ``m*``.

source: Clicking on the :guilabel:`Advanced options` button (the filter icon) next to the input field displays additional search options:
de: Durch einen Klick auf :guilabel:`Erweiterte Optionen` (das Filter-Icon) werden weitere Suchoptionen angezeigt:

source: The :guilabel:`Search in` field can be used to select whether the complete LDAP directory or only individual LDAP containers/OUs are searched. Further information on the structure of the LDAP directory service can be found in :ref:`central-cn-and-ous`.
de: Mit dem Auswahlfeld :guilabel:`Suche in` kann bestimmt werden, ob bei der Suche nach LDAP-Objekten das komplette LDAP-Verzeichnis oder nur einzelne LDAP-Container/OUs durchsucht werden. Weitere Informationen zur Strukturierung des LDAP-Verzeichnisdienstes finden sich in :ref:`central-cn-and-ous`.

source: The :guilabel:`Property` field can be used to search for a certain attribute directly.
de: Über das Auswahlfeld :guilabel:`Eigenschaft` kann gezielt nach einem bestimmten Attribut gesucht werden.

source: The majority of the modules administrate a range of types of LDAP objects; the computer management for example administrates different objects for the individual system roles. The search can be limited to one type of LDAP object.
de: Die meisten Module verwalten mehrere verschiedene Arten von LDAP-Objekten; die Rechnerverwaltung z.B. verwaltet verschiedene Objekte für die einzelnen Systemrollen. Die Suche kann auf eine Art von LDAP-Objekt beschränkt werden.

source: Some of the internally used user groups and groups (e.g., for domain joins) are not shown by default. If the :guilabel:`Include hidden objects` option is enabled, these objects are also shown.
de: Einige nur intern verwendete Benutzer und Gruppen (z.B. für den Domänenbeitritt) werden standardmäßig ausgeblendet. Wird die Option :guilabel:`Versteckte Objekte anzeigen` aktiviert, werden diese Objekte ebenfalls angezeigt.

source: Searching for users
de: Suche nach Benutzern

source: Creating objects
de: Anlegen von Objekten

source: At the top of the table that shows the objects is a toolbar which can be used to create a new object using :guilabel:`Add`.
de: In der Zeile über der Tabelle mit den Objekten findet sich eine Aktionsleiste, über die mit :guilabel:`Hinzufügen` ein neues Objekt angelegt werden kann.

source: There are simplified wizards for some UMC modules (users, hosts), in which only the most important settings are requested. All attributes can be shown by clicking on :guilabel:`Advanced`.
de: Für einige UMC-Module (Benutzer, Rechner) existieren vereinfachte Assistenten, in denen nur die wichtigsten Einstellungen abfragt werden. Durch einen Klick auf :guilabel:`Erweitert` werden alle Attribute angezeigt.

source: Editing objects
de: Bearbeiten von Objekten

source: Right-clicking on an LDAP object and selecting :guilabel:`Edit` allows to edit the object. The individual attributes are described in the individual documentation chapters. By clicking on :guilabel:`Save` at the top of the module, all changes are written into the LDAP directory. The :guilabel:`Back` button cancels the editing and returns to the previous search view.
de: Durch Rechtsklick auf ein LDAP-Objekt und Auswahl von :guilabel:`Bearbeiten` kann ein Objekt bearbeitet werden. Die einzelnen Attribute sind in den entsprechenden Abschnitten beschrieben. Mit einem Klick auf :guilabel:`Speichern` ganz oben im Modul werden alle vorgenommenen Anpassungen in das LDAP-Verzeichnis übernommen. Die Schaltfläche :guilabel:`Zurück` bricht die Bearbeitung ab und kehrt zur vorherigen Suchansicht zurück.

source: In front of every item in the result list is a checkbox with which individual objects can be selected. The selection status is also displayed in toolbar at the top of the table, e.g., *2 users of 102 selected*. If more than one object is selected, clicking on the :guilabel:`Edit` button in the toolbar activates the multi edit mode. The same attributes are now shown as when editing an individual object, but the changes are only accepted for the objects where the :guilabel:`Overwrite` checkbox is activated. Only objects of the same type can be edited at the same time.
de: Vor jedem Eintrag in der Ergebnisliste ist eine Checkbox, mit dem einzelne Objekte ausgewählt werden können. Der Auswahlstatus wird zusätzlich in der Aktionsleiste der Tabelle dargestellt, z.B. *2 Benutzer von 102 sind ausgewählt*. Ist mehr als ein Objekt selektiert, wird nach einem Klick auf :guilabel:`Bearbeiten` in der Aktionsleiste der Mehrfachbearbeitungsmodus aktiviert. Hierbei werden dieselben Attribute angezeigt wie bei der Bearbeitung eines einzelnen Objekts, Änderungen werden aber nur für die Objekte übernommen, bei denen die :guilabel:`Überschreiben`-Checkbox aktiviert wird. Es können nur Objekte gleichen Typs bearbeitet werden.

source: Deleting objects
de: Löschen von Objekten

source: Right-clicking on an LDAP object and selecting :guilabel:`Delete` allows to delete the object. The prompt must be confirmed. Some objects use internal references (e.g., a DNS or DHCP object can be associated with computer objects). These can also be deleted by selecting the :guilabel:`Delete referring objects` option.
de: Durch Rechtsklick auf ein LDAP-Objekt und Auswahl von :guilabel:`Löschen` wird das Objekt nach Bestätigung einer Rückfrage gelöscht. Einige Objekte verwenden interne Referenzen (z.B. kann zu Rechner-Objekten ein DNS- oder DHCP-Objekt assoziiert werden). Diese können durch Auswahl der Option :guilabel:`Zugehörige Objekte löschen` ebenfalls entfernt werden.

source: Similar to editing multiple objects at once, multiple objects can be deleted at once via the :guilabel:`Delete` button in the toolbar.
de: Ähnlich wie beim Bearbeiten mehrerer Objekte auf einmal, können mehrere Objekte auf einmal über die Schaltfläche :guilabel:`Löschen` in der Aktionsleiste gelöscht werden.

source: Moving objects
de: Verschieben von Objekten

source: Right-clicking on an LDAP object and selecting :guilabel:`Move to...` allows to to select an LDAP position to which the object should be moved.
de: Durch Rechtsklick auf ein LDAP-Objekt und Auswahl von :guilabel:`Verschieben nach...` kann eine LDAP-Position ausgewählt werden, an die das Objekt verschoben werden soll.

source: Similar to editing multiple objects at once, multiple objects can be moved at once by selecting :menuselection:`More --> Move to...` in the toolbar.
de: Analog zur Auswahl mehrerer Objekte bei der Bearbeitung von Objekten können auch mehrere Objekte auf einmal verschoben werden. Ähnlich wie beim Bearbeiten mehrerer Objekte auf einmal, können mehrere Objekte auf einmal über die Schaltfläche :menuselection:`Mehr --> Verschieben nach...` in der Aktionsleiste verschoben werden.

source: Display of system notifications
de: Anzeige von Systembenachrichtigungen

source: UMC modules can deploy system notifications to alert the user to potential errors like join scripts which have not been run or necessary actions such as available updates. These notifications are shown in the top right corner of the screen and can be viewed again in the Notifications menu, which can be opened by clicking the bell icon in the top right corner of the screen.
de: UMC-Module können den Benutzer durch Systembenachrichtigungen auf potentielle Fehler wie z.B. nicht ausgeführte Join-Skripte, oder nötige Aktionen wie verfügbare Aktualisierungen hinweisen. Die Benachrichtigungen werden in der oberen rechten Ecke eingeblendet und können erneut mit einem Klick auf das Glockensymbol in der oberen rechten Ecke eingesehen werden.

source: Structuring of the domain with user-defined LDAP structures
de: Strukturierung der Domäne durch angepasste LDAP-Strukturen

source: Containers and organizational units (OU) are used to structure the data in the LDAP directory. There is no technical difference between the two types, just in their application:
de: Container und Organisationseinheiten (OU) dienen der Strukturierung der Daten im LDAP-Verzeichnis. Technisch unterscheiden sich beide Typen nicht, sondern eher in der Anwendung:

source: Organizational units usually represent real, existing units such as a department in a company or an institution
de: Organisationseinheiten repräsentieren in der Regel real existierende Einheiten wie z.B. eine Abteilung einer Firma oder einer Behörde

source: Containers are usually used for fictitious units such as all the computers within a company
de: Container werden meistens für fiktive Einheiten wie z.B. alle Computer eines Unternehmens verwendet

source: Containers and organizational units are managed in the UMC module :guilabel:`LDAP directory` and are created with :guilabel:`Add` and the object types *Container: Container* and *Container: Organisational unit*.
de: Container und Organisationseinheiten werden im Modul :guilabel:`LDAP-Verzeichnis` von |UCSUMC| verwaltet und werden mit :guilabel:`Hinzufügen` und den Objekt-Typen *Container: Container* und *Container: Organisationseinheit* angelegt.

source: Containers and OUs can in principle be added at any position in the LDAP; however, OUs cannot be created below containers.
de: Container und OUs dürfen prinzipiell an jeder beliebigen Position im LDAP eingefügt werden, OUs können aber nicht unterhalb von Containern angelegt werden.

source: General tab
de: Reiter Allgemein

source: A random name for the container / organizational unit.
de: Ein beliebiger Name für den Container / die Organisationseinheit.

source: A random description for the container / organizational unit.
de: Eine beliebige Beschreibung für den Container / die Organisationseinheit.

source: Advanced settings tab
de: Reiter Erweiterte Einstellungen

source: *Advanced settings* tab
de: Reiter *Erweiterte Einstellungen*

source: Add to standard ``[object type]`` containers
de: Zu Standard ``[Objekttyp]``-Container hinzufügen

source: If this option is activated, the container or organizational unit will be regarded as a standard container for a certain object type. If the current container is declared the standard user container, for example, this container will also be displayed in users search and create masks.
de: Ist diese Option aktiviert, wird der Container/die Organisationseinheit als Standard-Container für einen bestimmten Objekttyp angesehen. Wird der aktuelle Container etwa als Standard-Benutzercontainer deklariert, wird in den Masken zum Suchen und Anlegen von Benutzern dieser Container ebenfalls angezeigt.

source: Policies tab
de: Reiter Richtlinien

source: The *Policies* tab is described in :ref:`central-policies-assign`.
de: Diese Karteikarte wird in :ref:`central-policies-assign` beschrieben.
