Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/central-management-umc.po
Languages: de

source: Object class to which the attribute entered under *LDAP attribute* belongs.
de: Die Objektklasse, zu welcher das unter *LDAP-Abbildung* eingetragene Attribut gehört.

source: Predefined LDAP schema extensions for extended attributes are provided with the object class ``univentionFreeAttributes``. Further information can be found in :ref:`domain-ldap-extensions`.
de: Für erweiterte Attribute stehen mit der Objektklasse ``univentionFreeAttributes`` vordefinierte LDAP-Schema-Erweiterungen zur Verfügung. Weitere Hinweise finden sich in :ref:`domain-ldap-extensions`.

source: Each LDAP object which should be extended with an attribute is automatically extended with the LDAP object class specified here if a value for the extended attribute has been entered by the user.
de: Jedes LDAP-Objekt, das um ein Attribut erweitert werden soll, wird automatisch um die hier angegebene LDAP-Objektklasse erweitert, wenn vom Benutzer ein Wert für das erweiterte Attribut angegeben wurde.

source: LDAP attribute
de: LDAP-Attribut

source: The name of the LDAP attribute where the values of the LDAP object are to be stored. The LDAP attribute must be included in the specified object class.
de: Der Name des LDAP-Attributs, in dem die Werte am LDAP-Objekt gespeichert werden sollen. Das LDAP-Attribut muss in der angegebenen Objektklasse enthalten sein.

source: Remove object class if the attribute is removed
de: Objektklasse löschen, wenn das Attribut entfernt wird

source: If the value of an extended attribute in a UMC module is deleted, the attribute is removed from the LDAP object. If no further attributes of the registered object class are used in this LDAP object, the *LDAP object class* will also be removed from the LDAP object if this option is activated.
de: Wird der Wert für ein erweitertes Attribut in einem UMC-Module gelöscht, wird das Attribut vom LDAP-Objekt entfernt. Werden an diesem LDAP-Objekt keine weiteren Attribute der angegebenen *Objektklasse* verwendet, wird auch die Objektklasse vom LDAP-Objekt entfernt, sofern diese Option aktiviert ist.

source: Extended attributes - UMC tab
de: Erweiterte Attribute - Reiter UMC

source: *UMC* tab
de: Reiter *UMC*

source: Do not show this extended attribute in UMC modules
de: Dieses erweiterte Attribut nicht in UMC-Modulen anzeigen

source: This option can be activated if an attribute should only be administrated internally instead of by the administrator, e.g., indirectly by scripts. The attribute can then only be set via the command line interface |UCSUDM| and is not displayed in UMC modules.
de: Wenn ein Attribut anstatt durch den Administrator nur intern verwaltet werden soll, - z.B. indirekt durch Skripte - kann diese Option aktiviert werden. Das Attribut kann dann nur über das Kommandozeilen-Interface |UCSUDM| gesetzt werden und wird in UMC-Modulen nicht angezeigt.

source: Exclude from UMC module
de: Von der UMC-Suche ausschließen

source: If it should not be possible to search for an extended attribute in the search window of a wizard, this option can be activated to remove the extended attribute from the list of possible search criteria.
de: Soll im Suchdialog eines Assistenten nicht nach einem erweiterten Attribut gesucht werden können, kann diese Option aktiviert werden, um das erweiterte Attribut aus der Liste der möglichen Sucheigenschaften zu entfernen.

source: This is only needed in exceptional cases.
de: Dies ist nur in Sonderfällen nötig.

source: Ordering number
de: Ordnungsnummer

source: If several extended attributes are to be managed on one tab, the order of the individual attributes on the tab can be influenced here. They are added to the end of the tab or the group in question in ascending order of their numbers.
de: Sollen mehrere erweiterte Attribute auf einer Karteikarte verwaltet werden, kann anhand dieser Positionsnummer die Reihenfolge der Attribute beeinflusst werden. Sie werden in aufsteigender Reihenfolge bestimmt und durch diese Positionsnummer jeweils am Ende der betreffenden Gruppe und Karteikarte angehängt.

source: Assigning consecutive position numbers results in the attributes being ordered on the left and right alternately in two columns. Otherwise, the positioning starts in the left column. If additional attributes have the same position number, their order is random.
de: Fortlaufend vergebene Positionsnummern führen dazu, dass die Attribute jeweils abwechselnd links und rechts zweispaltig angeordnet werden. Ansonsten beginnt die Platzierung in der linken Spalte. Weisen erweiterte Attribute die gleiche Positionsnummer auf, ist deren Reihenfolge zufällig.

source: Overwrite existing widget
de: Existierendes Eingabefeld überschreiben

source: In some cases it is useful to overwrite predefined input fields with extended attributes. If the internal UDM name of an attribute is configured here, its input field is overwritten by this extended attribute. The UDM attribute name can be identified with the command :command:`univention-directory-manager` (see :ref:`central-udm`). This option may cause problems if it is applied to a mandatory attribute.
de: In einigen Fällen ist es sinnvoll, vorgegebene Eingabefelder mit erweiterten Attributen zu überschreiben. Wird hier der interne UDM-Name eines Attributs konfiguriert, wird dessen Eingabefeld von diesem erweiterten Attribut überschrieben. Der UDM-Attributname kann mit dem Befehl :command:`univention-directory-manager` ermittelt werden (siehe :ref:`central-udm`). Es ist zu beachten, dass diese Option bei Pflichtfeldern zu Problemen führen kann.

source: Span both columns
de: Beide Spalten umfassen

source: As standard all input fields are grouped into two columns. This option can be used for overlong input fields, which need the full width of the tab.
de: Alle Eingabefelder werden standardmäßig in zwei Spalten gruppiert. Diese Option kann für überlange Eingabefelder verwendet werden, die sich über die komplette Breite beider Spalten erstrecken sollen.

source: Tab name
de: Name der Karteikarte

source: The name of the tab in UMC modules on which the extended attribute should be displayed. New tabs can also be added here.
de: Der Name der Karteikarte in UMC-Modulen, auf der das erweiterte Attribut angezeigt werden soll. Hier können auch neue Karteikarten hinzugefügt werden.

source: If no tab name is entered, *user-defined* will be used.
de: Wird kein Karteikartenname angegeben, wird *Benutzerdefiniert* verwendet.

source: Translations of tab name
de: Übersetzung des Karteikartennamens

source: Translated tab names can be assigned to the corresponding language code (e.g. ``de_DE`` or ``fr_FR``) in this input field.
de: Um den Namen der Karteikarte zu übersetzen, können in diesem Eingabefeld übersetzte Karteikartennamen zum entsprechenden Sprachcode (z.B. ``de_DE`` oder ``fr_FR``) hinterlegt werden.

source: Overwrite existing tab
de: Existierende Karteikarte überschreiben

source: If this option is activated, the tab in question is overwritten before the extended attributes are positioned on it. This option can be used to hide existing input fields on a predefined tab. It must be noted that this option can cause problems with compulsory fields. If the tab to be overwritten uses translations, the overwriting tab must also include identical translations.
de: Ist diese Option aktiviert, wird die betreffende Karteikarte überschrieben, bevor erweiterte Attribute darauf platziert werden. Mit Hilfe dieser Option können alle vorhandenen Eingabefelder auf einer vorgegebenen Karteikarte ausgeblendet werden. Es ist zu beachten, dass diese Option bei Pflichtfeldern zu Problemen führen kann. Verwendet die zu überschreibende Karteikarte Übersetzungen muss die überschreibende Karteikarte ebenfalls identische Übersetzungen mitbringen.

source: Tab with advanced settings
de: Karteikarte mit erweiterten Einstellungen

source: Settings possibilities which are rarely used can be placed in the extended settings tab
de: Einstellungsmöglichkeiten, die selten verwendet werden, können auf Karteikarten in den erweiterten Einstellungen platziert werden

source: Group name
de: Gruppenname

source: Groups allow the structuring of a tab. A group is separated by a gray horizontal bar and can be shown and hidden.
de: Gruppen ermöglichen die Strukturierung einer Karteikarte. Eine Gruppe wird durch einen grauen Querbalken abgetrennt und kann ein- und ausgeklappt werden.

source: If no group name is specified for an extended attribute, the attribute is placed above the first group entry.
de: Wird bei einem erweiterten Attribute kein Gruppenname angegeben, wird das erweiterte Attribut oberhalb der ersten Gruppe platziert.

source: Translations of group name
de: Übersetzung des Gruppennamens

source: To translate the name of the group, translated group names for the corresponding language code can be saved in this input field (e.g., ``de_DE`` or ``fr_FR``).
de: Um den Namen der Gruppe zu übersetzen, können in diesem Eingabefeld übersetzte Gruppennamen zum entsprechenden Sprachcode (z.B. ``de_DE`` oder ``fr_FR``) hinterlegt werden.

source: Group ordering number
de: Gruppen-Ordnungsnummer

source: If multiple groups are managed in one tab, this position number can be used to specify the order of the groups. They are shown in the ascending order of their position numbers.
de: Sollen mehrere Gruppen auf einer Karteikarte verwaltet werden, kann anhand dieser Positionsnummer die Darstellungsreihenfolge beeinflusst werden. Sie werden in aufsteigender Reihenfolge ihrer Positionsnummern dargestellt.

source: Extended attributes - Data type tab
de: Erweiterte Attribute - Reiter Datentyp

source: *Data type* tab
de: Reiter *Datentyp*

source: Syntax class
de: Syntax-Klasse

source: When values are entered in UMC modules, a syntax check is performed.
de: Bei der Eingabe von Werten nimmt das UMC-Modul eine Syntaxprüfung vor.

source: Apart from standard syntax definitions (``string``) and (``integer``), there are three possibilities for expressing a binary condition. The syntax ``TrueFalse`` is represented at LDAP level using the strings ``true`` and ``false``, the syntax ``TrueFalseUpper`` corresponds to the OpenLDAP boolean values ``TRUE`` and ``FALSE`` and the syntax ``boolean`` does not save any value or the string *1*.
de: Neben Standard-Syntaxdefinitionen für Zeichenketten (``string``), Zahlen (``integer``) gibt es drei Möglichkeiten einen binären Zustand auszudrücken: Die Syntax ``TrueFalse`` wird auf LDAP-Ebene durch die Zeichenketten ``true`` und ``false`` abgebildet, die Syntax ``TrueFalseUpper`` verwendet dagegen die Werte ``TRUE`` und ``FALSE``. Die Syntax ``boolean`` dagegen speichert keinen Wert oder die Zeichenkette *1*.

source: The syntax ``string`` is the default. An overview of the additionally available syntax definitions and instructions on integrating your own syntax can be found in :cite:t:`developer-reference`.
de: Standardmäßig wird die Syntax ``string`` verwendet. Eine Übersicht über die weiteren verfügbaren Syntax-Definitionen und eine Anleitung zur Integration eigener Syntaxen sind in :cite:t:`developer-reference` zu finden.

source: Default value
de: Vorgabewert

source: If a preset value is defined here, new objects to be created will be initialized with this value. The value can still be edited manually during creation. Existing objects remain unchanged.
de: Ist hier ein Vorgabewert definiert, werden Objekte beim Anlegen mit diesem Wert initialisiert. Der Wert kann während des Anlegens noch manuell bearbeitet werden. Bereits bestehende Objekte werden nicht verändert.

source: Multi value
de: Mehrfachwert

source: This option establishes whether a single value or multiple values can be entered in the input mask. The scheme definition of the LDAP attribute specifies whether one or several instances of the attribute may be used in one LDAP object.
de: Diese Option legt fest, ob ein einzelner Wert oder mehrere Werte in der Eingabemaske eingetragen werden können. Die Einstellung muss zur Schema-Definition passen, in der für das verwendete LDAP-Attributes festgelegt ist, ob nur eine oder mehrere Instanzen des Attributs an einem LDAP-Objekt verwendet werden dürfen.

source: Value required
de: Wert wird benötigt

source: If this option is active, a valid value must be entered for the extended attribute in order to create or save the object in question.
de: Ist diese Option aktiv, muss ein gültiger Wert für das erweiterte Attribut eingetragen sein, um das betreffende Objekt anzulegen oder zu speichern.

source: Editable after creation
de: Nachträglich modifizierbar

source: This option establishes whether the object saved in the extended attribute can only be modified when saving the object, or whether it can also be modified subsequently.
de: Diese Option legt fest, ob der im erweiterten Attribut gespeicherte Wert nur während des Anlegens eines Objektes oder auch nachträglich modifiziert werden kann.

source: Value is only managed internally
de: Wert wird nur intern verwaltet

source: If this option is activated, the attribute cannot be modified manually, neither at creation time, nor later. This is useful for internal state information configured through a hook function or internally inside a module.
de: Ist diese Option aktiviert, kann das Attribut nicht manuell gesetzt werden, weder beim Anlegen des Objekts, noch nachträglich. Dies ist sinnvoll für automatisch generierte interne Zustände, die über Hook-Funktionen oder intern in einem Modul gepflegt werden.

source: Copyable
de: Kopierbar

source: Values of this extended attribute are automatically filled into the form when copying a object.
de: Werte dieses erweiterten Attributs werden beim Kopieren eines Objekts automatisch in das Formular eingesetzt.

source: HTTP API of domain management
de: HTTP Schnittstelle (API) der Domänenverwaltung

source: UCS provides an HTTP API for UDM which can be used to inspect, modify, create and delete UDM objects via HTTP requests.
de: UCS stellt eine HTTP API für UDM zur Verfügung, mit der UDM Objekte über HTTP-Anfragen überprüft, geändert, erstellt und gelöscht werden können.

source: For more information on the API please refer to :cite:t:`developer-reference`.
de: Weitere Informationen zur API finden Sie unter :cite:t:`developer-reference`.

source: Chapter contents:
de: Kapitelinhalte:

source: UCS portal page
de: UCS Portalseite

source: The |UCSWEB| is the central tool for managing a UCS domain as well as for accessing installed applications of the domain.
de: Die |UCSWEB| ist das zentrale Werkzeug zur Verwaltung der UCS-Domäne sowie für den Zugriff auf installierte Applikationen derselben.

source: The |UCSWEB| is divided into several pages which all have a similarly designed header. Via the symbols in the top right, one may launch a search on the current page (magnifier) or open the user menu (three bars) (login is possible through the latter). The login at the web interface is done via a central page once for all sub pages of UCS as well as for third party applications as far as a web based *single sign-on* is supported (:ref:`central-management-umc-login`).
de: Die |UCSWEB| untergliedert sich in mehrere Unterseiten, die alle eine ähnlich gestaltete Kopfzeile besitzen. Über die Symbole oben rechts kann eine Suche auf der aktuellen Seite durchgeführt (Lupe) oder das Benutzermenü (drei Balken) geöffnet werden (dort kann man sich auch anmelden). Die Anmeldung an der Oberfläche geschieht über eine zentrale Seite für alle Unterseiten von UCS sowie Drittherstellern, sofern diese einen webbasierten *Single Sign-on* unterstützen (:ref:`central-management-umc-login`).

source: Central starting point for users and administrators for all following actions is the UCS portal page (cf. :numref:`fig-ucs-portal`). By default, the portal page is available on all system roles and allows an overview of all Apps and further services which are installed in the UCS domain. All aspects of the portal page can be customized to match one's needs (:ref:`central-portal`).
de: Zentraler Ausgangspunkt für Benutzer sowie Administratoren für alle weiteren Operationen ist die UCS-Portalseite (siehe :ref:`fig-ucs-portal`). Die Portalseite ist standardmäßig auf allen Systemrollen verfügbar und erlaubt einen Überblick über alle in der UCS-Domäne installierten Apps und weiteren Dienste. Alle Aspekte der Portalseite können umfangreich an die eigenen Bedürfnisse angepasst werden (:ref:`central-portal`).

source: For environments with more than one server, an additional entry to a server overview page is shown on the portal page. This sub page gives an overview of all available UCS systems in the domain. It allows a fast navigation to other systems in order to adjust local settings via UMC modules.
de: Für Umgebungen mit mehr als einem Server ist auf der Portalseite ein Verweis auf eine Serverübersichtseite zu sehen. Diese Unterseite gibt einen Überblick über alle in der Domäne verfügbaren UCS-Systeme. Sie erlaubt die schnelle Navigation hin zu anderen Systemen, um dort z.B. durch UMC-Module Anpassungen an lokalen Einstellungen vorzunehmen.

source: UMC modules are the web based tool for the administration of the UCS domain. There are various modules available for the administration of the different aspects of a domain depending on the respective system role. Installing additional software components may add new UMC modules to the system. :ref:`central-user-interface` describes their general operation.
de: |UCSUMC| (UMC) Module sind das zentrale Werkzeug zur webbasierten Administration der UCS-Domäne, dessen generelle Funktionsweise in :ref:`central-user-interface` beschrieben wird. Für die Administration der unterschiedlichen Aspekte einer Domäne werden je nach Systemrolle verschiedene Module bereit gestellt. Zusätzlich installierte Software-Komponenten können ihre eigenen UMC-Module mitbringen.

source: The subsequent sections detail the usage of various aspects of the domain management. :ref:`central-navigation` gives an overview of the LDAP directory browser. The use of administrative settings via policies is discussed in :ref:`central-policies`. How to extend the scope of function of the domain administration is detailed in :ref:`central-extended-attrs`. :ref:`central-cn-and-ous` details how containers and organizational units can be used to structure the LDAP directory. :ref:`delegated-administration` explains delegating administration rights to additional user groups.
de: Die anschließenden Abschnitte vertiefen die Benutzung einzelner Aspekte der Domänenverwaltung. :ref:`central-navigation` gibt einen Überblick über den LDAP-Verzeichnis-Browser. Die Anwendung von administrativen Einstellungen über Richtlinien wird in :ref:`central-policies` besprochen. Wie genau der Funktionsumfangs der Domänenverwaltung erweitert werden kann, ist in :ref:`central-extended-attrs` beschrieben. :ref:`central-cn-and-ous` vertieft, wie Container und Organisationseinheiten (OU) zur Strukturierung des LDAP-Verzeichnisses genutzt werden können. :ref:`delegated-administration` erläutert das Delegieren von Administrationsrechten an weitere Benutzergruppen.

source: In conclusion, the command line interface of the domain administration is illustrated (:ref:`central-udm`), and the evaluation of domain data via the UCS reporting function are explained (:ref:`central-reports`).
de: Abschließend wird die Kommandozeilenschnittstelle der Domänenverwaltung dargestellt (:ref:`central-udm`) und das Auswerten von Domänendaten über die UCS-Reporting-Funktionalität erläutert (:ref:`central-reports`).

source: The |UCSWEB| is part of Univention Nubus in the *Management UI* component. For more information about Nubus, refer to :ref:`introduction-nubus`
de: Das |UCSWEB| ist Teil von Univention Nubus in der *Management UI* Komponente. Weitere Informationen zu Nubus finden Sie unter :ref:`introduction-nubus`.

source: Introduction
de: Einführung

source: Access
de: Zugriff

source: The |UCSWEB| can be opened on any UCS system via the URL :samp:`https://{servername}/`. Alternatively, access is also possible via the server's IP address. Under certain circumstances it may be necessary to access the services over an insecure connection (e.g., if no SSL certificates have been created for the system yet). In this case, ``http`` must be used instead of ``https`` in the URL. In this case, passwords are sent over the network in plain text!
de: Auf jedem UCS-System kann die |UCSWEB| über die URL :samp:`https://{servername}/` aufgerufen werden. Alternativ ist der Zugriff auch über die IP-Adresse des Servers möglich. Unter besonderen Umständen kann es nötig sein, über eine ungesicherte Verbindung auf die Dienste zuzugreifen (z.B. wenn für das System noch keine SSL-Zertifikate erstellt worden sind). In diesem Fall muss in der URL ``http`` statt ``https`` verwendet werden. Passwörter werden in diesem Fall im Klartext über das Netzwerk gesendet!

source: Browser compatibility
de: Browserunterstützung

source: The |UCSWEB| uses numerous JavaScript and CSS functions. Cookies need to be permitted in the browser. The following browsers are supported:
de: Die |UCSWEB| verwendet für die Darstellung zahlreiche JavaScript- und CSS-Funktionen. Cookies müssen im Browser zugelassen sein. Die folgenden Browser werden unterstützt:

source: :program:`Chrome` as of version 85
de: :program:`Chrome` ab Version 85

source: :program:`Firefox` as of version 78
de: :program:`Firefox` ab Version 78

source: :program:`Microsoft Edge` as of version 88
de: :program:`Microsoft Edge` ab Version 88

source: :program:`Safari` and :program:`Safari Mobile` as of version 13
de: :program:`Safari` und :program:`Safari Mobile` ab Version 13

source: Users with older browsers may experience display problems or the site does not work at all.
de: Auf älteren Browsern können Darstellungsprobleme auftreten oder die Seite funktioniert gar nicht.

source: The |UCSWEB| is available in German and English (and French if it is chosen as language during the installation from DVD); the language to be used can be changed via the entry :guilabel:`Switch language` of the user menu in the upper right corner.
de: Die |UCSWEB| ist in Deutsch und Englisch verfügbar (und Französisch wenn dieses bei der Installation von DVD als Sprache ausgewählt wurde); die Darstellungssprache kann über den Punkt :guilabel:`Sprache ändern` im Benutzermenü der rechten, oberen Ecke geändert werden.

source: Switching between dark and light theme for |UCSWEB|\ s
de: Zwischen dunklem und hellem Theme für |UCSWEB|\ n umschalten

source: All |UCSWEB|\ s have a dark and a light theme that can be switched between with the |UCSUCRV| :envvar:`ucs/web/theme`. The value of :envvar:`ucs/web/theme` corresponds to a CSS file under :file:`/usr/share/univention-web/themes/` with the same name (without file extension). For example, setting :envvar:`ucs/web/theme` to ``light`` will use :file:`/usr/share/univention-web/themes/light.css` as theme for all |UCSWEB|\ s.
de: Alle |UCSWEB|\ n haben ein dunkles und ein helles *Theme*, zwischen denen mit der |UCSUCRV| :envvar:`ucs/web/theme` umgeschaltet werden kann. Der Wert von :envvar:`ucs/web/theme` entspricht einer CSS Datei unter :file:`/usr/share/univention-web/themes/` mit demselben Namen (ohne Dateierweiterung). Wird :envvar:`ucs/web/theme` z.B. auf ``light`` gesetzt, wird :file:`/usr/share/univention-web/themes/light.css` als *Theme* für alle |UCSWEB|\ n verwendet.

source: Creating a custom theme/Adjusting the design of |UCSWEB|\ s
de: Erstellen eines eigenen Themes/Anpassen des Designs von |UCSWEB|\ n
