Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/computers.po
Languages: de

source: In contrast to DHCP, in SLAAC there is no assignment of additional data such as the DNS server to be used. There is an additional protocol for this (DHCPv6), which, however, is not employed in the dynamic assignment. One network card can be used for different IPv6 addresses. The *Identifier* is a unique name for individual addresses. The main address always uses the identifier ``default``; functional identifiers such as ``Interface mail server`` can be assigned for all other addresses.
de: Im Gegensatz zu DHCP wird bei SLAAC keine Zuweisung von weitergehenden Daten wie dem zu verwendenden DNS-Server durchgeführt. Hierfür gibt es mit DHCPv6 ein Zusatzprotokoll, das bei der dynamischen Zuweisung aber nicht zum Einsatz kommt. Eine Netzwerkkarte kann verschiedene IPv6-Adressen bedienen. Der *Bezeichner* ist ein eindeutiger Name für einzelne Adressen. Die Haupt-Adresse verwendet immer den Bezeichner *default*, für alle anderen Adressen können funktionale Bezeichner vergeben werden, z.B. ``Interface-Mailserver``.

source: :envvar:`interfaces/ethX/ipv6/acceptRA` activates SLAAC
de: :envvar:`interfaces/ethX/ipv6/acceptRA` aktiviert SLAAC

source: Further network settings can be performed under :guilabel:`Global network settings`.
de: Unter :guilabel:`Globale Netzwerk-Einstellungen` können weitere netzwerkbezogene Einstellungen vorgenommen werden.

source: The IP addresses for the standard gateways in the subnetwork can be entered under *Gateway (IPv4)* and *Gateway (IPv6)*. It is not obligatory to enter a gateway for IPv6, but recommended. A gateway configured here has preference over router advertisements, which might otherwise be able to change the route.
de: Unter *Gateway (IPv4)* und *Gateway (IPv6)* können die für die IP-Adresse im Subnetz eingesetzten Standard-Gateways für IPv4 und IPv6 eingegeben werden. Für IPv6 ist die Angabe eines Gateways nicht erforderlich, wird jedoch empfohlen. Ein hier konfiguriertes IPv6-Gateway hat Vorrang vor Router Advertisements, die ansonsten die Route ändern könnten.

source: Configuring the name servers
de: Konfiguration der Nameserver

source: There are two types of DNS servers:
de: Zwei Typen von DNS-Servern werden unterschieden:

source: External DNS Server
de: Externer DNS Server

source: An *External DNS Server* is employed for the resolution of host names and addresses outside of the UCS domain, e.g., ``univention.de``. This is typically a name server operated by the internet provider.
de: Ein *externer DNS-Server* wird für die Auflösung von Rechnernamen und Adressen außerhalb der UCS-Domäne verwendet, z.B. ``univention.de``. Dies ist typischerweise ein Nameserver, der vom Internet Provider betrieben wird.

source: Domain DNS Server
de: Domänen DNS Server

source: A *Domain DNS Server* is a local name server in the UCS domain. This name server usually administrates host names and IP addresses belonging to the UCS domain. If an address is not found in the local inventory, an external DNS server is automatically requested. The DNS data are saved in the LDAP directory service, i.e., all domain DNS servers deliver identical data.
de: Ein *Domänen-DNS-Server* ist ein lokaler Nameserver der UCS-Domäne. Dort werden in der Regel die Rechnernamen und IP-Adressen der UCS-Domäne verwaltet. Wird eine Adresse im lokalen Datenbestand nicht aufgefunden, wird automatisch ein externer DNS-Server angefragt. Die DNS-Daten werden im LDAP-Verzeichnisdienst gespeichert, d.h. alle Domänen-DNS-Server liefern identische Daten aus.

source: A local DNS server is set up on the |UCSPRIMARYDN|, |UCSBACKUPDN| and |UCSREPLICADN| system roles. Here, you can configure which server should be primarily used for the name resolution by entering the *Domain DNS Server*.
de: Auf den Systemrollen |UCSPRIMARYDN|, |UCSBACKUPDN| und |UCSREPLICADN| läuft ein lokaler DNS-Server. Hier kann durch Angabe von *Domänen-DNS-Server* konfiguriert werden, welcher Server primär für die Namensauflösung verwendet wird.

source: :envvar:`nameserver1` to :envvar:`nameserver3`
de: :envvar:`nameserver1` bis :envvar:`nameserver3`

source: :envvar:`dns/forwarder1` to :envvar:`dns/forwarder3`,
de: :envvar:`dns/forwarder1` bis :envvar:`dns/forwarder3`,

source: UCS supports advanced network configurations using bridging, bonding and virtual networks (VLAN):
de: UCS unterstützt komplexe Netzwerk-Konfigurationen mit Bridges, Bonding und VLAN-Netzen:

source: Bridging is often used with virtualization to connect multiple virtual machines running on a host through one shared physical network interface.
de: Bridges werden oft von Virtualisierungslösungen verwendet, um virtualisierte Netzwerkkarten einer virtuellen Maschine mit der physischen Netzwerkkarte des Virtualisierungsservers zu verbinden.

source: Bonding allows failover redundancy for hosts with multiple physical network interfaces to the same network.
de: Bonding erhöht die Ausfallsicherheit, in dem mehrere physikalische Netzwerkkarten für den Zugriff auf ein Netzwerk gebündelt werden.

source: VLANs can be used to separate network traffic logically while using only one (or more) physical network interface.
de: VLANs können verwendet werden um den Netzwerkverkehr in einem physikalischen Netzwerk logisch auf ein oder mehrere virtuelle Unternetze aufzuteilen.

source: Configure bridging
de: Konfiguration von Bridging

source: The most common application scenario for *bridging* is the shared use of a physical network card by one or more virtual machines. Instead of one network card for each virtual machine and the virtualization server itself, all systems are connected via a shared uplink. A bridge can be compared with a switch implemented in software which is used to connect the individual hosts together. The hardware network adapter used is called a *bridge port*.
de: Der häufigste Anwendungsfall für *Bridging* ist die gemeinsame Nutzung einer physischen Netzwerkkarte durch eine oder mehrere virtuelle Maschinen. Anstatt eine Netzwerkkarte für jede virtuelle Maschine und den Virtualisierungsserver selbst zu verwenden, werden alle System durch einen gemeinsamen Uplink angebunden. Eine Bridge kann mit einem in Software realisierten Switch verglichen werden, über den einzelne Hosts miteinander verbunden werden. Die verwendete Hardware-Netzwerkkarte wird als *Bridge Port* bezeichnet.

source: In order to configure a bridge, ``Bridge`` must be selected as the *Interface type* under :guilabel:`Add`. The *Name of new bridge interface* can be selected at will. Then click on :guilabel:`Next`.
de: Um eine Bridge zu konfigurieren muss unter :guilabel:`Hinzufügen` als *Netzwerkgerätetyp* ``Bridge`` ausgewählt werden. Der *Name des neuen Bridge-Netzwerkgerätes* kann beliebig gewählt werden. Anschließend muss auf :guilabel:`Weiter` geklickt werden.

source: The physical network card intended to act as the uplink can be selected under *Bridge ports*. In the typical scenario of connecting virtual machines via just one network card, there is no risk of a network loop. If the bridge is used to connect two Ethernet networks, the spanning tree protocol (STP) is employed to avoid network loops. The Linux kernel only implements STP, not the Rapid STP or Multiple STP versions.
de: Unter *Bridge ports* kann die physische Netzwerkkarte ausgewählt werden, die den Uplink darstellt. Im typischen Anwendungsfall der Anbindung virtueller Maschinen über nur eine Netzwerkkarte kann keine Schleife auftreten. Wird die Bridge zur Verbindung zweier Netzwerkkarten verwendet, wird das Spanning Tree Protocol (STP) zur Vermeidung von Netzwerkschleifen eingesetzt. Der Linux-Kernel implementiert lediglich STP, nicht die Varianten Rapid STP oder Multiple STP.

source: The *Forwarding delay* setting configures the waiting time in seconds during which information is collected about the network topology when a connection is being made via STP. If the bridge is used for connecting virtual machines to one physical network card, STP should be disabled by setting the value to ``0``. Otherwise problems may occur when using DHCP, as the packets sent during the waiting time are not forwarded.
de: Die Einstellung *Forwarding delay* konfiguriert die Wartezeit in Sekunden, während der bei Aufbau einer Verbindung durch STP Informationen über die Netzwerktopologie gesammelt werden. Wird die Bridge zur Anbindung virtueller Maschinen über eine physische Netzwerkkarte verwendet, sollte STP dann deaktiviert werden, in dem der Wert auf ``0`` gesetzt wird. Ansonsten kann es zu Problemen bei der Verwendung von DHCP führen, da die während der Wartezeit versendeten Pakete nicht weitergeleitet werden.

source: The *Additional bridge options* input field can be used to configure arbitrary bridge parameters. This is only necessary in exceptional cases; an overview of the possible settings can be found on the manual page :manpage:`bridge-utils-interfaces(5)`.
de: Über das Eingabefeld *Weitere Geräteoptionen* können beliebige weitere Bridge-Parameter konfiguriert werden. Dies ist nur in Ausnahmefällen nötig, eine Übersicht der möglichen Einstellungen findet sich in der Manpage :manpage:`bridge-utils-interfaces(5)`.

source: Clicking on :guilabel:`Next` offers the possibility of optionally assigning the bridge an IP address. This interface can then also be used as a network interface for the virtualization host. The options are the same as described in :ref:`computers-ipv4` and :ref:`computers-ipv6`.
de: Nach einem Klick auf :guilabel:`Weiter` kann der Bridge optional eine IP-Adresse zugewiesen werden. Diese kann dann auch als Netzwerkinterface auf dem Virtualisierungshost verwendet werden. Die Einstellungsmöglichkeiten sind dieselben wie in :ref:`computers-ipv4` und :ref:`computers-ipv6` beschrieben.

source: Configure bonding
de: Konfiguration von Bonding

source: *Bonding* can be used to bundle two (or more) physical network cards in order to increase the performance or improve redundancy in failover scenarios.
de: Mit *Bonding* können zwei (oder mehr) physische Netzwerkkarten zur Erhöhung des Durchsatzes oder zur Verbesserung der Redundanz in Failoverszenarien gebündelt werden.

source: In order to configure a bonding, ``Bonding`` must be selected as the *Interface type* under :guilabel:`Add`. The *Name of the bonding interface* can be selected at will. Then click on :guilabel:`Next`.
de: Um ein Bonding zu konfigurieren muss unter :guilabel:`Hinzufügen` als *Netzwerkgerätetyp* ``Kanalbündelung (Bonding)`` ausgewählt werden. Der *Name des neuen Bonding-Netzwerkgerätes* kann beliebig gewählt werden. Anschließend muss auf :guilabel:`Weiter` geklickt werden.

source: The network cards which form part of the bonding interface are selected under *Bond slaves*. The network cards which should be given preference in failover scenarios (see below) can be selected via *Bond primary*.
de: Unter *Bond slaves* werden die Netzwerkkarten ausgewählt, die Teil des Bonding-Interfaces sind. Für das Failover-Szenarien (s.u.) können über *Bond primary* die Netzwerkkarten ausgewählt werden, die bevorzugt verwendet werden sollen.

source: The *Mode* configures the distribution of the network cards within the bonding:
de: Der *Modus* konfiguriert die Verteilung der Netzwerkkarten innerhalb des Bondings:

source: ``balance-rr (0)`` distributes the packets equally over the available network interfaces within the bonding one after the other. This increases performance and improves redundancy. In order to use this mode, the network switches used must support *link aggregation*.
de: ``balance-rr (0)`` verteilt die Pakete der Reihe nach gleichmässig auf die verfügbaren Netzwerkschnittstellen innerhalb des Bondings. Dies erhöht den Durchsatz und verbessert die Ausfallsicherheit. Zur Verwendung dieser Variante müssen die verwendeten Netzwerk-Switches *Link Aggregation* unterstützen.

source: When ``active-backup (1)`` is used, only one network card is active for each bonding interface (by default this is the network interface configured in *Bond primary*). If the primary network card fails, this is detected by the Linux kernel, which switches to another card in the bonding. This version increases redundancy. It can be used with every network switch.
de: Bei Verwendung von ``active-backup (1)`` ist nur jeweils eine Netzwerkkarte des Bonding-Interfaces aktiv (in der Grundeinstellung die Netzwerkschnittstelle aus *Bond primary*). Fällt die primäre Netzwerkkarte aus, wird dies durch den Linux-Kernel erkannt und auf eine der weiteren Karten des Bondings umgeschaltet. Diese Variante erhöht die Ausfallsicherheit. Sie kann mit jedem Netzwerk-Switch verwendet werden.

source: In addition, there are also a number of other bonding methods. These are generally only relevant for special cases and are described under `Linux Ethernet Bonding Driver HOWTO <kernel-bonding_>`_.
de: Darüber hinaus existieren noch weitere Bonding-Methoden. Diese sind in der Regel nur für Sonderfälle relevant und sind unter `Linux Ethernet Bonding Driver HOWTO <kernel-bonding_>`_ beschrieben.

source: The Media Independent Interface (MII) of the network cards is used to detect failed network adapters. The *MII link monitoring frequency* setting specifies the testing interval in milliseconds.
de: Zur Erkennung ausgefallener Netzwerkverbindungen wird das Media Independent Interface (MII) der Netzwerkkarten verwendet. Die Einstellung *MII link monitoring frequency* legt das Prüfintervall in Millisekunden fest.

source: All other bonding parameters can be configured under *Additional bonding options*. This is only necessary in exceptional cases; an overview of the possible settings can be found under `Linux Ethernet Bonding Driver HOWTO <kernel-bonding_>`_.
de: Unter *Weitere Bonding-Optionen* können beliebige weitere Bonding-Parameter konfiguriert werden. Dies ist nur in Ausnahmefällen nötig, eine Übersicht der möglichen Einstellungen findet sich in `Linux Ethernet Bonding Driver HOWTO <kernel-bonding_>`_.

source: Clicking on :guilabel:`Next` allows to optionally assign the bonding interface an IP address. If one of the existing network cards which form part of the bonding interface has already been assigned an IP address, this configuration will be removed. The options are the same as described in :ref:`computers-ipv4` and :ref:`computers-ipv6`.
de: Nach einem Klick auf :guilabel:`Weiter` kann dem Bonding-Interface eine IP-Adresse zugewiesen werden. Sollte eine der bestehenden Netzwerkkarten, die Bestandteil des Bonding-Interfaces sind, schon eine IP-Adresse zugewiesen haben, so wird diese Konfiguration entfernt. Die Einstellungsmöglichkeiten sind dieselben wie in :ref:`computers-ipv4` und :ref:`computers-ipv6` beschrieben.

source: Configure VLAN
de: Konfiguration VLAN

source: VLANs can be used to separate the network traffic in a physical network logically over one or more virtual subnetworks. Each of these virtual networks is an independent broadcast domain. This makes it e.g. possible to differentiate between a network for the employees and a guest network for visitors in a company network although they use the same physical cables. The individual end devices can be assigned to the VLANs via the configuration of the switches. The network switches must support 802.1q VLANs.
de: VLANs können verwendet werden um den Netzwerkverkehr in einem physischen Netzwerk logisch auf ein oder mehrere virtuelle Unternetze aufzuteilen. Jedes dieser virtuellen Netze ist eine eigenständige Broadcast-Domäne. So kann etwa in einem Firmennetzwerk das Netz für die Mitarbeiter von einem Gastnetz für Besucher unterschieden werden, obwohl die selbe physikalische Verkabelung genutzt wird. Die Zuordnung der einzelnen Endgeräte zu den VLANs erfolgt durch Konfiguration auf den verwendeten Switches. Die Netzwerk-Switches müssen 802.1q VLANs unterstützen.

source: A distinction is made between two types of connections between network cards:
de: Es werden zwei Typen von Verbindungen zwischen Netzwerkkarten unterschieden:

source: A connection only transports packets from a specific VLAN. In this case, untagged data packets are transmitted.
de: Eine Verbindung transportiert nur Pakete eines spezifischen VLANs. In diesem Fall werden die Datenpakete ungetagged übertragen.

source: This is typically the case if only one individual end device is connected via this network connection.
de: Dies ist typischerweise der Fall, wenn nur ein einzelnes Endgerät über diese Netzwerkverbindung angebunden wird.

source: A connection transports packets from several VLANs. This is also referred to as a trunk link. In this case, each packet is assigned to a VLAN using a VLAN ID. During transmission between trunk links and specific VLANs, the network switch takes over the task of filtering the packets by means of the VLAN IDs as well as adding and removing the VLAN IDs.
de: Eine Verbindung transportiert Pakete aus mehreren VLANs. Dies wird auch als *trunk link* bezeichnet. In diesem Fall ist jedes Paket über eine VLAN-ID einem VLAN zugeordnet. Bei der Weiterleitung zwischen *trunk links* und spezifischen VLANs übernimmt der Netzwerk-Switch die Aufgabe, anhand der VLAN-IDs die Pakete zu filtern und die VLAN-IDs hinzuzufügen und zu entfernen.

source: This type of connection is primarily used between switches/servers.
de: Diese Verbindungsart wird vornehmlich zwischen Switches und Servern eingesetzt.

source: Some switches also allow the sending of packets with and without VLAN tags over a shared connection, but this is not described in more detail here.
de: Einige Switches erlauben es auch Pakete mit und ohne VLAN-Tag über eine gemeinsame Verbindung zu schicken, darauf wird hier aber nicht weiter eingegangen.

source: When configuring a VLAN in the UMC module :guilabel:`Network settings` it is possible to configure for a computer which VLANs it wants to participate in. An example here would be an internal company web server, which should be available both to the employees and any users of the guest network.
de: Mit der Konfiguration eines VLANs im UMC-Modul :guilabel:`Netzwerk-Einstellungen` kann für einen Rechner konfiguriert werden, an welchen VLANs er teilnehmen möchte. Ein Beispiel wäre ein interner Firmen-Webserver, der sowohl für die Mitarbeiter, als auch für die Benutzer des Gastnetzes verfügbar sein soll.

source: In order to configure a VLAN, ``Virtual LAN`` must be selected as the *Interface type* under :guilabel:`Add`. The network interface for which the VLAN is specified with *Parent interface*. The *VLAN ID* is the unique identifier of the VLAN. Valid values are from 1 to 4095. Then :guilabel:`Next` must be clicked.
de: Um ein VLAN zu konfigurieren muss unter :guilabel:`Hinzufügen` als *Netzwerkgerätetyp* ``Virtuelles LAN`` ausgewählt werden. Die Netzwerkschnittstelle, für die das VLAN konfiguriert wird, wird mit *Übergeordnetes Netzwerkgerät* angegeben. Die *VLAN ID* ist der eindeutige Bezeichner für das VLAN. Gültige Werte sind 1 bis 4095. Anschließend muss auf :guilabel:`Weiter` geklickt werden.

source: Clicking on :guilabel:`Next` allows to optionally assign the VLAN interface an IP address. The options are the same as described in :ref:`computers-ipv4` and :ref:`computers-ipv6`. When assigning an IP address, ensure that the address matches the assigned VLAN address range.
de: Nach einem Klick auf :guilabel:`Weiter` kann dem VLAN-Interface eine IP-Adresse zugewiesen werden. Die Einstellungsmöglichkeiten sind dieselben wie in :ref:`computers-ipv4` und :ref:`computers-ipv6` beschrieben. Bei der Vergabe einer IP-Adresse muss darauf geachtet werden, dass die Adresse zum zugeordneten VLAN-Adressbereich passt.

source: Proxy access configuration
de: Konfiguration des Proxyzugriffs

source: The majority of the command line tools which access web servers (e.g., :command:`wget`, :command:`elinks` or :command:`curl`) check whether the environment variable ``http_proxy`` is set. If this is the case, the proxy server set in this variable is used automatically.
de: Die meisten Kommandozeilen-Tools, die Zugriffe auf Webserver durchführen (z.B. :command:`wget`, :command:`elinks` oder :command:`curl`), prüfen, ob die Umgebungsvariable :command:`http_proxy` gesetzt ist. Ist dies der Fall, wird automatisch der in dieser Variable eingestellte Proxy-Server verwendet.

source: The |UCSUCRV| :envvar:`proxy/http` can also be used to activate the setting of this environment variable via an entry in :file:`/etc/profile`.
de: Über die |UCSUCRV| :envvar:`proxy/http` kann das Setzen dieser Umgebungsvariable durch einen Eintrag in :file:`/etc/profile` aktiviert werden.

source: The proxy URL must be specified for this, e.g., ``http://192.0.2.100``. The proxy port can be specified in the proxy URL using a colon, e.g., ``http://192.0.2.100:3128``. If the proxy requires authentication for the accessing user, this can be provided in the form :samp:`http://{username}:{password}@192.0.2.100`.
de: Dabei muss die Proxy-URL angegeben werden, also z.B. ``http://192.0.2.100``. In Proxy-URL kann optional auch die Angabe eines Ports folgen, welcher durch einen Doppelpunkt abzutrennen ist, z.B. ``http://192.0.2.100:3128``. Erfordert der Proxy eine Authentifizierung des zugreifenden Benutzers, so können die Benutzerinformationen in der Form :samp:`http://{username}:{password}@192.0.2.100` übergeben werden.

source: The environment variable is not adopted for sessions currently opened. A new login is required for the change to be activated.
de: Die Umgebungsvariable wird nicht für aktuell geöffnete Sitzungen übernommen. Damit die Änderung aktiv wird, muss eine Neuanmeldung erfolgen.

source: The Univention tools for software updates also support operation via a proxy and query the |UCSUCR| variable.
de: Die UCS-Programme zur Paketverwaltung unterstützen ebenfalls den Betrieb über einen Proxy und lesen die |UCSUCR|-Variable direkt aus.

source: Individual domains can be excluded from use by the proxy by including them separated by commas in the |UCSUCRV| :envvar:`proxy/no_proxy`. Subdomains are taken into account; e.g. an exception for ``software-univention.de`` also applies for ``updates.software-univention.de``.
de: Einzelne Domänen können von der Verwendung des Proxys ausgenommen werden, in dem sie kommasepariert in die |UCSUCRV| :envvar:`proxy/no_proxy` aufgenommen werden. Unterdomänen werden dabei berücksichtigt; eine Ausnahme für ``software-univention.de`` wirkt sich also auch auf ``updates.software-univention.de`` aus.

source: Mounting NFS shares
de: Einbinden von NFS-Freigaben

source: The *NFS mounts* policy of the UMC computer management can be used to configure NFS shares, which are mounted on the system. There is a *NFS share* for selection, which is mounted in the file path specified under *Mount point*.
de: Mit der Richtlinie *NFS-Freigaben* in den UMC-Modulen für die Rechnerverwaltung können NFS-Freigaben konfiguriert werden, die auf dem System gemountet werden. Zur Auswahl steht eine *NFS-Freigabe*, die unter dem in *Mount point* angegebenen Dateipfad eingehängt wird.

source: Mounting a NFS share
de: Einbinden einer NFS-Freigabe

source: Collection of list of supported hardware
de: Erfassung von unterstützter Hardware

source: Univention collects information about hardware which is compatible with UCS and in use by customers. The information processed for this is gathered by the UMC module :guilabel:`Hardware information`.
de: Univention erfasst Informationen über Hardware, die mit UCS kompatibel und bei Kunden im Einsatz ist. Die hierbei verarbeiteten Informationen werden über das UMC-Modul :guilabel:`Hardwareinformationen` erfasst.

source: All files are forwarded to Univention anonymously and only transferred once permission has been received from the user.
de: Alle Daten werden dabei anonymisiert an Univention weitergeleitet und erst nach Benutzereinwilligung übermittelt.
