Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/computers.po
Languages: de

source: With very big caches it may be necessary to increase the size of the cache database in the system memory. This can be configured through the |UCSUCR| variables :envvar:`nscd/hosts/maxdbsize`, :envvar:`nscd/group/maxdbsize` and :envvar:`nscd/passwd/maxdbsize`.
de: Bei sehr großen Caches kann es nötig sein, die Größe der Cache-Datenbank im Arbeitsspeicher zu erhöhen. Dies kann mit den |UCSUCR|-Variablen :envvar:`nscd/hosts/maxdbsize`, :envvar:`nscd/group/maxdbsize` und :envvar:`nscd/passwd/maxdbsize` konfiguriert werden.

source: As standard, five threads are started by NSCD. In environments with many accesses it may prove necessary to increase the number via the |UCSUCRV| :envvar:`nscd/threads`.
de: Standardmäßig startet NSCD fünf Threads. In Umgebungen, in denen viele Zugriffe erfolgen, kann es erforderlich sein, die Anzahl durch die |UCSUCRV| :envvar:`nscd/threads` zu erhöhen.

source: In the basic setting, a resolved group or hostname is kept in cache for one hour, a username for ten minutes. With the |UCSUCR| variables :envvar:`nscd/group/positive_time_to_live`, :envvar:`nscd/hosts/positive_time_to_live` and :envvar:`nscd/passwd/positive_time_to_live` these periods can be extended or diminished (in seconds).
de: In der Grundeinstellung wird ein aufgelöster Gruppen- oder Rechnername eine Stunde im Cache vorgehalten und ein Benutzername zehn Minuten. Durch die |UCSUCR|-Variablen :envvar:`nscd/group/positive_time_to_live`, :envvar:`nscd/hosts/positive_time_to_live` und :envvar:`nscd/passwd/positive_time_to_live` können diese Zeiträume erweitert oder verringert werden (die Angabe erfolgt in Sekunden).

source: From time to time it might be necessary to manually invalidate the cache of the NSCD. This can be done individually for each cache table with the following commands:
de: Gelegentlich kann es nötig sein, den Cache des NSCD manuell zu invalidieren. Dies kann individuell pro Cache-Tabelle durch folgende Befehle geschehen:

source: The verbosity of the log messages can be configured through the |UCSUCRV| :envvar:`nscd/debug/level`.
de: Der Detailgrad der Logmeldungen kann mit der |UCSUCRV| :envvar:`nscd/debug/level` konfiguriert werden.

source: SSH login to systems
de: SSH-Zugriff auf Systeme

source: When installing a UCS system, an SSH server is also installed per preselection. SSH is used for realizing encrypted connections to other hosts, wherein the identity of a host can be assured via a check sum. Essential aspects of the SSH server's configuration can be adjusted in |UCSUCR|.
de: Bei der Installation eines UCS-Systems wird in der Vorauswahl ein SSH-Server mitinstalliert. Über SSH können verschlüsselte Verbindungen zu Rechnern aufgebaut werden, wobei auch die Identität eines Rechners über eine Prüfsumme sichergestellt werden kann. Wesentliche Aspekte der Konfiguration des SSH-Servers lassen sich über |UCSUCR| anpassen.

source: By default the login of the privileged ``root`` user is permitted by SSH (e.g. for configuring a newly installed system where no users have been created yet, from a remote location).
de: Standardmäßig ist der Login des privilegierten ``root``-Benutzers per SSH erlaubt (etwa um ein neu installiertes System an einem entfernten Standort zu konfigurieren, auf dem noch keine weiteren Benutzer angelegt wurden).

source: If the |UCSUCRV| :envvar:`sshd/permitroot` is set to ``without-password``, then no interactive password request will be performed for the ``root`` user, but only a login based on a public key. By this means brute force attacks to passwords can be avoided.
de: Wird die |UCSUCRV| :envvar:`sshd/permitroot` auf ``without-password`` gesetzt, so wird für den ``root``-Benutzer keine interaktive Passwort-Abfrage mehr durchgeführt, sondern beispielsweise nur eine Public-Key-basierte Anmeldung, was Brute-Force-Attacken auf Passwörter vermeidet.

source: To prohibit SSH login completely, this can be deactivated by setting the |UCSUCRV| :envvar:`auth/sshd/user/root` to ``no``.
de: Soll für den ``root``-Benutzer überhaupt keine SSH-Anmeldung mehr möglich sein, kann dies durch Setzen der |UCSUCRV| :envvar:`auth/sshd/user/root` auf ``no`` deaktiviert werden.

source: The |UCSUCRV| :envvar:`sshd/xforwarding` can be used to configure whether an X11 output should be passed on via SSH. This is necessary, for example, for allowing a user to start a program with graphic output on a remote computer by logging in with :command:`ssh -X TARGETHOST`. Valid settings are ``yes`` and ``no``.
de: Mit der |UCSUCRV| :envvar:`sshd/xforwarding` kann konfiguriert werden, ob eine X11-Ausgabe über SSH weitergeleitet werden soll. Dies ist u.a. nötig, um einem Benutzer die Möglichkeit zu geben durch einen Login mit :command:`ssh -X ZIELRECHNER` ein Programm mit grafischer Ausgabe auf einem entfernten Rechner zu starten. Die möglichen Einstellungen sind ``yes`` und ``no``.

source: The standard port for SSH connections is port 22 via TCP. If a different port is to be used, this can be arranged via the |UCSUCRV| :envvar:`sshd/port`.
de: Der Standard-Port für SSH-Verbindungen ist Port 22 über TCP. Wenn ein abweichender Port verwendet werden soll, kann dies über die |UCSUCR|-Variable :envvar:`sshd/port` konfiguriert werden.

source: Configuring the time zone / time synchronization
de: Konfiguration der Zeitzone / Zeitsynchronisation

source: The time zone in which a system is located can be changed in the UMC module :guilabel:`Language settings` under :menuselection:`Time zone and keyboard settings --> Time zone`.
de: Die Zeitzone, in der ein System angesiedelt ist, kann im UMC-Modul :guilabel:`Sprach-Einstellungen` unter :menuselection:`Zeitzonen- und Tastatureinstellungen --> Zeitzone` geändert werden.

source: Asynchronous system times between individual hosts of a domain can be the source of a large number of errors, for example:
de: Asynchrone Systemzeiten zwischen den einzelnen Rechnern einer Domäne können die Quelle vielfältiger Fehler bedeuten, zum Beispiel:

source: The reliability of log files is impaired.
de: Sie verringern beispielsweise die Verlässlichkeit von Log-Dateien.

source: Kerberos operation is disrupted.
de: Der Kerberos-Betrieb ist gestört.

source: The correct evaluation of the validity periods of passwords can be disturbed.
de: Die korrekte Auswertung von Passwortablaufintervallen kann gestört sein.

source: Usually the |UCSPRIMARYDN| functions as the time server of a domain. With the |UCSUCR| variables :envvar:`timeserver`, :envvar:`timeserver2` and :envvar:`timeserver3` external NTP servers can be included as time sources.
de: In einer Domäne dient standardmäßig der |UCSPRIMARYDN| als Zeitserver. Über die |UCSUCR|-Variablen :envvar:`timeserver`, :envvar:`timeserver2` und :envvar:`timeserver3` können externe NTP-Server als Zeitquelle eingebunden werden.

source: Manual time synchronization can be started by the command :command:`ntpdate`.
de: Eine manuelle Zeitsynchronisation kann durch den Befehl :command:`ntpdate` gestartet werden.

source: Windows clients joined in a Samba/AD domain only accept signed NTP time requests. If the |UCSUCRV| :envvar:`ntp/signed` is set to ``yes``, the NTP replies are signed by Samba/AD.
de: Windows-Clients, die in eine Samba/AD-Domäne gejoint wurden, akzeptieren nur signierte NTP-Zeitanfragen. Wird die |UCSUCRV| :envvar:`ntp/signed` auf ``yes`` gesetzt, werden die NTP-Pakete durch Samba/AD signiert.

source: Configuration of hardware and drivers
de: Konfiguration von Hardware und Treibern

source: Available kernel variants
de: Verfügbare Kernel-Varianten

source: The standard kernel in UCS 5.0 is based on the Linux kernel 4.19. In principle, there are three different types of kernel packages:
de: Der Standard-Kernel in UCS 5.0 basiert auf dem Linux-Kernel 4.19. Prinzipiell sind drei verschiedene Arten von Kernel-Paketen zu unterscheiden:

source: A *kernel image package* provides an executable kernel which can be installed and started.
de: Ein *Kernel-Image-Paket* stellt einen lauffähigen Kernel bereit, der installiert und gestartet werden kann.

source: A *kernel source package* provides the source code for a kernel. From this source, a tailor-made kernel can be created, and functions can be activated or deactivated.
de: Ein *Kernel-Source-Paket* stellt den Quellcode für einen Kernel bereit. Aus diesem kann beispielsweise ein angepasster Kernel erstellt werden, indem Funktionen aktiviert oder deaktiviert werden können.

source: A *kernel header package* provides interface information which is required by external packages if these have to access kernel functions. This information is usually necessary for compiling external kernel drivers.
de: Ein *Kernel-Header-Paket* stellt Schnittstellen-Informationen bereit, die von externen Paketen benötigt werden, wenn diese auf Kernel-Funktionen zugreifen müssen. Sie werden typischerweise zum Übersetzen externer Kernel-Treiber benötigt.

source: Normally, the operation of a UCS system only requires the installation of one kernel image package.
de: Im Regelfall ist für den Betrieb eines UCS-Systems nur die Installation eines Kernel-Image-Paketes notwendig.

source: Several kernel versions can be installed in parallel. This makes sure that there is always an older version available to which can be reverted in case of an error. So-called meta packages are available which always refer to the kernel version currently recommended for UCS. In case of an update, the new kernel version will be installed, making it possible to keep the system up to date at any time.
de: Mehrere Kernel-Varianten können parallel installiert sein. Dies stellt sicher, dass im Fehlerfall immer auf eine ältere Variante zurückgegriffen werden kann. Um ein System trotzdem immer auf dem jeweils aktuellen Stand halten zu können, werden sogenannte Meta-Pakete bereit gestellt, die immer auf die aktuell für UCS empfohlene Kernel-Version verweisen und diese im Update-Fall jeweils nachinstallieren.

source: Hardware drivers / kernel modules
de: Treiber-Management / Kernel-Module

source: The boot process occurs in two steps using an initial RAM disk (*initrd* for short). This is composed of an archive with further drivers and programs.
de: Der Boot-Prozess erfolgt zweistufig unter Verwendung einer Initial RAM Disk (kurz *initrd*). Diese besteht aus einem Archiv mit weiteren Treibern und Programmen.

source: The GRUB boot manager (see :ref:`grub`) loads the kernel and the *initrd* into the system memory, where the *initrd* archive is extracted and mounted as a temporary root file system. The real root file system is then mounted from this, before the temporary archive is removed and the system start implemented.
de: Der Boot-Manager GRUB (siehe :ref:`grub`) lädt den Kernel und die *initrd* in den Arbeitsspeicher, wo das *initrd*-Archiv entpackt und als temporäres Root-Dateisystem gemountet wird. Aus diesem wird dann das tatsächliche Root-Dateisystem eingebunden, woraufhin abschließend das temporäre Archiv wieder entfernt und der Systemstart eingeleitet wird.

source: The drivers to be used are recognized automatically during system start and loaded via the :program:`udev` device manager. At this point, the necessary device links are also created under :file:`/dev/`. If drivers are not recognized (which can occur if no respective hardware IDs are registered or hardware is employed which cannot be recognized automatically, e.g., ISA boards), kernel modules to be loaded can be added via |UCSUCRV| :envvar:`kernel/modules`. If more than one kernel module is to be loaded, these must be separated by a semicolon. The |UCSUCRV| :envvar:`kernel/blacklist` can be used to configure a list of one or more kernel modules for which automatic loading should be prevented. Multiple entries must also be separated by a semicolon.
de: Die zu verwendenden Treiber werden beim Systemstart automatisch erkannt und durch den Device Manager :program:`udev` geladen. Dabei werden außerdem die notwendigen System-Verknüpfungen unter :file:`/dev/` angelegt. Wenn Treiber nicht erkannt werden (was vorkommen kann, wenn keine entsprechenden Hardware-IDs registriert sind oder Hardware verwendet wird, die nicht automatisch erkannt werden kann, etwa ISA-Steckkarten), so können zu ladende Kernel-Module durch die |UCSUCRV| :envvar:`kernel/modules` hinzugefügt werden. Soll mehr als ein Kernel-Modul geladen werden, so müssen diese durch ein Semikolon voneinander getrennt werden. Mit der |UCSUCRV| :envvar:`kernel/blacklist` kann eine Liste von einem oder mehreren Kernel-Modulen konfiguriert werden, für die das automatische Laden verhindert wird. Mehrere Einträge müssen ebenfalls durch ein Semikolon getrennt werden.

source: Unlike other operating systems, the Linux kernel (with very few exceptions) provides all drivers for hardware components from one source. For this reason, it is not normally necessary to install drivers from external sources subsequently.
de: Im Gegensatz zu anderen Betriebssystemen liefert der Linux-Kernel (von wenigen Ausnahmen abgesehen) alle Treiber für Komponenten aus einer Hand. Im Regelfall ist es deshalb nicht notwendig Treiber aus externen Quellen nachzuinstallieren.

source: However, if external drivers or kernel modules are required, they can be integrated via the DKMS framework (Dynamic Kernel Module Support). This provides a standardized interface for kernel sources, which are then built automatically for every installed kernel (insofar as the source package is compatible with the respective kernel). For this to happen, the kernel header package :program:`linux-headers-amd64` must be installed in addition to the :program:`dkms` package. Please note that not all the external kernel modules are compatible with all kernels.
de: Wenn doch externe Treiber oder Kernelmodule benötigt werden, können diese über *Dynamic Kernel Module Support* (DKMS) eingebunden werden. Es stellt eine standardisierte Schnittstelle für Kernelquellen bereit und erlaubt es, Module automatisch für jeden installierten Kernel zu übersetzen. Dazu müssen neben dem Paket :program:`dkms` auch die Kernel-Header-Pakete :program:`linux-headers-amd64` für die gewünschten Kernel installiert werden. Zu beachten ist, dass nicht alle externen Kernelmodule mit allen Kernel kompatibel sind.

source: In |UCSUCS| GNU GRUB 2 is used as the boot manager. GRUB provides a menu which allows the selection of a Linux kernel or another operating system to be booted. GRUB can also access file systems directly and can thus, for example, load another kernel in case of an error.
de: Als Boot-Manager wird in |UCSUCS| GNU GRUB 2 verwendet. GRUB stellt ein Auswahlmenü bereit, aus dem eine zu bootende Linux-Kernel-Variante oder ein weiteres Betriebssystem ausgewählt werden kann. GRUB kann auch direkt auf Dateisysteme zugreifen, so dass im Fehlerfall etwa ein abweichender Kernel geladen werden kann.

source: GRUB menu
de: GRUB-Auswahlmenü

source: GRUB gets loaded in a two-step procedure; in the Master Boot Record of the hard drive, the Stage 1 loader is written which refers to the data of Stage 2, which in turn manages the rest of the boot procedure.
de: GRUB wird in einem zweistufigen Verfahren geladen: in den Master Boot Record der Festplatte wird der Stage 1-Loader geschrieben, der auf die Daten der Stage 2 verweist, welche den Großteil des übrigen Boot-Vorgangs übernimmt.

source: The selection of kernels to be started in the boot menu is stored in the file :file:`/boot/grub/grub.cfg`. This file is generated automatically; all installed kernel packages are available for selection. The memory test program :command:`Memtest86+` can be started by selecting the option :guilabel:`Memory test` and performs a consistency check for the main memory.
de: Die Auswahl der zu startenden Kernel im Boot-Menü wird in der Datei :file:`/boot/grub/grub.cfg` abgelegt. Diese Datei wird automatisch generiert, es stehen alle installierten Kernel-Pakete zur Auswahl. Durch Auswahl der Option :guilabel:`Memory test` kann das Speicher-Testprogramm :command:`Memtest86+` gestartet werden, das Konsistenzprüfungen auf dem Arbeitsspeicher durchführt.

source: There is a five second waiting period during which the kernel to be booted can be selected. This delay can be changed via the |UCSUCRV| :envvar:`grub/timeout`.
de: Standardmäßig wird fünf Sekunden auf die Auswahl des zu bootenden Kernels gewartet. Durch die |UCSUCRV| :envvar:`grub/timeout` kann ein abweichender Wert in Sekunden konfiguriert werden.

source: By default a screen size of ``800x600`` pixels and 16 Bit color depth is preset. A different value can be set via the |UCSUCRV| :envvar:`grub/gfxmode`. Only resolutions are supported which can be set via VESA BIOS extensions. A list of available modes can be found in `VESA BIOS Extensions <w-vesa-bios-extensions_>`_. The input must be specified in the format :samp:`{HORIZONTAL}x{VERTICAL}@{COLOURDEPTHBIT}`, so for example ``1024x768@16``.
de: In der Grundeinstellung wird in einen ``800x600`` Pixel großen Bildschirm unter 16 Bit Farbtiefe gewechselt. Durch die |UCSUCRV| :envvar:`grub/gfxmode` kann ein anderer Modus ausgewählt werden. Es werden nur Auflösungen unterstützt, die über VESA BIOS Extentions gesetzt werden können. Eine Liste der verfügbaren Modi findet sich unter `VESA BIOS Extensions <w-vesa-bios-extentions_>`_. Die Eingabe erfolgt im Format :samp:`{HORIZONTAL}x{VERTIKAL}@{FARBTIEFEBIT}`, also z.B. ``1024x768@16``.

source: Kernel options for the started Linux kernel can be passed with the |UCSUCRV| :envvar:`grub/append`. |UCSUCRV| :envvar:`grub/xenhopt` can be used to pass options to the Xen hypervisor.
de: Kernel-Optionen für die gestarteten Linux-Kernel können mit der |UCSUCRV| :envvar:`grub/append` übergeben werden. Mit der :envvar:`grub/xenhopt` können Optionen an den Xen-Hypervisor übergeben werden.

source: The graphic representation of the boot procedure - the so-called splash screen - can be deactivated by setting |UCSUCRV| :envvar:`grub/bootsplash` to ``nosplash``.
de: Die grafische Darstellung während des Bootvorgangs - der sogenannte Splash-Screen - kann durch Setzen der |UCSUCRV| :envvar:`grub/bootsplash` auf ``nosplash`` deaktiviert werden.

source: Network configuration
de: Netzwerk Konfiguration

source: The configuration of network interfaces can be adjusted with the UMC module :guilabel:`Network settings`.
de: Die Konfiguration von Netzwerk-Interfaces kann über das UMC-Modul :guilabel:`Netzwerk-Einstellungen` angepasst werden.

source: The configuration is saved in |UCSUCR| variables, which can also be set directly. These variables are listed in the individual sections.
de: Die Konfiguration wird in |UCSUCR|-Variablen gespeichert, die auch direkt gesetzt werden können. Die Variablen sind in den einzelnen Abschnitten aufgeführt.

source: Configuring the network settings
de: Konfiguration der Netzwerkeinstellungen

source: All the network cards available in the system are listed under *IPv4 network devices* and *IPv6 network devices* (only network interfaces in the :samp:`eth{X}` scheme are shown).
de: Unter *IPv4-Netzwerkgeräte* und *IPv6-Netzwerkgeräte* werden alle im System verfügbaren Netzwerkkarten aufgeführt (es werden nur Netzwerkinterfaces im Schema :samp:`eth{X}` dargestellt).

source: Network interfaces can be configured for IPv4 and/or IPv6. IPv4 addresses have a 32-bit length and are generally written in four blocks in decimal form (e.g., ``192.0.2.10``), whereas IPv6 addresses are four times as long and typically written in hexadecimal form (e.g., ``2001:0DB8:FE29:DE27:0000:0000:0000:0000``).
de: Netzwerkschnittstellen können für IPv4 und/oder IPv6 konfiguriert werden. IPv4-Adressen haben 32 Bit Länge und werden in der Regel in vier Blöcken in Dezimalschreibweise dargestellt (z.B. ``192.0.2.10``), während IPv6-Adressen vier Mal so lang sind und typischerweise hexadezimal dargestellt werden (z.B. ``2001:0DB8:FE29:DE27:0000:0000:0000:0000``).

source: Configuration of IPv4 addresses
de: Konfiguration von IPv4-Adressen

source: If the *Dynamic (DHCP)* option was not chosen, the IP address to be bound to the network card must be entered. In addition to the *IPv4 address* the *net mask* must also be entered. *DHCP query* is used to request an address from a DHCP server. Unless the *Dynamic (DHCP)* option is activated, the values received from the DHCP request are configured statically.
de: Wenn die Option *Dynamisch (DHCP)* nicht gewählt wurde, muss die IP-Adresse eingegeben werden, die an die Netzwerkkarte gebunden werden soll. Zusätzlich zur *IPv4-Adresse* muss die *Netzmaske* angegeben werden. Mit *DHCP-Anfrage* kann eine Adresse von einem DHCP-Server abgefragt werden. Sofern die Option *Dynamisch (DHCP)* nicht aktiviert wird, werden die aus der DHCP-Anfrage erhaltenen Werte dann statisch konfiguriert.

source: Server systems can also be configured via DHCP. This is necessary for some cloud providers, for example. If the assignment of an IP address for a server fails, a random link local address (:samp:`169.254.{x}.{y}`) is configured as a replacement.
de: Auch Server-Systeme können per DHCP konfiguriert werden. Dies ist z.B. bei einigen Cloud-Anbietern notwendig. Schlägt die Vergabe einer IP-Adresse für einen Server fehl, wird ersatzweise eine zufällige Link-Local-Adresse (:samp:`169.254.{x}.{y}`) konfiguriert.

source: For UCS server systems the address received via DHCP is also written to the LDAP directory.
de: Die über DHCP erhaltene Adresse wird für UCS-Serversysteme auch in das LDAP-Verzeichnis geschrieben.

source: Not all services (e.g., DNS servers) are suitable for use on a DHCP-based server.
de: Nicht alle Dienste (z.B. DNS-Server) sind für eine Verwendung auf einem DHCP-basierten Server geeignet.

source: UCR variables:
de: UCR Variablen:

source: Besides the physical interfaces, additional virtual interfaces can also be defined in the form :envvar:`interfaces/ethX_Y/setting`.
de: Neben den physischen Interfaces können auch zusätzliche virtuelle Interfaces in der Form :envvar:`interfaces/ethX_Y/setting` definiert werden.

source: Configuration of IPv6 addresses
de: Konfiguration von IPv6-Adressen

source: The IPv6 address can be configured in two ways: Stateless address autoconfiguration (SLAAC) is employed in the :guilabel:`Autoconfiguration (SLAAC)` configuration. In this, the IP address is assigned from the routers of the local network segment. Alternatively, the address can also be configured statically by entering the *IPv6 address* and *IPv6 prefix*.
de: Die IPv6-Adresse kann auf zwei Arten konfiguriert werden: Bei der :guilabel:`Automatischen Konfiguration (SLAAC)` kommt Stateless Address Autoconfiguration (SLAAC) zum Einsatz. Dabei wird die IP-Adresse von den Routern des lokalen Netzsegmentes zugewiesen. Alternativ kann die Adresse auch durch Angabe von *IPv6-Adresse* und *IPv6-Präfix* statisch konfiguriert werden.
