Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/computers.po
Languages: de

source: Inline Python code can also be integrated for more complicated scenarios, which then also allows more complicated constructions such as conditional assignments.
de: Für komplexere Szenarien kann auch Inline-Python-Code integriert werden, der dann auch komplexere Konstrukte wie etwa bedingte Abfragen erlaubt.

source: |UCSUCR| templates are included in the corresponding software packages as configuration files. When packages are updated, a check is performed for whether any changes have been made to the configuration files.
de: |UCSUCR|-Templates sind in den entsprechenden UCS-Software-Paketen als Konfigurationsdateien enthalten. Bei der Aktualisierung von Paketen wird überprüft, ob Änderungen an Konfigurationsdateien vorgenommen wurden.

source: If configuration files are no longer there in the form in which they were delivered, they will not be overwritten. Instead a new version will be created in the same directory with the ending :file:`.debian.dpkg-new`.
de: Wenn Konfigurationsdateien nicht mehr im Auslieferungszustand vorliegen, werden diese nicht überschrieben. Stattdessen wird eine neue Version im selben Verzeichnis mit der Endung :file:`.debian.dpkg-new` abgelegt.

source: If changes are to be made on the |UCSUCR| templates, these templates are also not overwritten during the update and are instead re-saved in the same directory with the ending :file:`.dpkg-new` or :file:`.dpkg-dist`. Corresponding notes are written in the :file:`/var/log/univention/actualise.log` log file. This only occurs if UCR templates have been locally modified.
de: Sollen Änderungen an |UCSUCR|-Templates vorgenommen werden, werden diese Templates bei der Aktualisierung ebenfalls nicht überschrieben und im selben Verzeichnis mit der Endung :file:`.dpkg-new` oder :file:`.dpkg-dist` abgelegt. Entsprechenden Hinweise werden in die Log-Datei :file:`/var/log/univention/updater.log` geschrieben. Dies tritt nur auf, wenn UCR-Templates lokal angepasst werden.

source: The UCR templates are stored in the :file:`/etc/univention/templates/files/` directory. The path to the templates is the absolute path to the configuration file with the prefixed path to the template directory. For example, the template for the :file:`/etc/issue` configuration file can be found under :file:`/etc/univention/templates/files/etc/issue`.
de: Die UCR-Templates werden im Verzeichnis :file:`/etc/univention/templates/files/` abgelegt. Der Pfad zu den Vorlagen entspricht dem absoluten Pfad zu der Konfigurationsdatei mit vorangestelltem Pfad zum Vorlagenverzeichnis. So findet sich zum Beispiel die Vorlage für die Konfigurationsdatei :file:`/etc/issue` unter :file:`/etc/univention/templates/files/etc/issue`.

source: For the configuration files to be processed correctly by |UCSUCR| they must be in UNIX format. If configuration files are edited in DOS or Windows, for example, control characters are inserted to indicate line breaks, which can disrupt the way |UCSUCR| uses the file.
de: Damit Konfigurationsdateien von |UCSUCR| korrekt verarbeitet werden können, müssen sie im UNIX-Format vorliegen. Werden Konfigurationsdateien z.B. unter DOS oder Windows bearbeitet, werden Steuerzeichen zur Kennzeichnung des Zeilenumbruchs eingefügt, die die Verwendung der Datei durch |UCSUCR| stören.

source: Referencing of UCR variables in templates
de: Referenzierung von UCR-Variablen in Templates

source: In the simplest case, a UCR variable can be directly referenced in the template. The variable name framed by the string ``@%@`` represents the wildcard. As an example the option for the activation of X11 forwarding in the configuration file :file:`/etc/ssh/sshd_config` of the OpenSSH server:
de: Im einfachsten Fall kann eine UCR-Variable im Template direkt referenziert werden. Als Platzhalter dient der Variablenname, der von der Zeichenkette ``@%@`` eingefasst wird. Als Beispiel die Option für die Aktivierung von X11-Forwarding in der Konfigurationsdatei :file:`/etc/ssh/sshd_config` des OpenSSH-Servers:

source: Newly added references to UCR variables are automatically evaluated by templates; additional registration is only required with the use of inline Python code (see :ref:`ucr-templates-extend-python`).
de: Neu eingefügte Referenzen auf UCR-Variablen werden automatisch von Templates ausgewertet, eine zusätzliche Registrierung ist nur bei der Verwendung von Inline-Python-Code nötig (siehe :ref:`ucr-templates-extend-python`).

source: Integration of inline Python code in templates
de: Integration von Inline-Python-Code in Templates

source: Any type of Python code can be embedded in UCR templates by entering a code block framed by the string ``@!@``. For example, these blocks can be used to realize conditional requests so that when a parameter is changed via a variable, further dependent settings are automatically adopted in the configuration file. The following code sequence configures for example network settings using the |UCSUCR| settings:
de: In UCR-Templates kann beliebiger Python-Code eingebettet werden, in dem ein von der Zeichenkette ``@!@`` eingefasster Codeblock eingefügt wird. Mit solchen Blöcken können z.B. bedingte Abfragen umgesetzt werden, so dass beim Ändern eines Parameters über eine Variable weitere abhängige Einstellungen automatisch in die Konfigurationsdatei aufgenommen werden. Folgende Code-Sequenz konfiguriert beispielsweise Netzwerk-Einstellungen anhand der |UCSUCR|-Einstellungen:

source: All the data output with the print function are written in the generated configuration file. The data saved in |UCSUCR| can be requested via the ``ConfigRegistry`` object, e.g.:
de: Alle mit der ``print``-Funktion ausgegebenen Daten werden dabei in die generierte Konfigurationsdatei geschrieben. Die in |UCSUCR| gespeicherten Daten können über das ``ConfigRegistry``-Objekt abgefragt werden, z.B.:

source: In contrast to directly referenced UCR variables (see :ref:`ucr-templates-extend-simple`), variables accessed in inline Python code must be explicitly registered.
de: Im Gegensatz zu direkt referenzierten UCR-Variablen (siehe :ref:`ucr-templates-extend-simple`) müssen Variablen, auf die in Inline-Python-Code zugegriffen wird, explizit registriert werden.

source: The |UCSUCR| variables used in the configuration files are registered in *info* files in the :file:`/etc/univention/templates/info/` directory which are usually named after the package name with the file ending :file:`.info`. If new Python code is entered into the templates or the existing code changed in such a way that it requires additional or different variables, one of the existing :file:`.info` files will need to be modified or a new one added.
de: Die in Konfigurationsdateien verwendeten |UCSUCR|-Variablen werden unterhalb des Verzeichnisses :file:`/etc/univention/templates/info/` in *info*-Dateien registriert, die in der Regel nach dem Paketnamen mit der Dateiendung :file:`.info` benannt werden. Wird neuer Python-Code in die Vorlagen eingefügt oder bestehender Code so verändert, dass er zusätzliche oder andere Variablen nutzt, so muss einer der bestehenden :file:`.info`-Dateien modifiziert oder eine neue hinzugefügt werden.

source: Following the changing of :file:`.info` files, the :command:`ucr update` command must be run.
de: Nach der Änderung von :file:`.info`-Dateien muss der Befehl :command:`ucr update` aufgerufen werden.

source: Management of computer accounts via |UCSUMC| module
de: Verwaltung der Rechnerkonten über |UCSUMC| Modul

source: All UCS, Linux and Windows systems within a UCS domain each have a computer domain account (also referred to as the host account) with which the systems can authenticate themselves among each other and with which they can access the LDAP directory.
de: Alle UCS-, Linux- und Windowssysteme innerhalb einer UCS-Domäne verfügen über ein Rechner-Domänenkonto, mit dem sich die Systeme untereinander authentifizieren und mit dem sie auf das LDAP-Verzeichnis zugreifen.

source: The computer account is generally created automatically when the system joins the UCS domain (see :ref:`domain-join`); however, the computer account can also be added prior to the domain join.
de: Das Rechnerkonto wird in der Regel automatisch beim Join des Systems zur UCS-Domäne angelegt (siehe :ref:`domain-join`), das Rechnerkonto kann jedoch auch vor dem Domänenbeitritt angelegt werden.

source: The password for the computer account is generated automatically during the domain join and saved in the :file:`/etc/machine.secret` file. By default the password consists of 20 characters (can be configured via the |UCSUCRV| :envvar:`machine/password/length`). The password is regenerated automatically at fixed intervals (default setting: 21 days; can be configured using the |UCSUCRV| :envvar:`server/password/interval`). Password rotation can also be disabled using the variable :envvar:`server/password/change`.
de: Das Passwort für das Rechnerkonto wird beim Domänenbeitritt automatisch erzeugt und in der Datei :file:`/etc/machine.secret` gespeichert. Das Passwort umfasst in der Grundeinstellung 20 Zeichen (konfigurierbar über die |UCSUCRV| :envvar:`machine/password/length`). Das Passwort wird in festen Intervallen automatisch neu generiert (in der Grundeinstellung 21 Tage, konfigurierbar über die |UCSUCRV| :envvar:`server/password/interval`). Die Passwortrotation kann über die Variable :envvar:`server/password/change` auch deaktiviert werden.

source: There is an different computer object type for every system role. Further information on the individual system roles can be found in :ref:`system-roles`.
de: Für jede Systemrolle existiert ein eigenständiger Rechnerobjekttyp. Weitergehende Hinweise zu den einzelnen Systemrollen finden sich in :ref:`system-roles`.

source: Computer accounts are managed in the UMC module :guilabel:`Computers`.
de: Rechnerkonten werden im UMC-Modul :guilabel:`Rechner` verwaltet.

source: By default a simplified wizard for creating a computer is shown, which only requests the most important settings. All attributes can be shown by clicking on :guilabel:`Advanced`. If there is a DNS forward zone and/or a DNS reverse zone (see :ref:`networks-dns`) assigned to the selected network object (see :ref:`network-objects`), a host record and/or pointer record is automatically created for the host. If there is a DHCP service configured for the network object and a MAC address is configured, a DHCP host entry is created (see :ref:`module-dhcp-dhcp`).
de: In der Grundeinstellung wird zum Anlegen eines Rechners ein vereinfachter Assistent angezeigt, der nur die wichtigsten Einstellungen abfragt. Durch einen Klick auf :guilabel:`Erweitert` werden alle Attribute angezeigt. Ist dem ausgewählten Netzwerk-Objekt (siehe :ref:`network-objects`) eine DNS-Forward-Zone und/oder eine DNS-Reverse-Zone zugeordnet (siehe :ref:`networks-dns`), wird für den Rechner automatisch ein Host-Record und/oder Pointer-Record angelegt. Ist für das Netzwerk-Objekt ein DHCP-Service konfiguriert und eine MAC-Adresse angegeben, wird ein DHCP-Rechner-Eintrag angelegt (siehe :ref:`module-dhcp-dhcp`).

source: The simplified wizard can be disabled for all system roles by setting the |UCSUCRV| :envvar:`directory/manager/web/modules/computers/computer/wizard/disabled` to ``true``.
de: Der vereinfachte Assistent kann für alle Systemrollen deaktiviert werden, indem die |UCSUCRV| :envvar:`directory/manager/web/modules/computers/computer/wizard/disabled` auf ``true`` gesetzt wird.

source: Creating a computer in the UMC module
de: Anlegen eines Rechners im UMC-Modul

source: Advanced computer settings
de: Erweiterte Rechneransicht

source: Computer management module - General tab
de: Modul Rechnerverwaltung - Reiter Allgemein

source: *General* tab
de: Reiter *Allgemein*

source: Attribute
de: Attribut

source: Description
de: Beschreibung

source: The name for the host should be entered in this input field.
de: In dieses Eingabefeld muss der Rechnername eingetragen werden.

source: To guarantee compatibility with different operating systems and services, computer names should only contain the lowercase letters *a* to *z*, numbers, hyphens and underscores. Umlauts and special characters are not permitted. The full stop is used as a separating mark between the individual components of a fully qualified domain name and must therefore not appear as part of the computer name. Computer names must begin with a letter.
de: Um die Kompatibilität mit verschiedenen Betriebssystemen und Diensten zu gewährleisten, sollten Rechnernamen ausschließlich die Buchstaben *a* bis *z* in Kleinschreibung, Zahlen, Bindestriche und Unterstriche enthalten. Umlaute und Sonderzeichen sind nicht erlaubt. Der Punkt wird als Trennzeichen zwischen den einzelnen Bestandteilen eines voll qualifizierten Domänennamens interpretiert und darf deswegen nicht innerhalb des Rechnernamens verwendet werden. Rechnernamen sollten mit einem Buchstaben beginnen.

source: Microsoft Windows accepts computer names with a maximum of 13 characters, so as a rule computer names should be limited to 13 characters if there is any chance that Microsoft Windows will be used.
de: Microsoft Windows akzeptiert nur Rechnernamen mit maximal 13 Zeichen, so dass man sich bei Rechnernamen grundsätzlich auf 13 Zeichen beschränken sollte, sofern nicht ausgeschlossen ist, dass Microsoft Windows zum Einsatz kommen wird.

source: After creation, the computer name can only be changed for the system roles *Windows Workstation/Server*, *macOS Client* and *IP client*.
de: Der Rechnername kann nach dem Anlegen nur bei den Systemrollen *Windows Workstation/Server*, *macOS Client* und *IP-Client* verändert werden.

source: Any description can be entered for the host in this input field.
de: Für den Rechner kann in diesem Eingabefeld eine beliebige Beschreibung hinterlegt werden.

source: Inventory number
de: Inventarnummer

source: Inventory numbers for hosts can be stored here.
de: Hier können Inventarnummern für Rechner hinterlegt werden.

source: Network
de: Netzwerk

source: The host can be assigned to an existing network object. Information on the IP configuration can be found in :ref:`network-objects`.
de: Der Rechner kann einem bereits angelegten Netzwerk-Objekt zugeordnet werden. Hinweise zur IP-Konfiguration finden sich in :ref:`network-objects`.

source: MAC address
de: MAC-Adresse

source: The MAC address of the computer can be entered here, for example ``2e:44:56:3f:12:32``. If the computer is to receive a DHCP entry, the entry of the MAC address is essential.
de: An dieser Stelle kann die MAC-Adresse des Rechners eingetragen werden, z.B. ``2e:44:56:3f:12:32``. Soll der Rechner einen DHCP-Eintrag erhalten, ist die Angabe der MAC-Adresse zwingend erforderlich.

source: IP address
de: IP-Adresse

source: Fixed IP addresses for the host can be given here. Further information on the IP configuration can be found in :ref:`network-objects`.
de: Hier können feste IP-Adressen für den Rechner eingegeben werden. Weitere Hinweise zur IP-Konfiguration finden sich in :ref:`network-objects`.

source: If a network was selected on the *General* tab, the IP address assigned to the host from the network will be shown here automatically.
de: Wenn auf der Karteikarte *Allgemein* ein Netzwerk ausgewählt wurde, wird die IP-Adresse, die dem Rechner aus dem Netzwerk automatisch zugewiesen wurde, hier angezeigt.

source: An IP address entered here (i.e. in the LDAP directory) can only be transferred to the host via DHCP. If no DHCP is being used, the IP address must be configured locally, see :ref:`hardware-network-configuration`.
de: Eine hier (also im LDAP-Verzeichnis) eingetragene IP-Adresse kann dem Rechner nur über DHCP zugewiesen werden. Sollte kein DHCP-Server verwendet werden, so muss die IP-Adresse auch lokal auf dem Rechner konfiguriert werden, siehe :ref:`hardware-network-configuration`.

source: If the IP addresses entered for a host are changed without the DNS zones being changed, they are automatically changed in the computer object and - where they exist - in the DNS entries of the forward and reverse lookup zones. If the IP address of the host was entered at other places as well, these entries must be changed manually! For example, if the IP address was given in a DHCP boot policy instead of the name of the boot server, this IP address will need to be changed manually by editing the policy.
de: Werden die eingetragenen IP-Adressen eines Rechners ohne Wechsel der DNS-Zonen geändert, werden diese im Rechner-Objekt und - soweit vorhanden - auch automatisch in den DNS-Einträgen in der Forward und Reverse Lookup Zone geändert. Falls die IP-Adresse des Rechners noch an anderen Stellen eingetragen wurde, müssen diese Einträge manuell geändert werden! Wurde beispielsweise in einer DHCP-Boot-Richtlinie nicht der Name des Boot-Servers, sondern seine IP-Adresse dort eingetragen, muss diese IP-Adresse manuell durch das Bearbeiten der Richtlinie angepasst werden.

source: Forward zone for DNS entry
de: Forward-Zone für DNS-Eintrag

source: The DNS forward zone in which the computer is entered. The zone is used for the resolution of the computer name in the assigned IP address. Further information on the IP configuration can be found in :ref:`network-objects`.
de: Die DNS-Forward-Zone, in die der Rechner eingetragen wird. Die Zone dient der Auflösung des Rechnernamens in die zugewiesene IP-Adresse. Hinweise zur IP-Konfiguration finden sich in :ref:`network-objects`.

source: Reverse zone for DNS entry
de: Reverse-Zone für DNS-Eintrag

source: The DNS reverse zone in which the computer is entered. The zone is used to resolve the computer's IP address in a computer name. Further information on the IP configuration can be found in :ref:`network-objects`.
de: Die DNS-Reverse-Zone, in die der Rechner eingetragen wird. Mit der Zone wird die IP-Adresse des Rechners in einen Rechnernamen aufgelöst. Hinweise zur IP-Konfiguration finden sich in :ref:`network-objects`.

source: DHCP service
de: Service für DHCP-Eintrag

source: If a computer is supposed to procure its IP address via DHCP, a DHCP service must be assigned here. Information on the IP configuration can be found in :ref:`network-objects`.
de: Wenn ein Rechner seine IP-Adresse über DHCP beziehen soll, muss hier ein DHCP-Service zugeordnet werden. Hinweise zur IP-Konfiguration finden sich in :ref:`network-objects`.

source: During assignment, it must be ensured that the DHCP servers of the DHCP service object are responsible for the physical network.
de: Bei der Zuweisung muss darauf geachtet werden, dass die DHCP-Server des DHCP-Service-Objekts für das physikalische Netzwerk zuständig sind.

source: If a network is selected on the *General* tab an appropriate entry for the network will be added automatically. It can be adapted subsequently.
de: Wurde auf der Karteikarte *Allgemein* ein Netzwerk ausgewählt, wird automatisch ein für das Netzwerk passender Eintrag hinzugefügt, der nachträglich manuell angepasst werden kann.

source: Computer management module - Account tab
de: Modul Rechnerverwaltung - Reiter Konto

source: *Account* tab (advanced settings)
de: Reiter *Konto* (erweiterte Einstellungen)

source: Password
de: Passwort

source: The password for the computer account is usually automatically created and rotated. For special cases such as the integration of external systems it can also be explicitly configured in this field.
de: Das Passwort des Rechnerkontos wird in der Regel automatisch erstellt und rotiert. Für Sonderfälle wie die Einbindung externer Systeme kann es in diesem Feld auch explizit konfiguriert werden.

source: The same password must then also be entered locally on the computer in the :file:`/etc/machine.secret` file.
de: Dasselbe Passwort muss dann auch lokal auf dem Rechner in die Datei :file:`/etc/machine.secret` eingetragen werden.

source: Primary group
de: Primäre Gruppe

source: The primary group of the host can be selected in this selection field. This is only necessary when they deviate from the automatically created default values. The default value for a |UCSPRIMARYDN| or |UCSBACKUPDN| is ``DC Backup Hosts``, for a |UCSREPLICADN| ``DC Slave Hosts`` and for |UCSMANAGEDNODE|\ s ``Computers``.
de: In diesem Auswahlfeld kann die primäre Gruppe des Rechners selektiert werden. Das ist nur notwendig, wenn von den automatisch eingestellten Vorgabewerten abgewichen werden soll. Der Vorgabewert für einen |UCSPRIMARYDN| oder |UCSBACKUPDN| lautet ``DC Backup Hosts``, für einen |UCSREPLICADN| ``DC Slave Hosts`` und für |UCSMANAGEDNODE|\ s ``Computers``.

source: Computer management module - Unix account tab
de: Modul Rechnerverwaltung - Reiter Unix-Konto

source: *Unix account* tab (advanced settings)
de: Reiter *Unix-Konto* (erweiterte Einstellungen)

source: Unix home directory (*)
de: UNIX Heimatverzeichnis (*)

source: A different input field for the host account can be entered here. The automatically created default value for the home directory is :file:`/dev/null`.
de: In diesem Eingabefeld kann ein abweichendes Heimatverzeichnis für das Rechner-Konto eingetragen werden. Der automatisch eingestellte Vorgabewert für das Heimatverzeichnis lautet :file:`/dev/null`.

source: If a different login shell from the default value is to be used for the computer account, the login shell can be adapted manually in this input field. The automatically set default value assumes a login shell of :file:`/bin/sh`.
de: Falls eine vom Vorgabewert abweichende Login-Shell für das Rechner-Konto verwendet werden soll, kann die Login-Shell in diesem Eingabefeld manuell angepasst werden. Der automatisch eingestellte Vorgabewert sieht :file:`/bin/sh` als Login-Shell vor.

source: Computer management module - Services tab
de: Modul Rechnerverwaltung - Reiter Dienste

source: *Services* tab (advanced settings)
de: Reiter *Dienste* (erweiterte Einstellungen)

source: Service
de: Dienst

source: By means of a service object, applications or services can determine whether a service is available on a computer or generally in the domain.
de: Mit einem Dienst-Objekt können Applikationen oder Dienste feststellen, ob auf einem Rechner oder generell in der Domäne ein Dienst verfügbar ist.

source: The tab *Services* is only displayed on UCS server system roles.
de: Der Reiter *Dienste* wird nur auf UCS-Systemrollen angezeigt.

source: Computer management module - Deployment tab
de: Modul Rechnerverwaltung - Reiter (Re)installation

source: This *Deployment* tab is used for the Univention Net Installer, see :cite:t:`ext-doc-inst`.
de: Dieser Reiter wird für den Univention Net Installer verwendet, siehe :cite:t:`ext-doc-inst`.

source: Computer management module - DNS alias tab
de: Modul Rechnerverwaltung - Reiter DNS-Alias

source: *DNS alias* tab (advanced settings)
de: Reiter *DNS Alias* (Erweiterte Einstellungen)

source: Zone for DNS Alias
de: Zone für DNS-Alias

source: If a zone entry for forward mapping has been set up for the host in the *Forward zone for DNS entry* field, the additional alias entries via which the host can be reached can be configured here.
de: Wenn für den Rechner im Feld *Forward Lookup Zone für DNS-Eintrag* ein Zoneneintrag zur Vorwärtsauflösung eingerichtet wurde, können hier zusätzlich Alias-Einträge konfiguriert werden, über die der Rechner erreichbar ist.

source: Computer management module - Alerts tab
de: Modul Rechnerverwaltung - Reiter Dienste

source: *Alerts* tab (advanced settings)
de: Reiter *Alerts* (erweiterte Einstellungen)

source: Assigned monitoring alerts
de: Überwachungsalarme zuweisen
