Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/computers.po
Languages: de

source: The start dialogue contains the entry fields *Manufacturer* and *Model*, which must be completed with the values determined from the DMI information of the hardware. The fields can also be adapted and an additional *Descriptive comment* added.
de: Im Start-Dialog finden sich die Eingabefelder *Hersteller* und *Modell*, die mit aus den DMI-Informationen der Hardware ermittelten Werten vorausgefüllt sind. Die Felder können auch angepasst und ein zusätzlicher *Kommentar* angegeben werden.

source: If the hardware information is transferred as part of a support request, the :guilabel:`This is related to a support case` option should be activated. A ticket number can be entered in the next field; this facilitates assignment and allows quicker processing.
de: Wenn die Übermittlung der Hardwareinformationen im Rahmen einer Support-Anfrage erfolgt, sollte die Option :guilabel:`Dies bezieht sich auf einen Supportfall` aktiviert werden. Im folgenden Feld kann dann eine Ticketnummer angegeben werden, die die Zuordnung vereinfacht und eine schnellere Bearbeitung ermöglicht.

source: Clicking on :guilabel:`Next` offers an overview of the transferred hardware information. In addition, a compressed TAR archive is created, which contains a list of the hardware components used in the system and can be downloaded via :guilabel:`Archive with system information`.
de: Nach einem Klick auf :guilabel:`Weiter` wird eine Übersicht der ermittelten Hardwareinformationen ausgegeben. Außerdem wird ein komprimiertes Tar-Archiv erstellt, das eine Liste mit den im System verwendeten Hardware-Komponenten enthält und über :guilabel:`Archiv mit den Hardwareinformationen` heruntergeladen werden kann.

source: Clicking on :guilabel:`Next` again allows you to select the way the data are transferred to Univention. :guilabel:`Upload` transmits the data via HTTPS, :guilabel:`Send mail)` opens a dialogue, which lists the needed steps to send the archive via email.
de: Nach einem erneuten Klick auf :guilabel:`Weiter` kann der Übermittlungsweg der Daten an Univention ausgewählt werden. :guilabel:`Hochladen` überträgt die Daten per HTTPS, :guilabel:`Mail senden` führt zu einem Dialog, der die für den Versand nötigen Schritte aufführt.

source: Chapter contents:
de: Kapitelinhalte:

source: Computer management
de: Rechnerverwaltung

source: Administration of local system configuration with Univention Configuration Registry
de: Verwaltung der lokalen Systemkonfiguration mit Univention Configuration Registry

source: |UCSUCR| is the central tool for managing the local system configuration of a UCS-based system. Direct editing of the configuration files is usually not necessary.
de: |UCSUCR| ist das zentrale Werkzeug zur Verwaltung der lokalen Systemkonfiguration eines UCS-basierten Systems. Ein direktes Editieren der Konfigurationsdateien ist dabei in der Regel nicht nötig.

source: Settings are specified in a consistent format in a registry mechanism, the so-called *Univention Configuration Registry variables*. These variables are used to generate the configuration files used effectively by the services/programs from the configuration templates (the so-called *Univention Configuration Registry templates*).
de: Einstellungen werden in einem Registrierungsmechanismus in einem einheitlichen Format festgelegt, den sogenannten *Univention Configuration Registry-Variablen*. Diese Variablen werden verwendet, um aus Konfigurationsdatei-Vorlagen (den sogenannten *Univention Configuration Registry-Templates*) die effektiv von den Diensten/Programmen verwendeten Konfigurationsdateien zu generieren.

source: This procedure offers a range of advantages:
de: Dieses Verfahren bietet eine Reihe von Vorteilen:

source: It is not usually necessary to edit any configuration files manually. This avoids errors arising from invalid syntax of configuration settings or similar.
de: In der Regel müssen keine Konfigurationsdateien manuell editiert werden. Dies vermeidet Fehler durch ungültige Syntax von Konfigurationseinstellungen o.ä.

source: There is a uniform interface for editing the settings and the different syntax formats of the configuration files are hidden from the administrator.
de: Es existiert ein einheitliches Interface zum Editieren der Einstellungen und die unterschiedlichen Syntaxformate der Konfigurationsdateien werden vor dem Administrator verborgen.

source: Settings are decoupled from the actual configuration file, i.e., if a software uses a different configuration format in a new version, a new template in a new format is simply delivered instead of performing time-consuming and error-prone conversion of the file.
de: Die Einstellungen werden von der eigentlichen Konfigurationsdatei entkoppelt, d.h. wenn eine Software in einer neuen Version ein anderes Konfigurationsformat verwendet, wird einfach ein neues Template im neuen Format ausgeliefert anstatt eine aufwendige und fehlerträchtige Konvertierung der bestehenden Konfigurationsdatei vorzunehmen.

source: The variables used in a configuration file administrated with |UCSUCR| are registered internally. This ensures that when a UCR variable is changed, all the configuration files containing the changed variable are recreated.
de: Die in einer durch |UCSUCR| verwalteten Konfigurationsdatei verwendeten Variablen werden intern zugeordnet. Das stellt sicher, dass beim Ändern einer UCR-Variable alle Konfigurationsdateien, auf die sich die veränderte Variable bezieht, neu erstellt werden.

source: |UCSUCR| variables can be configured in the command line using the :command:`univention-config-registry` command (short form: :command:`ucr`) or via the UMC module :guilabel:`Univention Configuration Registry`.
de: |UCSUCR|-Variablen können auf der Kommandozeile über den Befehl :command:`univention-config-registry` (Kurzform: :command:`ucr`) oder über das UMC-Modul :guilabel:`Univention Configuration Registry` konfiguriert werden.

source: As the majority of packages perform their configuration via |UCSUCR| and the corresponding basic settings need to be set up during the installation, hundreds of |UCSUCR| variables are already set after the installation of a UCS system.
de: Da die meisten Pakete ihre Konfiguration über |UCSUCR| durchführen und bei der Installation entsprechende Grundeinstellungen eingerichtet werden, sind nach der Installation eines UCS-Systems bereits einige Hundert |UCSUCR|-Variablen gesetzt.

source: UCR variables can also be used efficiently in shell scripts for accessing current system settings.
de: UCR-Variablen können auch effizient in Shell-Skripten verwendet werden, um auf Systemeinstellungen wie den Rechnernamen zuzugreifen.

source: The variables are named according to a tree structure with a forward slash being used to separate components of the name. For example, |UCSUCR| variables beginning with ``ldap`` are settings which apply to the local directory service.
de: Die Benennung der Variablen folgt einer baumartigen Struktur, wobei ein Schrägstrich als Trennzeichen von Namensbestandteilen verwendet wird. Beispielsweise handelt es sich bei allen mit ``ldap`` beginnenden |UCSUCR|-Variablen um Einstellungen, die den lokalen Verzeichnisdienst betreffen.

source: A description is given for the majority of variables explaining their use.
de: Zu den meisten Variablen ist eine Beschreibung hinterlegt, die die Verwendung und Funktion erläutert.

source: If a configuration file is administrated by a UCR template and the required setting has not already been covered by an existing variable, the UCR template should be edited instead of the configuration file. If the configuration were directly adapted, the next time the file is regenerated - e.g., when a registered UCR variable is set - the local modification will be overwritten again. Adaptation of UCR templates is described in :ref:`ucr-templates-extend`.
de: Wenn eine Konfigurationsdatei durch ein UCR-Template verwaltet wird und die gewünschte Einstellung nicht bereits durch eine vorhandene Variable abgedeckt ist, muss statt der Konfigurationsdatei das UCR-Template erweitert werden. Würde die Konfigurationsdatei direkt angepasst, würde bei der nächsten Neugenerierung der Datei - z.B. beim Setzen einer registrierten UCR-Variable - die lokale Anpassung wieder überschrieben. Die Anpassung von UCR-Templates ist in :ref:`ucr-templates-extend` beschrieben.

source: Part of the settings configured in |UCSUCR| are system-specific (e.g., the computer name); many settings can, however, be used on more then one computer. The |UCSUCR| policy in the domain administration UMC modules can be used to compile variables and apply them on more than one computer.
de: Ein Teil der über |UCSUCR| konfigurierten Einstellungen sind systemspezifisch (z.B. der Rechnername), viele Eigenschaften können jedoch auch auf mehrere Rechner angewendet werden. Mithilfe der *Univention Configuration Registry-Richtlinie* in den UMC-Modulen zur Domänenverwaltung können Variablen zusammengefasst und auf mehr als einen Rechner angewendet werden.

source: The evaluation of the |UCSUCR| variables on a UCS system comprises four stages:
de: Die Auswertung der |UCSUCR|-Variablen auf einem UCS-System erfolgt vierstufig:

source: First the local |UCSUCR| variables are evaluated.
de: Als Erstes werden lokale |UCSUCR|-Variablen ausgewertet.

source: The local variables are overruled by policy variables which are usually sourced from the directory service
de: Die lokalen Variablen werden von Richtlinien-Variablen überstimmt, die aus dem Verzeichnisdienst bezogen werden

source: The ``--schedule`` option is used to set local variables which are only intended to apply for a certain period of time. This level of the |UCSUCR| is reserved for local settings which are automated by time-controlled mechanisms in |UCSUCS|.
de: Die Option ``--schedule`` dient zum Setzen lokaler Variablen, die nur für einen gewissen Zeitraum gelten sollen. Diese Ebene der |UCSUCR| ist reserviert für lokale Einstellungen, die durch zeitgesteuerte Mechanismen in |UCSUCS| automatisiert vorgenommen werden.

source: When the ``--force`` option is used in setting a local variable, settings adopted from the directory service and variables from the schedule level are overruled and the given value for the local system fixed instead. An example:
de: Durch Verwendung der Option ``--force`` beim Setzen einer lokalen Variable werden aus den Verzeichnisdienst übernommene Einstellung ebenso wie Variablen der Schedule-Ebene überstimmt und statt dessen der angegebene Wert für das lokale System festgelegt. Beispiel:

source: If a variable is set which is overwritten by a superordinate policy, a warning message is given.
de: Wird eine Variable gesetzt, die durch eine übergeordnete Richtlinie überschrieben wird, erscheint eine Warnmeldung.

source: The use of the |UCSUCR| policy is documented in the :ref:`ucr-templates-policy`.
de: Die Verwendung der |UCSUCR|-Richtlinie ist in :ref:`ucr-templates-policy` dokumentiert.

source: Using the |UCSUMC| module
de: Verwendung des |UCSUMC| Moduls

source: The UMC module :guilabel:`Univention Configuration Registry` can be used to display and adjust the variables of a system. There is also the possibility of setting new variables using :guilabel:`Add new variable`.
de: Über das UMC-Modul :guilabel:`Univention Configuration Registry` können die Variablen eines Systems angezeigt und verändert werden, außerdem besteht die Möglichkeit über :guilabel:`Hinzufügen` neue Variablen zu setzen.

source: A search mask is displayed on the start page. All variables are classified using a *Category*, for example all LDAP-specific settings.
de: Auf der Startseite wird eine Suchmaske angezeigt. Alle Variablen sind anhand einer *Kategorie* klassifiziert, etwa alle LDAP-bezogenen Einstellungen.

source: The *Search attribute* can be entered as a filter in the search mask, which can refer to the variable name, value or description.
de: In der Suchmaske kann als Filter das *Suchattribut* angegeben werden, das sich auf den Variablennamen, den Wert oder die Beschreibung beziehen kann.

source: Following a successful search, the variables found are displayed in a table with the variable name and the value. A detailed description of the variable is displayed when moving the mouse cursor over the variable name.
de: Nach erfolgter Suche werden die gefundenen Variablen in einer Tabelle angezeigt, dabei wird der Variablenname und der Wert angezeigt. Bewegt man den Mauszeiger auf den Variablennamen, wird eine weiterführende Beschreibung der Variable angezeigt.

source: A variable can be edited by clicking on its name. A variable can be deleted by right-clicking and selecting :guilabel:`Delete`.
de: Eine Variable kann mit einem Klick auf ihren Namen bearbeitet werden. Mit einem Rechts-Klick und der Auswahl von :guilabel:`Löschen` können Variablen gelöscht werden.

source: Using the command line front end
de: Verwendung des Kommandozeilenfrontends

source: The command line interface of |UCSUCR| is run using the :command:`univention-config-registry` command. Alternatively, the short form :command:`ucr` can be used.
de: Das Kommandozeileninterface von |UCSUCR| wird über den Befehl :command:`univention-config-registry` aufgerufen. Alternativ kann auch die Kurzform :command:`ucr` verwendet werden.

source: Querying a UCR variable
de: Abfrage einer UCR-Variable

source: A single |UCSUCR| variable can be queried with the parameter :option:`get`:
de: Eine einzelne |UCSUCR|-Variable kann mit dem Aufrufparameter :option:`get` ausgelesen werden:

source: The parameter :option:`dump` can also be used to display all currently set variables:
de: Mit dem Aufrufparameter :option:`dump` können auch alle aktuell gesetzten Variablen ausgegeben werden:

source: Setting UCR variables
de: Setzen von UCR-Variablen

source: The parameter :option:`set` is used to set a variable. The variable can be given any name consisting exclusively of letters, full stops, figures, hyphens and forward slashes.
de: Mit dem Aufrufparameter :option:`set` kann eine Variable gesetzt werden. Der Name der Variable kann frei gewählt werden, darf aber ausschließlich aus Buchstaben, Punkten, Zahlen, Binde- und Schrägstrichen bestehen.

source: $ univention-config-registry set VARIABLENAME=VALUE
de: $ univention-config-registry set VARIABLENNAME=WERT

source: If the variable already exists, the content is updated; otherwise, a new entry is created.
de: Ist die Variable schon vorhanden, wird der Inhalt aktualisiert. Ansonsten wird ein neuer Eintrag angelegt.

source: The syntax is not checked when a |UCSUCR| variable is set. The change to a variable results in all configuration files for which the variable is registered being rewritten immediately. The files in question are output on the console.
de: Beim Setzen einer |UCSUCR|-Variable erfolgt keine Syntaxprüfung. Die Änderung einer Variable bewirkt, dass alle Konfigurationsdateien, für die diese Variable registriert ist, unmittelbar neu geschrieben werden. Die betroffenen Dateien werden auf der Kommandozeile ausgegeben.

source: In doing so it must be noted that although the configuration of a service is updated, the service in question is not restarted automatically! The restart must be performed manually.
de: Dabei ist zu beachten, dass beim Setzen einer UCR-Variable zwar die Konfiguration eines Dienstes aktualisiert wird, der entsprechende Dienst aber nicht automatisch neu gestartet wird! Der Neustart muss manuell erfolgen.

source: It is also possible to perform simultaneous changes to several variables in one command line. If these refer to the same configuration file, the file is only rewritten once.
de: Gleichzeitige Änderungen mehrerer Variablen in einer Befehlszeile sind möglich. Wenn sich diese auf ein- und dieselbe Konfigurationsdatei beziehen, wird diese nur einmal neu geschrieben.

source: A conditional setting is also possible. For example, if a value should only be saved in a |UCSUCR| variable when the variable does not yet exist, this can be done by entering a question mark (``?``) instead of the equals sign (``=``) when assigning values.
de: Auch ein bedingtes Setzen ist möglich. Soll z.B. ein Wert nur dann in einer |UCSUCR|-Variable gespeichert werden, wenn die Variable noch nicht vorhanden ist, kann dies durch ein Fragezeichen (``?``) statt des Gleichheitszeichens (``=``) beim Zuweisen des Wertes erreicht werden.

source: Searching for variables and set values
de: Suche nach Variablen und gesetzten Werten

source: The parameter :option:`search` can be used to search for a variable. This command searches for variable names which contain ``nscd`` and displays these with their current assignments:
de: Mit dem Parameter :option:`search` kann nach einer Variable gesucht werden. Dieser Befehl sucht nach Variablennamen, welche die Zeichenkette ``nscd`` enthalten und gibt diese mit den aktuellen Belegungen aus:

source: Alternatively, searches can also be performed for set variable values. This request searches for all variables set to ``primary.example.com``:
de: Es kann alternativ auch nach gesetzten Variablen-Werten gesucht werden. Dieser Aufruf sucht nach allen Variablen, die auf ``primary.example.com`` gesetzt sind:

source: Search templates in the form of regular expressions can also be used in the search. The complete format is documented at `Regular expression operations in the Python 2 documentation <python2-re_>`_.
de: Bei der Suche können auch Suchmuster in Form von regulären Ausdrücken verwendet werden. Das vollständige Format ist unter `Regular expression operations in the Python 2 documentation <python2-re_>`_ dokumentiert.

source: Deleting UCR variables
de: Löschen von UCR-Variablen

source: The parameter :option:`unset` is used to delete a variable. The following example deletes the variable :envvar:`dns/forwarder2`. It is also possible here to specify several variables to be deleted:
de: Mit dem Aufrufparameter :option:`unset` kann eine Variable entfernt werden. Das folgende Beispiel löscht die Variable :envvar:`dns/forwarder2`. Auch hier können mehrere zu löschende Variablen übergeben werden:

source: Regeneration of configuration files from their template
de: Neuerzeugung von Konfigurationsdateien aus ihrem Template

source: The parameter :option:`commit` is used to regenerate a configuration file from its template. The name of the configuration file is entered as a parameter, e.g.:
de: Mit dem Aufrufparameter :option:`commit` wird eine Konfigurationsdatei aus ihrem Template neu erzeugt. Der Name der Konfigurationsdatei ist als Parameter anzugeben, z.B.:

source: As UCR templates are generally regenerated automatically when UCR variables are edited, this is primarily used for tests.
de: Da UCR-Templates beim Editieren von UCR-Variablen in der Regel automatisch neu erzeugt werden, wird dies vor allem für Tests verwendet.

source: If no filename is given when running :command:`ucr commit`, all of the files managed by |UCSUCR| will be regenerated from the templates. It is, however, not generally necessary to regenerate all the configuration files.
de: Wird beim Aufruf von :command:`ucr commit` kein Dateiname angegeben, werden sämtliche durch |UCSUCR| verwalteten Dateien neu aus den Vorlagen erzeugt. In der Regel sollte es allerdings nicht notwendig sein, alle Konfigurationsdateien neu zu erzeugen.

source: Sourcing variables in shell scripts
de: Übernahme von Variablen in Shell-Skripte

source: The parameter :option:`shell` is used to display |UCSUCR| variables and their current assignments in a format that can be used in shell scripts.
de: Über den Aufrufparameter :option:`shell` werden |UCSUCR|-Variablen und ihre aktuellen Belegungen in einem Format ausgegeben, das in Shell-Skripten verwendet werden kann.

source: Different conversions are involved in this: forward slashes in variable names are replaced with underscores and characters in the values which have a particular significance in shell scripts are included in quotation marks to ensure they are not altered.
de: Dabei werden verschiedene Konvertierungen vorgenommen: Schrägstriche in Variablennamen werden durch Unterstriche ersetzt und in den Werten enthaltene Zeichen, die in Shell-Skripten eine besondere Bedeutung haben, werden durch Anführungszeichen geschützt.

source: The |UCSUCR| output must be executed via the command :command:`eval` for |UCSUCR| variables to be able to be read in a shell script as environment variables:
de: Damit |UCSUCR|-Variablen als Umgebungsvariablen in einem Shell-Skript eingelesen werden, muss die Ausgabe von |UCSUCR| durch den Befehl :command:`eval` ausgeführt werden:

source: Policy-based configuration of UCR variables
de: Richtlinienbasierte Konfiguration von UCR-Variablen

source: Part of the settings configured in |UCSUCR| are system-specific (e.g., the computer name); many settings can, however, be used on more then one computer. The *Univention Configuration Registry* policy managed in the UMC module :guilabel:`Policies` can be used to compile variables and apply them on more than one computer.
de: Ein Teil der über |UCSUCR| konfigurierten Einstellungen sind systemspezifisch (z.B. der Rechnername), viele Eigenschaften können jedoch auch auf mehrere Rechner angewendet werden. Mithilfe der im UMC-Modul :guilabel:`Richtlinien` verwalteten *Univention Configuration Registry*-Richtlinie können Variablen zusammengefasst und auf mehr als einen Rechner angewendet werden.

source: Policy-based configuration of the Apache start page and forced HTTPS
de: Richtlinienbasierte Konfiguration der Webserver Startseite mit forciertem HTTPS

source: Firstly, a *Name* must be set for the policy which is to be created, under which the variables will later be assigned to the individual computer objects.
de: Zuerst muss für die anzulegende Richtlinie ein *Name* gesetzt werden, unter dem die Variablen später einzelnen Rechner-Objekten zugewiesen werden können.

source: In addition, at least one *Variable* must be configured and a *Value* assigned.
de: Außerdem muss mindestens eine *Variable* konfiguriert und ein *Wert* zugewiesen werden.

source: This policy can then be assigned to a computer object or a container or OU (see :ref:`central-policies-assign`). Note that the evaluation of configured values differs from other policies: The values are not forwarded directly to the computer, but rather written on the assigned computer by Univention Directory Policy. The time interval used for this is configured by the |UCSUCRV| :envvar:`ldap/policy/cron` and is set to hourly as standard.
de: Diese Richtlinie kann dann einem Rechner-Objekt oder einem Container/OU zugewiesen werden (siehe :ref:`central-policies-assign`). Es ist zu beachten, dass die Auswertung der konfigurierten Werte gegenüber den übrigen Richtlinien abweicht: Die Werte werden nicht direkt auf die Rechner übertragen, sondern durch Univention Directory Policy auf den zugewiesenen Rechner geschrieben. Das dabei verwendete Zeitintervall wird durch die |UCSUCRV| :envvar:`ldap/policy/cron` konfiguriert und erfolgt standardmäßig stündlich.

source: Modifying UCR templates
de: Anpassung von UCR-Templates

source: In the simplest case, a |UCSUCR| template is a copy of the original configuration file in which the points at which the value of a variable are to be used contain a reference to the variable name.
de: Ein |UCSUCR|-Template ist im einfachsten Fall eine Kopie der ursprünglichen Konfigurationsdatei, in der die Stellen, an denen der Wert einer Variable verwendet werden soll, eine Referenz auf den Variablennamen enthalten.
