Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/computers.po
Languages: de

source: Specifies which Monitoring alert checks should be performed for this computer, see :ref:`monitoring-alert-configuration`.
de: Legt fest, welche Monitoring Alert Prüfungen für diesen Rechner ausgeführt werden, siehe :ref:`monitoring-alert-configuration`.

source: Computer management module - Groups tab
de: Modul Rechnerverwaltung - Reiter Gruppen

source: The computer can be added into different groups in *Groups* tab.
de: In diesem Reiter kann der Rechner in verschiedene Gruppen aufgenommen werden.

source: Computer management module - Options alias tab
de: Modul Rechnerverwaltung - Reiter Optionen

source: The *Options* tab allows to disable LDAP object classes for host objects. The entry fields for attributes of disabled object classes are no longer shown. Not all object classes can be modified subsequently.
de: Der Reiter ermöglicht es, einzelne LDAP-Objektklassen für den Rechner zu konfigurieren. Die Eingabefelder für Attribute abgewählter Objektklassen werden dann nicht angezeigt. Nicht alle Objektklassen können nachträglich verändert werden.

source: *(Options)* tab
de: Reiter *(Optionen)*

source: Kerberos principal
de: Kerberos Prinzipal

source: If this checkbox is not selected the host does not receive the ``krb5Principal`` and ``krb5KDCEntry`` object classes.
de: Ist dieses Auswahlkästchen nicht markiert, erhält der Rechner die Objektklassen ``krb5Principal`` und ``krb5KDCEntry`` nicht.

source: POSIX account
de: POSIX Konto

source: If this checkbox is not selected the host does not receive the ``posixAccount`` object class.
de: Ist dieses Auswahlkästchen nicht markiert, erhält der Rechner die Objektklasse ``posixAccount`` nicht.

source: Samba account
de: Samba-Konto

source: If this checkbox is not selected the host does not receive the ``sambaSamAccount`` object class.
de: Ist dieses Auswahlkästchen nicht markiert, erhält der Rechner die Objektklasse ``sambaSamAccount`` nicht.

source: Integration of Ubuntu clients
de: Integration von Ubuntu-Clients

source: Ubuntu clients can be managed in the UMC module :guilabel:`Computers` with their own system role. The network properties for DNS/DHCP can also be managed there.
de: Ubuntu-Clients können mit einer eigenen Rechnerrolle im UMC-Modul :guilabel:`Rechner` verwaltet werden. Die Netzwerkeigenschaften für DNS/DHCP können dabei ebenfalls dort verwaltet werden.

source: The use of policies is not supported.
de: Die Anwendung von Richtlinien wird nicht unterstützt.

source: Some configuration adjustments need to be performed on Ubuntu systems; these are documented in :cite:t:`ext-doc-domain`.
de: Auf den Ubuntu-Systemen müssen einige Konfigurationsanpassungen vorgenommen werden, die in :cite:t:`ext-doc-domain` beschrieben sind.
