Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/idm-cloud.po
Languages: de

source: You can change the default group type of a Microsoft 365 group. The following group types are available:
de: Sie können den Standard-Gruppentyp einer Microsoft 365-Gruppe ändern. Die folgenden Gruppentypen sind verfügbar:

source: To change the group type, you need to modify the default value of the extended attribute ``UniventionMicrosoft365GroupType`` to one of the available group types:
de: Um den Gruppentyp zu ändern, müssen Sie den Standardwert des erweiterten Attributs ``UniventionMicrosoft365GroupType`` auf einen der verfügbaren Gruppentypen ändern:

source: $ udm settings/extended_attribute modify \ --dn "cn=UniventionMicrosoft365GroupType,cn=custom attributes,cn=univention,$(ucr get ldap/base)" \ --set default="Microsoft 365 Group"
de: $ udm settings/extended_attribute modify \ --dn "cn=UniventionMicrosoft365GroupType,cn=custom attributes,cn=univention,$(ucr get ldap/base)" \ --set default="Microsoft 365 Group"$ udm settings/extended_attribute modify --dn "cn=UniventionMicrosoft365GroupType,cn=custom attributes,cn=univention,$(ucr get ldap/base)" --set default="Microsoft 365 Group"

source: To use Teams, synchronization of groups must be enabled in the |UCSUCRV| :envvar:`office365/groups/sync` with the value ``yes``, and then the |UCSUDL| service must be restarted. If UCS groups are to be created as teams in Microsoft 365, the groups must be configured as teams on the *Microsoft 365* tab via the :guilabel:`Microsoft 365 Team` checkbox. Furthermore, it is necessary to define an owner of the team on the same tab. Further settings on the team can be made by the team owners directly in the Teams interface. After activating a group as a team, the group members are added to the new team. Provisioning a new team in Microsoft 365 can take a few minutes.
de: Für die Nutzung von Teams muss die Synchronisation von Gruppen per |UCSUCRV| :envvar:`office365/groups/sync` mit dem Wert ``yes`` aktiviert werden, anschließend muss der Dienst |UCSUDL| neu gestartet werden. Sollen UCS-Gruppen als Teams in Microsoft 365 angelegt werden, so müssen die Gruppen auf dem Reiter *Microsoft 365* über die Checkbox :guilabel:`Microsoft 365 Team` als Team konfiguriert werden. Des Weiteren ist es notwendig, auf demselben Reiter einen Besitzer des Teams zu definieren. Weitere Einstellungen am Team können von den Team-Besitzern direkt im Teams Interface vorgenommen werden. Nach der Aktivierung einer Gruppe als Team werden die Gruppenmitglieder dem neuen Team hinzugefügt. Das Einrichten eines neuen Teams in Microsoft 365 kann einige Minuten in Anspruch nehmen.

source: Ensure that users of a team in Azure are provided with a license that includes the use of Teams.
de: Es muss sichergestellt sein, dass die Benutzer eines Teams in Azure eine Lizenz erhalten, in der die Nutzung von Teams enthalten ist.

source: Synchronization of Users in multiple Azure Active Directories
de: Synchronisation von Benutzern in mehrere Azure Active Directories

source: The Microsoft 365 Connector is able to synchronize users to multiple Azure Active Directories. For each user account, multiple Azure AD instances can be assigned, where an account should be created. A user gets a distinct username (*Userprincipalname* or *UPN*) for every assigned Azure AD.
de: Der Microsoft 365 Connector kann Benutzer in mehrere Azure *Active Directories* synchronisieren. Sind mehrere Verbindungen verfügbar, können an jedem Benutzerkonto individuell die Azure AD Instanzen zugewiesen werden, in denen ein Account erstellt werden soll. Ein Benutzer bekommt in jedem der seinem UCS Konto zugewiesenen Azure AD ein separates Konto mit eindeutigem Benutzernamen (*Userprincipalname*, UPN).

source: An alias is assigned to each additional Azure AD connection by the administrator. To manage these aliases the program :command:`/usr/share/univention-office365/scripts/manage_adconnections` can be used. A new alias is created by calling :samp:`/usr/share/univention-office365/scripts/manage_adconnections create {<Aliasname>}`. This will set the |UCSUCRV| :envvar:`office365/adconnection/wizard` to the newly created alias. The value of this |UCSUCRV| defines which connection is configured by the next run of the Microsoft 365 Configuration Wizard.
de: Jede zusätzlich eingerichtete Azure AD Verbindung erhält einen vom Administrator festzulegenden Verbindungsalias als eindeutigen Namen. Für die Verwaltung der Aliase kann das Programm :command:`/usr/share/univention-office365/scripts/manage_adconnections` verwendet werden. Ein neuer Alias kann über das Kommando :samp:`/usr/share/univention-office365/scripts/manage_adconnections create {<Aliasname>}` erstellt werden. Dies konfiguriert unter anderem die |UCSUCRV| :envvar:`office365/adconnection/wizard` auf den neu erstellten Alias um. Der Wert dieser |UCSUCRV| bestimmt, welche Azure Verbindung durch den Microsoft 365 Einrichtungswizard konfiguriert wird.

source: After creating the alias, the new connection must be configured through the Microsoft 365 Configuration Wizard, as well.
de: Nach dem Anlegen muss die Verbindung wie gewohnt über den Microsoft 365 Einrichtungswizard eingerichtet werden, damit Benutzer synchronisiert werden können.

source: To use single sign-on with multiple Azure AD connections, a new logical SAML Identity Provider is needed for each connection. This is described in :ref:`domain-saml-extended-configuration`.
de: Um Single Sign-On mit mehreren Azure AD Verbindungen zu ermöglichen, muss für jede weitere Verbindung ein neuer logischer SAML Identity Provider erstellt werden. Dies ist in :ref:`domain-saml-extended-configuration` beschrieben.

source: The Identity Provider should get the same name as the alias. If another name was chosen, the PowerShell script to configure single sign-on needs to be adjusted manually. For example the |UCSUCRV| :samp:`saml/idp/entityID/supplement/{Aliasname}=true` needs to be set on all domain controllers responsible for single sign-on.
de: Der Identity Provider sollte dabei denselben Namen wie der Verbindungsalias erhalten. Wurde ein anderer Name gewählt, muss das PowerShell Skript zur Einrichtung der Single Sign-On Verbindung manuell angepasst werden. Auf allen für das Single Sign-On der Domäne zuständigen Domaincontrollern muss also beispielsweise die |UCSUCRV| in der Form :samp:`saml/idp/entityID/supplement/{Aliasname}=true` gesetzt werden.

source: A UCS user can only use one Microsoft 365 account in one browser session at a time. To change the connection, a logout from Microsoft 365 is necessary.
de: Ein UCS Benutzer kann in einer Browser-Sitzung nur zu einem Azure AD gleichzeitig verbunden sein. Um die Verbindung zu wechseln, ist ein Abmelden an Microsoft 365 notwendig.

source: A default alias for Microsoft 365 enabled users and groups can be set in the |UCSUCRV| :envvar:`office365/defaultalias`. To synchronize them into a different Azure Active Directory the connection alias must be selected explicitly at the user or group object.
de: Zur weiteren Konfiguration gibt es die |UCSUCRV| :envvar:`office365/defaultalias`. Diese legt fest, in welches Azure AD ein Benutzer- oder Gruppenkonto synchronisiert wird, falls am Benutzerkonto keines explizit ausgewählt wurde. Soll das Konto in ein anderes Azure AD synchronisiert werden, muss bei der Aktivierung für Microsoft 365 das entsprechende Azure AD Verbindungsalias als Ziel ausgewählt werden.

source: Messages during the setup are logged in :file:`/var/log/univention/management-console-module-office365.log`.
de: Meldungen während der Einrichtung werden in der Logdatei :file:`/var/log/univention/management-console-module-office365.log` protokolliert.

source: In case of synchronization problems, the log file of the |UCSUDL| should be examined: :file:`/var/log/univention/listener.log`.
de: Bei Synchronisationsproblemen sollte die Logdatei des |UCSUDL| geprüft werden: :file:`/var/log/univention/listener.log`.

source: Some actions of the Connector use long-running Azure Cloud operations, especially when using Teams. These operations are logged in the log file :file:`/var/log/univention/listener_modules/ms-office-async.log` The |UCSUCRV| :envvar:`office365/debug/werror` activates additional debug output.
de: Einige Aktionen des Connectors verwenden Operationen der Azure Cloud mit langer Laufzeit, insbesondere bei der Verwendung von Teams. Diese Operationen werden in der Logdatei :file:`/var/log/univention/listener_modules/ms-office-async.log` protokolliert. Mit Hilfe der |UCSUCRV| :envvar:`office365/debug/werror` können mehr Debugausgaben aktiviert werden.
