Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/index.po
Languages: de

source: For example, users can be organized in different containers or organizational units (which are a form of containers) depending on which department they belong to. Settings such as the desktop background or accessible programs can then be connected to these organizational units using policies. Subsequently, they apply for all users within the organizational unit in question.
de: Beispielsweise können Benutzer nach Abteilungszugehörigkeit in unterschiedliche Container oder Organisationseinheiten (die eine besondere Form von Containern darstellen) organisiert werden. Einstellungen wie Bildschirmhintergrund oder aufrufbare Programme können dann mit Hilfe von Richtlinien an diese Organisationseinheiten gebunden werden und gelten für alle unterhalb der betreffenden Organisationseinheit befindlichen Benutzer.

source: Further information can be found in :ref:`central-policies`.
de: Weiterführende Informationen finden sich in :ref:`central-policies`.

source: Listener/notifier replication
de: Listener/Notifier-Replikation

source: The listener/notifier mechanism is an important technical component of the |UCSUMS|. With this, the creation, editing or deleting of entries in the LDAP directory triggers defined actions on the computers in question. For example, the creation of a directory share with the UMC module :guilabel:`Shares` leads to the share firstly being entered in the LDAP directory. The listener/notifier mechanism then ensures that the NFS and Samba configuration files are also expanded accordingly on the selected server and that the directory is created in the file system of the selected server if it does not already exist.
de: Ein wichtiger technischer Bestandteil des |UCSUMS|\ s stellt der so genannte Listener/Notifier-Mechanismus dar. Mit ihm lösen das Anlegen, Verändern oder Löschen von Einträgen im LDAP-Verzeichnis definierte Aktionen auf betroffenen Rechnern aus. So führt zum Beispiel das Anlegen einer Verzeichnisfreigabe mit dem UMC-Modul :guilabel:`Freigaben` dazu, das die Freigabe zunächst in das LDAP-Verzeichnis eingetragen wird. Der Listener/Notifier-Mechanismus stellt dann sicher, dass die Konfigurationsdateien auf dem gewählten Server entsprechend erweitert werden und das Verzeichnis im Dateisystem des gewählten Servers erstellt wird, falls es noch nicht existiert.

source: The listener/notifier mechanism can be expanded with modules for further - also customer-specific - procedures. Consequently, it is used by numerous technology partners for the integration of their products in the LDAP directory service and the |UCSUMS| for example.
de: Der Listener/Notifier-Mechanismus kann leicht um Module für weitere – auch kundenspezifische – Vorgänge ergänzt werden und wird zum Beispiel von zahlreichen Technologiepartnern für die Integration ihrer Produkte in den LDAP-Verzeichnisdienst und das |UCSUMS| verwendet.

source: Further information can be found in :ref:`domain-listener-notifier`.
de: Weiterführende Informationen finden sich in :ref:`domain-listener-notifier`.

source: Further documentation
de: Weitere Dokumentationen

source: This manual addresses just a small selection of the possibilities in UCS. Among other things, UCS and solutions based on UCS provide:
de: Dieses Handbuch behandelt nur einen kleinen Ausschnitt der Möglichkeiten von UCS. UCS und auf UCS aufbauende Lösungen bieten unter anderem:

source: Comprehensive support for complex server environments and replication scenarios
de: Umfangreiche Unterstützung für komplexe Serverumgebungen und Replikationsszenarien

source: Advanced capabilities for Windows environments
de: Weitergehende Einsatzmöglichkeiten für Microsoft Windows-Umgebungen

source: Central network management with DNS and DHCP
de: Zentrales Netzmanagement mit DNS und DHCP

source: Monitoring systems and networks
de: System- und Netzüberwachung

source: Print server functionalities
de: Druckserver-Funktionalität

source: Further documentation related to UCS and further issues is published under :cite:t:`ucs-docs` and in the `Univention Wiki <univention-wiki_>`_.
de: Unter :cite:t:`ucs-docs` und im `Univention Wiki <univention-wiki_>`_ sind weitere Dokumentationen zu UCS veröffentlicht, die weiterführende Themen behandeln.

source: Symbols and conventions used in this manual
de: Verwendete Symbole und Konventionen

source: The manual uses the following symbols:
de: Im Handbuch werden folgende Symbole verwendet:

source: Warnings are highlighted.
de: Warnungen werden hervorgehoben.

source: Notes are also highlighted.
de: Hinweise werden ebenfalls hervorgehoben.

source: This table describes the functionality of a UMC module:
de: Diese Felder beschreiben den Funktionsumfang eines UMC-Moduls:

source: Tab DHCP service
de: Reiter DHCP-Dienst

source: Attribute
de: Attribut

source: Description
de: Beschreibung

source: The unique name of a DHCP service.
de: Ein eindeutiger Name für den DHCP-Dienst.

source: An arbitrary description of the service.
de: Eine beliebige Beschreibung des Dienstes.

source: Menu entries, button labels, and similar details with actions are printed in :guilabel:`this font face`.
de: Menüeinträge, Schaltflächenbeschriftungen und ähnliches sind :guilabel:`in dieser Schriftform` gesetzt.

source: *Names* are highlighted.
de: Eigennamen sind *hervorgehoben*.

source: ``Computer names, LDAP DNs``, :command:`program names`, :file:`file names, file paths`, `internet addresses <https://example.com>`_ and ``options`` are also optically accented.
de: ``Computernamen``, ``LDAP-DNs``, :command:`Programmnamen`, :file:`Dateinamen und -pfade`, ``Internetadressen`` und ``Optionen`` werden ebenfalls optisch hervorgehoben.

source: ``Commands and other keyboard input`` is accented optically.
de: ``Befehle und Tastatureingaben`` werden optisch hervorgehoben.

source: In addition, excerpts from configuration files, screen output, etc. are printed as code block.
de: Abschnitte aus Konfigurationsdateien, Bildschirmausgaben usw. werden als Codeblock formatiert.

source: A backslash (``\``) at the end of a line signifies that the subsequent line feed is not to be understood as an *end of line*. This circumstance may occur, for example, where commands cannot be represented in one line in the manual, yet have to be entered in the command line in one piece without the backslash or with the backslash and a subsequent :kbd:`Enter`.
de: Ein Backslash (``\``) am Ende einer Zeile weist darauf hin, dass der folgende Zeilenumbruch nicht die Bedeutung eines *End-of-Line* hat. Das kommt z.B. bei Befehlen vor, die nicht in einer Zeile des Handbuches dargestellt werden können, an der Kommandozeile aber entweder ohne den Backslash in einem Stück oder mit dem Backslash und einem anschließenden :kbd:`Enter` eingegeben werden müssen.

source: The path to a function is represented in a similar way to a file path. :menuselection:`Users --> Add` means for example, you have to click :guilabel:`Users` in the main menu and :guilabel:`Add` in the submenu.
de: Der Weg zu einer Funktion wird ähnlich wie ein Dateipfad dargestellt. :menuselection:`Benutzer --> Hinzufügen` bedeutet beispielsweise, dass im Hauptmenü auf :guilabel:`Benutzer` und im erscheinenden Untermenü auf :guilabel:`Hinzufügen` zu klicken ist.
