Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/installation.po
Languages: de

source: Installation as Docker image
de: Installation als Docker Image

source: Univention provides UCS as Docker images in the `Docker Hub <docker-hub-univention_>`_. The description of the Docker images explains how they can be configured.
de: Univention stellt UCS als Docker Images im `Docker Hub <docker-hub-univention_>`_ bereit. In der Beschreibung der jeweiligen Docker Images ist erklärt, wie diese in Betrieb genommen werden können.

source: In a standard installation, the Docker images are used in a network that cannot be reached directly from outside the server. If multiple Docker images are used and they are executed on different Docker servers, a Software Defined Network or a VPN solution should be used.
de: Die Docker Images werden bei einer Standardinstallation in einem Netzwerk betrieben, welches von außerhalb des Servers nicht direkt erreicht werden kann. Sofern mehrere Docker Images eingesetzt werden und diese auf unterschiedlichen Docker Servern betrieben werden, sollte entsprechend ein *Software Defined Network* oder eine VPN Lösung eingesetzt werden.

source: The process for setting up a UCS instance in Citrix XenServer is documented in :cite:t:`xenserver-installation`.
de: Die Einrichtung einer UCS-Instanz in Citrix XenServer ist unter :cite:t:`xenserver-installation` dokumentiert.
