Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/installation.po
Languages: de

source: Once the partitioning is complete, the UCS basic system and additional software is installed automatically. This can take some time depending on the speed of the hardware used. The system is then made ready to boot via the installation of the GRUB boot loader.
de: Nach Abschluss der Partitionierung werden automatisch das UCS-Grundsystem sowie weitere Software installiert. Dies kann je nach Geschwindigkeit der verwendeten Hardware einige Zeit beanspruchen. Nachfolgend wird das System durch die Installation des GRUB-Bootloaders bootfähig gemacht.

source: Finish the installation
de: Installation abschließen

source: A restart into the freshly installed system follows subsequently in order to complete the configuration within it.
de: Ein Systemneustart in das frisch installierte System erfolgt anschließend, um darin die Konfiguration abzuschließen.

source: Domain settings
de: Domäneneinstellungen

source: The final configuration of the UCS system is started by selecting a domain mode. There are three modes available, which influence the following configuration steps:
de: Die abschließende Konfiguration des UCS-Systems beginnt mit der Auswahl eines Domänenmodus. Es stehen drei Modi zur Verfügung, die Einfluss auf die nächsten Konfigurationsschritte haben:

source: Create a new UCS domain
de: Erstellen einer neuen UCS-Domäne

source: In the first mode, *Create a new UCS domain*, the first system in a new UCS domain is configured: a UCS system with the |UCSPRIMARYDN_e| system role. In the following configuration steps, the information required for setting up a new directory service, authentication service and DNS server are requested. A UCS domain can consist of one single or several UCS systems. Additional UCS systems can be added at a later point in time using the *Join an existing UCS domain* mode.
de: Im ersten Modus, *Erstellen einer neuen UCS-Domäne*, wird das erste System einer neuen UCS-Domäne konfiguriert: ein UCS-System mit der Systemrolle |UCSPRIMARYDN_e|. In den folgenden Konfigurationsschritten werden die notwendigen Informationen zur Einrichtung eines neuen Verzeichnisdienstes, Authentifikationsdienstes sowie DNS-Servers abgefragt. Eine UCS-Domäne kann aus einem einzelnen oder mehreren UCS-Systemen bestehen. Zusätzliche UCS-Systeme können über den Modus *Einer bestehenden UCS-Domäne beitreten* nachträglich aufgenommen werden.

source: Join into an existing Active Directory domain
de: Einer bestehenden Active-Directory-Domäne beitreten

source: This mode, in which UCS is operated as a member of an Active Directory domain, is suitable for expanding an Active Directory domain with applications available on the UCS platform. Apps installed on the UCS platform are then available for the users of the Active Directory domain to use. On selection of this mode, all the relevant information for the joining of the Active Directory domain is requested and the UCS system configured correspondingly.
de: Dieser Modus, in dem UCS als Mitglied einer Active Directory-Domäne betrieben wird, eignet sich, um eine Active Directory-Domäne um Applikationen zu erweitern, die auf der UCS-Plattform zur Verfügung stehen. Auf der UCS-Plattform installierte Apps sind dann für Benutzer der Active Directory-Domäne nutzbar. Nach der Auswahl dieses Modus werden alle relevanten Informationen für den Beitritt zur Active Directory-Domäne abgefragt und das UCS-System entsprechend konfiguriert.

source: Join into an existing UCS domain
de: Einer bestehenden UCS-Domäne beitreten

source: Selecting the *Join into an existing UCS domain* mode allows the UCS system to be configured to join an existing UCS domain. What UCS system role it is to take on in the domain is queried at a later stage.
de: Mit der Auswahl des Modus *Einer bestehenden UCS-Domäne beitreten* kann das zu konfigurierende UCS-System einer bereits existierenden UCS-Domäne beitreten. Die UCS-Systemrolle, die es in der Domäne einnehmen soll, wird in einem nachgelagerten Schritt abgefragt.

source: "Create a new UCS domain" mode
de: Modus "Erstellen einer neuen UCS-Domäne"

source: Once the *Create a new UCS domain* mode has been selected, an *organization name*, an *email address*, a *fully qualified domain name* and an *LDAP base* are requested in the following two steps.
de: Nach der Auswahl des Modus *Erstellen einer neuen UCS-Domäne* wird in den folgenden zwei Schritten ein *Organisationsname*, eine *E-Mail-Adresse*, ein *vollständiger Rechnername* sowie eine *LDAP-Basis* abgefragt.

source: Specification of an organization name is optional and it is used in the second step to generate a domain name and the LDAP base automatically.
de: Die Angabe eines Organisationsnamens ist optional und wird im zweiten Schritt für die automatische Generierung eines Domänennamens sowie der LDAP-Basis verwendet.

source: If a valid email address is specified, this is used to activate a personalized license, which is required for the use of the Univention App Center. The license is generated automatically and sent to the specified email address immediately. The license can then be imported via the UMC module *Welcome!* (:ref:`central-license`).
de: Wird eine gültige E-Mail-Adresse angegeben, wird diese verwendet, um eine personalisierte Lizenz zu aktivieren, die für die Verwendung des Univention App Centers notwendig ist. Die Lizenz wird automatisch generiert und umgehend an die angegeben E-Mail-Adresse zugeschickt. Die Lizenz kann dann über das UMC-Modul *Wilkommen!* eingespielt werden (:ref:`central-license`).

source: The name of the UCS system to be configured and the name of the DNS domain are determined from the fully qualified domain name (hostname including domain name) entered here. A suggestion is generated automatically from the organization name entered in the previous step. It is recommended not to use a publicly available DNS domain, as this can result in problems during the name resolution.
de: Aus dem hier eingetragenen vollständigen Rechnernamen (ein Rechnername inklusive Domänenname) wird automatisch der Name des zu konfigurierenden UCS-Systems sowie der Name der DNS-Domäne ermittelt. Aus dem im vorigen Schritt angegebenen Organisationsnamen wird automatisch ein Vorschlag generiert. Es wird empfohlen, keine öffentlich verfügbare DNS-Domäne zu verwenden, da dies zu Problemen in der Namensauflösung führen kann.

source: A LDAP base needs to be specified for the initialization of the directory service. A suggestion is also derived here automatically from the fully qualified domain name. This value can usually be adopted without any changes.
de: Für die Initialisierung des Verzeichnisdienstes wird die Angabe einer LDAP-Basis benötigt. Auch hier wird ein Vorschlag automatisch aus dem vollständigen Rechnernamen abgeleitet. In der Regel kann dieser Wert unverändert übernommen werden.

source: Specification of hostname and LDAP base
de: Angabe des Rechnernamens und der LDAP-Basis

source: "Join an existing Active Directory domain" mode
de: Modus "Einer bestehenden Active-Directory-Domäne beitreten"

source: If the DNS server of an Active Directory domain was specified during the network configuration, the name of the Active Directory domain controller is suggested automatically in the *Active Directory account information* step. If the suggestion is incorrect, the name of another Active Directory domain controller or another Active Directory domain can be entered here.
de: Wurde während der Netzwerkkonfiguration der DNS-Server einer Active-Directory-Domäne angegeben, wird im Schritt *Active Directory-Kontoinformationen* automatisch der Name des Active Directory-Domänencontrollers vorgeschlagen. Falls dieser Vorschlag nicht stimmen sollte, kann hier der Name eines anderen Active Directory-Domänencontrollers oder einer anderen Active Directory-Domäne angegeben werden.

source: The specification of an Active Directory account and the corresponding password is required for joining the Active Directory domain. The user account must possess the right to join new systems in the Active Directory domain.
de: Für den Beitritt in die Active Directory-Domäne ist die Angabe eines Active Directory-Kontos sowie des zugehörigen Passworts notwendig. Das Benutzerkonto muss die Berechtigung besitzen, neue Systeme in die Active Directory-Domäne aufzunehmen.

source: In addition, a hostname must be entered for the UCS system to be configured. The suggested hostname can be adopted or a new hostname entered. The domain name of the computer is derived automatically from the domain DNS server. In some scenarios (e.g., a public mail server) it can prove necessary to use a specific fully qualified domain name. The UCS system will join the Active Directory domain with the hostname specified here. Once set up, the domain name **cannot** be changed again once the configuration is completed.
de: Zusätzlich muss ein Rechnername für das zu konfigurierende UCS-System angegeben werden. Dabei kann der vorgeschlagene Rechnername übernommen oder ein eigener Rechnername eingetragen werden. Der Domänenname des Rechners wird automatisch aus dem Domänen-DNS-Server abgeleitet. In einigen Szenarien (z.B. ein öffentlicher Mailserver) kann es notwendig sein, einen bestimmten vollständigen Rechnernamen zu verwenden. Das UCS-System wird mit dem hier angegebenen Rechnernamen der Active Directory-Domäne beitreten. Der eingerichtete Domänenname kann nach Abschluss der Konfiguration **nicht** mehr verändert werden.

source: In a UCS domain, systems can be installed in different *system roles*. The first UCS system, that joins an Active Directory domain, is automatically installed with the |UCSPRIMARYDN| system role. If this mode is selected during installation of additional UCS systems, the system role selection dialogue is shown. The system roles are described within the following section.
de: In einer UCS-Domäne können Systeme in unterschiedlichen *Systemrollen* installiert werden. Das erste UCS-System, das einer Active Directory-Domäne beitritt, wird automatisch mit der Systemrolle |UCSPRIMARYDN| konfiguriert. Wird dieser Modus während der Installation eines weiteren UCS-Systems ausgewählt, wird der Dialog zur Auswahl einer Systemrolle angezeigt. Die einzelnen Systemrollen werden im folgenden Abschnitt genauer beschrieben.

source: Information on the Active directory domain
de: Informationen zum Active Directory-Domänenbeitritt

source: "Join an existing UCS domain domain" mode
de: Modus "Einer bestehenden UCS-Domäne beitreten"

source: In a UCS domain, systems can be installed in different *system roles*. The first system in a UCS domain is always installed with the |UCSPRIMARYDN_e| system role. Additional UCS systems can join the domain at a later point in time and can be configured with one of the following system roles.
de: In einer UCS-Domäne können Systeme in unterschiedlichen *Systemrollen* installiert werden. Das erste System einer UCS-Domäne wird immer mit der Systemrolle |UCSPRIMARYDN_e| installiert. Zusätzliche UCS-Systeme können der Domäne später beitreten und mit einer der folgenden Systemrollen konfiguriert werden.

source: The |UCSBACKUPDN| is the fallback system for the |UCSPRIMARYDN|. If the latter should fail, a |UCSBACKUPDN| can adopt the role of the |UCSPRIMARYDN| permanently. All the domain data and SSL security certificates are saved as read-only copies on servers with the |UCSBACKUPDN| role.
de: Der |UCSBACKUPDN| dient als Ersatzsystem des |UCSPRIMARYDN|. Sollte dieser ausfallen, kann ein |UCSBACKUPDN| die Rolle des |UCSPRIMARYDN| dauerhaft übernehmen. Auf Servern mit der Rolle |UCSBACKUPDN| werden alle Domänendaten und SSL-Sicherheitszertifikate als Nur-Lese-Kopie gespeichert.

source: All the domain data are saved as read-only copies on servers with the |UCSREPLICADN| role. In contrast to the |UCSBACKUPDN|, however, not all security certificates are saved. As accesses to the services running on a |UCSREPLICADN| are performed against the local LDAP directory service, |UCSREPLICADN| systems are ideal for site servers and the distribution of high-load services.
de: Auf Servern mit der Rolle |UCSREPLICADN| werden die Domänendaten als Nur-Lese-Kopie gespeichert. Im Gegensatz zum |UCSBACKUPDN| werden jedoch nicht alle SSL-Sicherheitszertifikate gespeichert. Da die Zugriffe der auf einem |UCSREPLICADN| laufenden Dienste gegen den lokalen LDAP-Verzeichnisdienst erfolgen, bieten sich |UCSREPLICADN|\ s für Standortserver und für die Verteilung lastintensiver Dienste an.

source: |UCSMANAGEDNODE|\ s are UCS systems without a local LDAP directory service. Access to domain data here is performed via other servers in the domain. They are therefore suitable for services which do not require a local database for authentication, for example, such as print and file servers.
de: |UCSMANAGEDNODE|\ s sind UCS Systeme ohne lokalen LDAP-Verzeichnisdienst. Der Zugriff auf Domänendaten erfolgt hierbei über andere Server der Domäne. Sie eignen sich daher für Dienste, die keine lokale Datenbank für z.B. die Authentifizierung benötigen, beispielsweise Druck- und Dateiserver.

source: Once the UCS system role has been selected, further information on the domain join is requested. If the domain join is not intended to occur automatically during the installation, the *Start join at the end of the installation* option can be disabled. If the correct DNS server was selected during the network configuration, Univention Installer can determine the name of the |UCSPRIMARYDN| system automatically. If the decision is taken to join another UCS domain, the *Search Primary Directory Node in DNS* option can be disabled and the fully qualified domain name of the preferred |UCSPRIMARYDN| entered in the input field below. The access information required for the domain join must be entered in the *Administrator account* and *Administrator password* input fields.
de: Nach der Auswahl der UCS-Systemrolle werden einige Informationen zum Domänenbeitritt abgefragt. Soll der Domänenbeitritt nicht automatisch während der Installation stattfinden, kann die Option *Domänenbeitritt am Ende der Installation starten* deaktiviert werden. Wurde während der Netzwerkkonfiguration der richtige DNS-Server ausgewählt, kann Univention Installer den Namen des |UCSPRIMARYDN| automatisch bestimmen. Falls doch in eine andere UCS-Domäne gejoined werden soll, kann die Option *Primary Directory Node im DNS suchen* deaktiviert und der vollständige Rechnername des gewünschten |UCSPRIMARYDN| im Eingabefeld darunter eingetragen werden. Die für den Domänenbeitritt notwendigen Zugangsinformationen müssen in die beiden Eingabefelder *Administrator-Kontoinformationen* und *Administrator-Passwort*.

source: Information on the domain join
de: Informationen zum Domänenbeitritt

source: In addition, a hostname must be entered for the UCS system to be configured in the next step. The suggested hostname can be adopted or a new hostname entered. The domain name of the computer is derived automatically from the domain DNS server. In some scenarios (e.g., a public mail server) it can prove necessary to use a certain fully qualified domain name. Once set up, the domain name **cannot** be changed again once the configuration is completed.
de: Im nächsten Schritt muss zusätzlich ein Rechnername für das zu konfigurierende UCS-System angegeben werden. Dabei kann der vorgeschlagene Rechnername übernommen oder ein eigener Rechnername eingetragen werden. Der Domänenname des Rechners wird automatisch aus dem Domänen-DNS-Server abgeleitet. In einigen Szenarien (z.B. ein öffentlicher Mailserver) kann es notwendig sein, einen bestimmten vollständigen Rechnernamen zu verwenden. Der eingerichtete Domänenname kann nach Abschluss der Konfiguration *nicht* mehr verändert werden.

source: Confirming the settings
de: Bestätigen der Einstellungen

source: This dialogue shows the major settings that were made. If all the settings are correct, the :guilabel:`CONFIGURE SYSTEM` button can be used to start the configuration of the UCS system, see :numref:`installation-overview`.
de: In diesem Dialog werden die wichtigsten vorgenommenen Einstellungen angezeigt. Sind alle Einstellungen korrekt, kann über die Schaltfläche :guilabel:`SYSTEM KONFIGURIEREN` die Konfiguration des UCS-Systems veranlasst werden, siehe :ref:`installation-overview`.

source: The *Update system after installation* option allows the automatic installation of available Errata updates. In addition, all patch level updates and Errata updates available are installed on a |UCSPRIMARYDN|. On all other system roles, all the patch level updates are set up to the installation status of the |UCSPRIMARYDN|. You need to sign in to the |UCSPRIMARYDN| to check the installation status. This is done using the login data specified in the join options.
de: Mit der Option *System nach der Installation aktualisieren* werden verfügbare Errata-Updates automatisch installiert. Zusätzlich werden auf einem |UCSPRIMARYDN| alle verfügbaren Patch-Level-Updates und Errata-Updates installiert. Auf allen übrigen Systemrollen werden alle Patch-Level-Updates bis zum Installationsstand des |UCSPRIMARYDN| eingerichtet. Um den Installationsstand zu prüfen, muss ein Login auf dem |UCSPRIMARYDN| erfolgen. Dazu werden die in den Join-Optionen angegebenen Anmeldedaten verwendet.

source: Installation overview
de: Installationsüberblick

source: During the configuration, a progress bar displays the progress of the installation.
de: Während der Konfiguration zeigt ein Fortschrittsbalken den Verlauf der Installation an.

source: The installation protocol of the Univention Installer is saved in the following files:
de: Das Installationsprotokoll des Univention Installers wird in den folgenden Dateien abgelegt:

source: Completion of the configuration must be confirmed with the :guilabel:`CONFIGURE SYSTEM` button. The UCS system is then prepared for the first full booting procedure and restarted.
de: Der Abschluss der Konfiguration muss über die Schaltfläche :guilabel:`SYSTEM KONFIGURIEREN` bestätigt werden. Das UCS-System wird anschließend auf den ersten vollständigen Bootvorgang vorbereitet und neugestartet.

source: The system will then boot from the hard drive. Following the boot procedure, the ``root`` and ``Administrator`` users can sign in to the UCS portal page (see :ref:`central-general`), which can be reached under the IP address set during the installation or the hostname.
de: Das System startet nun von Festplatte. Nach dem Bootvorgang können sich die Benutzer ``root`` und ``Administrator`` beim UCS Portal anmelden (siehe :ref:`central-general`), welche unter der während der Installation gesetzten IP-Adresse oder unter dem Rechnernamen erreichbar ist.

source: If the computer was installed as the first system in the UCS domain (|UCSPRIMARYDN|), the license can now be imported (see :ref:`central-license`).
de: Wenn der Rechner als erstes System der UCS-Domäne (|UCSPRIMARYDN|) installiert wurde, kann nun die Lizenz eingespielt werden (siehe :ref:`central-license`).

source: Troubleshooting for installation problems
de: Fehlersuche bei Installationsproblemen

source: Information on possible installation problems can be found in the `Univention Knowledge base <univention-kb_>`_ in the section *Installation*.
de: Hinweise zu eventuellen Installationsproblemen finden sich in der `Univention Support Datenbank <univention-kb_>`_ im Unterpunkt *Installation*.

source: Installation in text mode
de: Installation im Textmodus

source: On systems that showed a problem with the graphic variant of Univention Installer, the installation may be also started in text mode. To achieve this, in the DVD boot menu *Advanced options* the entry *Install in text mode* has to be selected.
de: Auf Systemen, die Probleme mit der graphischen Variante des Installers zeigen, kann der Installer auch im Textmodus gestartet werden. Im DVD-Bootmenu *Advanced options* muss dafür der Eintrag *Install in text mode* ausgewählt werden.

source: During installation in text mode Univention Installer shows the same information and asks for the same settings. After partitioning the hard drive, the system is prepared for the first boot and finally restarted.
de: Während der Installation im Textmodus werden die gleichen Informationen wie im graphischen Installer angezeigt und abgefragt. Jedoch wird nach der Partitionierung der Festplatten das System auf den ersten Neustart vorbereitet und schließlich neu gestartet.

source: After restart the configuration may be resumed by using a web browser. The URL :samp:`https://{SERVER-IP-ADDRESS}` or :samp:`http://{SERVER-IP-ADDRESS}` has to be opened within the browser (HTTPS is recommended). After loading the URL a login as user ``root`` is required.
de: Nach Abschluss des Neustarts kann die Konfiguration im Webbrowser fortgesetzt werden. Dafür muss im Browser die URL :samp:`https://{SERVER-IP-ADRESSE}` oder :samp:`http://{SERVER-IP-ADRESSE}` aufgerufen werden (HTTPS wird empfohlen). Nach dem Aufruf der Seite ist die Anmeldung mit dem Benutzer ``root`` erforderlich.

source: The configuration process asks for location and network setting and then resumes with the same steps as the graphic variant of the installation, see :ref:`installation-domain-settings`.
de: Die Konfiguration im Browser erfragt den Standort sowie die Netzwerkeinstellungen und fährt dann (wie in der graphischen Installation) mit dem Punkt *Domäneneinstellungen* fort, siehe :ref:`installation-domain-settings`.

source: Installation in the Amazon EC2 cloud
de: Installation in der Amazon EC2-Cloud

source: Univention provides an Amazon Machine Image (AMI) for the Amazon EC2 cloud for UCS. This generic image for all UCS system roles is used to derive an individual instance which can be configured via |UCSUMC| modules (domain name, software selection, etc.).
de: Univention stellt für UCS ein Amazon Machine Image (AMI) für die Amazon EC2 Cloud bereit. Aus diesem generischen Image für alle UCS-Systemrollen wird eine eigene Instanz abgeleitet, die über UMC-Module konfiguriert wird (Domänenname, Softwareauswahl und so weiter).

source: The process for setting up a UCS instance based on Amazon EC2 is documented in :cite:t:`ec2-quickstart`.
de: Die Einrichtung einer UCS-Instanz auf Basis von Amazon EC2 ist in :cite:t:`ec2-quickstart` dokumentiert.

source: If UCS is installed as a guest in VMware, the :menuselection:`Linux --> Other Linux system` option must be selected as the *Guest operating system* (UCS is based on Debian but the templates for Debian cannot be used).
de: Wird UCS als Gast in VMware installiert muss als *Gastbetriebssystem* die Option :menuselection:`Linux --> Anderes Linux-System` ausgewählt werden (UCS basiert zwar auf Debian, die Vorlagen für Debian können aber nicht verwendet werden).

source: The Linux kernel used in UCS includes all the support drivers necessary for operation in VMware (:file:`vmw_balloon`, :file:`vmw_pvsci`, :file:`vmw_vmci`, :file:`vmwgfx` and :file:`vmxnet3`).
de: Der in UCS verwendete Linux-Kernel bringt alle nötigen Unterstützungstreiber für den Betrieb in VMware direkt mit (:file:`vmw_balloon`, :file:`vmw_pvsci`, :file:`vmw_vmci`, :file:`vmwgfx` und :file:`vmxnet3`).

source: The open source version of the VMware Tools (Open VM Tools) is delivered with UCS. The tools can be installed using the ``open-vm-tools`` package (they are not required but do, for example, allow synchronization of the time on the virtualization server with the guest system).
de: Die Open-Source-Variante der VMware Tools (Open VM Tools) wird mit UCS ausgeliefert. Die Tools können über das Paket :program:`open-vm-tools` installiert werden (sie sind nicht zwingend notwendig, erlauben aber z.B. die Synchronisation der Zeit auf dem Gastsystem mit dem Virtualisierungsserver).
