Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/installation.po
Languages: de

source: The following documentation describes how to install Univention Corporate Server (UCS). The UCS system is installed from the DVD. The installation is interactive and prompts all the necessary system settings in a graphic interface.
de: Die folgende Dokumentation beschreibt die Installation von Univention Corporate Server (UCS). Als Installationsmedium wird eine DVD bereitgestellt. Die Installation erfolgt interaktiv und fragt alle notwendigen System-Einstellungen in einer graphischen Oberfläche ab.

source: The installation DVD is available for the computer architecture *amd64* (64-bit). In addition to support for the widely distributed BIOS systems, the DVD also includes support for the Unified Extensible Firmware Interface (UEFI) standard. The UEFI support on the DVD is also capable of starting systems with activated Secure Boot and installing UCS there.
de: Die Installations-DVD wird für die Rechnerarchitektur *amd64* (64 Bit) bereitgestellt. Die DVD bringt neben einer Unterstützung für die weit verbreiteten BIOS-Systeme auch eine Unterstützung für den Unified Extensible Firmware Interface-Standard (UEFI) mit. Die UEFI-Unterstützung auf der DVD ist auch in der Lage, auf Systemen mit aktiviertem SecureBoot zu starten und UCS dort zu installieren.

source: Please note that simultaneous operation of UCS and Debian on a UEFI system starting with UCS 5.0-0 is not supported. The reason for this is the GRUB boot loader of |UCSUCS|, which partly uses the same configuration files as Debian. An already installed Debian leads to the fact that UCS cannot be booted (any more) after the installation of or an update to UCS 5.0. A subsequent installation of Debian will also result in UCS 5.0 not being able to boot.
de: Es ist zu beachten, dass beginnend ab UCS 5.0-0 ein gleichzeitiger Betrieb von UCS und Debian auf einem UEFI System nicht unterstützt wird. Ursache hierfür ist der Bootloader GRUB von |UCSUCS|, der teilweise die gleichen Konfigurationsdateien wie Debian verwendet. Ein bereits installiertes Debian führt dazu, dass UCS nach der Installation von oder einem Update auf UCS 5.0 nicht (mehr) gebootet werden kann. Eine nachträgliche Installation von Debian wird ebenfalls dazu führen, dass UCS 5.0 nicht mehr gebootet werden kann.

source: Following installation on hardware or in a virtualization solution, UCS can also be installed on the Amazon EC2 cloud using an AMI image. Further information can be found in :ref:`Installation in the Amazon EC2 cloud <installation-amazon-ec2>`.
de: Neben einer Installation auf Hardware oder in einer Virtualisierungslösung kann UCS auch über ein AMI-Image in der Amazon EC2-Cloud installiert werden. Hinweise dazu finden sich in :ref:`installation-amazon-ec2`.

source: The installer's input masks can be operated with the mouse or via the keyboard.
de: Die Eingabemasken des Installers können mit der Maus oder über die Tastatur bedient werden.

source: The :kbd:`Tab` key can be used to proceed to the next field.
de: Mit der :kbd:`Tab`-Taste kann der Fokus auf das nächste Feld bewegt werden.

source: The key combination of :kbd:`Shift+Tab` can be used to return to the previous field.
de: Auf das vorherige Feld wird mit der Tastenkombination :kbd:`Shift+Tab` gesprungen.

source: The :kbd:`Enter` key is used to assign values to the input field and confirm buttons.
de: Mit der :kbd:`Eingabe`-Taste werden Werte im Eingabefeld übergeben und Schaltflächen betätigt.

source: Within a list or table, the *arrow keys* can be used for navigating between entries.
de: Innerhalb einer Liste oder Tabelle kann mit den *Pfeiltasten* zwischen den Einträgen gewechselt werden.

source: The :guilabel:`Cancel` button can be used to cancel the current configuration step. An earlier configuration step can then be selected again in the menu that is subsequently shown. Under certain circumstances, subsequent configuration steps cannot be directly selected if the earlier steps have not been completed.
de: Über die Schaltfläche :guilabel:`Abbrechen` kann der aktuelle Konfigurationsschritt abgebrochen werden. Im anschließend angezeigten Menü kann dann ein vorhergehender Konfigurationsschritt erneut ausgewählt werden. Nachfolgende Konfigurationsschritte sind unter Umständen nicht direkt auswählbar, wenn die vorhergehenden Schritte noch nicht vollständig durchlaufen wurden.

source: Selecting the installation mode
de: Auswahl des Installationsmodus

source: After booting the system from the installation medium, the following boot prompt is displayed:
de: Nach dem Starten des Systems vom Installationsmedium erscheint der folgende Bootprompt:

source: Installation boot prompt
de: Bootprompt der Installation

source: Now you can choose between several installation procedures.
de: Hier kann zwischen verschiedenen Installationsverfahren gewählt werden.

source: :guilabel:`Start with default settings` starts the interactive, graphic installation. During the installation, the system requests a number of parameters such as the network settings, hard drive partitions and domain settings for the UCS system to be installed and then performs the installation and the configuration.
de: :guilabel:`Start with default settings` startet die interaktive, graphische Installation von UCS. Bei der Installation fragt das System nach einigen Parametern wie Netzwerkeinstellungen, Festplattenpartitionierung und Domäneneinstellungen für das zu installierende UCS-System und führt anschließend die Installation und Konfiguration durch.

source: :guilabel:`Start with manual network settings` performs a standard installation, where the network is not configured automatically through DHCP. This is practical on systems, where the network must be setup manually.
de: :guilabel:`Start with manual network settings` führt eine Standardinstallation durch, bei der das Netzwerk nicht automatisch per DHCP konfiguriert wird. Dies ist auf Systemen sinnvoll, wo das Netzwerk manuell eingerichtet werden muss.

source: The :guilabel:`Advanced options` submenu offers advanced options for the installation process for selection:
de: Das Untermenü :guilabel:`Advanced options` bietet die Auswahl fortgeschrittener Optionen für den Installationsprozess:

source: :guilabel:`Start in text mode` performs an interactive standard installation in text mode. This is practical on systems which display problems with the graphic version of the installer.
de: :guilabel:`Start in text mode` führt eine interaktive Standardinstallation im Textmodus durch. Dies ist auf Systemen sinnvoll, die Probleme mit der graphischen Variante des Installers zeigen.

source: :guilabel:`Rescue mode` is there to recover systems unable to boot.
de: :guilabel:`Rescue mode` (Rettungsmodus) ist da, um nicht bootende Systeme wiederherzustellen.

source: :guilabel:`Boot from first hard drive` boots the operating system installed on the first hard drive instead of the UCS installation.
de: :guilabel:`Boot from first hard drive` startet nicht die UCS-Installation, sondern das auf der ersten Festplatte installierte Betriebssystem.

source: :guilabel:`Accessible dark contrast installer menu` allows to start the setup in a dark and contrast rich mode.
de: :guilabel:`Accessible dark contrast installer menu` erlaubt das Starten der Installation in einem dunklen und kontrastreichen Modus.

source: Once one of the installation option is selected, the kernel is loaded from the installation medium. The actual installation is divided into separate modules, which can be loaded from the installation medium subsequently if necessary. There are modules for network configuration or for selecting the software to be installed, among others.
de: Nach der Auswahl einer der Installationsoptionen wird der Kernel vom Installationsmedium geladen. Die eigentliche Installation gliedert sich in einzelne Module, die bei Bedarf vom Installationsmedium nachgeladen werden. In einem Modul werden inhaltlich zusammenhängende Einstellungen getroffen, es gibt beispielsweise Module für die Netzkonfiguration oder die Auswahl der zu installierenden Software.

source: Selecting the installation language
de: Auswahl der Installationssprache

source: In the first step, you can select the system language you wish to use. The selection has an influence on the use of language-specific characters and permits the representation of program output in the selected languages in the installed UCS system.
de: Im ersten Schritt wird die Systemsprache ausgewählt, die verwendet werden soll. Die Auswahl beeinflusst die Verwendung von sprachspezifischen Schriftzeichen und ermöglicht die Darstellung von Programmausgaben in den ausgewählten Sprachen im installierten UCS-System.

source: If Univention Installer has been translated into the selected language (currently German and English), the selected language is also used during the installation, otherwise the installation is performed in English.
de: Sofern der Univention Installer die ausgewählte Sprache unterstützt, wird diese als Installationssprache verwendet, andernfalls wird Englisch verwendet. Derzeit sind Deutsch und Englisch vom Univention Installer unterstützt.

source: Selecting the location
de: Auswahl des Standorts

source: Once the system language has been selected, a small list of locations is displayed based on the selected language. Select a suitable location from the list. The selected location is used to set the time zone or the correct language variant, for example. Should none of the displayed locations be appropriate, a more extensive list can be displayed using the menu entry **other**.
de: Nach der Auswahl der Systemsprache wird basierend auf der zuvor ausgewählten Sprache eine kleine Liste mit Standorten angezeigt. Wählen Sie aus der Liste einen passenden Standort aus. Der ausgewählte Standort wird verwendet, um z.B. die Zeitzone zu setzen oder den korrekten Sprachdialekt zu ermitteln. Falls kein angezeigter Standort passend sein sollte, kann über den Menüeintrag **weitere** eine umfangreichere Liste angezeigt werden.

source: Selecting the keyboard layout
de: Auswahl der Tastaturbelegung

source: The keyboard layout can be selected independently of the system language. The language selected here should be compatible with the keyboard used as it may otherwise cause operating problems.
de: Unabhängig von der Systemsprache kann ein Tastaturlayout ausgewählt werden. Die hier ausgewählte Sprache sollte zur verwendeten Tastatur passen, das es sonst zu Bedienproblemen kommen kann.

source: Network configuration
de: Netzwerkkonfiguration

source: Initially, the Univention Installer attempts to configure the network interfaces automatically. This can be disabled by selecting the menu item :guilabel:`Start with manual network settings` from the menu of the boot loader. Firstly, an attempt is made to determine an IPv6 address via the stateless address autoconfiguration (SLAAC). If this is not successful, the Univention Installer attempts to request an IPv4 address via the Dynamic Host Configuration Protocol (DHCP). If this is successful, the manual network configuration of Univention Installer is skipped.
de: Initial versucht der Univention Installer eine automatische Konfiguration der Netzwerkschnittstellen vorzunehmen. Dies kann durch die Auswahl des Menüeintrags :guilabel:`Start with manual network settings` im Menü des Bootloaders deaktiviert werden. Dabei wird zunächst versucht, eine IPv6-Adresse über die Stateless Address Autoconfiguration (SLAAC) zu ermitteln. Sollte dies nicht erfolgreich sein, versucht der Univention Installer eine IPv4-Adresse über das Dynamic Host Configuration Protocol (DHCP) zu erfragen. Ist dies erfolgreich, wird die manuelle Netzwerkkonfiguration von Univention Installer übersprungen.

source: Automatic network configuration
de: Automatische Netzwerkkonfiguration

source: If there is no DHCP server present in the local network or static configuration of the network interface is required, the :guilabel:`Cancel` button can be selected. The Univention Installer then offers to repeat the automatic configuration or to configure the interface manually.
de: Sollte kein DHCP-Server im lokalen Netz vorhanden sein oder es soll eine statische Konfiguration der Netzwerkschnittstelle stattfinden, kann die Schaltfläche :guilabel:`Abbrechen` ausgewählt werden. Der Univention Installer bietet dann an, die automatische Konfiguration zu wiederholen oder die Schnittstelle manuell zu konfigurieren.

source: At least one network interface is required for the installation of |UCSUCS|. If no supported network card is detected, Univention Installer opens a list of supported drivers for selection.
de: Für die Installation von |UCSUCS| ist mindestens eine Netzwerkschnittstelle erforderlich. Wird keine unterstützte Netzwerkkarte erkannt, bietet Univention Installer eine Liste der unterstützten Treiber zur Auswahl an.

source: Selecting the manual network configuration
de: Auswahl der manuellen Netzwerkkonfiguration

source: In manual configuration it is possible to specify either a static IPv4 or an IPv6 address for the system. IPv4 addresses have a 32-bit length and are generally written in four blocks in decimal form (e.g., ``192.0.2.10``), whereas IPv6 addresses are four times as long and typically written in hexadecimal form (e.g., ``2001:0DB8:FE29:DE27:0000:0000:0000:0000``). In addition to entering a static IP address, values for network masks, gateways and DNS servers are also requested.
de: Bei der manuellen Konfiguration kann für das System wahlweise eine statische IPv4- oder eine IPv6-Adresse angegeben werden. IPv4-Adressen haben 32 Bit Länge und werden in der Regel in vier Blöcken in Dezimalschreibweise dargestellt (z.B. ``192.0.2.10``), während IPv6-Adressen vier Mal so lang sind und typischerweise hexadezimal dargestellt werden (z.B. ``2001:0DB8:FE29:DE27:0000:0000:0000:000A``). Neben der Angabe einer statischen IP-Adresse werden auch Werte für Netzmaske, Gateway und DNS-Server abgefragt.

source: Specifying an IP address
de: Angabe einer IP-Adresse

source: The following points must be taken into consideration when specifying a DNS server manually. They depend on the intended subsequent use of the UCS system.
de: Bei der manuellen Angabe eines DNS-Server sind die folgenden Punkte zu beachten. Sie sind abhängig vom späteren Verwendungszweck des UCS-Systems.

source: When installing the first UCS system in a new UCS domain, the IP address of the local router (if it provides the DNS service) or the DNS server of the internet provider should be entered.
de: Bei der Installation des ersten UCS-Systems einer neuen UCS-Domäne sollte die IP-Adresse des lokalen Routers (sofern dieser den DNS-Dienst bereitstellt) oder der DNS-Server des Internet-Providers angegeben werden.

source: When installing every additional UCS system, the IP address of a UCS Directory Node system must be specified as the DNS server. This is essential for the automatic detection of the |UCSPRIMARYDN| to function. In case of doubt, the IP address of the UCS |UCSPRIMARYDN| system should be entered.
de: Bei der Installation jedes weiteren UCS-Systems muss als DNS-Server die IP-Adresse eines UCS Directory Nodes angegeben werden. Dies ist notwendig, damit die automatische Erkennung des |UCSPRIMARYDN| funktioniert. Im Zweifelsfall sollte hier die IP-Adresse des UCS |UCSPRIMARYDN| angegeben werden.

source: If the UCS system is to join a Windows Active Directory domain during the installation, the IP address of an Active Directory domain controller system should be specified as the DNS server. This is essential for the automatic detection of the Windows Active Directory domain controller to function.
de: Soll das UCS-System während der Installation einer Windows-Active Directory-Domäne beitreten, muss als DNS-Server die IP-Adresse eines Active Directory-Domänencontroller-Systems angegeben werden. Dies ist notwendig, damit die automatische Erkennung des Windows-Active Directory-Domänencontroller funktioniert.

source: Setting up the root password
de: Einrichtung des root-Passworts

source: Setting of a password for the ``root`` user is required for logging on to the installed system. If a |UCSPRIMARYDN| is installed, this password is also employed for the ``Administrator`` user. In later operation, the passwords for the ``root`` and ``Administrator`` users can be managed independently of each other. The password must be re-entered in the second entry field.
de: Für die Anmeldung am installierten System ist die Angabe eines Passworts für den Benutzer ``root`` notwendig. Wird ein |UCSPRIMARYDN| installiert, wird dieses Passwort auch für den Benutzer ``Administrator`` eingetragen. Im späteren Betrieb können die Passworte der Benutzer ``root`` und ``Administrator`` unabhängig voneinander verwaltet werden. Das Passwort muss im zweiten Feld erneut eingetragen werden.

source: The password must contain at least eight characters for security reasons.
de: Das Passwort muss aus Sicherheitsgründen mindestens acht Zeichen umfassen.

source: Setting the root password
de: root-Passwort einrichten

source: Partitioning the hard drive
de: Partitionierung der Festplatten

source: The Univention Installer supports the partitioning of hard drives and the creation of different file systems (e.g., *ext4* and *XFS*). In addition, it is also possible to set up mechanisms such as the logical volume manager (LVM), RAID or partitions encrypted with LUKS.
de: Der Univention Installer unterstützt die Partitionierung von Festplatten und die Erstellung von unterschiedlichen Dateisystemen (u.a. ``ext4`` und ``XFS``). Darüber hinaus können auch Mechanismen wie der Logical Volume Manager (LVM), RAID oder mit LUKS verschlüsselte Partitionen eingerichtet werden.

source: As of UCS 4.0, the Univention Installer selects a suitable partition model (MBR or GPT) automatically depending on the size of the selected hard drive. On systems with the *Unified Extensible Firmware Interface (UEFI)*, the GUID Partition Table (GPT) is used automatically.
de: Ab UCS 4.0 wählt der Univention Installer automatisch einen passenden Partitionstyp (MBR oder GPT) in Abhängigkeit von der Größe der gewählten Festplatte aus. Auf Systemen mit *Unified Extensible Firmware Interface (UEFI)* wird automatisch die GUID Partition Table (GPT) verwendet.

source: The Univention Installer offers guided installations to make installation simpler. In the guided installation, certain standard schemes with respect to the partitioning and formatting are applied to the selected hard drive. In addition, it is also possible to perform partitioning manually.
de: Zur einfacheren Installation bietet der Univention Installer geführte Installationen an. Bei der geführten Installation werden Standardschemata bezüglich Partitionierung und Formatierung auf die ausgewählte Festplatte angewendet. Darüber hinaus kann auch eine manuelle Partitionierung vorgenommen werden.

source: There are three schemes available for selection for guided partitioning:
de: Es stehen drei Schemata für eine geführte Partitionierung zur Auswahl:

source: Guided - Use entire disk
de: Geführt - vollständige Festplatte verwenden

source: In this scheme, an individual partition is created for each file system. Abstraction layers like LVM are not used. During the following step the number of file systems or partitions is assigned. The size of the partitions is restricted to the size of the respective hard drive.
de: In diesem Schema wird für jedes Dateisystem eine eigene Partition angelegt. Abstraktionsschichten wie LVM werden nicht verwendet. Im nachfolgenden Schritt wird bestimmt, welche Dateisysteme/Partitionen erstellt werden sollen. Die Größe der Partitionen ist in diesem Schema auf die Größe der jeweiligen Festplatte beschränkt.

source: Guided - Use entire disk and set up LVM
de: Geführt - gesamte Platte verwenden und LVM einrichten

source: If the second scheme is selected, a *Logical Volume Group (LVM)* is set up on the selected hard drive first. A separate logical volume is then created within the volume group for each file system. In this scheme, the size of the logical volume is restricted by the size of the volume group, which can also be subsequently enlarged with additional hard drives. In case of doubt, select this partitioning scheme.
de: Mit der Auswahl des zweiten Schemas wird auf der ausgewählten Festplatte zunächst eine *Logical Volume Group (LVM)* eingerichtet. Anschließend wird für jedes Dateisystem ein eigenes Logical Volume innerhalb der Volume Group angelegt. Die Größe der Logical Volumes ist bei diesem Schema durch die Größe der Volume Group beschränkt, die später auch durch weitere Festplatten vergrößert werden kann. Im Zweifelsfall wählen Sie dieses Partitionierungsschema.

source: Guided - Use entire disk with encrypted LVM
de: Geführt - gesamte Platte mit verschlüsseltem LVM

source: This version is the same as the previous version, with the addition that the LVM volume group is also encrypted. Consequently, the password for the encrypted volume group has to be entered every time the system is started up.
de: Diese Variante entspricht der vorherigen Variante, allerdings wird zusätzlich die LVM Volume Group verschlüsselt. Dies macht die Angabe des Passwort für die verschlüsselte Volume Group bei jedem Start von UCS notwendig.

source: In all three versions, the existing data on the selected hard drive are deleted during the partitioning!
de: Bei allen drei Varianten gehen die existierenden Daten auf der ausgewählten Festplatte während der Partitionierung verloren!

source: Selecting the partitioning scheme
de: Auswahl des Partitionierungsschemas

source: The next step is to select a hard drive from the list of those detected to which the partitioning version should be applied.
de: Im Anschluss muss aus der Liste der erkannten Festplatte eine ausgewählt werden, auf die die Partitionierungsvariante angewendet werden soll.

source: There are three sub versions for each partitioning version, which differ in the number of file systems created:
de: Für jede Partitionierungsvariante gibt es drei Untervarianten, die sich in der Anzahl der erstellten Dateisysteme unterscheiden:

source: All files in one partition
de: Alle Dateien auf eine Partition

source: In this version, just one partition or logical volume is created and the :file:`/` file system saved there.
de: Bei dieser Variante wird nur eine Partition oder ein Logical Volume erstellt, auf dem das :file:`/`-Dateisystem angelegt wird.

source: In addition to a file system for :file:`/`, an additional file system is also created for :file:`/home/`.
de: Neben einem Dateisystem für :file:`/` wird ein weiteres Dateisystem für :file:`/home/` angelegt.

source: Separate :file:`/home`, :file:`/usr`, :file:`/var` and :file:`/tmp` partition
de: Separate :file:`/home`, :file:`/usr`, :file:`/var` und :file:`/tmp`\ -Partition

source: In addition to a file system for :file:`/`, an additional file system is also created each for :file:`/home/`, :file:`/usr/`, :file:`/var/` and :file:`/tmp/`.
de: Neben einem Dateisystem für :file:`/` wird für :file:`/home/`, :file:`/usr/`, :file:`/var/` und :file:`/tmp/` jeweils ein eigenes Dateisystem angelegt.

source: Before every active change to the hard drive, the change is displayed again in an additional dialogue and must be confirmed explicitly.
de: Vor jeder aktiven Änderung auf der Festplatte wird diese noch einmal in einem zusätzlichen Dialog angezeigt und muss explizit bestätigt werden.

source: Confirmation of changes to the hard drive
de: Bestätigung von Änderungen auf der Festplatte
