Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/ip-config.po
Languages: de

source: DHCP shared network objects are managed in the UMC module :guilabel:`DHCP` (see :ref:`central-user-interface`). To create a shared network, a DHCP service must be selected in the left column of the module. :menuselection:`Add --> DHCP: Shared Network` can be used to register a network.
de: DHCP-Shared-Network-Objekte werden im UMC-Modul :guilabel:`DHCP` verwaltet (siehe auch :ref:`central-user-interface`). Um ein Shared Network anzulegen, muss in der linken Spalte des Moduls ein DHCP-Service ausgewählt werden. Mit :menuselection:`Hinzufügen --> DHCP: Shared Network` kann dann ein Netzwerk registriert werden.

source: A shared network must contain at least one shared subnet object. Otherwise the DHCP service will terminate itself and cannot be restarted until the configuration is fixed.
de: Ein Shared-Network muss mindestens einen Shared-Subnet-Eintrag enthalten. Anderenfalls beendet sich der DHCP-Dienst und kann nicht gestartet werden, bis die Konfiguration korrigiert ist.

source: A name for the shared network must be entered in this input field.
de: In dieses Eingabefeld ist ein Name für das Shared Network einzutragen.

source: Subnets are declared as a *DHCP shared subnet* when they use the same, common physical network. All subnets which use the same network must be stored below the same shared network container. A separate *DHCP shared subnet* object must be created for each subnet.
de: Als *DHCP:Shared Subnet* werden Subnetze deklariert, die gemeinsam dasselbe physikalische Netzwerk verwenden. Alle Subnetze, die dasselbe Netzwerk verwenden, müssen unterhalb desselben Shared Network-Containers angelegt werden. Für jedes Subnetz ist ein eigenes *DHCP:Shared Subnet*-Objekt anzulegen.

source: DHCP shared subnet objects can only be managed via the UMC module :guilabel:`LDAP directory`. To do so, one must always be in a DHCP shared network object - a DHCP shared subnet object must always be created below a DHCP shared network object - and a *DHCP shared subnet* object added with :guilabel:`Add`.
de: DHCP-Shared-Subnet-Objekte können nur über das UMC-Modul :guilabel:`LDAP-Verzeichnis` verwaltet werden. Dazu muss in ein DHCP-Shared Network-Objekt navigiert werden - ein DHCP-Shared Subnet-Objekt muss immer unterhalb eines DHCP-Shared Network-Objektes angelegt werden - und dort mit :guilabel:`Hinzufügen` ein *DHCP: Shared Subnet*-Objekt eingefügt werden.

source: Configuration of clients via DHCP policies
de: Konfiguration von Clients durch DHCP-Richtlinien

source: Many of the settings for DHCP are configured via policies. They are also applied to DHCP computer objects if a policy is linked to the LDAP base or one of the other intermediate containers. As the settings for DHCP computer objects have the highest priority, other settings for subnetwork and service objects are ignored.
de: Viele Einstellungen für DHCP werden über Richtlinien konfiguriert. Diese finden auch Anwendung auf DHCP-Rechner-Objekte, wenn eine Richtlinie mit der LDAP-Basis oder einem der anderen dazwischenliegenden Container verknüpft ist. Da die Einstellungen an DHCP-Rechner-Objekte die höchste Priorität haben, werden andere Einstellungen an Subnetz- oder Service-Objekten ignoriert.

source: For this reason, DHCP policies should be linked directly to the DHCP network objects (e.g., the DHCP subnetworks).
de: DHCP-Richtlinien sollten von daher direkt mit den DHCP-Netzwerk-Objekten (z.B. den DHCP-Subnetzen) verknüpft werden.

source: Alternatively, the LDAP class ``univentionDhcpHost`` can be added in the advanced settings of the policies under :menuselection:`Object --> Excluded object classes`. Such policies are then no longer applied to the DHCP computer objects, with the result that the settings from the DHCP subnetwork and service are used.
de: Alternativ kann in den erweiterten Einstellungen der Richtlinien unter :menuselection:`Objekt --> Ausgeschlossene Objektklassen` die LDAP-Klasse ``univentionDhcpHost`` hinzugefügt werden. Solche Richtlinien finden dann nicht länger auf die DHCP-Rechner-Objekte Anwendung, wodurch dann die Einstellungen aus DHCP-Subnetz und -Service benutzt werden.

source: When using the command line :command:`udm dhcp/host list` (see also :ref:`central-udm-example-dnsdhcp`), it is possible to use the option ``--policies 0`` to display the effective settings.
de: Bei Verwendung der Kommandozeile :command:`udm dhcp/host list` (siehe auch :ref:`central-udm-example-dnsdhcp`) kann die Option ``--policies 0`` verwendet werden, um die effektiven Einstellungen anzeigen zu lassen.

source: Setting the gateway
de: Vorgabe des Gateways

source: The default gateway can be specified via DHCP with a *DHCP routing* policy, which is managed in the UMC module :guilabel:`Policies` (see :ref:`central-policies`)
de: Das Default-Gateway kann per DHCP über eine Richtlinie vom Typ *DHCP Routing* festgelegt werden, die im UMC-Modul :guilabel:`Richtlinien` verwaltet wird (siehe auch :ref:`central-policies`).

source: Routers
de: Router

source: The names or IP addresses of the routers are to be entered here. It must be verified that the DHCP server can resolve these names in IP addresses. The routers are contacted by the client in the order in which they stand in the selection list.
de: Hier sind die Namen oder IP-Adressen der Router einzutragen. Dabei ist darauf zu achten, dass der DHCP-Server diese Namen in IP-Adressen auflösen kann. Die Router werden vom Client in der Reihenfolge angesprochen, in der sie in der Auswahlliste erscheinen.

source: Setting the DNS servers
de: Vorgabe der DNS-Server

source: The name servers to be used by a client can be specified via DHCP with a *DHCP DNS* policy, which is managed in the UMC module :guilabel:`Policies` (see :ref:`central-policies`)
de: Die von einem Client zu verwendenden Nameserver können per DHCP über eine Richtlinie vom Typ *DHCP DNS* festgelegt werden, die im UMC-Modul :guilabel:`Richtlinien` verwaltet wird (siehe auch :ref:`central-policies`).

source: Domain name
de: Domänenname

source: The name of the domain, which the client automatically appends on computer names that it sends to the DNS server for resolution and which are not FQDNs. Usually this is the name of the domain to which the client belongs.
de: Der Name der Domäne, den der Client automatisch an Rechnernamen anhängt, die er zur Auflösung an den DNS-Server schickt und die keine vollqualifierten Domänennamen sind. Üblicherweise wird hier der Name der Domäne verwendet, der der Client angehört.

source: Domain name servers
de: DNS-Server

source: Here IP addresses or fully qualified domain names (FQDNs) of DNS servers can be added. When using FQDNs, it must be verified that the DHCP server can resolve the names in IP addresses. The DNS servers are contacted by the clients according to the order specified here.
de: Hier können IP-Adressen oder vollqualifizierte Domänennamen (FQDNs) von DNS-Servern hinzugefügt werden. Bei der Verwendung von FQDNs ist darauf zu achten, dass der DHCP-Server die Namen in IP-Adressen auflösen kann. Die DNS-Server werden von den Clients entsprechend der hier angegebenen Reihenfolge kontaktiert.

source: Setting the WINS server
de: Vorgabe des WINS-Server

source: The WINS server to be used can be specified via DHCP with a *DHCP NetBIOS* policy, which is managed in the UMC module :guilabel:`Policies` (see :ref:`central-policies`)
de: Der zu verwendende WINS-Server kann per DHCP über eine Richtlinie vom Typ *DHCP NetBIOS* festgelegt werden, die im UMC-Modul :guilabel:`Richtlinien` verwaltet wird (siehe auch :ref:`central-policies`).

source: NetBIOS name servers
de: NetBIOS-Nameserver

source: The names or IP addresses of the NetBIOS name servers (also known as WINS servers) should be entered here. It must be verified that the DHCP server can resolve these names in IP addresses. The servers entered are contacted by the client in the order in which they stand in the selection list.
de: Hier sind die Namen oder IP-Adressen der NetBIOS-Nameserver (auch bekannt als WINS-Server) einzutragen. Dabei ist darauf zu achten, dass der DHCP-Server diese Namen in IP-Adressen auflösen kann. Die angegebenen Server werden vom Client in der Reihenfolge angesprochen, in der sie in der Auswahlliste erscheinen.

source: The NetBIOS over TCP/IP scope for the client according to the specification in :rfc:`1001` and :rfc:`1002`. Attention must be paid to uppercase and lowercase when entering the NetBIOS scope.
de: Der NetBIOS over TCP/IP-Scope für den Client nach der Spezifikation in :rfc:`1001` und :rfc:`1002`. Bei der Angabe des NetBIOS Scopes ist die Groß- und Kleinschreibung zu beachten.

source: This field sets the node type of the client. Possible values are:
de: Dieses Auswahlfeld legt den Node Type eines Clients fest. Mögliche Werte sind:

source: ``1 B-node`` (Broadcast: no WINS)
de: ``1 B-node`` (Broadcast: kein WINS)

source: ``2 P-node`` (Peer: only WINS)
de: ``2 P-node`` (Peer: ausschließlich WINS)

source: ``4 M-node`` (Mixed: first Broadcast, then WINS)
de: ``4 M-node`` (Mixed: erst Broadcast, dann WINS)

source: ``8 H-node`` (Hybrid: first WINS, then Broadcast)
de: ``8 H-node`` (Hybrid: erst WINS, dann Broadcast)

source: Configuration of the DHCP lease
de: Konfiguration der DHCP-Vergabedauer (Lease)

source: The validity of an assigned IP address - a so-called DHCP lease - can be specified with a *DHCP lease time* policy, which is managed in the UMC module :guilabel:`Policies` (see :ref:`central-policies`)
de: Die Gültigkeit einer vergebenen IP-Adresse - ein sogenanntes DHCP-Lease - kann über eine Richtlinie vom Typ *DHCP Lease-Zeit* festgelegt werden, die im UMC-Modul :guilabel:`Richtlinien` verwaltet wird (siehe auch :ref:`central-policies`).

source: Default lease time
de: Standard Lease-Zeit

source: If the client does not request a specific lease time, the standard lease time is assigned. If this input field is left empty, the DHCP server's default value is used.
de: Wenn der Client keine bestimmte Lease-Zeit anfragt, so wird die Standard-Lease-Zeit zugewiesen. Bleibt das Eingabefeld leer, wird der Vorgabewert des DHCP-Servers verwendet.

source: Maximum lease time
de: Maximale Lease-Zeit

source: The maximum lease time specifies the longest period of time for which a lease can be granted. If this input field is left empty, the DHCP server's default value is used.
de: Die maximale Lease-Zeit gibt die längste Zeitspanne an, die für einen Lease vergeben werden kann. Bleibt das Eingabefeld leer, wird der Vorgabewert des DHCP-Servers verwendet.

source: Minimum lease time
de: Minimale Lease-Zeit

source: The minimum lease time specifies the shortest period of time for which a lease can be granted. If this input field is left empty, the DHCP server's default value is used.
de: Die minimale Lease-Zeit gibt die kürzeste Zeitspanne an, die ein Lease gültig sein soll. Bleibt das Eingabefeld leer, wird der Vorgabewert des DHCP-Servers verwendet.

source: Configuration of boot server/PXE settings
de: Konfiguration von Bootserver/PXE-Einstellungen

source: A *DHCP Boot* policy is used to assign computer configuration parameters for booting via BOOTP/PXE. They are managed in the UMC module :guilabel:`Policies` (see :ref:`central-policies`)
de: Mit einer *DHCP Boot*-Richtlinie werden Rechnern Konfigurationsparameter für das Booten über BOOTP/PXE zugewiesen. Sie wird im UMC-Modul :guilabel:`Richtlinien` verwaltet (siehe auch :ref:`central-policies`).

source: *Boot* tab
de: Reiter *Boot*

source: The IP address or the FQDN of the PXE boot server from which the client should load the boot file is entered in the input field. If no value is entered in this input field, the client boots from the DHCP server from which it retrieves its IP address.
de: In diesem Eingabefeld ist die IP-Adresse oder der FQDN des PXE-Boot-Servers einzutragen, von dem der Client die Boot-Datei laden soll. Wird in diesem Eingabefeld kein Wert eingetragen, bootet der Client von dem DHCP-Server, von dem er seine IP-Adresse bezieht.

source: Boot filename
de: Boot-Dateiname

source: The path to the boot file is entered here. The path must be entered relative to the base directory of the TFTP service (:file:`/var/lib/univention-client-boot/`).
de: Hier ist der Pfad zur Boot-Datei einzutragen. Der Pfad muss relativ zum Basisverzeichnis des TFTP-Dienstes (:file:`/var/lib/univention-client-boot/`) angegeben werden.

source: Further DHCP policies
de: Weitere DHCP-Richtlinien

source: There are some further DHCP policies available, but they are only required in special cases.
de: Einige weitere DHCP-Richtlinien stehen zur Verfügung, sind aber nur für Sonderfälle nötig.

source: DHCP Dynamic DNS
de: DNS Aktualisierung

source: *DHCP Dynamic DNS* allows the configuration of dynamic DNS updates. These cannot yet be performed with a LDAP-based DNS service as provided out-of-the-box by UCS.
de: *DNS Aktualisierung* erlaubt die Konfiguration von dynamischen DNS-Aktualisierungen. Diese können bislang noch nicht gegen einen LDAP-basierten DNS-Dienst durchgeführt werden, wie er von UCS bereitgestellt wird.

source: DHCP Allow/Deny
de: DHCP Erlauben/Verbieten

source: *DHCP Allow/Deny* allows the configuration of different DHCP options, which control what clients are allowed to do. The are only useful in exceptional cases.
de: *DHCP Erlauben/Verbieten* erlaubt die Konfiguration verschiedener Optionen, die kontrollieren was für DHCP-Clients erlaubt ist. Diese sind nur in Ausnahmefällen nötig.

source: DHCP statements
de: DHCP Verschiedenes

source: *DHCP statements* allows the configuration of different options, which are only required in exceptional cases.
de: *DHCP Verschiedenes* erlaubt die Konfiguration verschiedener Optionen, die nur in Ausnahmefällen nötig sind.

source: Administration of DNS data with BIND
de: Verwaltung von DNS-Daten mit BIND

source: UCS integrates BIND for the name resolution via the domain name system (DNS). The majority of DNS functions are used for DNS resolution in the local domain; however, the UCS BIND integration can also be used for a public name server in principle.
de: UCS integriert BIND für die Namensauflösung über das Domain Name System (DNS). Die meisten DNS-Funktionen werden für die DNS-Auflösung in der lokalen Domäne verwendet, die UCS-BIND-Integration kann aber prinzipiell auch für einen öffentlichen Nameserver eingesetzt werden.

source: BIND is always available on all UCS Directory Node roles; installation on other system roles is not supported.
de: Auf allen UCS Directory Node Systemrollen ist BIND immer verfügbar, eine Installation auf anderen Systemrollen wird nicht unterstützt.

source: The configuration of the name servers to be used by a UCS system is documented in :ref:`hardware-network-configuration`.
de: Die Konfiguration der von einem UCS-System zu verwendenden Nameserver ist in :ref:`hardware-network-configuration` dokumentiert.

source: The following DNS data are differentiated:
de: Folgende DNS-Daten werden unterschieden:

source: A *forward lookup zone* contains information which is used to resolve DNS names into IP addresses. Each DNS zone has at least one authoritative, primary name server whose information governs the zone. Subordinate servers synchronize themselves with the authoritative server via zone transfers. The entry which defines such a zone is called a *SOA record* in DNS terminology.
de: Eine *Forward Lookup Zone* enthält Informationen, die zum Auflösen von DNS-Namen in IP-Adressen herangezogen werden. Jede DNS-Zone verfügt über mindestens einen authoritativen, primären Nameserver, dessen Informationen für eine Zone maßgeblich sind. Untergeordnete Server synchronisieren sich mit dem authoritativen Server über Zonentransfers. Der Eintrag, der eine solche Zone auszeichnet, ist der *SOA-Record*.

source: The *MX record* of a forward lookup zone represents important DNS information necessary for email routing. It points to the computer which accepts emails for a domain.
de: Der *MX-Record* einer Forward Lookup Zone ist eine für das E-Mail-Routing notwendige DNS-Information. Er verweist auf den Rechner, der für eine Domäne E-Mails entgegennimmt.

source: *TXT records* include human-readable text and can include descriptive information about a forward lookup zone.
de: *TXT-Records* enthalten menschenlesbaren Text und können beschreibende Informationen zu einer Forward Lookup Zone enthalten.

source: A *CNAME record*, also called an alias record, refers to an existing, canonical DNS name. For example, the actual hostname of the mail server can be given an alias entry *mailserver*, which is then entered in the mail clients. Any number of CNAME records can be mapped to one canonical name.
de: Ein *CNAME-Record* (desweiteren auch als *Alias-Record* bezeichnet) verweist auf einen vorhandenen, kanonischen DNS-Namen. So kann beispielsweise der kanonische Rechnername des Mailservers einen Alias-Eintrag *mailserver* erhalten, der dann in die Mail-Clients eingetragen wird. Zu einem kanonischen Namen können beliebig viele CNAME-Records definiert werden.

source: An *A record* (under IPv6 *AAAA record*) assigns an IP address to a DNS name. *A records* are also known as *Host records* in UCS.
de: Ein *A-Record* (unter IPv6 *AAAA-Record*) weist einem DNS-Namen eine IP-Adresse zu. A-Records werden in UCS auch als *Host-Records* bezeichnet.

source: A *SRV record*, called a service record in UCS, can be used to save information about available system services in the DNS. In UCS, service records are used among other things to make LDAP servers or the |UCSPRIMARYDN| known domain-wide.
de: Mit einem *SRV-Record* (in UCS als *Service Record* bezeichnet) kann im DNS Informationen über verfügbare Systemdienste hinterlegt werden. In UCS werden Service Records u.a. verwendet, um LDAP-Server oder den |UCSPRIMARYDN| domänenweit bekannt zu machen.

source: A *reverse lookup zone* contains information which is used to resolve IP addresses into DNS names. Each DNS zone has at least one authoritative, primary name server whose information governs the zone, subordinate servers synchronize themselves with the authoritative server via zone transfers. The entry which defines such a zone is the *SOA record*.
de: Eine *Reverse Lookup Zone* enthält Informationen, die zur Auflösung von IP-Adressen in DNS-Namen herangezogen werden. Jede DNS-Zone verfügt über mindestens einen authoritativen, primären Nameserver, dessen Informationen für eine Zone massgeblich sind. Untergeordnete Server synchronisieren sich mit dem authoritativen Server über Zonentransfers. Der Eintrag, der eine solche Zone auszeichnet, ist der *SOA Record*.

source: A *PTR record* (pointer record) allows resolution of an IP address into a hostname. It thus represents the equivalent in a reverse lookup zone of a host record in a forward lookup zone.
de: Ein *PTR-Record (Pointer Record)* erlaubt die Auflösung einer IP-Adresse in einen Rechnernamen. Er stellt damit in einer Reverse Lookup Zone in etwa das Äquivalent zu einem Host Record in einer Forward Lookup Zone dar.

source: Configuration of the BIND name server
de: Konfiguration des BIND-Dienstes

source: Configuration of BIND debug output
de: Konfiguration der Debug-Ausgaben von BIND

source: The level of detail of the BIND debug output can be configured via the :envvar:`dns/debug/level` and :envvar:`dns/dlz/debug/level` (for the Samba backend, see :ref:`ip-config-dns-backend`) |UCSUCR| variables. The possible values are between ``0`` (no debug tasks) to ``11``. A complete list of levels can be found at :cite:t:`bind-loglevel`.
de: Der Detailgrad der Debugausgaben von BIND kann über die |UCSUCR|-Variablen :envvar:`dns/debug/level` und :envvar:`dns/dlz/debug/level` (für das Samba-Backend, siehe :ref:`ip-config-dns-backend`) konfiguriert werden. Die möglichen Werte reichen von ``0`` (keine Debug-Ausgaben) bis ``11``. Eine komplette Aufstellung der Detailgrade findet sich unter :cite:t:`bind-loglevel`.

source: Configuration of the data backend
de: Konfiguration des Daten-Backends des Nameservers

source: In a typical BIND installation on a non-UCS system, the configuration is performed by editing zone files. In UCS, BIND is completely configured via UMC modules, which saves its data in the LDAP directory.
de: In einer typischen BIND-Installation auf einem Nicht-UCS-System wird die Konfiguration durch das Bearbeiten von Zonen-Dateien durchgeführt. In UCS wird BIND komplett über UMC-Module konfiguriert, das seine Daten im LDAP-Verzeichnis speichert.

source: BIND can use two different backend for its configuration:
de: BIND kann zwei verschiedene Backends für seine Konfigurationsdateien verwenden:

source: The *LDAP backend* accesses the data in the LDAP directory. This is the standard backend. The DNS service is split into two in this case: The *BIND proxy* is the primary name server and uses the DNS standard port ``53``. A second server in the background works on port ``7777``. If data from the internal DNS zones are edited in the LDAP, the zone file on the second server is updated based on the LDAP information and transmitted to the BIND proxy by means of a zone transfer.
de: Das *LDAP-Backend* greift auf die Daten im OpenLDAP-Verzeichnis zu. Dieses Backend ist der Standard. Der DNS-Dienst ist in diesem Fall zweigeteilt: Der *BIND-Proxy* ist der primäre Nameserver und bedient den DNS-Standard-Port ``53``. Ein zweiter Server im Hintergrund arbeitet auf Port ``7777``. Werden Daten der internen DNS-Zonen im LDAP bearbeitet, wird die Zonendatei auf dem zweiten Server basierend auf den LDAP-Informationen aktualisiert und durch einen Zonentransfer an den BIND-Proxy übertragen.

source: Samba/AD provides an Active Directory domain. Active Directory is closely connected with DNS, for DNS updates of Windows clients or the localization of NETLOGON shares among other things. If Samba/AD is used, the UCS Directory Node in question is switched over to the use of the *Samba backend*. The DNS database is maintained in Samba's internal LDB database, which Samba updates directly. BIND then accesses the Samba DNS data via the DLZ interface.
de: Samba/AD stellt eine Active Directory-Domäne bereit. Active Directory ist eng mit DNS verknüpft, u.a. für DNS-Updates von Windows-Clients oder für die Lokalisierung der Netlogon-Freigabe. Wird Samba/AD eingesetzt, wird der betreffende UCS Directory Node auf die Verwendung des *Samba-Backend*\ s umgestellt. Die DNS-Datenbank wird dabei in der Samba-internen LDB Datenbank vorgehalten, die direkt von Samba aktualisiert wird. BIND greift dann über die DLZ Schnittstelle auf die Samba-DNS-Daten zu.

source: When using the Samba backend, a search is performed in the LDAP for every DNS request. With the OpenLDAP backend, a search is only performed in the directory service if the DNS data has changed. The use of the LDAP backend can thus result in a reduction of the system load on Samba/AD systems.
de: Bei Verwendung des Samba-Backends wird für jede DNS-Anfrage eine Suche im LDAP durchgeführt. Bei Verwendung des OpenLDAP-Backends wird nur bei Änderungen der DNS-Daten im Verzeichnisdienst gesucht. Die Verwendung des LDAP-Backends kann daher zu einer Reduzierung der Systemlast auf Samba/AD-Systemen führen.

source: The backend is configured via the |UCSUCRV| :envvar:`dns/backend`. The DNS administration is not changed by the backend used and is performed via UMC modules in both cases.
de: Das Backend wird über die |UCSUCRV| :envvar:`dns/backend` konfiguriert. Die DNS-Verwaltung ändert sich durch das verwendete Backend nicht und erfolgt in beiden Fällen über UMC-Module.

source: Configuration of zone transfers
de: Konfiguration von Zonentransfers
