Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/ip-config.po
Languages: de

source: IP assignment via DHCP
de: IP-Vergabe über DHCP

source: The Dynamic Host Configuration Protocol (DHCP) assigns computers an IP address, the subnet mask and further settings for the gateway or NetBIOS server as necessary. The IP address can be set fixed or dynamic.
de: Das Dynamic Host Configuration Protocol (DHCP) weist Rechnern eine IP-Adresse, die Subnetz-Maske und gegebenenfalls weitere Einstellungen wie Gateway oder NetBIOS-Server zu. Die IP-Adresse kann fest oder dynamisch vergeben werden.

source: The use of DHCP allows central assignment and control of IP addresses via the LDAP directory without performing manual configuration on the individual computer systems.
de: Die Verwendung von DHCP ermöglicht eine zentrale Vergabe und Kontrolle von IP-Adressen über das LDAP-Verzeichnis ohne manuelle Einträge an den einzelnen Rechnersystemen vorzunehmen.

source: The DHCP integration in UCS only supports IPv4.
de: Die DHCP-Integration in UCS unterstützt nur IPv4.

source: In a *DHCP service*, DHCP servers are grouped in a shared LDAP configuration. Global configuration parameters are entered in the DHCP service; specific parameters in the subordinate objects.
de: In einem *DHCP-Service* werden DHCP-Server mit einer gemeinsamen LDAP-Konfiguration zusammengefasst. Globale Konfigurationsparameter werden am DHCP-Service angegeben, spezifische Parameter in den Objekten darunter.

source: A DHCP server can be installed from the Univention App Center with the application :program:`DHCP server`. Alternatively, the software package :program:`univention-dhcp` can be installed. Additional information can be found in :ref:`computers-softwaremanagement-install-software`.
de: Ein DHCP-Server kann mit der Applikation *DHCP-Server* aus dem Univention App Center installiert werden. Alternativ kann das Softwarepaket :program:`univention-dhcp` installiert werden. Weitere Informationen finden sich in :ref:`computers-softwaremanagement-install-software`.

source: Every DHCP assigns IP addresses via DHCP. In the default setting, only static IP addresses are assigned to computer objects registered in the UCS LDAP.
de: Jeder DHCP-Server verteilt IP-Adressen über DHCP. In der Grundeinstellungen werden nur statische IP-Adressen an im UCS-LDAP registrierte Rechnerobjekte vergeben.

source: If only fixed IP addresses are assigned, as many DHCP servers as required may be used in a DHCP service. All the DHCP servers procure identical data from the LDAP and offer the DHCP clients the data multiple times. DHCP clients then accept the first answer and ignore the rest.
de: Werden ausschließlich feste IP-Adressen vergeben, können beliebig viele DHCP-Server in einem DHCP-Service verwendet werden. Alle DHCP-Server greifen auf identische Daten aus dem LDAP zurück und bieten den DHCP-Clients die Daten mehrfach an. DHCP-Clients akzeptieren dann die erste Antwort und verwerfen die übrigen.

source: If dynamic IP addresses are also assigned, the DHCP failover mechanism must be employed and a maximum of two DHCP servers can be used per subnet.
de: Werden auch dynamisch IP-Adressen verteilt, muss der DHCP-Failover-Mechanismus eingesetzt werden. Dabei können maximal zwei DHCP-Server pro Subnetz verwendet werden.

source: A *DHCP host* entry is used to make the DHCP service aware of a computer. A DHCP host object is required for computers attempting to retrieve a fixed IP address over DHCP. DHCP computer objects do not normally need to be created manually, because they are created automatically when a DHCP service is assigned to a computer object with a fixed IP address.
de: Mit einem *DHCP-Rechner*-Eintrag wird ein Rechner dem DHCP-Service bekannt gemacht. Für Rechner, die per DHCP eine feste IP-Adresse beziehen sollen, ist ein DHCP-Rechner-Objekt zwingend erforderlich. DHCP-Rechner-Objekte müssen in der Regel nicht manuell erstellt werden, weil diese automatisch angelegt werden, wenn einem Rechnerobjekt mit fester IP-Adresse ein DHCP-Service zugewiesen wird.

source: A *DHCP subnet* entry is required for every subnet, irrespective of whether dynamic IP addresses are to be assigned from this subnet.
de: Für jedes Subnetz wird ein *DHCP-Subnetz*-Eintrag benötigt, unabhängig davon, ob dynamische IP-Adressen aus diesen Subnetzen vergeben werden sollen.

source: Configuration parameters can be assigned to the different IP ranges by creating *DHCP pools* within subnets. In this way unknown computers can be allowed in one IP range and excluded from another IP range. DHCP pools can only be created below DHCP subnet objects.
de: Über die Einrichtung von *DHCP-Pools* innerhalb von Subnetzen können den verschiedenen IP-Adressbereichen unterschiedliche Konfigurationsparameter zugeordnet werden. Auf diese Weise können unbekannte Rechner in einem IP-Adressbereich zugelassen und von einem anderen IP-Adressbereich ausgeschlossen werden. DHCP-Pools können nur unterhalb von DHCP-Subnetz-Objekten angelegt werden.

source: If several IP subnets are used in a physical Ethernet network, this should be entered as a *DHCP shared subnet* below a *DHCP shared network*. *DHCP shared subnet* objects can only be created below *DHCP shared network* objects.
de: Falls mehrere IP-Subnetze gemeinsam dasselbe physikalische Ethernet-Netzwerk verwenden, sollten diese als *DHCP Shared Subnet* unterhalb eines *DHCP Shared Network* eingetragen werden. *DHCP Shared Subnet*-Objekte können nur unterhalb von *DHCP Shared Network*-Objekten angelegt werden.

source: Values which are set on a DHCP configuration level always apply for this level and all subordinate levels, unless other values are specified there. Similar to policies, the value which is closest to the object always applies.
de: Werte, die auf einer Ebene der DHCP-Konfiguration angegeben werden, gelten immer für diese und alle darunterliegenden Ebenen, sofern dort keine anderen Angaben gemacht werden. Ähnlich wie bei Richtlinien gilt immer der Wert, der dem Objekt am nächsten ist.

source: Composition of the DHCP configuration via DHCP LDAP objects
de: Aufbau der DHCP-Konfiguration durch DHCP-LDAP-Objekte

source: The left column of the UMC module :guilabel:`DHCP` includes a list of all the DHCP services. To add an object to a DHCP service - for example in an additional subnet - the corresponding service must be selected. :guilabel:`Add` is then used to create the object in this service. To create a new DHCP service, start by selecting *All DHCP services*. Clicking on :guilabel:`Add` then creates a new service. If an object is saved within a service, the service is labeled in UMC dialogues as a *superordinate object*.
de: In der linken Spalte des UMC-Moduls :guilabel:`DHCP` befindet sich eine Liste aller DHCP-Services. Um einem DHCP-Service ein Objekt hinzuzufügen - etwa ein weiteres Subnetz - muss der entsprechende Service ausgewählt werden. Durch :guilabel:`Hinzufügen` wird das Objekt dann in diesem Service angelegt. Um einen neuen DHCP-Service anzulegen, muss zuerst *Alle DHCP-Dienste* selektiert werden, der Klick auf :guilabel:`Hinzufügen` legt dann einen neue Service an. Wird ein Objekt unterhalb eines Services angelegt, wird der Service in den UMC-Dialogen als *übergeordnetes Objekt* bezeichnet.

source: Administration of DHCP services
de: Verwaltung von DHCP-Services

source: DHCP services are managed in the UMC module :guilabel:`DHCP` (see :ref:`central-user-interface`). To create a new DHCP service, *All DHCP services* needs to be selected in the left column of the UMC module. Clicking on :guilabel:`Add` then creates a new service.
de: DHCP-Services werden im UMC-Modul :guilabel:`DHCP` verwaltet (siehe auch :ref:`central-user-interface`). Um einen neuen DHCP-Service anzulegen muss zuerst *Alle DHCP-Dienste* in der linken Spalte des UMC-Moduls selektiert werden. Ein Klick auf :guilabel:`Hinzufügen` legt dann einen neue Service an.

source: A DHCP server can only serve one DHCP service; to use another DHCP service, a separate DHCP server must be set up (see :ref:`networks-dhcp-dhcpserver`).
de: Ein DHCP-Server kann nur einen DHCP-Service bedienen; wenn ein weiterer DHCP-Service verwendet werden soll, muss dafür ein separater DHCP-Server eingerichtet werden (siehe :ref:`networks-dhcp-dhcpserver`).

source: The following parameters are often set on the DHCP service object which then apply to all the computers which are served by this DHCP service (unless other values are entered in lower levels):
de: Am DHCP-Service-Objekt werden häufig folgende Parameter festgelegt, die dann für alle Rechner gültig sind, die von diesem DHCP-Service bedient werden (es sei denn, es werden auf tieferen Ebenen andere Angaben gemacht):

source: *Domain name* and *Domain name servers* under *Policy: DHCP DNS*
de: *Domänenname* und *DNS-Server* unter *Richtlinie: DHCP DNS*

source: *NetBIOS name servers* under *Policy: DHCP NetBIOS*
de: *NetBIOS-Nameserver* unter *Richtlinie: DHCP NetBIOS*

source: A description of this and the other DHCP policies can be found at :ref:`networks-dhcp-policies`.
de: Eine Beschreibung dieser und der anderen DHCP-Richtlinien findet sich unter :ref:`networks-dhcp-policies`.

source: *General* tab
de: Reiter *Allgemein*

source: Attribute
de: Attribut

source: Description
de: Beschreibung

source: An unambiguous name for the DHCP service must be entered in this input field, e.g., ``company.example``.
de: In dieses Eingabefeld muss ein beliebiger, aber eindeutiger Name für den DHCP-Service eingetragen werden, z.B. ``firma.com``.

source: Administration of DHCP server entries
de: Verwaltung von DHCP-Server-Einträgen

source: Each server which should offer the DHCP service requires a *DHCP server* entry in the LDAP directory. The entry does not normally need to be created manually, instead it is created by the join script of the :program:`univention-dhcp` package. However, to create another record manually, a DHCP service must be selected in the left column of the UMC module :guilabel:`DHCP`. :menuselection:`Add --> DHCP Server` can then be used to register a new server.
de: Jeder Server, der den DHCP-Dienst anbieten soll, benötigt zwingend einen *DHCP-Server*-Eintrag im LDAP-Verzeichnis. Der Eintrag muss in der Regel nicht von Hand angelegt werden, sondern wird durch das Join-Skript des :program:`univention-dhcp`-Pakets angelegt. Um dennoch manuell einen weiteren Record anzulegen, muss im UMC-Modul :guilabel:`DHCP` in der linken Spalte ein DHCP-Service ausgewählt werden. Mit :menuselection:`Hinzufügen --> DHCP Server` kann dann ein neuer Server registriert werden.

source: The computer name that the DHCP service should offer is entered in this input field, e.g., ``ucs-primary``.
de: In diesem Eingabefeld ist der Rechnername, der den DHCP-Dienst anbieten soll, einzutragen, z.B. ``ucs-primary``.

source: A server can only ever provide a single DHCP service and therefore cannot be entered in more than one DHCP service at the same time.
de: Ein Server kann immer nur einen einzigen DHCP-Dienst anbieten und kann deshalb nicht gleichzeitig in mehreren DHCP-Services eingetragen sein.

source: Administration of DHCP subnets
de: Verwaltung von DHCP-Subnetzen

source: DHCP subnets are managed in the UMC module :guilabel:`DHCP` (see :ref:`central-user-interface`). To create another subnet, a DHCP service must be selected in the left column. :menuselection:`Add --> DHCP: Subnet` can be used to create a new subnet.
de: DHCP-Subnetze werden im UMC-Modul :guilabel:`DHCP` verwaltet (siehe auch :ref:`central-user-interface`). Um ein weiteres Subnetz anzulegen, muss in der linken Spalte ein DHCP-Service ausgewählt werden. Mit :menuselection:`Hinzufügen --> DHCP: Subnetz` kann dann ein neues Subnetz angelegt werden.

source: A DHCP subnet entry is required for every subnet from which dynamic or fixed IP addresses are to be assigned. It is only necessary to enter IP address ranges if IP addresses are to be assigned dynamically.
de: Ein DHCP-Subnetz-Eintrag ist für jedes Subnetz, aus dem dynamische oder feste IP-Adressen vergeben werden sollen, zwingend erforderlich. Das Eintragen von IP-Adressbereichen ist nur notwendig, wenn IP-Adressen dynamisch vergeben werden sollen.

source: If *DHCP shared subnet* objects are to be used, the corresponding subnets should be created below the *DHCP shared subnet* container created for this purpose (see :ref:`networks-dhcp-shared-subnets`).
de: Falls *DHCP:Shared Subnet*-Objekte verwendet werden sollen, sollten die entsprechenden Subnetze unterhalb des dafür angelegten *DHCP:Shared Network*-Containers angelegt werden (siehe :ref:`networks-dhcp-shared-subnets`).

source: Subnet address
de: Subnetz-Adresse

source: The IP address of the subnet must be entered in dot-decimal form in this input field, e.g., ``192.0.2.0``.
de: In diesem Eingabefeld ist die IP-Adresse des Subnetzes in Oktettschreibweise einzutragen, z.B. ``192.0.2.0``.

source: Net mask
de: Netzmaske

source: The network mask can be entered in this input field as the network prefix or in dot-decimal form. If the network mask is entered in dot-decimal form it will be subsequently be converted into the corresponding network prefix and later also shown so.
de: Die Netzmaske kann in diesem Eingabefeld wahlweise als Dezimalzahl des Netzpräfix oder in Oktettschreibweise eingetragen werden. Wenn die Netzmaske in Oktettschreibweise eingegeben wird, wird sie automatisch in den entsprechenden Netzpräfix umgewandelt und später auch ausgegeben.

source: Dynamic address assignment
de: Dynamische Adresszuweisung

source: Here one can set up individual or multiple IP address ranges for dynamic assignment. The range stretches from the *First address* to the *Last address* in dot-decimal form.
de: Hier können ein einzelner oder mehrere IP-Adressbereiche eingerichtet werden, die für die dynamische Vergabe zur Verfügung stehen. Der Bereich erstreckt sich von *Erste Adresse* bis *Letzte Adresse* in Oktettschreibweise.

source: Dynamic IP ranges for a subnet should always either be specified exclusively in the subnet entry or exclusively in one or more special pool entries. The types of IP range entries within a subnet must not be mixed! If different IP ranges with different configurations are be set up in one subnet, pool entries must be created for this purpose.
de: Dynamische IP-Adressbereiche für ein Subnetz sind immer entweder ausschließlich im Subnetz-Eintrag oder ausschließlich in einem oder mehreren gesonderten Pool-Einträgen anzugeben. Die Typen der Einträge im IP-Adressbereich innerhalb eines Subnetzes dürfen nicht gemischt werden! Wenn in einem Subnetz verschiedene IP-Adressbereiche mit unterschiedlichen Konfigurationen eingesetzt werden sollen, müssen dafür Pool-Einträge angelegt werden.

source: At this level, the gateway for all computers in a subnet is often set using the *Policy: DHCP Routing* tab (unless other entries are performed at lower levels).
de: Auf dieser Ebene wird häufig über dir Karteikarte :guilabel:`Richtlinie: DHCP Routing` das Gateway für alle Rechner in diesem Subnetz festgelegt (es sei denn, es werden an DHCP-Pools andere Angaben gemacht).

source: Administration of DHCP pools
de: Verwaltung von DHCP-Pools

source: DHCP pools can only be managed via the UMC module :guilabel:`LDAP directory`. To do so, one must always be in a DHCP subnet object - a DHCP pool object must always be created below a DHCP subnet object - and a *DHCP: Pool* object added with :guilabel:`Add`.
de: DHCP-Pools können nur über das UMC-Modul :guilabel:`LDAP-Verzeichnis` verwaltet werden. Dazu muss in ein DHCP-Subnetz-Objekt navigiert werden - ein DHCP-Pool-Objekt muss immer unterhalb eines DHCP-Subnetz-Objektes angelegt werden - und dort mit :guilabel:`Hinzufügen` ein *DHCP: Pool*-Objekt eingefügt werden.

source: If DHCP pools are created in a subnet, no IP address range should be defined in the subnet entry. These should only be specified via the pool entries.
de: Wenn in einem Subnetz DHCP-Pools angelegt werden, sollten keine IP-Adressbereiche im Subnetz-Eintrag definiert werden. Diese sind ausschließlich in den Pool-Einträgen anzulegen.

source: General tab
de: Reiter Allgemein

source: An unambiguous name for the DHCP pool must be entered in this input field, e.g., ``testnet.compaby.example``.
de: In dieses Eingabefeld muss ein beliebiger, aber eindeutiger Name für den DHCP-Pool eingetragen werden, z.B. ``testnetz.firma.com``.

source: Dynamic range
de: Dynamischer Bereich

source: Here you can enter the IP addresses in dot-decimal form that are to be dynamically assigned.
de: Hier können die IP-Adressen in Oktettschreibweise angegeben werden, die dynamisch vergeben werden.

source: Advanced settings tab
de: Reiter Erweiterte Einstellungen

source: *Advanced settings* tab
de: Reiter *Erweiterte Einstellungen*

source: The name of a failover configuration, which must to be configured manually in file :file:`/etc/dhcp/local.conf`. Further information can be found at `A Basic Guide to Configuring DHCP Failover <isc-dhcp-failover_>`_.
de: Der Name einer Failover-Konfiguration, die von Hand in der Datei :file:`/etc/dhcp/local.conf` konfiguriert werden. Hinweise zur Einrichtung finden sich in `A Basic Guide to Configuring DHCP Failover <isc-dhcp-failober_>`_.

source: Allow known clients
de: Erlaube bekannte Clients

source: A computer is identified by its MAC address. If this input field is set to ``allow`` or unset, a computer **with** a matching DHCP host entry (see :ref:`ip-config-dhcp-objects-hosts`) is eligible to receive an IP address from this pool.
de: Ein Computer wird durch seine MAC-Adresse identifiziert. Ist dieses Feld auf ``erlauben`` gesetzt oder nicht gesetzt, ist ein Computer mit einem DHCP-Rechner-Eintrag (siehe :ref:`ip-config-dhcp-objects-hosts`) berechtigt eine IP-Adresse aus diesem Pool zu beziehen.

source: If set to ``deny``, the computer doesn't receive an IP address from the pool.
de: Ist es auf ``verbieten`` gesetzt, erhalten diese Computer keine IP-Adresse aus dem Pool.

source: Allow unknown clients
de: Erlaube unbekannte Clients

source: A computer is identified by its MAC address. If this input field is set to ``allow`` or unset, a computer **without** a matching DHCP host entry (see :ref:`ip-config-dhcp-objects-hosts`) is eligible to receive an IP address from this pool.
de: Ein Computer wird durch seine MAC-Adresse identifiziert. Ist dieses Feld auf ``erlauben`` gesetzt oder nicht gesetzt, ist ein Computer ohne DHCP-Rechner-Eintrag (siehe :ref:`ip-config-dhcp-objects-hosts`) berechtigt eine IP-Adresse aus diesem Pool zu beziehen.

source: Allow dynamic BOOTP clients
de: Dynamische BOOTP-Clients erlauben

source: BOOTP is the predecessor of the DHCP protocol. It has no mechanism to renew leases and by default assigns leases infinitely, which can deplete the pool. If this options is set to ``allow`` clients can retrieve an IP address from this pool using BOOTP.
de: BOOTP ist das Vorgängerprotokoll von DHCP. Es kennt keinen Mechanismus zum Aktualisieren eines Leases und weist Adressen zeitlich unbeschränkt zu, was den Pool erschöpfen kann. Ist diese Option auf ``erlauben`` gesetzt können Clients auch über BOOTP eine Adresse aus diesem Pool zu beziehen.

source: All clients
de: Alle Clients

source: If this option is set to ``deny`` the pool is disabled globally. This is only useful in exceptional scenarios.
de: Wird diese Option auf ``verbieten`` gesetzt, wird der Pool global deaktiviert. Diese Option ist nur in Ausnahmefällen sinnvoll.

source: Registration of computers with DHCP computer objects
de: Registrierung von Rechnern mit DHCP-Rechner-Objekten

source: A *DHCP host* entry is used to register the respective computer in the DHCP service. Computers can be handled depending on their registration status. Known computers may get fixed and dynamic IP addresses from the DHCP service; unknown computers only get dynamic IP addresses.
de: Mit einem *DHCP Rechner*-Eintrag wird der betreffende Rechner im DHCP-Service registriert. Rechner können in Abhängigkeit von ihrem Registrierungsstatus behandelt werden. Bekannte Rechner können feste oder dynamische IP-Adressen vom DHCP-Service beziehen; unbekannte Rechner erhalten nur dynamische IP-Adressen.

source: DHCP computer entries are usually created automatically when a computer is added via the computer management. Below the DHCP service object you have the possibility of adding DHCP computer entries or editing existing entries manually, irrespective of whether they were created manually or automatically.
de: Üblicherweise werden beim Hinzufügen eines Rechners über die Rechnerverwaltung automatisch DHCP-Rechner-Einträge erstellt. Unterhalb des DHCP-Service-Objekts gibt es die Möglichkeit, manuell DHCP-Rechner-Einträge hinzuzufügen oder bestehende Einträge, egal ob manuell oder automatisch erzeugt, zu bearbeiten.

source: DHCP host objects are managed in the UMC module :guilabel:`DHCP` (see :ref:`central-user-interface`). To register a host in the DHCP manually, a DHCP service must be selected in the left column of the module. :menuselection:`Add --> DHCP: Host` can be used to register a host.
de: DHCP-Rechner-Objekte werden im UMC-Modul :guilabel:`DHCP` verwaltet (siehe auch :ref:`central-user-interface`). Um einen Rechner manuell im DHCP zu registrieren, muss in der linken Spalte des Moduls ein DHCP-Service ausgewählt werden. Mit :menuselection:`Hinzufügen --> DHCP: Rechner` kann dann ein Rechner registriert werden.

source: Hostname
de: Rechnername

source: A name for the computer is entered in this input field (which usually also has an entry in the computer management). It is recommended to enter the same name and the same MAC address for the computer in both entries to facilitate assignment.
de: In diesem Eingabefeld ist ein Name für den Rechner einzugeben (der in der Regel auch einen Eintrag in der Rechnerverwaltung besitzt). Es empfiehlt sich, in beiden Einträgen denselben Namen und dieselbe MAC-Adresse für den Rechner zu verwenden, um die Zuordnung zu erleichtern.

source: Type
de: Netzwerktyp

source: The type of network used can be selected in this selection list. *Ethernet* almost always needs to be selected here.
de: In dieser Auswahlliste ist der Typ des verwendeten Netzwerks auszuwählen. Hier ist nahezu immer *Ethernet* auszuwählen.

source: Address
de: Adresse

source: The MAC address of the network card needs to be entered here, e.g., ``2e:44:56:3f:12:32`` or ``2e-44-56-3f-12-32``.
de: In diesem Eingabefeld ist die MAC-Adresse der Netzwerkkarte einzutragen, z.B. ``2e:44:56:3f:12:32`` oder ``e-44-56-3f-12-32``.

source: Fixed IP addresses
de: Feste IP-Adressen

source: One or more fixed IP addresses can be assigned to the computer here. In addition to an IP address, a fully qualified domain name can also be entered, which is resolved into one or more IP addresses by the DHCP server.
de: Hier können dem Rechner eine oder mehrere feste IP-Adressen zugewiesen werden. Neben einer IP-Adresse kann auch ein vollqualifizierter Domänenname angegeben werden, der vom DHCP-Server in eine oder mehrere IP-Adressen aufgelöst wird.

source: Management of DHCP shared networks / DHCP shared subnets
de: Verwaltung von DHCP Shared Networks / DHCP Shared Subnets

source: *DHCP shared network* objects accept subnets which use a common physical network.
de: *DHCP Shared Network*-Objekte nehmen Subnetze auf, die ein physikalisches Netzwerk gemeinsam nutzen.
