Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/ip-config.po
Languages: de

source: By default the UCS name server allows zone transfers of the DNS data. If the UCS server can be reached from the internet, a list of all computer names and IP addresses can be requested. The zone transfer can be deactivated when using the OpenLDAP backend by setting the |UCSUCRV| :envvar:`dns/allow/transfer` to ``none``.
de: In der Grundeinstellung erlaubt der UCS-Nameserver Zonentransfers der DNS-Daten. Ist der UCS-Server aus dem Internet erreichbar, kann dadurch eine Liste aller Rechnernamen und IP-Adressen abgefragt werden. Der Zonentransfer kann bei Verwendung des OpenLDAP-Backends durch Setzen der |UCSUCRV| :envvar:`dns/allow/transfer` auf ``none`` deaktiviert werden.

source: Administration of DNS data via |UCSUMC| module
de: Konfiguration der DNS-Daten über |UCSUMC| Modul

source: DNS files are stored in the :samp:`cn=dns,{base DN}` container as standard. Forward and reverse lookup zones are stored directly in the container. Additional DNS objects such as pointer records can be stored in the respective zones.
de: DNS-Daten werden standardmäßig im Container :samp:`cn=dns,{Basis-DN}` abgelegt. Forward- und Reverse-Lookup-Zonen werden direkt in dem Container abgelegt. In den jeweiligen Zonen können zusätzliche DNS-Objekte wie z.B. Pointer-Records angelegt werden.

source: The relative or fully qualified domain name (FQDN) should always be used in the input fields for computers and not the computer's IP address. A FQDN should always end in a full stop to avoid the domain name being added anew.
de: In Eingabefeldern für Rechner sollte immer der relative oder vollqualifizierte Domänenname und nicht die IP-Adresse des Rechners verwendet werden. Um zu verhindern, dass der Domänenname erneut angehängt wird, sollte ein FQDN immer mit einem Punkt abgeschlossen werden.

source: The left column of the UMC module :guilabel:`DNS` includes a list of all the forward and reverse lookup zones. To add an object to a zone - for example an alias record to a forward zone - the corresponding zone must be selected. :guilabel:`Add` is then used to create the object in this zone. To create a new forward or reverse zone, start by selecting *All DNS zones*. Clicking on :guilabel:`Add` then creates a new zone. If an object is created within the zone, the zone is labeled in the UMC dialogues as a *superordinate object*.
de: In der linken Spalte des UMC-Moduls :guilabel:`DNS` befindet sich eine Liste aller Forward- und Reverse-Lookup-Zonen. Um ein Objekt einer Zone hinzuzufügen - etwa einen Alias-Record zu einer Forward-Zone - muss die entsprechende Zone ausgewählt werden. Durch :guilabel:`Hinzufügen` wird das Objekt dann in dieser Zone angelegt. Um eine neue Forward- oder Reverse-Zone anzulegen, muss zuerst *Alle DNS-Zonen* selektiert werden, der Klick auf :guilabel:`Hinzufügen` legt dann eine neue Zone an. Wird ein Objekt unterhalb einer Zone angelegt, wird die Zone in den UMC-Dialogen als *übergeordnetes Objekt* bezeichnet.

source: Forward lookup zones contain information which is used to resolve DNS names into IP addresses. They are managed in the UMC module :guilabel:`DNS` (see :ref:`central-user-interface`). To add another forward lookup zone, select *All DNS zones* and :menuselection:`Add --> DNS: Forward lookup zone`.
de: Forward Lookup Zonen enthalten Informationen, die zum Auflösen von DNS-Namen in IP-Adressen verwendet werden. Sie werden im UMC-Modul :guilabel:`DNS` verwaltet (siehe auch :ref:`central-user-interface`). Um eine weitere Forward Lookup Zone anzulegen, muss *Alle DNS-Zonen* selektiert werden und :menuselection:`Hinzufügen --> DNS: Forward Lookup Zone` ausgewählt werden.

source: Configuring a forward lookup zone in the UMC module *DNS*
de: Konfiguration einer Forward Lookup Zone durch Univention Management Console Modul

source: DNS UMC module forward lookup - General tab
de: DNS UMC Modul Forward Lookup - Reiter Allgemein

source: Zone name
de: Name der Zone

source: This is the complete name of the DNS domain for which the zone will be responsible.
de: Der komplette Name der DNS-Domäne, für die die Zone zuständig sein soll.

source: The domain name **must not** end in a full stop in zone names!
de: In Zonennamen **darf** der Domänenname **nicht** mit einem Punkt abgeschlossen werden!

source: The time to live specifies how long these files may be cached by other DNS servers. The value is specified in seconds.
de: Die Time-to-Live gibt an, wie lange diese Daten von anderen DNS-Servern im Cache gespeichert werden dürfen. Der Wert wird in Sekunden gespeichert.

source: Name servers
de: Nameserver

source: The fully qualified domain name with a full stop at the end of the relative domain name of the responsible name server. The first entry in the line is the primary name server for the zone.
de: Der FQDN mit abschließendem Punkt oder der relative Domänenname der zuständigen Nameserver. Der erste Eintrag in der Liste ist der primäre Nameserver der Zone.

source: DNS UMC module forward lookup - Start of authority tab
de: DNS UMC Modul Forward Lookup - Reiter Start of Authority

source: *Start of authority* tab
de: Reiter *Start of Authority*

source: Contact person
de: Verantwortliche Person

source: The email address of the person responsible for administrating the zone.
de: Die E-Mail-Adresse der für die Verwaltung der Zone verantwortlichen Person.

source: Serial number
de: Seriennummer

source: Other DNS servers use the serial number to recognize whether zone data have changed. The secondary name server compares the serial number of its copy with that on the primary name server. If the serial number of the secondary is lower than that on the primary, the secondary copies the changed data.
de: Anhand der Seriennummer erkennen andere DNS-Server, ob sich Zonendaten geändert haben. Der sekundäre Nameserver vergleicht die Seriennummer seiner Kopie mit der auf dem primären Nameserver. Ist die Seriennummer auf dem sekundären Nameserver niedriger als auf dem primären Nameserver, so kopiert der sekundäre Nameserver die geänderten Daten.

source: There are two commonly used patterns for this serial number:
de: Es gibt zwei häufig verwendete Muster für die Seriennummer:

source: Start with ``1`` and increment the serial number with each change.
de: Beginn mit ``1`` unter Inkrementierung der Seriennummer bei jeder Änderung.

source: By including the date the number can be entered in the format ``YYYYMMDDNN``, where
de: Unter Einbeziehung des Datums kann die Zahl im Format ``JJJJMMTTNN`` eingegeben werden, wobei

source: ``Y`` stands for year,
de: ``J`` steht für Jahr,

source: ``M`` for month,
de: ``M`` steht für Monat,

source: ``D`` for day and
de: ``T`` steht für Tag

source: ``N`` for the number of the change of this day.
de: ``N`` steht für die Nummer der Änderung an diesem Tag steht.

source: If the serial number is not changed manually, it will be increased automatically with every change.
de: Wird die Seriennummer nicht von Hand geändert, wird sie automatisch bei jeder Änderung inkrementiert.

source: Refresh interval
de: Aktualisierungsintervall

source: The time span in seconds after which the secondary name server checks that its copy of the zone data is up-to-date.
de: Die Zeitspanne in Sekunden, nach der der sekundäre Nameserver überprüft, ob seine Kopie der Zonendaten noch aktuell ist.

source: Retry interval
de: Intervall für erneute Versuche

source: The time span in seconds after which the secondary name server tries again to check that its copy of the zone data is up-to-date after a failed attempt to update. This time span is usually set to be less than the update interval, but can also be equal.
de: Die Zeitspanne in Sekunden, nach der der sekundäre Nameserver nach einer fehlgeschlagenen Aktualisierungsanfrage erneut versucht, die Aktualität seiner Zonendaten-Kopie zu überprüfen. Üblicherweise wird diese Zeitspanne kürzer gewählt als das Aktualisierungsintervall, darf aber auch gleich lang sein.

source: Expiry interval
de: Ablaufintervall

source: The time span in seconds after which the copy of the zone data on the secondary becomes invalid if it could not be checked to be up-to-date.
de: Die Zeitspanne in Sekunden, nach der die Zonendaten-Kopie auf dem sekundären Nameserver ungültig wird, wenn ihre Aktualität nicht überprüft werden konnte.

source: For example, an expiry interval of one week means that the copy of the zone data becomes invalid when all requests to update in one week fail. In this case, it is assumed that the files are too outdated after the expiry interval date to be used further. The secondary name server can then no longer answer name resolution requests for this zone.
de: Bei einem Ablaufintervall von einer Woche bedeutet dies beispielsweise, dass die Zonendaten-Kopie ungültig wird, wenn eine Woche lang alle Aktualisierungsanfragen fehlgeschlagen sind. In dem Fall wird davon ausgegangen, dass die Daten nach der Ablaufzeit zu veraltet sind, um weiter verwendet zu werden. Der sekundäre Nameserver kann dann keine Namensauflösungsanfragen für diese Zone mehr beantworten.

source: The negative time to live specifies in seconds how long other servers can cache no-such-domain (NXDOMAIN) answers. This value cannot be set to more than 3 hours, the default value is 3 hours.
de: Die negative *Time-to-Live* gibt in Sekunden an, wie lange andere Server *No-such-Domain*-Antworten (NXDOMAIN) im Cache behalten dürfen. Der Wert darf nicht mehr als 3 Stunden betragen, der Standard sind 3 Stunden.

source: DNS UMC module forward lookup - IP addresses tab
de: DNS UMC Modul Forward Lookup - Reiter IP Adressen

source: *IP addresses* tab
de: Reiter *IP Adressen*

source: IP addresses
de: IP Adressen

source: This input field can be used to specify one or more IP addresses, which are output when the name of the zone is resolved. These IP addresses are queried by Microsoft Windows clients in AD compatible domains.
de: Mit diesem Eingabefeld können eine oder mehrere IP-Adressen angegeben werden, die zurückgegeben werden, wenn der Name der Zone aufgelöst wird. Die hier hinterlegten Adressen werden von Microsoft Windows-Clients in AD-kompatiblen Domänen abgefragt.

source: DNS UMC module forward lookup - MX records tab
de: DNS UMC Modul Forward Lookup - Reiter MX Records

source: *MX records* tab
de: Reiter *MX Records*

source: Priority
de: Priorität

source: A numerical value between 0 and 65535. If several mail servers are available for the MX record, an attempt will be made to engage the server with the lowest priority value first.
de: Ein Zahlenwert zwischen 0 und 65535. Stehen mehrere Mail-Server für den MX-Record zur Verfügung, wird zuerst versucht, den Server mit dem niedrigsten Prioritätswert in Anspruch zu nehmen.

source: The mail server responsible for this domain as fully qualified domain name with a full stop at the end. Only canonical names and no alias names can be used here.
de: Hier wird der für diese Domäne zuständige Mail-Server als vollqualifizierter Domänenname mit abschließendem Punkt eingetragen. Es dürfen nur kanonische Namen und keine Alias-Namen verwendet werden.

source: DNS UMC module forward lookup - TXT records tab
de: DNS UMC Modul Forward Lookup - Reiter TXT Records

source: *TXT records* tab
de: Reiter *TXT Recods*

source: Descriptive text for this zone. Text records must not contain umlauts or other special characters.
de: Ein beschreibender Text zu dieser Zone. Text Records dürfen keine Umlaute oder sonstige Sonderzeichen enthalten.

source: CNAME records / alias records are managed in the UMC module :guilabel:`DNS` (see :ref:`central-user-interface`). To create another record, the forward lookup zone must be selected in the left column. :menuselection:`Add --> DNS: Alias record` can be used to create a new record.
de: CNAME-Records / Alias-Records werden im UMC-Modul :guilabel:`DNS` verwaltet (siehe auch :ref:`central-user-interface`). Um einen weiteren Record anzulegen, muss in der linken Spalte eine Forward Lookup Zone ausgewählt werden. Mit :menuselection:`Hinzufügen --> DNS: Alias Record` kann dann ein neuer Record angelegt werden.

source: The alias name as fully qualified domain name with a full stop at the end or as a relative domain name which should point to the canonical name.
de: Der Aliasname als FQDN mit abschließendem Punkt oder als relativer Domänenname, der auf den kanonischen Namen verweisen soll.

source: Canonical name
de: Kanonischer Name

source: The canonical name of the computer that the alias should point to, entered as a fully qualified domain name with a full stop at the end or a relative domain name.
de: Der kanonische Name des Rechners, auf den der Alias verweisen soll, angegeben als FQDN mit abschließendem Punkt oder als relativer Domänenname.

source: Host records are managed in the UMC module :guilabel:`DNS` (see :ref:`central-user-interface`). To create another record, the forward lookup zone must be selected in the left column. :menuselection:`Add --> DNS: Host record` can be used to create a new record.
de: Host-Records werden im UMC-Modul :guilabel:`DNS` verwaltet (siehe auch :ref:`central-user-interface`). Um einen weiteren Record anzulegen, muss in der linken Spalte eine Forward Lookup Zone ausgewählt werden. Mit :menuselection:`Hinzufügen --> DNS: Host Record` kann dann ein neuer Record angelegt werden.

source: When adding or editing a computer object a host record can be created automatically or edited.
de: Beim Hinzufügen oder Bearbeiten eines Rechner-Objekts kann ein Host Record automatisch erstellt oder geändert werden.

source: The FQDN with a full stop at the end or the relative domain name of the name server.
de: Der FQDN mit abschließendem Punkt oder der relative Domänenname des Rechners.

source: The IPv4 and/or IPv6 addresses to which the host record should refer.
de: Die IPv4 und/oder IPv6-Adressen, auf die der Host Record verweisen soll.

source: The time to live specifies in seconds how long these files may be cached by other DNS servers.
de: Die Time-to-Live gibt in Sekunden an, wie lange diese Daten von anderen DNS-Servern im Cache gespeichert werden dürfen.

source: Service records are managed in the UMC module :guilabel:`DNS` (see :ref:`central-user-interface`). To create another record, the forward lookup zone must be selected in the left column. :menuselection:`Add --> DNS: Service record` can be used to create a new record.
de: Service Records werden im Modul :guilabel:`DNS` verwaltet (siehe auch :ref:`central-user-interface`). Um einen weiteren Record anzulegen, muss in der linken Spalte eine Forward Lookup Zone ausgewählt werden. Mit :menuselection:`Hinzufügen --> DNS: Service Record` kann dann ein neuer Record angelegt werden.

source: Configuring a service record
de: Konfiguration eines Service Records

source: A service record must always be assigned to a forward lookup zone and can therefore only be added to a forward lookup zone or a subordinate container.
de: Ein Service Record muss immer einer Forward Lookup Zone zugewiesen sein und kann daher nur einer Forward Lookup Zone oder einem untergeordneten Container zugewiesen werden.

source: Service
de: Dienst

source: The name under which the service should be reachable.
de: Der Name, unter dem der Dienst erreichbar sein soll.

source: Protocol
de: Protokoll

source: The protocol via which the record can be accessed (``TCP``, ``UDP``, ``MSDCS`` or ``SITES``).
de: Das Protokoll, über das der Record erreichbar ist (``TCP``, ``UDP``, ``MSDCS`` oder ``SITES``).

source: Extension
de: Erweiterung

source: This input field can be used to specify additional parameters.
de: Über dieses Eingabefeld können weitere Parameter übergeben werden.

source: A whole number between 0 and 65535. If more than one server offer the same service, the client will approach the server with the lowest priority value first.
de: Eine ganze Zahl zwischen 0 und 65535. Stellen mehrere Server denselben Dienst zur Verfügung, wendet sich der Client zuerst an den Server mit dem niedrigeren Prioritätswert.

source: Weighting
de: Gewichtung

source: A whole number between 0 and 65535. The weight function is used for load balancing between servers with the same priority. When more than one server offer the same service and have the same priority the load is distributed across the servers in relation to the weight function.
de: Eine ganze Zahl zwischen 0 und 65535. Die Gewichtung dient der Lastverteilung zwischen Servern mit gleicher Priorität. Wenn mehrere Server denselben Dienst zur Verfügung stellen und denselben Prioritätswert haben, wird die Last im Verhältnis der Gewichtungen auf die Server verteilt.

source: Example: ``Server1`` has a priority of ``1`` and a weight function of ``1``, whilst ``Server2`` also has a priority of ``1``, but has a weight function of ``3``. In this case, ``Server2`` will be used three times as often as ``Server1``. The load is measured depending on the service, for example, as the number of requests or connection.
de: Beispiel: ``Server1`` hat eine Priorität von 1 und eine Gewichtung von 1, während ``Server2`` ebenfalls eine Priorität von 1, aber eine Gewichtung von 3 hat. In diesem Fall wird ``Server2`` dreimal so oft verwendet wie ``Server1``. Die Belastung wird abhängig vom Dienst beispielsweise als Anzahl der Anfragen oder Verbindungen gemessen.

source: The port where the service can be reached on the server (valid value from 1 to 65535).
de: Der Port, über den der Dienst auf dem Server zu erreichen ist (gültige Werte liegen zwischen 1 und 65535).

source: The name of the server on which the service will be made available, as a fully qualified domain name with a full stop at the end or a relative domain name.
de: Der Name des Servers, auf dem der Dienst bereitgestellt wird, als FQDN mit abschließendem Punkt oder als relativer Domänenname.

source: Several servers can be entered for each service.
de: Für jeden Dienst können über die Auswahlbox auch mehrere Server eingetragen werden.

source: The time to live specifies how long these files may be cached by other DNS servers.
de: Die Time-to-Live gibt an, wie lange diese Daten von anderen DNS-Servern im Cache gespeichert werden dürfen.

source: A reverse lookup zone is used to resolve IP address into host names. They are managed in the UMC module :guilabel:`DNS`. To add another reverse lookup zone, select *All DNS zones* and :menuselection:`Add --> DNS: Reverse lookup zone`.
de: Eine Reverse Lookup Zone dient zur Umwandlung von IP-Adressen in Rechnernamen. Sie werden im UMC-Modul :guilabel:`DNS` verwaltet. Um eine weitere Reverse Lookup Zone anzulegen, muss *Alle DNS-Zonen* selektiert werden und :menuselection:`Hinzufügen --> DNS: Reverse Lookup Zone` ausgewählt werden.

source: DNS UMC module reverse lookup - General tab
de: DNS UMC Modul Reverse Lookup - Reiter Allgemein

source: Subnet
de: Subnetz

source: The IP address of the network for which the reverse lookup zone shall apply. For example, if the network in question consisted of the IP addresses ``192.0.2.0`` to ``192.0.2.255``, ``192.0.2`` should be entered.
de: Die IP-Adresse des Netzwerkes, für das die Reverse Lookup Zone gültig sein soll. Wenn beispielsweise das betreffende Netz aus den IP-Adressen ``192.0.2.0`` bis ``192.0.2.255`` besteht, wäre ``192.0.2`` einzutragen.

source: Each DNS zone has at least one authoritative, primary name server whose information governs the zone. Subordinate servers synchronize themselves with the authoritative server via zone transfers. The entry which defines such a zone is called a SOA record in DNS terminology.
de: Jede DNS-Zone hat mindestens einen autoritativen, primären Nameserver, dessen Informationen die Zone regeln. Untergeordnete Server synchronisieren sich mit dem autoritativen Server über Zonentransfers. Der Eintrag, der eine solche Zone definiert, wird in der DNS-Terminologie als SOA Eintrag bezeichnet.

source: DNS UMC module reverse lookup - Start of authority tab
de: DNS UMC Modul Reverse Lookup - Reiter Start of Authority

source: The email address of the person responsible for administrating the zone (with a full stop at the end).
de: Die E-Mail-Adresse der für die Verwaltung der Zone verantwortlichen Person (mit abschließendem Punkt).

source: The fully qualified domain name with a full stop at the end or the relative domain name of the primary name server.
de: Der FQDN mit abschließendem Punkt oder der relative Domänenname der zuständigen Nameserver. Der erste Eintrag in der Liste ist der primäre Nameserver der Zone.

source: See the documentation on forward lookup zones in :ref:`networks-dns-forwardzone`.
de: Siehe die Dokumentation zu Forward Lookup Zonen in :ref:`networks-dns-forwardzone`.

source: Pointer record
de: Pointer Records

source: Pointer records are managed in the UMC module :guilabel:`DNS` (see :ref:`central-user-interface`). To create another record, the reverse lookup zone must be selected in the left column. :menuselection:`Add --> DNS: Pointer record` can be used to create a new record.
de: Pointer-Records werden im UMC-Modul :guilabel:`DNS` verwaltet (siehe auch :ref:`central-user-interface`). Um einen weiteren Record anzulegen, muss in der linken Spalte eine Reverse Lookup Zone ausgewählt werden. Mit :menuselection:`Hinzufügen --> DNS: Pointer Record` kann dann ein neuer Record angelegt werden.

source: The last octet of the computer's IP address (depends on network prefix, see example below).
de: Das letzte Oktett der IP-Adresse des Rechners (abhängig vom Netz-Präfix, siehe unten).

source: The computer's fully qualified domain name with a full stop at the end.
de: Der FQDN des Rechners mit abschließendem Punkt.

source: In a network with a 24-bit network prefix (subnet mask ``255.255.255.0``) a pointer should be created for the ``client001`` computer with the IP address ``192.0.2.101``. ``101`` must then be entered in the *Address field* and ``client001.company.com.`` in *Pointer*.
de: In einem Netzwerk mit 24-Bit langem Netz-Präfix (Netzmaske ``255.255.255.0``) soll für den Rechner ``client001`` mit der IP-Adresse ``192.0.2.101`` ein Pointer angelegt werden. In das Feld *Adresse* ist dann ``101`` und in *Pointer* ``client001.firma.com.`` einzutragen.

source: Example:
de: Beispiel:

source: For a network with a 16-bit network prefix (subnet mask ``255.255.0.0``) the last two octets should be entered in reverse order for this computer (here ``101.1``). ``client001.company.com.`` also needs to be entered in the *Pointer* field here.
de: Bei einem Netzwerk mit 16-Bit langem Netz-Präfix (Netzmaske ``255.255.0.0``) müssten für diesen Rechner die letzten zwei Oktette in umgekehrter Reihenfolge (hier ``101.1``) eingetragen werden. In das Feld *Pointer* wäre auch hier ``client001.firma.com.`` einzutragen.

source: Packet filter with Univention Firewall
de: Paketfilter mit Univention Firewall

source: Univention Firewall integrates a packet filter based on :program:`iptables` in Univention Corporate Server.
de: Die Univention Firewall integriert einen Paketfilter auf Basis von :program:`iptables` in |UCSUCS|.

source: It permits targeted filtering of undesired services and the protection of computers during installations. Furthermore it provides the basis for complex scenarios such as firewalls and application level gateways. Univention Firewall is included in all UCS installations as standard.
de: Dies ermöglicht die gezielte Filterung unerwünschter Dienste, die Absicherung von Rechnern während Installationsarbeiten, und stellt die Basis für komplexere Szenarien wie Firewalls oder Application Level Gateways bereit. Univention Firewall ist standardmäßig auf allen |UCSUCS|-Installationen enthalten.
