Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/ip-config.po
Languages: de

source: By default all incoming ports are blocked. Every UCS package provides rules, which free up the ports required by the package again.
de: In der Grundeinstellung werden eingehende Pakete für alle Ports blockiert/abgelehnt. Jedes UCS-Paket bringt Regeln mit, die die von dem Paket benötigten Ports wieder freigeben.

source: The configuration is primarily performed via |UCSUCR| variables. The definition of this type of packet filter rules is documented in :cite:t:`developer-reference`.
de: Die Konfiguration erfolgt im Wesentlichen über |UCSUCR|-Variablen. Die Definition von solchen Paketfilter-Regeln ist in :cite:t:`developer-reference` dokumentiert.

source: In addition, the configuration scripts in the :file:`/etc/security/packetfilter.d/` directory are listed in alphabetic order. The names of all scripts begin with two digits, which allows a numbered order. The scripts must be marked as executable.
de: Darüber hinaus werden die im Verzeichnis :file:`/etc/security/packetfilter.d/` liegenden Konfigurationsskripte in alphabetischer Reihenfolge ausgeführt. Standardmäßig sind alle Skripte mit zwei führenden Ziffern benannt, so dass eine einfache Festlegung der Reihenfolge möglich ist. Die Skripte müssen als ausführbar markiert sein.

source: After changing the packet filter settings, the :program:`univention-firewall` service has to be restarted.
de: Nach Änderungen der Paketfilter-Einstellungen muss der Dienst :program:`univention-firewall` neu gestartet werden.

source: Univention Firewall can be deactivated by setting the |UCSUCRV| :envvar:`security/packetfilter/disabled` to ``true``
de: Die Univention Firewall kann durch Setzen der |UCSUCRV| :envvar:`security/packetfilter/disabled` auf ``true`` deaktiviert werden

source: IP and network management
de: IP- und Netzverwaltung

source: This chapter describes how IP addresses for computer systems in a UCS domain can be centrally managed via UMC modules and assigned via DHCP.
de: Dieses Kapitel beschreibt wie IP-Adressen für die in einer UCS-Domäne verwalteten Rechnersysteme zentral über UMC-Module verwaltet und per DHCP zugewiesen werden können.

source: :ref:`network-objects` bundle available IP address segments of a network. The DNS resolution as well as the assignment of IP addresses via DHCP are integrated in UCS, as detailed in :ref:`networks-dns` and :ref:`module-dhcp-dhcp`.
de: :ref:`network-objects` fassen verfügbare IP-Adressbereiche eines Netzes zusammen. Die DNS-Auflösung sowie die Vergabe von IP-Adressen über DHCP sind in UCS integriert und werden genauer in :ref:`networks-dns` sowie :ref:`module-dhcp-dhcp` erläutert.

source: Incoming and outgoing network traffic can be restricted via the *Univention Firewall* based on :command:`iptables`, see :ref:`ip-config-packet-filter-with-univention-firewall`.
de: Ein- und ausgehende Netzwerkverbindungen können über die in UCS integrierte *Univention Firewall* auf Basis von :command:`iptable` begrenzt werden (:ref:`ip-config-packet-filter-with-univention-firewall`).

source: The integration of the proxy server Squid allows the caching of web contents and the enforcement of content policies for web access, see :ref:`ip-config-web-proxy-for-caching-and-policy-management-virus-scan`.
de: Die Integration des Proxy-Servers Squid ermöglicht das Zwischenspeichern von Web-Inhalten und die Umsetzung inhaltlicher Richtlinien für den Web-Zugriff (:ref:`ip-config-web-proxy-for-caching-and-policy-management-virus-scan`).

source: Network objects
de: Netzwerk-Objekte

source: *Network objects* can be used to compile available IP addresses; the next available address is then automatically specified during assignment to a computer.
de: Mit *Netzwerk-Objekten* lassen sich Eigenschaften eines Netzes zentral erfassen, z.B. die verfügbaren IP-Adressen und die DNS- und DHCP-Zonen, in denen die Systeme angesiedelt sind.

source: Creating a network object
de: Erstellen eines Netzwerk-Objekts

source: For example, it is possible to define a network object *Workstation network* which encompasses the IP addresses from ``192.0.2.0`` to ``192.0.2.254``. If a Windows computer object is now created and only the network object selected, an internal check is performed for which IP addresses are already assigned and the next free one selected. This saves the administrator having to compile the available addresses manually. If a computer object is removed, the address is automatically reassigned.
de: So kann beispielsweise ein Netzwerk-Objekt *Produktivnetz* definiert werden, das sich über die IP-Adressen von ``192.0.2.0`` bis ``192.0.2.254`` erstreckt. Wird nun ein Windows-Rechnerobjekt angelegt, muss nun nur das Netzwerk-Objekt ausgewählt werden. Es wird dann intern geprüft, welche der IP-Adressen des Netzes bereits vergeben sind und die nächste freie ausgewählt. Wird ein Rechnerobjekt entfernt, wird die Adresse automatisch wieder neu vergeben. Dies erspart dem Administrator eine manuelle Verwaltung verfügbarer Adressen.

source: Network objects are managed in the UMC module :guilabel:`Networks`. For more information about UMC, see :ref:`central-user-interface`.
de: Für Netzwerk-Objekte können sowohl IPv4-, als auch IPv6-Adressen verwendet werden. Für mehr Informationen über UMC, siehe :ref:`central-user-interface`.

source: The name of the network is entered in this input field. This is the name under which the network also appears in the computer management.
de: In diesem Eingabefeld ist der Name des Netzwerks einzutragen. Unter diesem Namen erscheint das Netzwerk auch in der Rechnerverwaltung.

source: Networks
de: Netzwerk

source: The network address is entered in dot-decimal form in this input field, e.g., ``192.0.2.0``.
de: In diesem Eingabefeld muss die Netzwerk-Adresse in Oktettschreibweise eingetragen werden, z.B. ``192.0.2.0``.

source: Netmask
de: Netzmaske

source: The network mask can be entered in this input field in network prefix or dot-decimal form. If the network mask is entered in dot-decimal form it will be subsequently be converted into the corresponding network prefix and later also shown so.
de: Die Netzmaske kann in diesem Eingabefeld wahlweise als Bitzahl (Netzpräfix) oder in Oktettschreibweise eingetragen werden. Wenn die Netzmaske in Oktettschreibweise eingegeben wird, wird sie automatisch in den entsprechenden Netzpräfix umgewandelt und später auch ausgegeben.

source: IP address range
de: IP-Adressbereich

source: One or more IP ranges can be configured here. When a host is assigned to this network at a later point, it will automatically be assigned the next, free IP address from the IP range entered here.
de: In diesem Feld können ein oder mehrere IP-Adressbereiche angelegt werden. Wenn später ein Gerät diesem Netzwerk zugeordnet werden soll, wird dem Gerät automatisch die nächste freie IP-Adresse aus den hier eingetragenen IP-Adressbereichen zugewiesen.

source: When no IP range is entered here, the system automatically uses the range given by the network and the subnet mark entered.
de: Wenn an dieser Stelle kein IP-Adressbereich eingerichtet wird, verwendet das System automatisch den Bereich, der sich aus dem Netzwerk und der Netzmaske ergibt.

source: Forward lookup zones and reverse lookup zones can be selected in the sub menu *DNS preferences*. When a host is assigned to this network at a later point, a host record in the forward lookup zone and/or a pointer record in the reverse lookup zone will be created automatically.
de: Im Untermenü *DNS-Einstellungen* können Forward Lookup Zone und Reverse Lookup Zone ausgewählt werden. Wird später ein Gerät diesem Netzwerk zugeordnet, wird für das Gerät automatisch ein Host Record in der Forward Lookup Zone beziehungsweise ein Pointer Record in der Reverse Lookup Zone angelegt.

source: The zones are also administrated in the UMC module :guilabel:`DNS`, see :ref:`networks-dns-forwardzone`.
de: Die Zonen werden ebenfalls im UMC-Modul :guilabel:`DNS` verwaltet, siehe :ref:`networks-dns-forwardzone`.

source: If no zone is selected here, no DNS records are created during assignment to a computer object. However, the DNS entries can still be set manually.
de: Wird hier keine Zone ausgewählt, werden bei der Zuweisung zu einem Rechnerobjekt keine DNS-Records angelegt. Die DNS-Einträge können aber weiterhin manuell gesetzt werden.

source: DNS forward lookup zone
de: Forward Lookup Zone für DNS-Einträge

source: The forward lookup zone where hosts from the network should be added must be specified here. The resolution of the computer name to an IP address is performed via the zone.
de: Hier ist die Forward Lookup Zone anzugeben, in die Geräte aus diesem Netzwerk eingetragen werden sollen. Über diese Zone wird die Auflösung des Rechnernamens zu einer IP-Adresse durchgeführt.

source: DNS reverse lookup zone
de: Reverse Lookup Zone für DNS-Einträge

source: The reverse lookup zone where hosts from the network should be added must be specified here. The reverse resolution of the IP address back to a computer name is performed via the zone.
de: Hier ist die Reverse Lookup Zone anzugeben, in die Geräte aus diesem Netzwerk eingetragen werden sollen. Über diese Zone wird die Rückwärtsauflösung der IP-Adresse zu einem Rechnernamen durchgeführt.

source: A DHCP service can be assigned to the network in the sub menu *DHCP preferences*. When a host is assigned to this network at a later point, a DHCP computer entry with a fixed IP address will be created automatically in the selected DHCP service.
de: Im Untermenü *DHCP-Einstellungen* kann dem Netzwerk ein DHCP-Service zugeteilt werden. Wird später ein Gerät diesem Netzwerk zugeordnet, wird für das Gerät automatisch ein DHCP-Rechner-Eintrag mit der festen IP-Adresse unterhalb des gewählten DHCP-Services angelegt.

source: The DHCP service settings are also administrated in the UMC module :guilabel:`DHCP`, see :ref:`networks-dhcp-general`.
de: Die DHCP-Service-Einstellungen werden ebenfalls im UMC-Modul :guilabel:`DHCP` verwaltet, siehe :ref:`networks-dhcp-general`.

source: If no DHCP service is selected, no DHCP host record is created during assignment to a computer object. However, such an entry can also still be assigned manually.
de: Wird hier keine DHCP-Service ausgewählt, wird bei der Zuweisung zu einem Rechnerobjekt kein DHCP-Rechner-Eintrag angelegt. Ein solcher Eintrag kann aber weiterhin manuell zugewiesen werden.

source: The :program:`RADIUS` app increases the security for UCS managed IT infrastructures by controlling the access to the wireless network for users, groups and endpoint devices via `RADIUS protocol <w-radius_>`_. The configuration is done via deny and allow lists and directly at user, group and endpoint device objects in the UCS management system. Registered users are authenticated with their usual domain credentials or, alternatively, with a specifically for RADIUS generated password, which, among others, also allows bring your own device concepts.
de: Die :program:`RADIUS` App erhöht die Sicherheit für mit UCS verwaltete IT-Infrastrukturen durch Zugangskontrollen zu WLAN-Netzwerken für Benutzer, Gruppen und Endgeräte über das `RADIUS-Protokoll <w-radius_>`_. Die Konfiguration erfolgt über Blacklisten und Whitelisten direkt am Benutzer-, Gruppen- oder Endgeräte-Objekt im UCS Managementsystem. Registrierte Benutzer werden mit ihrem üblichen Domänenpasswort oder alternativ mit einem eigens erzeugten RADIUS-Passwort authentisiert, so dass unter anderem *Bring-Your-Own-Device-Konzepte* ermöglicht werden.

source: :program:`RADIUS` is available through the App Center (see :ref:`software-appcenter`) and can be installed using the UMC module :guilabel:`App Center`. It can be installed on multiple machines. After the installation it runs a `FreeRADIUS <freeradius_>`_ server. Authenticators (e.g. access points) can contact via RADIUS to check network access requests.
de: :program:`RADIUS` steht über das App Center (siehe :ref:`software-appcenter`) zur Verfügung und kann über das entsprechende UMC-Modul :guilabel:`App Center` installiert werden. Die App kann auf mehreren Systemen installiert werden. Nach der Installation startet die App einen `FreeRADIUS <freeradius_>`_ Server. *Authenticators* (z.B. *Access Points*) können den Server via RADIUS kontaktieren und Netzwerkzugangsanfragen prüfen.

source: The RADIUS app can also be installed on UCS\@school systems. In this case, the network access can be given to users or groups regardless of the internet rule or computer room settings.
de: Die RADIUS App kann auch auf UCS\@school Systemen installiert werden. In diesem Fall kann der Zugang an Benutzer oder Gruppen unabhängig von der Internetregel oder Computerraumeinstellungen vergeben werden.

source: Configuration
de: Konfiguration

source: Allowed users
de: Erlaubte Benutzer

source: By default no user is allowed to access the network. Enabling the checkbox for *network access* on the *RADIUS* tab, gives the user access to the network. The checkbox can also be set on groups, which allows all users in this group access.
de: Standardmäßig hat kein Benutzer Zugang zum Netzwerk. Indem die Checkbox für *Netzwerkzugriff erlaubt* im *RADIUS* Reiter aktiviert wird, erhält der Benutzer Zugriff auf das Netzwerk. Die Checkbox kann auch für Gruppen gesetzt werden, so dass alle Benutzer in der Gruppe Zugang erlangen.

source: Example for a group allowing network access to its users
de: Beispiel für eine Gruppe, die ihren Benutzern Zugang gewährt

source: Service specific password
de: Dienst-spezifisches Passwort

source: By default, users authenticate with their domain password. By setting the |UCSUCRV| :envvar:`radius/use-service-specific-password` to ``true``, a dedicated password for RADIUS will be used. Through the :ref:`Self Service app <user-management-password-changes-by-users>`, users can get such a password. The system will generate a random password for users to use. If needed, a new password can be generated at any time. This also invalidates the old password. To enable this page in the Self Service, the |UCSUCRV| :envvar:`umc/self-service/service-specific-passwords/backend/enabled` has to be set to ``true`` on the :guilabel:`Self Service Backend`.
de: Standardmäßig authentifizieren sich Benutzer über ihr Domänenpasswort. Durch Setzen der |UCSUCRV| :envvar:`radius/use-service-specific-password` auf ``true`` wird stattdessen ein Passwort speziell für RADIUS genutzt. Dieses Passwort können Nutzer selbst über die :ref:`App Self Service <user-management-password-changes-by-users>` setzen lassen. Dafür ist auf dem :guilabel:`Self Service Backend` die |UCSUCRV| :envvar:`umc/self-service/service-specific-passwords/backend/enabled` auf ``true`` zu setzen. In der App kann dann vom System ein zufälliges Passwort erzeugt werden, das die Benutzer dann nutzen können. Bei Bedarf kann das Passwort neu generiert werden. Dadurch wird gleichzeitig das alte Passwort ungültig.

source: The page in the Self Service to get a RADIUS specific password
de: Seite im Self Service, um ein RADIUS-spezifisches Passwort zu bekommen

source: The parameters used to generate the passwords can be adjusted. On a |UCSPRIMARYDN| some |UCSUCRVs| have to be set:
de: Die Parameter, mit denen das Passwort erzeugt wird, können angepasst werden. Auf dem |UCSPRIMARYDN| müssen dazu |UCSUCRVs| gesetzt werden:

source: MAC filtering
de: MAC-Adressfilter

source: By default access to the network is allowed for every device (assuming the used username has access). It can be restricted to only allow specific devices. This can be enabled by setting the |UCSUCRV| :envvar:`radius/mac/whitelisting` to ``true``. When enabled, the device used to access the network is looked up via the LDAP attribute ``macAddress`` and the resulting computer object must have network access granted (either directly or via one of its groups), too.
de: Standardmäßig ist allen Geräten der Zugang zum Netzwerk erlaubt, vorausgesetzt der verwendete Benutzer hat Zugriff. Der Netzwerkzugriff kann auch auf spezifische Geräte begrenzt werden. Das kann durch Setzen der |UCSUCRV| :envvar:`radius/mac/whitelisting` auf ``true`` erreicht werden. Sobald aktiviert, wird das Geräteobjekt beim Zugriff des Geräts auf das Netzwerk über das LDAP-Attribut ``macAddress`` abgerufen und dem entsprechenden Geräteobjekt muss der Zugang zum Netzwerk auch erlaubt sein (entweder direkt oder über eine der Gruppen).

source: MAC Authentication Bypass with computer objects
de: MAC Authentication Bypass für Computerobjekte

source: MAC Authentication Bypass (MAB) is a proprietary fallback mode to 802.1X for devices that don't support 802.1X authentication, such as network printers or wireless phones. MAB is an option that allows such devices to authenticate with the network using their MAC address as their username.
de: MAC Authentication Bypass (MAB) ist ein proprietärer Fallback-Modus zu 802.1X für Geräte, die keine 802.1X-Authentifizierung unterstützen, wie Netzwerkdrucker oder drahtlose Telefone. MAB ist eine Option, die es solchen Geräten ermöglicht, sich mit ihrer MAC-Adresse als Benutzernamen beim Netzwerk zu authentifizieren.

source: This section describes how to use a device's MAC address for authentication and assign them a VLAN to the corresponding network infrastructure through MAB. To activate MAC Authentication Bypass, set the |UCSUCRV| :envvar:`freeradius/conf/allow-mac-address-authentication` to ``true``.
de: Dieser Abschnitt beschreibt, wie Sie die MAC-Adresse eines Geräts zur Authentifizierung verwenden und ihm über MAB ein VLAN der entsprechenden Netzwerkinfrastruktur zuweisen. Um MAC Authentication Bypass zu aktivieren, setzen Sie die |UCSUCRV| :envvar:`freeradius/conf/allow-mac-address-authentication` auf ``true``.

source: Devices that authenticate using MAB ignore network access settings:
de: Geräte, die sich mit MAB authentifizieren, ignorieren die Netzwerkzugangseinstellungen:

source: The checkbox *Allow network access* at the computer object and in the group setting
de: Die Checkbox *Netzwerkzugriff zulassen* beim Computerobjekt und in der Gruppeneinstellung

source: Attackers can spoof MAC addresses. Consider any port as compromised where your switch allows to use MAB. Make sure you have put appropriate measures in place to still keep your network secure.
de: Angreifer können MAC-Adressen ausspionieren. Betrachten Sie jeden Anschluss als gefährdet, an dem Ihr Switch die Verwendung von MAB zulässt. Vergewissern Sie sich, dass Sie geeignete Maßnahmen ergriffen haben, um Ihr Netzwerk weiterhin sicher zu halten.

source: To assign the VLAN ID to a computer, you need to add it to the group of the computer object with the respective VLAN ID. In the UCS management system, follow these steps:
de: Um einem Computer die VLAN-ID zuzuweisen, müssen Sie ihn zur Gruppe des Computerobjekts hinzufügen, dass die entsprechende VLAN ID hat. Gehen Sie im UCS-Managementsystem wie folgt vor:

source: Open :menuselection:`Devices --> Computers`.
de: Öffnen Sie :menuselection:`Geräte --> Computer`.

source: Click the computer object to edit.
de: Klicken Sie das Computerobjekt, das Sie bearbeiten möchten.

source: Go to :menuselection:`Advanced settings --> Groups`.
de: Gehen Sie zu :menuselection:`Erweiterte Einstellungen --> Gruppen`.

source: To add a group with VLAN IDs, click :guilabel:`+ ADD`, select ``Virtual LAN ID`` from the *Object property* drop-down, and activate the appropriate group to add it.
de: Um eine Gruppe mit VLAN-IDs hinzuzufügen, klicken Sie auf :guilabel:`ADD`, wählen Sie ``Virtual LAN ID`` aus der Dropdown-Liste *Objekteigenschaft* und aktivieren Sie die entsprechende Gruppe, um sie hinzuzufügen.

source: To save, click :guilabel:`ADD` in the *Add objects* dialog and :guilabel:`SAVE` in the *Advanced settings*.
de: Um zu speichern, klicken Sie auf :guilabel:`HINZUFÜGEN` im *Objekte hinzufügen* Dialog und :guilabel:`SAVE` in *Erweiterte Einstellungen*.

source: To assign the VLAN ID to a user group, you need to add it to the user group settings. In the UCS management system, follow these steps:
de: Um die VLAN-ID einer Benutzergruppe zuzuweisen, müssen Sie sie zu den Benutzergruppeneinstellungen hinzufügen. Führen Sie im UCS-Managementsystem die folgenden Schritte aus:

source: Open :menuselection:`Users --> Groups`.
de: Öffnen Sie :menuselection:`Benutzer --> Gruppen`.

source: Click the user group object to edit or create a new user group.
de: Klicken Sie die Benutzergruppe zum Bearbeiten oder erstellen Sie eine neue Benutzergruppe.

source: Go to :menuselection:`RADIUS`.
de: Gehen Sie zu :menuselection:`RADIUS`.

source: Enter the VLAN ID as number into the field *Virtual LAN ID*.
de: Geben Sie die VLAN ID as Zahl in das Feld *Virtual LAN ID*.

source: To save, click :guilabel:`SAVE`.
de: Zum Speichern, klicken Sie :guilabel:`SPEICHERN`.

source: If a computer object has assigned several groups with VLAN IDs, UCS selects the VLAN ID with the lowest number and assigns it. To configure a default VLAN ID, set it as value to the |UCSUCRV| :envvar:`freeradius/vlan-id`.
de: Wenn einem Computerobjekt mehrere Gruppen mit VLAN-IDs zugeordnet sind, wählt UCS die VLAN-ID mit der niedrigsten Nummer aus und weist sie zu. Um eine Standard VLAN-ID zu konfigurieren, setzen Sie diese als Wert in die |UCSUCRV| :envvar:`freeradius/vlan-id`.

source: After you completed the configuration, the Radius server returns the assigned VLAN ID to requests with the given MAC address.
de: Nachdem Sie die Konfiguration abgeschlossen haben, gibt der Radius-Server die zugewiesene VLAN-ID an Anfragen mit der angegebenen MAC-Adresse zurück.

source: UCS stores the MAC address in the LDAP directory as lowercase string with the colon (``:``) as separator, for example ``00:00:5e:00:53:00``.
de: UCS speichert die MAC-Adresse im LDAP-Verzeichnis als Zeichenkette in Kleinbuchstaben mit dem Doppelpunkt (``:``) als Trennzeichen, zum Beispiel ``00:00:5e:00:53:00``.

source: With :uv:erratum:`5.0x1011` the Radius server can handle different formats of the MAC addresses for the username when using MAB.
de: Mit :uv:erratum:`5.0x1011` kann der Radius-Server mit verschiedenen Formaten der MAC Adresse für Benutzernamen umgehen, wenn MAB verwendet wird.

source: Devices that use MAB, use their MAC address as username and they may use different formats for it. The Radius server supports different case-sensitive formats. The following list shows the tested formats:
de: Geräte, die MAB verwenden, benutzen ihre MAC-Adresse als Benutzernamen und sie können unterschiedliche Formate dafür verwenden. Der Radius-Server unterstützt verschiedene Formate, die Groß- und Kleinschreibung unterscheiden. In der folgenden Liste sind die getesteten Formate aufgeführt:

source: For non-standard formats, you can configure a regular expression in the |UCSUCRV| :envvar:`freeradius/conf/mac-addr-regexp` to match your custom MAC address format.
de: Für nicht-standardisierte Formate können Sie einen regulären Ausdruck in der |UCSUCRV| :envvar:`freeradius/conf/mac-addr-regexp` konfigurieren, der mit Ihrem benutzerdefinierten MAC-Adressformat zusammen passt.

source: Depending on your regular expression, the previously listed formats may not work anymore.
de: Je nach regulärem Ausdruck kann es vorkommen, dass die zuvor aufgeführten Formate nicht mehr funktionieren.
