Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/mail.po
Languages: de

source: A mail domain is an common namespace for email addresses, mailing lists and IMAP group folders. Postfix differentiates between the delivery of emails between local and external domains. Delivery to mailboxes defined in the LDAP directory is only conducted for email address from local domains. The name of a mail domain may only be composed of lowercase letters, the figures 0-9, full stops and hyphens.
de: Eine Mail-Domäne ist ein gemeinsamer Namensraum für E-Mail-Adressen, Mailinglisten und IMAP-Gruppen-Ordner. Postfix unterscheidet bei der Zustellung von E-Mails zwischen lokalen und externen Domänen. Nur für E-Mail-Adressen lokaler Domänen wird die Mailzustellung vorgenommen. Der Name einer Mail-Domäne darf nur aus Kleinbuchstaben, den Ziffern 0-9, Punkten und Bindestrichen bestehen.

source: Several mail domains can be managed with UCS. The managed mail domains do not need to be the DNS domains of the server - they can be selected at will. The mail domains registered on a mail server are automatically saved in the |UCSUCRV| :envvar:`mail/hosteddomains`.
de: Mit UCS lassen sich mehrere Mail-Domänen verwalten. Die verwalteten Mail-Domänen müssen dabei nicht der DNS-Domäne des Servers entsprechen, sondern sind frei wählbar. Die auf einem Mailserver registrierten Mail-Domänen werden automatisch in der |UCSUCRV| :envvar:`mail/hosteddomains` gespeichert.

source: To ensure that external senders can also send emails to members of the domain, MX records must be created in the configuration of the authoritative name servers, which designate the UCS server as mail server for the domain. These DNS adjustments are generally performed by an internet provider.
de: Damit auch externe Absender E-Mails an die Mitglieder der Domäne versenden können, müssen in der Konfiguration der autoritativen DNS-Nameserver MX-Records angelegt werden, die den UCS-Server als Mailserver für die Domäne ausweisen. Diese DNS-Anpassungen werden üblicherweise von Internet-Providern vorgenommen.

source: Mail domains are managed in the UMC module :guilabel:`Mail` with the *Mail domain* object type.
de: Mail-Domänen werden im UMC-Modul :guilabel:`E-Mail` mit dem Objekttyp *Mail-Domäne* verwaltet.

source: Assignment of email addresses to users
de: Zuordnung von E-Mail-Adressen zu Benutzern

source: A user can be assigned three different types of email addresses:
de: Einem Benutzer können drei verschiedene Arten von E-Mail-Adressen zugeordnet werden:

source: Primary email address
de: Primäre E-Mail-Adresse

source: The *primary email address* is used for authentication on Postfix and Dovecot. Primary email addresses must always be unique. Only one primary email address can be configured for every user. It also defines the user's IMAP mailbox. If a mail home server is assigned to a user (see :ref:`mail-homeserver`), the IMAP inbox is automatically created by a |UCSUDL| module. The domain part of the email address must be registered in the UMC module :guilabel:`Mail` (see :ref:`mail-management-domains`).
de: Die *primäre E-Mail-Adresse* wird zur Authentifizierung an Postfix und Dovecot verwendet. Primäre E-Mail-Adressen müssen eindeutig sein. Pro Benutzer kann nur eine primäre E-Mail-Adresse konfiguriert werden. Sie definiert auch das IMAP-Postfach des Benutzers. Wenn dem Benutzer ein Mail Home Server zugeordnet ist (siehe :ref:`mail-homeserver`), wird das IMAP-Postfach automatisch durch ein |UCSUDL|-Modul erstellt. Der Domänenanteil der E-Mail-Adresse muss im UMC-Modul :guilabel:`E-Mail` registriert sein (siehe :ref:`mail-management-domains`).

source: Alternative email addresses
de: Alternative E-Mail-Adressen

source: Emails to *alternative email addresses* are also delivered to the user's mailbox. As many addresses can be entered as you wish. The alternative email addresses do not have to be unique: if two users have the same email address, they both receive all the emails which are sent to this address. The domain part of the email address must be registered in the UMC module :guilabel:`Mail` (see :ref:`mail-management-domains`). To receive emails to alternative email addresses, a user must have a primary email address.
de: E-Mails an *alternative E-Mail-Adressen* werden ebenfalls in das Postfach des Benutzers zugestellt. Es können beliebig viele Adressen angegeben werden. Die alternativen E-Mail-Adressen müssen nicht eindeutig sein; besitzen zwei Benutzer die gleiche Adresse, erhalten beide Benutzer alle E-Mails, die an diese Adresse gesandt werden. Der Domänenanteil der E-Mail-Adresse muss im UMC-Modul :guilabel:`E-Mail` registriert sein (siehe :ref:`mail-management-domains`). Um E-Mails an alternative E-Mail-Adressen zu erhalten, muss ein Benutzer eine primäre E-Mail-Adresse besitzen.

source: Forward email addresses
de: E-Mailadressen zur Weiterleitung

source: If *forward email addresses* are configured for a user, emails received through the primary or alternative email addresses are forwarded to them. A copy of the messages can optionally be stored in the user's mailbox. Forward email addresses do not have to be unique and their domain part does not have to be registered via a UMC module.
de: Wenn *Weiterleitungs-E-Mail-Adressen* für einen Benutzer konfiguriert sind, werden E-Mails, die er über die primäre oder über alternative E-Mail-Adressen empfängt, an diese weiter geleitet. Optional kann eine Kopie der eingehenden Nachrichten in das Postfach des Benutzers zugestellt werden. Es können beliebig viele Adressen angegeben werden. E-Mailadressen zur Weiterleitung müssen weder eindeutig, noch muss ihr Domänenanteil im UMC-Modul registriert sein.

source: Email addresses can consist of the following characters: letters ``a-z``, figures ``0-9``, dots (``.``), hyphens (``-``) and underscores (``_``). The address has to begin with a letter and must include an ``@`` character. At least one mail domain must be registered for to be able to assign email addresses (see :ref:`mail-management-domains`).
de: E-Mail-Adressen können die Zeichen ``a-z``, die Ziffern ``0-9``, Punkte (``.``), Bindestriche (``-``) und Unterstriche (``_``) enthalten. Als weitere Vorgabe müssen die E-Mail-Adressen mit einem Buchstaben beginnen und ein ``@``-Zeichen enthalten. Um E-Mail-Adressen vergeben zu können, muss vorher mindestens eine Mail-Domäne registriert werden (siehe :ref:`mail-management-domains`).

source: Email addresses are managed in the UMC module :guilabel:`Users`. The *primary email address* is entered in the *General* tab in the *User account* submenu. *Alternative email addresses* can be entered under :menuselection:`Advanced settings --> Mail`.
de: E-Mail-Adressen werden im UMC-Modul :guilabel:`Benutzer` verwaltet. Die *primäre E-Mail-Adresse* wird im Reiter *Allgemein* im Untermenü *Benutzer-Konto* eingetragen. *Alternative E-Mail-Adressen* können unter :menuselection:`Erweiterte Einstellungen --> Mail` eingetragen werden.

source: Once the user account is properly configured, authentication to the mail stack is possible (``IMAP``/``POP3``/``SMTP``). Please keep in mind that after disabling the account or changing the password, the login to the mail stack is still possible for 5 minutes due to the authentication cache of the mail stack. To invalidate the authentication cache run
de: Sobald das Benutzerkonto konfiguriert ist, kann eine Anmeldung am UCS-Mail-Stack (``IMAP``/``POP3``/``SMTP``) erfolgen. Wurde das Benutzerkonto deaktiviert (oder das Passwort geändert), ist eine Anmeldung am Mail-Stack für eine Dauer von 5 Minuten weiterhin möglich. Der Grund hierfür ist der Authentifizierungscache des Mail-Stacks. Um den Cache zu invalidieren, führen Sie

source: on the mail server. The expiration time of the authentication cache can be configured on the mail server with the |UCSUCRV| :envvar:`mail/dovecot/auth/cache_ttl` and :envvar:`mail/dovecot/auth/cache_negative_ttl`.
de: auf dem Mailserver aus. Die Ablaufzeit des Caches kann auf dem Mailserver mit der |UCSUCRV| :envvar:`mail/dovecot/auth/cache_ttl` sowie :envvar:`mail/dovecot/auth/cache_negative_ttl` konfiguriert werden.

source: Management of mailing lists
de: Verwaltung von Mailinglisten

source: Mailing lists are used to exchange emails in closed groups. Each mailing list has its own email address. If an email is sent to this address, it is received by all the members of the mailing list.
de: Mailinglisten werden zum Austausch von E-Mails in geschlossenen Gruppen verwendet. Jede Mailingliste verfügt über eine eigene E-Mail-Adresse. Wird an diese Adresse eine E-Mail gesendet, empfangen sie alle Mitglieder der Mailingliste.

source: Creating a mailing list
de: Einrichtung einer Mailingliste

source: Mail domains are managed in the UMC module :guilabel:`Mail` with the *Mailing list* object type. A name of your choice can be entered for the mailing list under *Name*; the entry of a *Description* is optional. The email address of the mailing list should be entered as the *Mail address*. The domain part of the address needs to be the same as one of the managed mail domains. As many addresses as necessary can be entered under *Members*. In contrast to mail groups (see :ref:`mail-management-mailgroups`), external email addresses can also be added here. The mailing list is available immediately after its creation.
de: Mail-Domänen werden im UMC-Modul :guilabel:`E-Mail` mit dem Objekttyp *Mailingliste* verwaltet. Unter *Name* ist ein frei wählbarer Name der Mailingliste anzugeben, die Angabe einer *Beschreibung* ist optional. Als *Mail-Adresse* ist die E-Mail-Adresse der Mailingliste einzugeben. Der Domänenteil der Adresse muss dabei einer der verwalteten Mail-Domänen entsprechen. Unter *Mitglieder* können beliebig viele Adressen aufgenommen werden, im Gegensatz zu Mailgruppen (siehe :ref:`mail-management-mailgroups`) können hier auch externe E-Mail-Adressen aufgenommen werden. Nach dem Anlegen einer Mailingliste ist diese umgehend verfügbar.

source: By default everyone can write to the mailing list. To prevent misuse, there is the possibility of restricting the circle of people who can send mails. To do so, the |UCSUCRV| :envvar:`mail/postfix/policy/listfilter` on the mail server must be set to ``yes`` and Postfix restarted. *Users that are allowed to send emails to the list* and *Groups that are allowed to send emails to the list* can be specified under *Advanced settings*. If a field is set here, only authorized users/groups are allowed to send mails.
de: In der Grundeinstellung kann jeder an die Mailingliste schreiben. Um Missbrauch zu verhindern, besteht die Möglichkeit den Senderkreis einzuschränken. Dazu muss die |UCSUCRV| :envvar:`mail/postfix/policy/listfilter` auf dem Mailserver auf ``yes`` gesetzt und Postfix neu gestartet werden. Unter *Erweiterte Einstellungen* können dann *Benutzer, die berechtigt sind, E-Mails an diese Liste zu versenden* und *Gruppen, die berechtigt sind, E-Mails an diese Liste zu versenden* festgelegt werden. Ist hier ein Feld gesetzt, ist das Senden nur den berechtigten Nutzern/Gruppen erlaubt.

source: Management of mail groups
de: Verwaltung von Mailgruppen

source: There is the possibility of creating a mail group: This is where an email address is assigned to a group of users. Emails to this address are delivered to the primary email address of each of the group members.
de: Es besteht die Möglichkeit eine Mailgruppe zu bilden: Dabei wird einer Benutzer-Gruppe eine E-Mail-Adresse zugewiesen. E-Mails an diese Adresse werden dann allen Gruppenmitgliedern an ihre primäre E-Mail-Adresse zugestellt.

source: Mail groups are managed in the UMC module :guilabel:`Groups` (see :ref:`groups`).
de: Mailgruppen werden im UMC-Modul :guilabel:`Gruppen` verwaltet (siehe auch :ref:`groups`).

source: The email address of the mail group is specified in the *mail address* input field under *Advanced settings*. The domain part of the address must be the same as one of the managed mail domains.
de: Die E-Mail-Adresse der Mailgruppe wird im Eingabefeld *Mail-Adresse* unter *Erweiterte Einstellungen* festgelegt. Der Domänenteil der Adresse muss einer der verwalteten Mail-Domänen entsprechen.

source: By default everyone can write to the mail group. To prevent misuse, there is the possibility of restricting the circle of people who can send mails. To do so, the |UCSUCRV| :envvar:`mail/postfix/policy/listfilter` on the mail server must be set to ``yes`` and Postfix restarted.
de: In der Grundeinstellung kann jeder an die Mailgruppe schreiben. Um Missbrauch zu verhindern, besteht die Möglichkeit den Senderkreis einzuschränken. Dazu muss die |UCSUCRV| :envvar:`mail/postfix/policy/listfilter` auf dem Mailserver auf ``yes`` gesetzt und Postfix neu gestartet werden.

source: *Users that are allowed to send emails to the group* and *Groups that are allowed to send emails to the group* can be specified under *Advanced settings*. If a field is set here, only authorized users/groups are allowed to send mails.
de: Unter *Erweiterte Einstellungen* können *Benutzer, die berechtigt sind, E-Mails an diese Gruppe zu versenden* und *Gruppen, die berechtigt sind, E-Mails an diese Gruppe zu versenden* festgelegt werden. Ist hier ein Feld gesetzt, ist das Senden nur den berechtigten Nutzern/Gruppen erlaubt.

source: Management of shared IMAP folders
de: Verwaltung von globalen IMAP-Ordnern

source: Shared email access forms the basis for cooperation in many work groups. In UCS, users can create folders in their own mailboxes and assign permissions so that other users may read emails in these folders or save additional emails in them.
de: Ein gemeinsamer Zugriff auf E-Mails ist in vielen Arbeitsgruppen die Grundlage der Zusammenarbeit. Mit UCS können Benutzer sehr einfach Ordner in Ihren eigenen Postfächern anlegen und Berechtigungen vergeben, so dass es weiteren Benutzern gestattet ist, E-Mails in diesen Ordnern zu lesen oder weitere E-Mails in diesen Ordnern abzulegen.

source: Alternatively, individual IMAP folders can be shared for users or user groups. This type of folder is described as a shared IMAP folder. Shared IMAP folders are managed in the UMC module :guilabel:`Mail` with the *Mail folder (IMAP)* object type.
de: Alternativ können eigene IMAP-Ordner für Benutzer oder Benutzergruppen freigegeben werden. Ein solcher Ordner wird als globaler IMAP-Ordner bezeichnet. Globale IMAP-Ordner werden im UMC-Modul :guilabel:`Mail` mit dem Objekttyp *Mail-Ordner (IMAP)* verwaltet.

source: Shared folders cannot be renamed, therefore the |UCSUCRV| :envvar:`mail/dovecot/mailbox/rename` is not taken into account. When a shared folder is deleted in the UMC module :guilabel:`Mail`, it is only deleted from the hard disk, if :envvar:`mail/dovecot/mailbox/delete` is set to ``yes``. The default value is ``no``.
de: Globale IMAP-Ordner können nicht umbenannt werden. Die |UCSUCRV| :envvar:`mail/dovecot/mailbox/rename` kommt daher nicht zur Anwendung. Nur wenn :envvar:`mail/dovecot/mailbox/delete` auf ``yes`` gesetzt ist (Standard ist ``no``), wird ein globaler IMAP-Ordner beim Löschen im UMC-Modul :guilabel:`Mail` auch tatsächlich von der Festplatte gelöscht.

source: Creating a shared IMAP folder
de: Einrichtung eines globalen IMAP-Ordners

source: Shared IMAP folder - General tab
de: Globaler IMAP-Ordner - Reiter Allgemein

source: *General* tab
de: Reiter *Allgemein*

source: The name under which the IMAP folder is available in the email clients. The name displayed in the IMAP client differs depending on if an email address is configured (see field *Email address*) or not. If no email address is configured, the IMAP folder will be displayed in the client as ``name@domain/INBOX``. If an email address is configured, it will be ``shared/name@domain``.
de: Der Name, unter dem der IMAP-Ordner im E-Mail-Client verfügbar ist. Der Name unterscheidet sich je nach dem, ob eine E-Mail-Adresse konfiguriert wird (siehe Zeile "Mail-Adresse" unten) oder nicht. Wird keine Mail-Adresse konfiguriert, erscheint der IMAP-Ordner im Client als ``name@domain/INBOX``. Wird eine Mail-Adresse verwendet, wird der Name die Form ``shared/name@domain`` haben.

source: Mail domain (*)
de: Mail-Domäne (*)

source: Every shared IMAP folder is assigned to a mail domain. The management of the domains is documented in the :ref:`mail-management-domains`.
de: Jeder globale IMAP-Ordner ist einer Mail-Domäne zugeordnet. Die Verwaltung der Domänen ist in :ref:`mail-management-domains` dokumentiert.

source: An IMAP folder is assigned to a mail home server. Further information can be found in :ref:`mail-homeserver`.
de: Ein IMAP-Ordner ist einem Mail Home Server zugeordnet. Weitere Hinweise finden sich in :ref:`mail-homeserver`.

source: This setting can be used to set the maximum total size of all emails in this folder.
de: Mit dieser Einstellung kann die maximale Gesamtgröße aller E-Mails in diesem Ordner festgelegt werden.

source: Email address
de: E-Mailadresse

source: An email address can be entered here via which emails can be sent directly to the IMAP folder. If no address is set here, it is only possible to write in the folder from email clients.
de: Hier kann eine E-Mail-Adresse angegeben werden, durch die E-Mails direkt an den IMAP-Ordner gesendet werden können. Ist hier keine Adresse gesetzt, so kann nur aus E-Mail-Clients heraus in den Ordner geschrieben werden.

source: The domain part of the email address must be registered in the UMC module :guilabel:`Mail` (see :ref:`mail-management-domains`).
de: Der Domänenanteil der E-Mail-Adresse muss im UMC-Modul :guilabel:`E-Mail` registriert sein (siehe :ref:`mail-management-domains`).

source: Shared IMAP folder - Access rights tab
de: Globale IMAP-Ordner - Reiter Zugriffsrechte

source: *Access rights* tab
de: Reiter *Zugriffsrechte*

source: Access permissions based on users or groups can be entered here. Users are entered with their username; the groups saved in the UMC module :guilabel:`Groups` can be used as groups.
de: Hier können Zugriffsberechtigungen auf Basis von Benutzern oder Gruppen vergeben werden. Benutzer werden mit Ihrem Benutzernamen eingetragen; als Gruppen werden die im UMC-Modul :guilabel:`Gruppen` angelegten Gruppen verwendet.

source: The access permissions have the following consequences for individual users or members of the specified group:
de: Die Zugriffsrechte haben folgende Auswirkungen für einzelne Benutzer oder Mitglieder der angegebenen Gruppe:

source: No access
de: Keine

source: No access is possible. The folder is not displayed in the folder list.
de: Es ist kein Zugriff möglich. Der Ordner wird nicht in der Ordnerliste angezeigt.

source: Read
de: Lesen

source: The user may only perform read access to existing entries.
de: Es darf nur lesend auf bestehende Einträge zugegriffen werden.

source: Append
de: Anhängen

source: Existing entries may not be edited; only new entries may be created.
de: Bestehende Einträge dürfen nicht verändert werden, nur neue Einträge erzeugt werden.

source: Write
de: Schreiben

source: New entries may be created in this directory; existing entries may be edited or deleted.
de: Neue Einträge in diesem Ordner anlegen, bestehende verändern oder bestehende löschen ist erlaubt.

source: Post
de: Senden

source: Sending an email to this directory as a recipient is permitted. This function is not supported by all the clients.
de: Eine E-Mail an diesen Ordner als Empfänger senden ist zugelassen. Dies wird nicht von jedem Client unterstützt.

source: All
de: Alles

source: Encompasses all permissions of *write* and also allows the changing of access permissions.
de: Umfasst alle Berechtigungen von *Schreiben* und erlaubt zusätzlich das Ändern von Zugriffsrechten.

source: The size of the users' mailboxes can be restricted via the mail quota. When this is attained, no further emails can be accepted for the mailbox by the mail server until the user deletes old mails from their account.
de: Die Größe der Benutzerpostfächer kann über Mail-Quotas eingeschränkt werden, bei deren Erreichen vom Mailserver keine weiteren E-Mails für das Postfach angenommen werden, bis der Benutzer alte Mails aus seinem Konto entfernt hat.

source: The limit is specified in megabytes in the *Mail quota* field under :menuselection:`Advanced settings --> Mail`. The default value is ``0`` and means that no limit is set. The multi edit mode of UMC modules can be used to assign a quota to multiple users at one time, see :ref:`central-user-interface-edit`.
de: Die Grenze wird in Megabytes im Feld *Mail-Quota* festgelegt, die unter :menuselection:`Erweiterte Einstellungen --> Mail` verwaltet wird. Der Standardwert ist ``0`` und bedeutet, dass keine Beschränkung aktiv ist. Für das Zuweisen einer Quota an mehrere Benutzer auf einmal, kann der Mehrfachbearbeitungsmodus von UMC-Modulen verwendet werden, siehe :ref:`central-user-interface-edit`.

source: The user can be warned once a specified portion of the mailbox is attained and then receives a message that their available storage space is almost full. The administrator can enter the threshold in percent and the messages subject and text:
de: Der Benutzer kann ab einer bestimmten erreichten Postfachgröße gewarnt werden und erhält dann eine Mail mit dem Hinweis, dass seine Speicherressourcen nahezu ausgeschöpft sind. Der Administrator kann den Schwellwert in Prozent, den Betreff der Nachricht und ihren Inhalt angeben:

source: The threshold for when the warning message should be issued can be configured in the |UCSUCRV| :envvar:`mail/dovecot/quota/warning/text`, for example :samp:`mail/dovecot/quota/warning/text/{PERCENT}={TEXT}`
de: In der |UCSUCRV| :envvar:`mail/dovecot/quota/warning/text` kann der Schwellwert konfiguriert werden, ab dem eine Warnmeldung ausgegeben werden soll, zum Beispiel: :samp:`mail/dovecot/quota/warning/text/{PROZENT}={TEXT}`

source: ``PERCENT`` must be a number between 0 and 100 without the percent sign.
de: ``PROZENT`` muss als Zahl zwischen 0 und 100 ohne Prozentzeichen angegeben werden.

source: ``TEXT`` will be the content of the email. If the value ``TEXT`` contains the string ``$PERCENT``, it will be replaced in the email with the value of the limit that has been exceeded.
de: ``TEXT`` ist der Inhalt der E-Mail. Wenn ``TEXT`` die Zeichenkette ``$PERCENT`` enthält, wird diese in der E-Mail mit dem überschrittenen Wert ersetzt.

source: The value of the |UCSUCRV| :envvar:`mail/dovecot/quota/warning/subject` will be used for the subject of the email.
de: Der Wert der |UCSUCRV| :envvar:`mail/dovecot/quota/warning/subject` wird als Betreff der E-Mails verwendet.

source: When the mail server package is installed, a subject and two warning messages are automatically configured:
de: Bei der Installation des Mail-Server-Paketes werden Betreff und zwei Warn-Nachrichten automatisch konfiguriert:

source: ``mail/dovecot/quota/warning/subject`` is set to ``Quota-Warning``
de: ``mail/dovecot/quota/warning/subject`` wird gesetzt auf ``Quota-Warning``

source: ``mail/dovecot/quota/warning/text/80`` is set to ``Your mailbox has filled up to over $PERCENT%.``
de: ``mail/dovecot/quota/warning/text/80`` wird gesetzt auf ``Your mailbox has filled up to over $PERCENT%.``

source: ``mail/dovecot/quota/warning/text/95`` is set to ``Attention: Your mailbox has already filled up to over $PERCENT%. Please delete some messages or contact the administrator.``
de: ``mail/dovecot/quota/warning/text/95`` wird gesetzt auf ``Attention: Your mailbox has already filled up to over $PERCENT%. Please delete some messages or contact the administrator.``
