Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/mail.po
Languages: de

source: Dovecot flushes NFS caches when needed if you set :envvar:`mail/dovecot/process/mail_nfs_storage`\ ``=yes``, but unfortunately this doesn't work 100%, so you can get random errors. The same holds for flushing NFS caches after writing index files with :envvar:`mail/dovecot/process/mail_nfs_index`\ ``= yes``.
de: Dovecot kann mit :envvar:`mail/dovecot/process/mail_nfs_storage`\ ``=yes`` angewiesen werden, wenn nötig, den NFS Cache zu leeren. Dies funktioniert jedoch nicht immer, daher kann es zu sporadischen Fehlern kommen. Das gleiche gilt für das Leeren des NFS-Cache nach dem Schreiben von Index-Dateien: :envvar:`mail/dovecot/process/mail_nfs_index`\ ``=yes``.

source: The Dovecot documentation has more information on the topic: `Dovecot Wiki: Mail storage on shared disks <dovecot-mail-storage-shared-disk_>`_ and `Dovecot Wiki: NFS <dovecot-nfs_>`_.
de: In der Documentation des Dovecot Servers sind weitere Hinweise zu finden: `Dovecot Wiki: Mail storage on shared disks <dovecot-mail-storage-shared-disk_>`_ und `Dovecot Wiki: NFS <dovecot-nfs_>`_.

source: Connection limits
de: Beschränkung der Verbindungsanzahl

source: In a default |UCSUCS| configuration Dovecot allows ``400`` concurrent IMAP and POP3 connections each. That is enough to serve at least 100 concurrently logged in IMAP users, possibly a lot more.
de: In der Standardeinstellung in UCS wird Dovecot für jeweils maximal 400 gleichzeitige Verbindungen per IMAP und POP3 ausgeliefert. Diese reichen sicher aus, um 100 gleichzeitig eingeloggte IMAP-Benutzer zu bedienen, unter Umständen deutlich mehr.

source: How many IMAP connections are opened by a user depends on the clients they use:
de: Wie viele IMAP-Verbindungen Benutzer gleichzeitig geöffnet haben, hängt von den eingesetzten Clients ab:

source: Web mail opens just a few short lived connections.
de: Webmail öffnet nur einzelne, kurzlebige Verbindungen.

source: Desktop clients keep multiple connections open over a long period of time.
de: Desktop E-Mail-Programme halten über lange Zeit mehrere Verbindungen offen.

source: Mobile clients keep just a few connections open over a long period of time. But they tend to never close them, unnecessarily wasting resources.
de: Mobile Clients halten über lange Zeit wenige Verbindungen offen, aber beenden diese oft nicht von sich aus, so dass sie unnötig lang Ressourcen belegen.

source: The limits exist mainly to resist denial of service attacks that open a lot of connections and create lots of processes.
de: Die Beschränkungen dienen primär dazu, einem Denial-of-Service-Angriff durch sehr viele geöffnete Prozesse und Netzwerkverbindungen zu widerstehen.

source: To list the open connections, run:
de: Um die in diesem Augenblick offenen Verbindungen zu sehen, kann folgender Befehl ausgeführt werden:

source: To display the total amount of open connections, run:
de: Um die Gesamtanzahl auszugeben:

source: The |UCSUCRV|\ s :envvar:`mail/dovecot/limits`\ ``/*`` can be set to modify the limits. The process of adapting those variables is only semi automatic, because of their complex interaction. For the meaning of each variable refer to `Dovecot Wiki: Service configuration <dovecot-services_>`_.
de: Um die Beschränkungen zu verändern, können die |UCSUCRV|\ n :envvar:`mail/dovecot/limits`\ ``/*`` angepasst werden. Der Vorgang ist auf Grund des komplexen Zusammenspiels dieser Variablen nur halb automatisch. Die Bedeutung aller Variablen kann in `Dovecot Wiki: Service configuration <dovecot-services_>`_ nachgelesen werden.

source: Dovecot uses separate processes for login and to access emails. The limits for these can be configured separately. The maximum number of concurrent connections to a service and the maximum number of processes for a service is also configured separately. Setting ``mail/dovecot/limits/default_client_limit = 3000`` changes the limit for the maximum number of concurrent connections to the IMAP and POP3 services but does not change the maximum number of processes allowed to run. With the |UCSUCS| default settings Dovecot runs in "High-security mode": each connection is served by a separate process. The default is to allow only ``400`` processes, so only 400 connections can be made.
de: Da bei Dovecot verschiedene Prozesse für Login und Zugriff auf die E-Mail-Dateien zuständig sind, können diese getrennt konfiguriert werden. Zusätzlich wird getrennt konfiguriert, wie viele Verbindungen zu einem Dienst erlaubt sind und wie viele Prozesse für einen Dienst gestartet werden. Durch das Setzen von ``mail/dovecot/limits/default_client_limit = 3000`` würde die Beschränkung für die Anzahl an Verbindungen zu den POP3- und IMAP-Diensten verändert, nicht jedoch für die erlaubte Anzahl an Prozessen. In der |UCSUCS| Standardeinstellung läuft Dovecot im *High-security mode*: Jede Verbindung wird von einem separaten Login-Prozess betreut. Da standardmäßig nur 400 Prozesse erlaubt sind, können auch nicht mehr Verbindungen geöffnet werden.

source: To allow 3000 clients to connect to their emails, another |UCSUCRV| has to be set:
de: Um 3000 Verbindungen von Benutzern zu ihren E-Mails zu erlauben, muss daher eine weitere |UCSUCRV| gesetzt werden:

source: Reading :file:`/var/log/dovecot.info` reveals a warning:
de: Ein Blick in :file:`/var/log/dovecot.info` offenbart nun eine Warnung:

source: The services ``auth`` (responsible for login and SSL connections) and ``anvil`` (responsible for statistics collection) are set to their default limits. Although 3000 POP3 and IMAP connections and processes are allowed, the connection limit for the login service is too low. Leaving it like this will lead to failed logins.
de: Die Dienste ``auth`` (Zuständig für Login und SSL-Verbindungen) sowie ``anvil`` (Zuständig für Statistiken) haben noch das Standardlimit. Es werden zwar je 3000 POP3- und IMAP-Verbindungen und -Prozesse erlaubt, aber die Anzahl der Prozesse für Login und SSL ist nun zu niedrig um sie alle zu bedienen. Dies wird dazu führen, dass Logins fehlschlagen.

source: The values are so high, because ``default_client_limit`` and ``default_process_limit`` do not only lift limits for IMAP and POP3, but also for other services like ``lmtp`` and ``managesieve-login``. Those services can now start more processes that have to be monitored and can theoretically make more authentication requests. This increases the number of possible concurrent connections to the ``auth`` and ``anvil`` services.
de: Die hohen Werte kommen dadurch zustande, dass mit ``default_client_limit`` und ``default_process_limit`` nicht nur die Beschränkungen von IMAP und POP3 erhöht werden, sondern auch einiger weiterer Dienste wie ``lmtp`` und ``managesieve-login``. Diese Dienste können nun mehr zu überwachende Prozesse starten und theoretisch mehr Authentifizierungen durchführen, wodurch sich die maximale Anzahl gleichzeitiger Verbindungen zu den Diensten ``auth`` und ``anvil`` erhöht.

source: The values have to be adapted, using the numbers from the log file:
de: Die Werte für die Dienste müssen nun der Fehlermeldung entsprechend angepasst werden:

source: Another warning appears in :file:`/var/log/dovecot.info`:
de: Ein Blick in :file:`/var/log/dovecot.info` offenbart nun noch eine letzte Warnung:

source: The Linux kernel controlled setting ``ulimit`` setting (limit on the number of files/connections a process is allowed to open) is changed only when the Dovecot service is restarted:
de: Das vom Linux-Kernel kontrolliere ``ulimit`` (die erlaubte Anzahl gleichzeitig geöffneter Dateien/Verbindungen pro Prozess) wird nur bei einem Neustart des Dovecot-Dienstes verändert, daher:

source: No more warnings are written to the log file and both IMAP and POP3 servers now accept 3000 client connections each.
de: Nun erscheint keine Fehlermeldung mehr, und IMAP- und POP3-Server akzeptieren nun beide je 3000 Verbindungen.

source: |UCSUCS| configures Dovecot to run in "High-security mode" by default. For installations with 10.000s of users, Dovecot offers the "High-performance mode". The performance guide has further details on how to configure it, see :cite:t:`ucs-performance-guide`.
de: |UCSUCS| konfiguriert Dovecot so, dass es standardmäßig im *High-security mode* läuft. In Installationen mit zehntausenden Benutzern kann Dovecot im *High-performance mode* betrieben werden. Der Performance-Leitfaden beschreibt, wie dieser konfiguriert werden kann, siehe :cite:t:`ucs-performance-guide`.

source: Identification of Spam sources with DNS-based Blackhole Lists
de: Identifikation von Spam Quellen mit DNS basierten Blackhole Listen

source: Another means of combating spam is to use a *DNS-based Blackhole List* (DNSBL) or *Real-time Blackhole List* (RBL). DNSBLs are lists of IP addresses that the operator believes to be (potential) sources of spam. The lists are checked by DNS. If the IP of the sending email server is known to the DNS server, the message is rejected. The IP address is checked quickly and in a comparatively resource-friendly manner. The check is performed *before* the message is accepted. The extensive checking of the content with SpamAssassin and anti-virus software is only performed once it has been received. Postfix has `integrated support for DNSBLs <postfix-reject-rbl-client_>`_.
de: Eine weitere Möglichkeit gegen Spam vorzugehen ist die Verwendung von *DNS-based Blackhole List* (DNSBL) oder *Real-time Blackhole Lists* (RBL). DNSBL sind Listen von IP Adressen, von denen der Betreiber denkt, dass sie (potentiell) Quellen von Spam sind. Die Listen werden per DNS abgefragt. Ist dem DNS-Server die IP des sendenden E-Mail-Servers bekannt, so wird die Nachricht abgelehnt. Der Check einer IP-Adresse ist schnell und vergleichsweise ressourcenschonend. Er findet *vor* dem Annehmen der Nachricht statt. Erst nach dem Empfang findet die aufwändige Inhaltsüberprüfung mit SpamAssassin und Anti-Virus statt. Postfix hat eine `eingebaute Unterstützung für DNSBLs <postfix-reject-rbl-client_>`_.

source: DNSBLs from various projects and companies are available on the internet. Please refer to the corresponding websites for further information on conditions and prices.
de: Im Internet existieren DNSBL von verschiedenen Projekten und Firmen. Bitte informieren Sie sich auf deren Webseiten über Konditionen und Preise.

source: The |UCSUCRV| :envvar:`mail/postfix/smtpd/restrictions/recipient` with a key-value pair :samp:`{SEQUENCE}={RULE}` must be set to be able to use DNSBLs with Postfix: :samp:`mail/postfix/smtpd/restrictions/recipient/{SEQUENCE}={RULE}`.
de: Um DNSBL mit Postfix zu verwenden, muss die |UCSUCRV| :envvar:`mail/postfix/smtpd/restrictions/recipient` mit einem Schlüssel-Wert-Paar :samp:`{SEQUENCE}={RULE}` gesetzt werden: :samp:`mail/postfix/smtpd/restrictions/recipient/{SEQUENCE}={RULE}`.

source: It can be used to configure recipient restrictions via the Postfix option ``smtpd_recipient_restrictions`` (see `Postfix setting smtpd_recipient_restrictions <postfix-smtp-recipient-restrictions_>`_). The sequential number is used to sort multiple rules alphanumerically, which can be used to influences the ordering.
de: Mit ihr können Empfangsbeschränkungen über die Postfix-Option ``smtpd_recipient_restrictions`` konfiguriert werden (siehe `Postfix Einstellung smtpd_recipient_restrictions <postfix-smtp-recipient-restrictions_>`_). Die Sequenznummer dient der alphanumerisch Sortierung mehrerer Regeln, über die die Reihenfolge beeinflusst werden kann.

source: Existing ``smtpd_recipient_restrictions`` regulations can be listed as follows:
de: Existierende ``smtpd_recipient_restrictions`` Regeln können wie folgt aufgelistet werden:

source: In an unmodified |UCSUCS| Postfix installation, the DNSBL should be added to the end of the ``smtpd_recipient_restrictions`` rules. For example:
de: In einer unveränderten |UCSUCS| Postfix Installation sollten die DNSBL am Ende der ``smtpd_recipient_restrictions`` Regeln angehängt werden. Zum Beispiel:

source: Integration of Fetchmail for retrieving mail from external mailboxes
de: Integration von Fetchmail zum Abrufen von Mail von externen Postfächern

source: Usually, the UCS mail service accepts mails for the users of the UCS domain directly via SMTP. UCS also offers optional integration of the software *Fetchmail* for fetching emails from external POP3 or IMAP mailboxes.
de: Im Regelfall nimmt der UCS-Maildienst Mails für die Benutzer der UCS-Domäne direkt über SMTP entgegen. UCS bietet zusätzlich eine optionale Integration der Software Fetchmail zum Abrufen von Emails von externen POP3 oder IMAP-Postfächern.

source: Fetchmail can be installed via the Univention App Center; simply select the :program:`Fetchmail` application and then click on :guilabel:`Install`.
de: Fetchmail kann über das Univention App Center installiert werden; dort muss die Applikation :program:`Fetchmail` ausgewählt werden und auf :guilabel:`Installieren` geklickt werden.

source: Once the installation is finished, there are additional input fields in the :menuselection:`Advanced settings --> Remote mail retrieval` tab of the user administration which can be used to configure the collection of mails from an external server. The mails are delivered to the inboxes of the respective users. The primary email address must be configured for that.
de: Nach Abschluss der Installation finden sich in der Benutzerverwaltung im Reiter :menuselection:`Erweiterte Einstellungen --> Mailabruf von externen Servern` zusätzliche Eingabefelder, mit denen der Mailabruf von einem externen Server konfiguriert werden kann. Die Mails werden dabei in die Postfächer der jeweiligen Benutzer eingeliefert (die primäre E-Mail-Adresse muss dafür konfiguriert sein).

source: The mail is fetched every twenty minutes once at least one email address is configured for mail retrieval. After the initial configuration of a user Fetchmail needs to be started in the UMC module :guilabel:`System services`. In that module the fetching can also be disabled (alternatively by setting the |UCSUCRV| :envvar:`fetchmail/autostart` to ``false``).
de: Der Abruf erfolgt alle zwanzig Minuten sobald mindestens ein Postfach für den Abruf konfiguriert wurde. Nach der initialen Konfiguration eines Benutzers muss Fetchmail im UMC-Modul :guilabel:`Systemdienste` gestartet werden. Dort kann der Start des Dienstes auch deaktiviert werden (alternativ durch Setzen der |UCSUCRV| :envvar:`fetchmail/autostart` auf ``false``).

source: *Remote mail retrieval* tab
de: Reiter *Mailabruf von externen Servern*

source: Attribute
de: Attribut

source: Description
de: Beschreibung

source: Username
de: Benutzername

source: The username to be provided to the mail server for fetching mail.
de: Der Benutzername, der für den Abruf der Mail an den Mailserver übergeben werden soll.

source: Password
de: Passwort

source: The password to be used for fetching mail.
de: Das Passwort, das für den Mailabruf verwendet werden soll.

source: Protocol
de: Protokoll

source: The mail can be fetched via the IMAP or POP3 protocols.
de: Der Abruf kann über die Protokolle IMAP oder POP3 erfolgen.

source: Remote mail server
de: Externer Mailserver

source: The name of the mail server from which the emails are to be fetched.
de: Der Name des Mailservers, von dem die Mails abgerufen werden sollen.

source: Encrypt connection (SSL/TLS)
de: Verbindung verschlüsseln (SSL/TLS)

source: If this option is enabled, the mail is fetched in an encrypted form (when this is supported by the mail server).
de: Ist diese Option aktiviert, erfolgt der Mailabruf verschlüsselt (sofern dies vom Mailserver unterstützt wird).

source: Keep mails on the server
de: Mails auf dem Server nicht löschen

source: By default the fetched mails are deleted from the server following the transfer. If this option is enabled, it can be suppressed.
de: In der Grundeinstellungen werden die abgerufenen Mails nach dem Transfer auf dem Server gelöscht. Ist diese Option aktiviert, kann dies unterbunden werden.

source: Chapter contents:
de: Kapitelinhalte:

source: Mail services
de: Maildienste

source: |UCSUCS| (UCS) provides mail services that users can access via standard mail clients such as Thunderbird.
de: |UCSUCS| (UCS) stellt Maildienste bereit, auf die Benutzer über Standard-Mail-Clients wie Thunderbird zugreifen können.

source: :program:`Postfix` is used for sending and receiving mails. In the basic installation, a configuration equipped for local mail delivery is set up on every UCS system. In this configuration, Postfix only accepts mails from the local server and they can also only be delivered to local system users.
de: Für den Mailempfang und -versand wird :program:`Postfix` verwendet. In der Grundinstallation wird auf jedem UCS-System eine für die lokale Mailzustellung ausgelegte Konfiguration eingerichtet. Postfix nimmt in dieser Konfiguration E-Mails nur vom lokalen System entgegen, und auch die Zustellung erfolgt nur für lokale Systembenutzer.

source: The installation of the mail server component implements a complete mail transport via SMTP (see :ref:`mail-installation`). Postfix is reconfigured during the installation of the component so that a validity test in the form of a search in the LDAP directory is performed for incoming emails. That means that emails are only accepted for email addresses defined in the LDAP directory or via an alias.
de: Durch die Installation der Mailserver-Komponente wird ein vollständiger Mailtransport über SMTP umgesetzt (siehe :ref:`mail-installation`). Postfix wird bei der Installation der Komponente umkonfiguriert, so dass bei eingehenden E-Mails eine Gültigkeitsüberprüfung in Form einer Suche im LDAP-Verzeichnis durchgeführt wird. Das bedeutet, dass E-Mails nur für im LDAP-Verzeichnis eingetragene oder über einen Alias definierte E-Mail-Adressen akzeptiert werden.

source: The IMAP service :program:`Dovecot` is also installed on the system along with the mail server component. It provides email accounts for the domain users and offers corresponding interfaces for access via email clients. Dovecot is preconfigured for the fetching of emails via ``IMAP`` and ``POP3``. Access via POP3 can be deactivated by setting the |UCSUCRV| :envvar:`mail/dovecot/pop3` to ``no``. The same applies to IMAP and the |UCSUCRV| :envvar:`mail/dovecot/imap`. The further configuration of the mail server is performed via |UCSUCR|, as well, see :ref:`mail-serverconfig-general`.
de: Mit der Mailserver-Komponente wird ebenfalls der IMAP-Dienst :program:`Dovecot` auf dem System installiert. Dieser stellt E-Mailkonten für die Benutzer der Domäne bereit und bietet entsprechende Schnittstellen für den Zugriff durch E-Mail-Clients an. Dovecot ist für den Abruf von E-Mails über IMAP und POP3 vorkonfiguriert. Der Zugriff über POP3 kann durch Setzen der |UCSUCRV| :envvar:`mail/dovecot/pop3` auf ``no`` deaktiviert werden. Das gleiche gilt für IMAP und die |UCSUCRV| :envvar:`mail/dovecot/imap`. Auch die weitere Konfiguration der Mailserver erfolgt über |UCSUCR| (siehe :ref:`mail-serverconfig-general`).

source: The management of the user data of the mail server (e.g., email addresses or mailing list) is performed via UMC modules and is documented in :ref:`mail-management-general`. User data are stored in LDAP. The authentication is performed using a user's primary email address, i.e., it must be entered as the username in mail clients. As soon as a primary email address is assigned to a user in the LDAP directory, a listener module creates an IMAP mailbox on the mail home server. By specifying the mail home server, user email accounts can be distributed over several mail servers, as well, see :ref:`mail-homeserver`.
de: Die Verwaltung der Benutzerdaten des Mailservers (z.B. E-Mail-Adressen oder Verteiler) erfolgt über UMC-Module und ist in :ref:`mail-management-general` dokumentiert. Benutzerdaten werden in LDAP gespeichert. Die Authentifizierung wird anhand der primären E-Mail-Adresse eines Benutzers durchgeführt, d.h. sie muss als Benutzername in Mail-Clients eingetragen werden. Sobald einem Benutzer im LDAP-Verzeichnis eine primäre E-Mail-Adresse zugeordnet wird, legt ein Listener-Modul ein IMAP-Postfach auf dem Mail Home Server an. Durch die Angabe eines Mail Home Servers können E-Mail-Konten der Benutzer auch auf mehrere Mailserver verteilt werden (siehe :ref:`mail-homeserver`).

source: Optionally, emails received via Postfix can be checked for spam content and viruses before further processing by Dovecot. Spam emails are detected by the classification software :program:`SpamAssassin` (:ref:`mail-spam`); :program:`ClamAV` is used for the detection of viruses and other malware (:ref:`mail-virus`).
de: Optional können durch Postfix empfangene E-Mails vor der weiteren Verarbeitung durch Dovecot auf Spam-Inhalte und Viren hin untersucht werden. Spam-Mails werden über die Klassifizierungssoftware :program:`SpamAssassin` erkannt (:ref:`mail-spam`), für die Erkennung von Viren und anderer Malware wird :program:`ClamAV` eingesetzt (:ref:`mail-virus`).

source: By default emails to external domains are delivered directly to the responsible SMTP server of that domain. Its location is performed via the resolution of the MX record in the DNS. Mail sending can also be taken over by the relay host, e.g., on the internet provider (see :ref:`mail-serverconfig-relay`).
de: In der Voreinstellung werden E-Mails an fremde Domänen direkt dem zuständigen SMTP-Server der Domäne zugestellt. Die Ermittlung erfolgt dabei durch die Auflösung des MX-Records im DNS. Der Mailversand kann auch von einem Relay-Host z.B. beim Internet-Provider übernommen werden (siehe :ref:`mail-serverconfig-relay`).

source: The UCS mail system does not offer any groupware functionality such as shared calendars or invitations to appointments. However, there are groupware systems based on UCS which integrate in the UCS management system such as Kopano and Open-Xchange. Further information can be found in the :ref:`software-appcenter`.
de: Das UCS-Mailsystem bietet keine Groupware-Funktionalität wie gemeinsam genutzte Kalender oder Termineinladungen. Es existieren aber auf UCS basierende Groupwaresysteme, die sich in das UCS-Managementsystem integrieren, z. B. Kopano oder Open-Xchange. Weiterführende Informationen finden sich im Univention App Center (siehe :ref:`software-appcenter`).

source: A mail server can be installed from the Univention App Center with the application :program:`Mail server`. Alternatively, the software package :program:`univention-mail-server` can be installed. Additional information can be found in :ref:`computers-softwaremanagement-install-software`. A mail server can be installed on all server system roles. The use of a UCS Directory Node is recommended because of frequent LDAP accesses.
de: Ein Mailserver kann mit der Applikation *Mailserver* aus dem Univention App Center installiert werden. Alternativ kann das Softwarepaket :program:`univention-mail-server` installiert werden. Weitere Informationen finden sich in :ref:`computers-softwaremanagement-install-software`. Mailserver können auf allen Server-Systemrollen installiert werden. Die Verwendung eines UCS Directory Nodes wird wegen häufiger LDAP-Zugriffe empfohlen.

source: The runtime data of the Dovecot server are stored in the :file:`/var/spool/dovecot/` directory. If this directory is on a NFS share, please read :ref:`mail-serverconfig-nfs`.
de: Die Laufzeitdaten des Dovecot-Servers werden im Verzeichnis :file:`/var/spool/dovecot/` abgelegt. Falls dieses Verzeichnis auf einem NFS-Laufwerk liegen sollte, lesen Sie bitte :ref:`mail-serverconfig-nfs`.

source: Management of the mail server data
de: Verwaltung der Mailserver-Daten

source: Management of mail domains
de: Verwaltung von Mail-Domänen
