Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/mail.po
Languages: de

source: :program:`OX Connector` is an app in Univention App Center. It synchronizes selected users and groups to a remote OX App Suite installation like for example a hosted OX App Suite. The app should not be used with the separate OX App Suite app from the App Center, because it has synchronization already included.
de: :program:`OX Connector` ist eine App im Univention App Center. Sie synchronisiert ausgewählte Benutzer und Gruppen zu einer entfernten OX App Suite Installation wie zum Beispiel ein OX App Suite bei einem Hosting Anbieter. Die App sollte nicht mit der separaten OX App Suite App aus dem App Center verwendet werden, weil diese bereits eine Synchronisation enthält.

source: Spam detection and filtering
de: Spamerkennung und -filterung

source: Undesirable and unsolicited emails are designated as spam. The software SpamAssassin and Postgrey are integrated in UCS for the automatic identification of these emails. SpamAssassin attempts to identify whether an email is desirable or not based on heuristics concerning its origin, form and content. Postgrey is a policy server for Postfix, which implements gray listing. Grey listing is a spam detection method which denies the first delivery attempt of external mail servers. Mail servers of spam senders most often do not perform a second delivery attempt, while legitimate servers do so. Integration occurs via the packages :program:`univention-spamassassin` and :program:`univention-postgrey`, which are automatically set up during the installation of the mail server package.
de: Unerwünschte und nicht angeforderte E-Mails werden als Spam bezeichnet. Zur automatisierten Erkennung solcher E-Mails integriert UCS die Software SpamAssassin und Postgrey. SpamAssassin versucht anhand von Heuristiken über Herkunft, Form und Inhalt einer E-Mail zu erkennen, ob sie erwünscht ist oder nicht. Postgrey ist ein Policy Server für Postfix, der "Greylisting" implementiert. Greylisting ist eine Spam-Erkennungsmethode die E-Mail beim ersten Zustellversuch eines externen Servers ablehnt. Mailserver von Spamversendern unternehmen häufig keinen zweiten Zustellversuch, während legitime Server dies tun. Die Integration erfolgt über die Pakete :program:`univention-spamassassin` und :program:`univention-postgrey`, die bei der Einrichtung des Mailserver-Pakets automatisch eingerichtet werden.

source: SpamAssassin operates a point system, which uses an increasing number of points to express a high probability of the email being spam. Points are awarded according to different criteria, for example, keywords within the email or incorrect encodings. In the standard configuration only mails with a size of up to 300 kilobytes are scanned, this can be adjusted using the |UCSUCRV| :envvar:`mail/antispam/bodysizelimit`.
de: SpamAssassin arbeitet mit einem Punktesystem, das mit steigender Punktzahl eine höhere Wahrscheinlichkeit für Spam ausdrückt. Punkte werden nach verschiedenen Kriterien vergeben, die beispielsweise auf Schlagworte innerhalb der E-Mail oder fehlerhafte Codierungen ansprechen. In der Grundeinstellung werden nur Mails bis zu einer Größe von 300 Kilobyte geprüft. Dies kann mit der |UCSUCRV| :envvar:`mail/antispam/bodysizelimit` konfiguriert werden.

source: E-mails which are classified as spam - because they exceed a certain number of points - are not delivered to the recipient's inbox by Dovecot, but rather in the *Spam* folder below it. The name of the folder for spam can be configured with the |UCSUCRV| :envvar:`mail/dovecot/folder/Spam`. The filtering is performed by a Sieve script, which is automatically generated when the user is created.
de: E-Mails, die als Spam klassifiziert wurden - also eine bestimmte Anzahl Punkte überschreiten - werden bei der Auslieferung durch Dovecot nicht im Posteingang des Empfängers, sondern im darunter liegenden Ordner *Spam* abgelegt. Der Name des Ordners kann mit der |UCSUCRV| :envvar:`mail/dovecot/folder/Spam` konfiguriert werden. Die Filterung erfolgt durch ein Sieve-Skript, das beim Anlegen des IMAP-Postfachs eines Benutzers automatisch generiert wird.

source: The threshold in these scripts as of which emails are declared to be spam can be configured with the |UCSUCRV| :envvar:`mail/antispam/requiredhits`. The presetting (``5``) generally does not need to be adjusted. However, depending on experience in the local environment, this value can also be set lower. This will, however, result in more emails being incorrectly designated as spam. Changes to the threshold do not apply to existing users.
de: Der in die Sieve-Skripte eingetragene Schwellwert, ab der E-Mails als Spam deklariert werden, ist mit der |UCSUCRV| :envvar:`mail/antispam/requiredhits` konfigurierbar. Die Voreinstellung (``5``) muss in der Regel nicht angepasst werden. Je nach Erfahrung im eigenen Umfeld kann dieser Wert aber auch niedriger angesetzt werden. Es muss dann jedoch mit mehr E-Mails gerechnet werden, die fälschlich als Spam erkannt wurden. Die Änderung des Schwellwerts wirkt sich nicht auf bestehende Benutzer aus.

source: There is also the possibility of evaluating emails with a Bayes classifier. This compares an incoming email with statistical data already gathered from processed emails and uses this to adapt it's evaluation to the user's email. The Bayes classification is controlled by the user himself, whereby emails not identified as spam by the system can be placed in the *Spam* subfolder by the user and a selection of legitimate emails copied into the *Ham* (:envvar:`mail/dovecot/folder/ham`) subfolder. This folder is evaluated daily and data which have not yet been collected or were previously classified incorrectly are collected in a shared database. This evaluation is activated by default and can be configured with the |UCSUCRV| :envvar:`mail/antispam/learndaily`.
de: Zusätzlich gibt es die Möglichkeit, E-Mails mit einem Bayes-Klassifizierer bewerten zu lassen. Dieser vergleicht eine eingehende E-Mail mit statistischen Daten, die er aus bereits verarbeiteten E-Mails gewonnen hat und kann so seine Bewertung an die Mailgewohnheiten anpassen. Die Bayes-Klassifizierung wird vom Benutzer selbst gesteuert, in dem nicht vom System aber vom Benutzer als Spam erkannte E-Mails in den Unterordner *Spam* verschoben und eine Auswahl legitimer Mails in den Unterordner *Ham* (:envvar:`mail/dovecot/folder/ham`) kopiert werden. Diese Ordner werden täglich ausgewertet und noch nicht erfasste oder bisher falsch klassifizierte Daten in einer gemeinsamen Datenbank erfasst. Diese Auswertung ist in der Grundeinstellung aktiviert und kann mit der |UCSUCRV| :envvar:`mail/antispam/learndaily` konfiguriert werden.

source: The spam filtering can be deactivated by setting the |UCSUCRV| :envvar:`mail/antivir/spam` to ``no``. When modifying Univention Configuration Registry variables concerning spam detection, the AMaViS service and Postfix must be restarted subsequently.
de: Die Spam-Filterung kann durch Setzen der |UCSUCRV| :envvar:`mail/antivir/spam` auf ``no`` deaktiviert werden. Bei Änderungen an Univention Configuration Registry-Variablen, die die Spamerkennung betreffen, muss der AMaViS-Dienst und Postfix neu gestartet werden.

source: Identification of viruses and malware
de: Viren- und Malwareerkennung

source: The UCS mail services include virus and malware detection via the :program:`univention-antivir-mail` package, which is automatically set up during the setup of the mail server package. The virus scan can be deactivated with the |UCSUCRV| :envvar:`mail/antivir`.
de: Die UCS-Maildienste integrieren eine Viren- und Malwareerkennung über das Paket :program:`univention-antivir-mail`, das bei der Einrichtung des Mailserver-Pakets automatisch eingerichtet wird. Der Virenscan kann mit der |UCSUCRV| :envvar:`mail/antivir` deaktiviert werden.

source: All incoming and outgoing emails are scanned for viruses. If the scanner recognizes a virus, the email is sent to quarantine. That means that the email is stored on the server where it is not accessible to the user. The original recipient receives a message per email stating that this measure has been taken. If necessary, the administrator can restore or delete this from the :file:`/var/lib/amavis/virusmails/` directory. Automatic deletion is not performed.
de: Alle ein- und ausgehenden E-Mails werden auf Viren geprüft. Wird ein Virus erkannt, wird die E-Mail unter Quarantäne gestellt, d.h. auf dem Server unerreichbar für den Benutzer abgelegt. Der ursprüngliche Empfänger erhält eine Benachrichtigung per E-Mail über diese Maßnahme. Bei Bedarf kann der Administrator die E-Mail aus dem Verzeichnis :file:`/var/lib/amavis/virusmails/` wiederherstellen oder löschen. Eine automatische Löschung erfolgt nicht.

source: The :program:`AMaViSd-new` software serves as an interface between the mail server and different virus scanners. The free virus scanner ClamAV is included in the package and enters operation immediately after installation. The signatures required for virus identification are procured and updated automatically and free of charge by the Freshclam service.
de: Die Software :program:`AMaViSd-new` dient als Schnittstelle zwischen dem Mailserver und verschiedenen Virenscannern. Der freie Virenscanner ClamAV ist im Paket enthalten und nach der Installation sofort einsatzbereit. Die für die Virenerkennung nötigen Signaturen werden automatisch und kostenfrei durch den Freshclam-Dienst bezogen und aktualisiert.

source: Alternatively or in addition, other virus scanners can also be integrated in AMaViS. Postfix and AMaViS need to be restarted following changes to the AMaViS or ClamAV configuration.
de: Alternativ oder zusätzlich können andere Virenscanner in AMaViS eingebunden werden. Nach Änderungen an der AMaViS- oder ClamAV-Konfiguration müssen Postfix und AMaViS neu gestartet werden.
