Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/monitoring.po
Languages: de

source: The following monitoring alerts are only available once additional packages have been installed (see :ref:`Monitoring installation <monitoring-installation>`).
de: Die folgenden Alarme sind nur verfügbar, sobald zusätzliche Pakete installiert wurden (siehe :ref:`Monitoring installation <monitoring-installation>`)

source: Additional alerts
de: Zusätzliche Alarme

source: Monitors the OPSI daemon. If no OPSI process is running or the OPSI proxy is not accessible, the alert is fired.
de: Überwacht den OPSI-Daemon. Läuft kein OPSI-Prozess oder die OPSI-Weboberfläche ist nicht erreichbar, wird ein Alarm zurückgegeben.

source: Tests the S.M.A.R.T. status of the hard drive :file:`/dev/sda`. Corresponding alerts exist for the hard drives :file:`sdb`, :file:`sdc` and :file:`sdd`.
de: Prüft den S.M.A.R.T.-Status der Festplatte :file:`/dev/sda`. Für die Festplatten :file:`sdb`, :file:`sdc` und :file:`sdd` existieren entsprechende Alarme.

source: ``UNIVENTION_RAID`` and ``UNIVENTION_RAID_WARNING``
de: ``UNIVENTION_RAID`` und ``UNIVENTION_RAID_WARNING``

source: Tests the status of the software RAID through :file:`/proc/mdadm` and fires a *critical* alert if one of the hard drives in the RAID association has failed or a *warning* alert if a recovery procedure is in progress.
de: Prüft den Status des Software-RAIDs über :file:`/proc/mdadm` und löst einen *critical* Alarm aus, sofern eine Festplatte des RAID-Verbunds ausgefallen ist, oder einen *warning* Alarm, wenn der Recovery-Vorgang läuft.

source: ``UNIVENTION_ADCONNECTOR`` and ``UNIVENTION_ADCONNECTOR_WARNING``
de: ``UNIVENTION_ADCONNECTOR`` und ``UNIVENTION_ADCONNECTOR_WARNING``

source: Checks the status of the AD connector:
de: Prüft den Status des Active Directory Connectors:

source: If no connector process is running, the alert is fired.
de: Läuft kein Connector-Prozess, wird ein Alarm zurückgegeben.

source: If more than one process is running per connector instance, a *warning* is fired.
de: Existiert mehr als ein Prozess pro Connector-Instanz, wird ein *warning* Alarm ausgelöst.

source: If rejects occur, a *warning* alert is fired.
de: Treten Rejects auf, wird ein *warning* Alarm ausgelöst.

source: If the AD server can't be reached, an alert is fired.
de: Kann der AD-Server nicht erreicht werden, wird ein Alarm zurückgegeben.

source: The plugin can also be used in multi-connector instances.
de: Das Plugin kann auch in Multi-Connector-Instanzen verwendet werden.

source: Monitors the CUPS daemon. If there is no :program:`cupsd` process running or the web interface is not accessible, a *critical* alert is fired.
de: Überwacht den CUPS-Druckdienst. Läuft der :program:`cupsd`-Prozess nicht oder ist die Weboberfläche nicht erreichbar, wird ein *critical* Alarm ausgelöst.

source: Monitors the Squid proxy. If no squid process is running or the Squid proxy is not accessible, the alert is fired.
de: Überwacht den Proxy Squid. Läuft kein Squid-Prozess oder der Squid-Proxy ist nicht erreichbar, wird ein Alarm zurückgegeben.

source: Monitors the status of present raid devices. The *warning* alert is fired in case of the following RAID statuses:
de: Überwacht den Status der vorhandenen Raid-Geräte. Der *warning* Alarm wird im Falle folgender RAID Stati ausgelöst:

source: The *critical* alert is fired in case of the following RAID statuses:
de: Der *critical* Alarm wird für folgende RAID Status ausgelöst:

source: ``UNIVENTION_S4CONNECTOR`` and ``UNIVENTION_S4CONNECTOR_WARNING``
de: ``UNIVENTION_S4CONNECTOR`` und ``UNIVENTION_S4CONNECTOR_WARNING``

source: Monitors the status of Samba 4 server. A *warning* alert is fired if the Samba 4 is reachable and if any rejects are present. A *critical* alert is fired, if the server is not reachable.
de: Überwacht den Status des Samba 4 Servers. Ein *warning* Alarm wird ausgelöst, wenn der Samba 4 erreichbar ist, aber keine Ablehnungen (*rejects*) vorhanden sind. Ein *critical* Alarm wird ausgelöst, wenn der Server nicht erreichbar ist.

source: Monitors the status of the samba replication. the alert is fired if any replication failures are present.
de: Überwacht den Status der Samba-Replikation. Der Alarm wird ausgelöst, wenn ein Fehler der Replikation vorliegt.

source: Configuration
de: Konfiguration

source: |UCSUMC| offers the following settings:
de: |UCSUMC| bietet die folgenden Einstellungen:

source: Administrators must configure the alert (see :ref:`Monitoring installation <monitoring-installation>`) and define on which computers of the domain an alert shall be active (see :ref:`monitoring-assign-alerts`).
de: Administratoren müssen den Alarm konfigurieren (siehe :ref:`Monitoring installation <monitoring-installation>`) und festlegen, auf welchen Computern der Domäne ein Alarm aktiv sein soll (siehe :ref:`monitoring-assign-alerts`).

source: To configure the contact person that the *Alertmanager* notifies in case of errors or alerts, set the appropriate app setting in the :program:`Prometheus Alertmanager` app (see :ref:`Monitoring installation <monitoring-installation>`).
de: Um die Kontaktperson zu konfigurieren, die der *Alertmanager* im Falle von Fehlern und Alarmen benachrichtigt, muss die entsprechende Einstellung in der :program:`Prometheus Alertmanager` App gesetzt werden (siehe :ref:`Monitoring installation <monitoring-installation>`).

source: Administrators can silence firing alerts for a defined time. See the `Prometheus Alertmanager documentation <https://prometheus.io/docs/alerting/latest/alertmanager/#silences>`_. Use the *Prometheus Alertmanager* web interface for those settings.
de: Administratoren können Alarme für eine bestimmte Zeit stumm schalten. Siehe die `Prometheus Alertmanager Dokumentation <https://prometheus.io/docs/alerting/latest/alertmanager/#silences>`_. Benutzen Sie das *Prometheus Alertmanager* Webinterface für diese Einstellungen.

source: The basic settings already define a large number of tests for each computer, for example an alert basic configuration without the need for any further adjustments.
de: Die Grundeinstellungen definieren bereits eine Vielzahl von Tests für jeden Computer, z.B. eine Grundkonfiguration der Alarme, ohne dass weitere Anpassungen vorgenommen werden müssen.

source: Configure monitoring alerts
de: Konfiguration der Alarme

source: An alert defines the monitoring of a service or a status, for example free disk space. Administrators can assign any number of computers to such an alert object.
de: Ein Alert definiert die Überwachung eines Dienstes oder eines Zustandes, zum Beispiel freier Festplattenspeicher. Administratoren können eine beliebige Anzahl von Computern einem solchen Alert-Objekt zuordnen.

source: Administrators manage monitoring alerts in the UMC module :guilabel:`Monitoring` with the object type *Alert*, see :ref:`computers-management-table-monitoring-alert`. Prometheus has no LDAP interface for the monitoring configuration. Instead, a listener module generates the configuration files when administrators add, edit, or remove alerts.
de: Administratoren verwalten Alarme im UMC-Modul :guilabel:`Monitoring` mit dem Objekttyp *Alert*, siehe :ref:`computers-management-table-monitoring-alert`. Prometheus hat keine LDAP-Schnittstelle für die Überwachungskonfiguration. Stattdessen generiert ein Listener-Modul die Konfigurationsdateien, wenn Administratoren Alarme hinzufügen, bearbeiten oder entfernen.

source: Configuring an alert
de: Konfiguration eines Alarms

source: *General* tab
de: Reiter *Allgemein*

source: Attribute
de: Attribut

source: An unambiguous name for the alert.
de: Eine eindeutige Bezeichnung für den Alarm.

source: ``Alert group``
de: ``Alarm-Gruppe``

source: Defines the group that includes the alert. Multiple alarms can belong to the same group.
de: Legt die Gruppe fest, die den Alarm enthält. Mehrere Alarme können derselben Gruppe angehören.

source: ``Query expression``
de: ``Abfrageausdruck``

source: Prometheus query expression, which triggers the alert. The alert triggers when the given query returns a non-empty vector.
de: Prometheus Abfrage, die den Alarm auslöst. Der Alarm wird ausgelöst, wenn die angegebene Abfrage einen nicht leeren Vektor zurückgibt.

source: For details about the syntax, see the `Prometheus documentation <prometheus-query-expression_>`_.
de: Für Details zur Syntax, siehe die `Prometheus documentation <prometheus-query-expression_>`_.

source: Defines the time that the query expression result is non-empty until the alert triggers.
de: Definiert die Zeit, in der das Ergebnis des Abfrageausdrucks nicht leer sein muss, bis der Alarm ausgelöst wird.

source: ``Summary template``
de: ``Vorlage für Zusammenfassung``

source: The title of the alert, shown in alert dashboard and alert email notifications.
de: Der Titel des Alarms, der im Dashboard und in den E-Mail-Benachrichtigungen für Alarme angezeigt wird.

source: ``Description template``
de: ``Vorlage für Beschreibung``

source: The description of the alert, shown in alert dashboard and alert email notifications.
de: Die Beschreibung des Alarms, die im Dashboard und in den E-Mail-Benachrichtigungen für Alarme angezeigt wird.

source: *Prometheus* attaches labels to alerts. Labels help in queries for alerts. For example: *severity* with the value ``critical`` or ``warning``.
de: Prometheus fügt den Alarmen Labels hinzu. Labels helfen bei der Abfrage von Alerts. Zum Beispiel: *severity* mit dem Wert ``critical`` oder ``warning``.

source: ``Template Values``
de: ``Vorlagenwerte``

source: Query expressions, descriptions and summaries can use variable values. For example: Reference ``max`` through ``%max%``.
de: Abfrageausdrücke, Beschreibungen und Zusammenfassungen können variable Werte verwenden. Zum Beispiel: Referenziere ``max`` durch ``%max%``.

source: *Hosts* tab
de: Reiter *Rechner*

source: ``Assigned hosts``
de: ``Zugeordnete Rechner``

source: *Prometheus* executes the query on the computers referenced here. The listener module runs the tests for the alert. It replaces the term ``%instance%`` in the query expression with a regular expression that matches the assigned hosts.
de: *Prometheus* führt die Abfrage auf den hier referenzierten Rechnern aus. Das Listener Modul führt die Tests für den Alert aus. Es ersetzt den Begriff ``%instance%`` im Abfrageausdruck durch einen regulären Ausdruck, der mit den zugewiesenen Rechnern übereinstimmt.

source: Assign monitoring alerts to computers
de: Zuweisung von Alarmen an Computer

source: *Prometheus* can monitor all computers administered with |UCSUMC|.
de: *Prometheus* kann alle Computer überwachen, die mit |UCSUMC| verwaltet werden.

source: Navigate in the |UCSUMC| to :guilabel:`Computers` and choose the computer you want to activate alerts on. Choose and add all alerts you like in the tab *Advanced settings* under *Alerts* and save your changes.
de: Navigieren Sie in |UCSUMC| zu :guilabel:`Computers` und wählen Sie den Computer aus, auf dem Sie Alarme aktivieren möchten. Wählen und fügen Sie die gewünschten Alarme im Reiter *Erweiterte Einstellungen* unter *Warnmeldungen* aus und speichern Sie Ihre Änderungen.

source: Assigning alert to a host
de: Zuweisung eines Alarms an einen Computer

source: *Advanced settings* tab
de: Reiter *Erweiterte Einstellungen*

source: ``Assigned monitoring alerts``
de: ``zugewiesene Warnmeldungen``

source: Lists all assigned monitoring alerts for the current computer. Add or remove alerts.
de: Listet alle zugewiesenen Alarme für den aktuellen Computer auf. Fügen Sie hier Alarme hinzu oder entfernen Sie sie.

source: Create new alerts
de: Neue Alarme erstellen

source: This section describes how to add a custom script to collect new metrics and create new alerts.
de: In diesem Abschnitt wird beschrieben, wie Sie ein benutzerdefiniertes Skript hinzufügen, um neue Metriken zu sammeln und Alarme zu erstellen.

source: As administrator, you can complement the preconfigured alerts supplied with UCS with additional alerts. An alert check script exports metrics about the machine it runs on to *Prometheus*. A *PromQL* query on metrics defines an alert in *Prometheus*. For more information about how to write custom checks, see `Querying basis <prometheus-query-expression_>`_.
de: Als Administrator können Sie die vorkonfigurierten Alarme, die mit UCS geliefert werden, durch zusätzliche Alarme ergänzen. Ein Alarmprüfung Skript exportiert Metriken über den Rechner, auf dem es läuft, an *Prometheus*. Eine *PromQL*-Abfrage auf Metriken definiert einen Alarm in *Prometheus*. Für weitere Informationen darüber, wie man eigene benutzerdefinierte Checks schreibt, siehe `Querying basis <prometheus-query-expression_>`_.

source: Copy the custom alert check script into the directory :file:`/usr/share/univention-monitoring-client/scripts/` on the UCS system that shall export the custom metrics. Change the file mode to *executable* with :command:`chmod a+x PLUGIN`.
de: Kopieren Sie das benutzerdefinierte Alarmprüfung Skript in das Verzeichnis :file:`/usr/share/univention-monitoring-client/scripts/` auf dem UCS-System, das die benutzerdefinierten Metriken exportieren soll. Ändern Sie den Dateimodus auf *ausführbar* mit :command:`chmod a+x PLUGIN`.

source: All alert checks delivered by UCS use Python. Custom checks can use Perl, Python, or Shell and don't require any external libraries or programs. All UCS systems always provide the needed interpreters.
de: Alle von UCS gelieferten Alert Checks verwenden Python. Benutzerdefinierte Prüfungen können Perl, Python oder Shell verwenden und benötigen keine externen Bibliotheken oder Programme. Alle UCS-Systeme stellen immer die benötigten Interpreter zur Verfügung.

source: In contrast, if the custom alert check uses external programs or libraries, ensure you install them on all UCS systems that use the custom alert check.
de: Verwendet die benutzerdefinierte Alarmprüfung dagegen externe Programme oder Bibliotheken, müssen Sie diese auf allen UCS-Systemen installieren, die die benutzerdefinierte Prüfung verwenden sollen.

source: The alert check script exports one or multiple metrics by writing them to a text file. It must write valid *Prometheus* metrics into a :file:`.prom` file in the :file:`/var/lib/prometheus/node-exporter/` directory. *Prometheus* imports this file.
de: Das Skript für die Alarmprüfung exportiert eine oder mehrere Metriken, indem es sie in eine Textdatei schreibt. Es muss gültige *Prometheus* Metriken in eine :file:`.prom` Datei im :file:`/var/lib/prometheus/node-exporter/` Verzeichnis schreiben. *Prometheus* importiert diese Datei.

source: You need to configure the custom alert in |UCSUMC|, see :ref:`monitoring-alert-configuration`. You must enter a Prometheus expression for the metric of the script to the *Query expression* field. To assign the custom alert to UCS systems, see :ref:`monitoring-assign-alerts`.
de: Sie müssen den benutzerdefinierten Alarm in |UCSUMC| konfigurieren, siehe :ref:`monitoring-alert-configuration`. Sie müssen einen Prometheus-Ausdruck für die Metrik des Skripts in das Feld *Query expression* eingeben. Um den benutzerdefinierten Alert zu UCS-Systemen zuzuordnen, siehe see :ref:`monitoring-assign-alerts`.

source: Prometheus naming conventions
de: Prometheus Namenskonventionen

source: Text-based format of a :file:`.prom` file
de: Textbasiertes Format einer :file:`.prom`-Datei

source: With UCS 5.0 support for the Nagios server component has been discontinued. Yet, the systems can still be monitored, e.g. by UCS 4.4 Nagios servers, as described in the UCS 4.4 manual.
de: In UCS 5.0 ist die Serverkomponente von Nagios nicht mehr unterstützt. Die Systeme können aber als Nagios Client dienen, um sie z.B. von einem UCS 4.4 Nagios Server überwachen zu lassen, wie im UCS 4.4 Handbuch beschreiben.

source: In addition to the standard plugins provided with the installation of the :program:`univention-nagios-client` package, additional plugins can be subsequently installed with the following packages:
de: Neben den Standard-Plugins, die mit der Installation des Pakets :program:`univention-nagios-client` mitgebracht werden, können zusätzliche Plugins über folgende Pakete nachinstalliert werden:

source: :program:`univention-nagios-raid`: Monitoring of the software RAID status
de: :program:`univention-nagios-raid` Überwachung des Software-RAID-Status

source: :program:`univention-nagios-smart`: Test of the S.M.A.R.T. status of hard drives
de: :program:`univention-nagios-smart` Prüfung des S.M.A.R.T.-Status von Festplatten

source: :program:`univention-nagios-opsi`: Test of software distribution OPSI
de: :program:`univention-nagios-opsi` Prüfung der Softwareverteilung OPSI

source: :program:`univention-nagios-ad-connector`: Test of the AD Connector
de: :program:`univention-nagios-ad-connector` Prüfung des AD-Connectors

source: Some of the packages are automatically set up during installation of the respective services. For example, if the UCS AD connector is set up, the monitoring plugin is included automatically.
de: Einige der Pakete werden bei der Installation der entsprechenden Dienste automatisch mit eingerichtet. Wird beispielsweise der UCS AD Connector eingerichtet, bringt dieser das Überwachungsplugin :program:`univention-nagios-ad-connector` mit.

source: Preconfigured Nagios checks
de: Vorkonfigurierte Nagios-Prüfungen

source: During the installation, basic Nagios tests are set up automatically for UCS systems.
de: Während der Installation werden automatisch grundlegende Nagios-Prüfungen für die UCS-Systeme der Domäne eingerichtet.

source: Nagios service
de: Nagios-Dienst

source: Tests the function of the local DNS server and the accessibility of the public DNS server by querying the hostname ``www.univention.de``. If no DNS forwarder is defined for the UCS domain, this request fails. In this case, ``www.univention.de`` can be replaced with the FQDN of the |UCSPRIMARYDN| for example, in order to test the function of the name resolution.
de: Testet die Funktion des lokalen DNS-Servers und die Erreichbarkeit der öffentlichen DNS-Server durch die Abfrage des Rechnernamens ``www.univention.de``. Ist für die UCS-Domäne kein DNS-Forwarder definiert, schlägt diese Abfrage fehl. In diesem Fall kann ``www.univention.de`` z.B. gegen den FQDN des |UCSPRIMARYDN| ersetzt werden, um die Funktion der Namensauflösung zu testen.

source: Tests the mail server.
de: Testet den Mailserver.

source: Tests the availability of the name server cache daemon (NSCD). If there is no NSCD process running, a CRITICAL event is triggered; if more than one process is running, a WARNING.
de: Testet die Verfügbarkeit des Name Server Cache Dienstes (NSCD). Läuft kein NSCD-Prozess wird ein CRITICAL-Event ausgelöst, läuft mehr als ein Prozess, wird ein WARNING-Event ausgelöst.

source: Tests the availability of the Winbind service. If no process is running, a CRITICAL event is triggered.
de: Testet die Verfügbarkeit des Winbind-Dienstes. Läuft kein Prozess, wird ein CRITICAL-Event ausgelöst.

source: Tests the availability of the Samba service. If no process is running, a CRITICAL event is triggered.
de: Testet die Verfügbarkeit des Samba-Dienstes. Läuft kein Prozess, wird ein CRITICAL-Event ausgelöst.

source: Tests the availability of the NMBD service, which is responsible for the NetBIOS service in Samba. If no process is running, a CRITICAL event is triggered.
de: Testet die Verfügbarkeit des NMBD-Dienstes, der in Samba für den NetBIOS-Dienst zuständig ist. Läuft kein Prozess, wird ein CRITICAL-Event ausgelöst.

source: Tests the join status of a system. If a system has yet to join, a CRITICAL event is triggered; if non-run join scripts are available, a WARNING event is returned.
de: Prüft den Join-Status eines Systems. Ist ein System noch nicht Mitglied der Domäne, wird ein CRITICAL-Event ausgelöst, sind nicht-aufgerufene Joinskripte vorhanden, wird ein WARNING-Event zurückgeliefert.

source: Tests the availability of the Kerberos password service (only available on Primary/|UCSBACKUPDN|\ s). If fewer or more than one process is running, a CRITICAL event is triggered.
de: Prüft die Verfügbarkeit des Kerberos-Passwort-Dienstes (nur verfügbar auf Primary/|UCSBACKUPDN|). Läuft weniger oder mehr als ein Prozess, wird ein CRITICAL-Event ausgelöst.

source: Monitors the CUPS daemon. If there is no :program:`cupsd` process running or the web interface on port 631 is not accessible, the CRITICAL status is returned.
de: Überwacht den CUPS-Druckdienst. Läuft :program:`cupsd`-Prozess oder ist die Weboberfläche auf Port 631 nicht erreichbar, wird der Status CRITICAL zurückgegeben.

source: Monitors the Squid proxy. If no squid process is running or the Squid proxy is not accessible, the CRITICAL status is returned.
de: Überwacht den Proxy Squid. Läuft kein Squid-Prozess oder der Squid-Proxy ist nicht erreichbar, wird der Status CRITICAL zurückgegeben.

source: The following Nagios services are only available on the respective Nagios client once additional packages have been installed (see :ref:`nagios-installation`):
de: Die folgenden Nagios-Dienste sind nur auf dem jeweiligen Nagios Client verfügbar, sobald zusätzliche Pakete installiert wurden (siehe :ref:`nagios-installation`):

source: Additional Nagios checks
de: Zusätzliche Nagios Checks

source: Monitors the OPSI Daemon. If no OPSI process is running or the OPSI proxy is not accessible, the CRITICAL status is returned.
de: Überwacht den OPSI-Daemon. Läuft kein OPSI-Prozess oder die OPSI-Weboberfläche ist nicht erreichbar, wird der Status CRITICAL zurückgegeben.

source: Tests the S.M.A.R.T. status of the hard drive :file:`/dev/sda`. Corresponding Nagios services exist for the hard drives :file:`sdb`, :file:`sdc` and :file:`sdd`.
de: Prüft den S.M.A.R.T.-Status der Festplatte :file:`/dev/sda`. Für die Festplatten :file:`sdb`, :file:`sdc` und :file:`sdd` existieren entsprechende Nagios-Dienste.

source: Tests the status of the software RAID via :file:`/proc/mdadm` and returns CRITICAL if one of the hard drives in the RAID association has failed or WARNING if a recovery procedure is in progress.
de: Prüft den Status des Software-RAIDs über :file:`/proc/mdadm` und gibt einen CRITICAL Alarm zurück, sofern eine Festplatte des RAID-Verbunds ausgefallen ist, oder einen WARNING Alarm zurück, wenn der Recovery-Vorgang läuft.

source: If no connector process is running, CRITICAL is reported.
de: Läuft kein Connector-Prozess, wird der Status CRITICAL zurückgegeben.

source: If more than one process is running per connector instance, a WARNING is given.
de: Existiert mehr als ein Prozess pro Connector-Instanz gibt es eine WARNING.

source: If rejects occur, a WARNING is given.
de: Treten Rejects auf, gibt es eine WARNING.

source: If the AD server cannot be reached, a CRITICAL status occurs.
de: Kann der AD-Server nicht erreicht werden, tritt ein CRITICAL-Zustand ein.

source: The plugin can also be used in multi-connector instances; the name of the instance must be passed on as a parameter.
de: Das Plugin kann auch in Multi-Connector-Instanzen verwendet werden. Dabei muss der Name der Instanz als Parameter übergeben werden.
