Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/monitoring.po
Languages: de

source: The :program:`UCS Dashboard` app allows administrators to view the state of the domain and individual servers can be read quickly and clearly on so-called dashboards. The dashboards are accessible via a web browser, access a database in the background, and deliver continuously updated reports on specific aspects of the domain or server.
de: Die :program:`UCS Dashboard` App ermöglicht es Administratoren, den Zustand der Domäne und einzelner Server schnell und übersichtlich auf sogenannten Dashboards abzulesen. Die Dashboards sind über einen Web-Browser erreichbar, greifen im Hintergrund auf eine Datenbank zu und liefern kontinuierlich aktualisierte Reports über bestimmte Aspekte der Domäne oder der Server.

source: The UCS Dashboard consists of the following parts:
de: Das UCS Dashboard besteht aus den folgenden Komponenten:

source: The *UCS Dashboard* app for the visualization of data from the central Database. This component is based on the software `Grafana <grafana_>`_ [1]_.
de: Die UCS Dashboard App für die Visualisierung von Daten aus der zentralen Datenbank. Diese Komponente basiert auf der Softwarekomponente `Grafana <grafana_>`_ [1]_.

source: The *UCS Dashboard Database* app, a time series database for storing of the metrics. This database is based on the software Prometheus.
de: Die *UCS Dashboard Database* App, eine Zeitserien-Datenbank für die Speicherung der Metriken. Diese Datenbank wird durch die Software Prometheus bereitgestellt.

source: The *UCS Dashboard Client* app for deploying the metrics of server systems. This is based on the Prometheus Node Exporter.
de: Die *UCS Dashboard Client* App für die Bereitstellung der Metriken von Serversystemen. Diese baut auf dem Prometheus Node-Exporter auf.

source: The app *UCS Dashboard* can be installed from the Univention App Center on a server in the domain. The installation is only supported on the system roles |UCSPRIMARYDN|, |UCSBACKUPDN| or |UCSREPLICADN|. The apps *UCS Dashboard Database* and *UCS Dashboard Client* are automatically installed on the same system.
de: Die *UCS Dashboard* App kann über das Univention App Center auf einem Server in der Domäne installiert werden. Die Installation wird nur auf den Systemrollen |UCSPRIMARYDN|, |UCSBACKUPDN| oder |UCSREPLICADN| unterstützt. Die *UCS Dashboard Database* App und die *UCS Dashboard Client* App werden automatisch auf demselben System installiert.

source: Usage
de: Nutzung

source: After the installation, the UCS Dashboard is linked in the portal. Alternatively, it can be accessed directly via :samp:`https://{SERVERNAME-OR-IP}/ucs-dashboard/`.
de: Nach der Installation ist das UCS Dashboard im Portal verlinkt. Alternativ kann es direkt über :samp:`https://{SERVERNAME-OR-IP}/ucs-dashboard/` erreicht werden.

source: By default access is only granted to users of the group ``Domain Admins`` (e.g. the user Administrator).
de: Der Zugriff wird in der Standardeinstellung ausschließlich Benutzern der Gruppe ``Domain Admins`` (z.B. der Benutzer Administrator) gewährt.

source: After the login, the *Domain Dashboard* is opened by default. On this dashboard, general information about the domain is displayed, such as how many servers and how many users exist in the environment.
de: Nach der Anmeldung wird standardmäßig das *Domain Dashboard* geöffnet. Auf diesem Dashboard werden allgemeine Informationen über die Domäne angezeigt, z.B. wie viele Server und wie viele Benutzer in der Umgebung existieren.

source: Furthermore, the UCS systems are listed on the dashboard, in a tabular overview, including further information, such as the server role, the installed apps or whether an update is available or not.
de: Weiter sind auf dem Dashboard, in einer tabellarischen Übersicht, die UCS-Systeme aufgelistet inklusive weiterer Informationen, wie z.B. die Server Rolle, die installierten Apps oder ob ein Update verfügbar ist.

source: In addition, the CPU usage, memory usage, free hard disk space and the status of the LDAP replication are displayed. In this graphics all servers are displayed together.
de: Zusätzlich wird die CPU-Auslastung, Arbeitsspeicherauslastung, der freie Festplattenspeicher und der Status der LDAP-Replikation angezeigt. Dabei werden in den Grafiken jeweils alle Serversysteme angezeigt.

source: By default, the *Server Dashboard* is also configured. On this dashboard, detailed information about individual server systems are shown, such as the CPU- or memory usage or network throughput.
de: Standardmäßig wird zusätzlich das *Server Dashboard* eingerichtet. Auf diesem Dashboard sind detaillierte Informationen zu einzelnen Serversystemen aufgelistet, wie z.B. die CPU- oder Speicherauslastung oder der Netzwerkdurchsatz.

source: The servers can be selected in the drop down *server*. Then the graphics show the details about the selected server.
de: Die Server können im Dropdown *server* ausgewählt werden. Anschließend werden die Grafiken entsprechend aktualisiert.

source: By default, the :program:`UCS Dashboard` app configures the *Alert Dashboard*. The *Alert Dashboard* shows detailed information about the status of all alerts, configured in UCS.
de: Standardmäßig konfiguriert die :program:`UCS Dashboard` App das *Alert Dashboard*. Das *Alert Dashboard* zeigt detaillierte Informationen über den Status aller in UCS konfigurierten Alerts.

source: Own dashboards
de: Eigene Dashboards

source: Administrators can't change the three included dashboards *Domain Dashboard*, *Server Dashboard* and *Alert Dashboard*, because Univention provides updates for them.
de: Administratoren können die drei enthaltenen Dashboards *Domain Dashboard*, *Server Dashboard* und *Alarm Dashboard* nicht ändern, da Univention Updates für sie bereitstellt.

source: Instead, you can create your own dashboards. On these dashboards you can then either add already existing elements or new elements can be created. All you need to do is click on the plus sign on the left side. A new dashboard will be created which can be filled with elements.
de: Stattdessen können eigene Dashboards erstellt werden. Auf diesen Dashboards können dann entweder bereits vorhandene Elemente hinzugefügt werden oder auch neue Elemente erstellt werden. Dazu muss lediglich auf das Plus Zeichen am linken Rand geklickt werden. Anschließend existiert ein neues Dashboard, welches mit Elementen befüllt werden kann.

source: The Grafana Labs Marks are trademarks of Grafana Labs, and are used with Grafana Labs’ permission. We are not affiliated with, endorsed or sponsored by Grafana Labs or its affiliates.
de: Die Grafana Labs Marken sind Warenzeichen von Grafana Labs und werden mit Genehmigung von Grafana Labs verwendet. Wir sind weder mit Grafana Labs noch mit seinen Tochtergesellschaften verbunden, noch werden wir von ihnen unterstützt oder gefördert.

source: Chapter contents:
de: Kapitelinhalte:

source: Infrastructure monitoring
de: Infrastruktur-Monitoring

source: UCS offers two different solutions for infrastructure monitoring.
de: UCS bietet zwei unterschiedliche Lösungen für das Monitoring der Infrastruktur.

source: On the one hand the UCS Dashboard helps administrators to quickly read the state of domains and individual servers. On the other hand, under UCS 4.4, with Nagios it is possible to continuously check computers and services in the background and proactively trigger a notification if a warning level is reached. From UCS 5.0-2 onward, Prometheus and Prometheus Alertmanager are used for monitoring. With UCS 5.0 support for the Nagios server component has been discontinued.
de: Das UCS Dashboard hilft einerseits den Administratoren, schnell den Zustand von Domänen und einzelnen Servern zu erfassen. Zum anderen ist es unter UCS 4.4 mit Nagios möglich, Rechner und Dienste im Hintergrund zu überprüfen und proaktiv eine Benachrichtigung auszulösen, wenn eine Warnstufe erreicht wird. Ab UCS 5.0-2 können Prometheus und Prometheus Alertmanager zur Überwachung eingesetzt. Mit UCS 5.0 wurde die Unterstützung für die Nagios-Serverkomponente eingestellt.

source: UCS 5.0-2 supports monitoring alerts through *Prometheus* metrics.
de: UCS 5.0-2 unterstützt die Überwachung von Alarmen durch *Prometheus*-Metriken.

source: With *Prometheus*, *Prometheus Node Exporter*, and *Prometheus Alertmanager*, administrators can verify the correct function of complex IT structures from networks, computers and services continually and automatically.
de: Mit *Prometheus*, *Prometheus Node Exporter*, und *Prometheus Alertmanager* können Administratoren die korrekte Funktion von komplexen IT-Strukturen aus Netzwerken, Rechnern und Diensten kontinuierlich und automatisch überprüfen.

source: Prometheus Node Exporter exports a comprehensive collection of metrics into the Prometheus database. Besides polling system indicators like CPU, memory usage, and free disk space, they test availability and operation of different services like SSH, SMTP, and HTTP. Operation tests generally perform program steps such as the delivery of a test email or the resolution of a DNS record. The Prometheus Node Exporter provides UCS specific alerts in addition to the start metrics already included, for example an alert for the listener/notifier replication.
de: Der Prometheus Node Exporter exportiert eine umfassende Sammlung von Metriken in die Prometheus-Datenbank. Neben der Abfrage von Systemindikatoren wie CPU, Speichernutzung und freien Speicherplatz, testen sie die Verfügbarkeit und den Betrieb von verschiedenen Diensten wie SSH, SMTP und HTTP. Betriebstests führen im Allgemeinen Programmschritte wie die Zustellung einer Test-E-Mail oder die Auflösung eines DNS-Eintrags durch. Der Prometheus Node Exporter bietet UCS spezifische Alarme zusätzlich zu den bereits enthaltenen Startmetriken, zum Beispiel einen Alarm für die Listener/Notifier-Replikation.

source: When the operating status changes, the monitoring informs a contact person specified in advance of the possible malfunction. In addition to the reactive notification in case of error, administrators can check the current status at any time continually in the *Grafana UCS Dashboard* web interface displaying the status information in a compact manner.
de: Wenn sich der Betriebszustand ändert, informiert die Überwachung einen vorher festgelegten Ansprechpartner über die mögliche Störung. Zusätzlich zur reaktiven Benachrichtigung im Fehlerfall können Administratoren den aktuellen Status jederzeit kontinuierlich in der Web-Oberfläche *Grafana UCS Dashboard* , das die Statusinformationen kompakt anzeigt, überprüfen.

source: See UCS-Dashboard :ref:`dashboard-installation` for an overview of all involved components.
de: Siehe UCS-Dashboard :ref:`dashboard-installation` für eine Übersicht über alle beteiligten Komponenten.

source: Administrators define the alert configuration in |UCSUMC|. A listener module automatically generates the configuration files from information stored in the LDAP directory.
de: Administratoren definieren die Alarmkonfiguration in |UCSUMC|. Ein Listener Modul generiert automatisch die Konfigurationsdateien aus den Informationen im LDAP-Verzeichnis.

source: For installation of the UCS Dashboard components, see :ref:`dashboard-installation`.
de: Zur Installation der UCS Dashboard-Komponenten siehe :ref:`dashboard-installation`.

source: Additionally to the components of the UCS Dashboard you need to install the *Prometheus Alertmanager* app and the *univention-monitoring-client*.
de: Zusätzlich zu den Komponenten des UCS Dashboards müssen Sie die App *Prometheus Alertmanager* und den *univention-monitoring-client* installieren.

source: For every UCS system that the administrator wants to show system data on the dashboard, they must install the *UCS Dashboard Client* app. The package :program:`univention-monitoring-client` depends on the *UCS Dashboard Client* app and is installed on every UCS system by default for the alert functionality.
de: Für jedes UCS-System, das der Administrator auf dem Dashboard anzeigen möchte, muss er die App *UCS Dashboard Client* installieren. Das Paket :program:`univention-monitoring-client` hängt von *UCS Dashboard Client* ab und wird standardmäßig auf jedem UCS-System installiert, um die Alarmfunktionalität bereitzustellen.

source: The *Prometheus Alertmanager* app to send notifications for example through email for firing alerts. The Alertmanager needs some configuration to work properly.
de: Die *Prometheus Alertmanager* App versendet Benachrichtigungen über ausgelöste Alarme, zum Beispiel per E-Mail. Der Alertmanager benötigt einige Einstellungen, um korrekt zu funktionieren.

source: Alertmanager Settings
de: Alertmanager Einstellungen

source: The settings include the recipients of the email alert notifications. Furthermore, the app settings need a value for a SMTP server to send email notifications. The Alertmanager supports the SMTP authentication methods ``PLAIN``, ``LOGIN``, and ``CRAM-MD5`` as well as communication with TLS. No authentication will be used, if you leave all authentication related fields of the app settings empty.
de: Die Einstellungen umfassen die Empfänger der E-Mail-Benachrichtigungen. Außerdem benötigen die App-Einstellungen einen Wert für einen SMTP-Server, um E-Mail-Benachrichtigungen zu senden. Der Alertmanager unterstützt die SMTP-Authentifizierungsmethoden ``PLAIN``, ``LOGIN`` und ``CRAM-MD5`` sowie die Kommunikation via TLS. Keine Authentifizierung wird verwendet, wenn Sie alle Felder der App-Einstellungen bezüglich Authentifizierung leer lassen.

source: The package :program:`univention-monitoring-client` provides standard alert plugins for checking the system health.
de: Das Paket :program:`univention-monitoring-client` stellt Standard Alarm Plugins zur Überprüfung des Systemzustands bereit.

source: Administrators can install plugins with the following packages, that add alerts beyond the standard plugins provided with the :program:`univention-monitoring-client` package:
de: Administratoren können mit den folgenden Paketen Plugins installieren, die über die Standard-Plugins hinausgehen, die mit dem :program:`univention-monitoring-client` Paket bereitgestellt werden.

source: :program:`univention-monitoring-raid`: Monitoring of the software RAID status
de: :program:`univention-monitoring-raid`: Überwachung des Software-RAID-Status

source: :program:`univention-monitoring-smart`: Test of the S.M.A.R.T. status of hard drives
de: :program:`univention-monitoring-smart`: Prüfung des S.M.A.R.T.-Status von Festplatten

source: :program:`univention-monitoring-opsi`: Test of software distribution OPSI
de: :program:`univention-monitoring-opsi`: Prüfung der Software OPSI

source: :program:`univention-monitoring-cups`: Test of CUPS printing system
de: :program:`univention-monitoring-cups`: Prüfung des Druckerdienstes CUPS

source: :program:`univention-monitoring-squid`: Test of Squid proxy server
de: :program:`univention-monitoring-squid`: Prüfung des Squid proxy Servers

source: :program:`univention-monitoring-samba`: Test of the Samba 4 services
de: :program:`univention-monitoring-samba`: Prüfung des Samba 4 Dienstes

source: :program:`univention-monitoring-s4-connector`: Test of the S4 Connector
de: :program:`univention-monitoring-s4-connector`: Prüfung des S4-Connector

source: :program:`univention-monitoring-ad-connector`: Test of the AD Connector
de: :program:`univention-monitoring-ad-connector`: Prüfung des AD Connectors

source: Some services already automatically setup their respective package during installation. For example, if administrators setup the :program:`UCS AD Connector`, it automatically includes the monitoring plugin.
de: Einige Dienste richten ihr jeweiliges Paket zur Überwachung bereits bei der Installation ein. Wenn Administratoren zum Beispiel den :program:`UCS AD Connector einrichten, enthält es automatisch das Plugin für die Überwachung.

source: Preconfigured monitoring checks
de: Vorkonfigurierte Überwachungstests

source: The installation automatically sets up basic monitoring tests for UCS systems. All alerts have label *severity* with value ``critical`` or ``warning``.
de: Die Installation richtet automatisch grundlegende Überwachungstests für UCS Systeme ein. Alle Alarme haben ein Label *severity* mit dem Wert ``critical`` oder ``warning``.

source: Preconfigured alerts
de: Vorkonfigurierte Alarme

source: Alert
de: Alarm

source: Description
de: Beschreibung

source: Tests the availability of the monitored UCS system with the command :command:`ping`. By default an error status is attained if the response time exceeds 50 ms or 100 ms or package losses of 20% or 40% occur.
de: Testet die Erreichbarkeit des überwachten UCS-Systems mit dem Kommando :command:`ping`. In der Standardeinstellung wird der Fehlerzustand erreicht, wenn die Antwortzeit 50 ms oder 100 ms überschreitet oder Paketverluste von 20% oder 40% auftreten.

source: ``UNIVENTION_DISK_ROOT`` and ``UNIVENTION_DISK_ROOT_WARNING``
de: ``UNIVENTION_DISK_ROOT`` und ``UNIVENTION_DISK_ROOT_WARNING``

source: Monitors how full the :file:`/` partition is. An error status is raised if the remaining free space falls below 25% or 10% by default.
de: Überwacht den Füllstand der :file:`/`-Partition. Unterschreitet der verbleibende freie Platz in der Standardeinstellung 25% oder 10% wird der Fehlerzustand gesetzt.

source: Tests the function of the local DNS server and the accessibility of the public DNS server by querying the hostname ``www.univention.de``. If no DNS forwarder is defined for the UCS domain, this request fails. In this case, ``www.univention.de`` can be replaced with the FQDN of the |UCSPRIMARYDN| for example, in the :envvar:`monitoring/dns/lookup-domain` to test the function of the name resolution.
de: Testet die Funktion des lokalen DNS-Servers und die Erreichbarkeit des öffentlichen DNS-Servers durch Abfrage des Hostnamens ``www.univention.de``. Wenn kein DNS-Forwarder für die UCS-Domäne definiert ist, schlägt diese Anfrage fehl. In diesem Fall kann ``www.univention.de`` durch den FQDN des |UCSPRIMARYDN| ersetzt werden, zum Beispiel in der :envvar:`monitoring/dns/lookup-domain` um die Funktion der Namensauflösung zu testen.

source: Monitors the LDAP server running on UCS Directory Nodes.
de: Überwacht den auf Directory Nodes laufenden LDAP-Server.

source: ``UNIVENTION_LOAD`` and ``UNIVENTION_LOAD_WARNING``
de: ``UNIVENTION_LOAD`` und ``UNIVENTION_LOAD_WARNING``

source: Monitors the system load.
de: Überwacht die Systemlast.

source: ``UNIVENTION_NTP`` and ``UNIVENTION_NTP_WARNING``
de: ``UNIVENTION_NTP`` und ``UNIVENTION_NTP_WARNING``

source: Requests the time from the NTP service on the monitored UCS system. If this deviates by more than ``60`` or ``120`` seconds, the error status is attained.
de: Fragt auf dem überwachten UCS-System die Uhrzeit beim NTP-Dienst ab. Tritt eine Abweichung von mehr als ``60`` oder ``120`` Sekunden auf, wird der Fehlerzustand erreicht.

source: Tests if the SMTP server is reachable. The alert fires if it is not reachable.
de: Testet, ob der SMTP-Server erreichbar ist. Der Alarm wird ausgelöst, wenn er nicht erreichbar ist.

source: ``UNIVENTION_SSL`` and ``UNIVENTION_SSL_WARNING``
de: ``UNIVENTION_SSL`` und ``UNIVENTION_SSL_WARNING``

source: Tests the remaining validity period of the UCS SSL certificates. This plugin is only suitable for |UCSPRIMARYDN| and |UCSBACKUPDN| systems.
de: Testet die verbleibende Gültigkeitsdauer der UCS-SSL-Zertifikate. Dieses Plugin ist nur für |UCSPRIMARYDN| und |UCSBACKUPDN|\ s geeignet.

source: ``UNIVENTION_SWAP`` and ``UNIVENTION_SWAP_WARNING``
de: ``UNIVENTION_SWAP`` und ``UNIVENTION_SWAP_WARNING``

source: Monitors the utilization of the swap partition. An error status is raised if the remaining free space falls below the threshold (40% or 20% by default).
de: Überwacht die Auslastung der Swap-Partition. Unterschreitet der verbleibende freie Platz den Schwellwert (in der Standardeinstellung 40% oder 20%), wird der Fehlerzustand gesetzt.

source: ``UNIVENTION_REPLICATION`` and ``UNIVENTION_REPLICATION_WARNING``
de: ``UNIVENTION_REPLICATION`` und ``UNIVENTION_REPLICATION_WARNING``

source: Monitors the status of the LDAP replication and recognizes the creation of a :file:`failed.ldif` file and the standstill of the replication and warns of large differences between the transaction IDs.
de: Überwacht den Status der LDAP-Replikation, erkennt das Vorhandensein einer :file:`failed.ldif`-Datei sowie den Stillstand der Replikation und warnt vor zu großen Differenzen der Transaktions-IDs.

source: ``UNIVENTION_NSCD`` and ``UNIVENTION_NSCD2``
de: ``UNIVENTION_NSCD`` und ``UNIVENTION_NSCD2``

source: Tests the availability of the name server cache daemon (NSCD). If there is no NSCD process running, a *critical* alert is fired; if more than one process is running, a *warning* alert is fired.
de: Testet die Verfügbarkeit des Name Server Cache Dienstes (NSCD). Läuft kein NSCD-Prozess wird ein *critical* Alarm ausgelöst, läuft mehr als ein Prozess, wird ein *warning* Alarm ausgelöst.

source: Tests the availability of the Winbind service. If no process is running, a *critical* alert is fired.
de: Testet die Verfügbarkeit des Winbind-Dienstes. Läuft kein Prozess, wird ein *critical* Alarm ausgelöst.

source: Tests the availability of the Samba service. If no process is running, an alert is fired.
de: Testet die Verfügbarkeit des Samba-Dienstes. Läuft kein Prozess, wird ein Alarm ausgelöst.

source: Tests the availability of the NMBD service, which is responsible for the NetBIOS service in Samba. If no process is running, an alert is fired.
de: Testet die Verfügbarkeit des NMBD-Dienstes, der in Samba für den NetBIOS-Dienst zuständig ist. Läuft kein Prozess, wird ein Alarm ausgelöst.

source: ``UNIVENTION_JOINSTATUS`` and ``UNIVENTION_JOINSTATUS_WARNING``
de: ``UNIVENTION_JOINSTATUS`` und ``UNIVENTION_JOINSTATUS_WARNING``

source: Tests the join status of a system. If a system has yet to join, a *critical* alert is fired; if non-run join scripts are available, a *warning* alert is fired.
de: Prüft den Join-Status eines Systems. Ist ein System noch nicht Mitglied der Domäne, wird ein *critical* Alarm ausgelöst, sind nicht-aufgerufene Joinskripte vorhanden, wird ein *warning* Alarm ausgelöst.

source: Tests the availability of the Kerberos password service (only available on Primary/|UCSBACKUPDN|\ s). If fewer or more than one process is running, an alert is fired.
de: Prüft die Verfügbarkeit des Kerberos-Passwort-Dienstes (nur verfügbar auf Primary/|UCSBACKUPDN|). Läuft weniger oder mehr als ein Prozess, wird ein Alarm ausgelöst.

source: Monitors the status of installed debian packages. If any package has status *half-installed* an alert is fired.
de: Überwacht den Status der installierten Debian-Pakete. Wenn ein Paket den Status *half-installed* hat, wird ein Alarm ausgelöst.

source: ``UNIVENTION_SLAPD_MDB_MAXSIZE`` and ``UNIVENTION_SLAPD_MDB_MAXSIZE_WARNING``
de: ``UNIVENTION_SLAPD_MDB_MAXSIZE`` und ``UNIVENTION_SLAPD_MDB_MAXSIZE_WARNING``

source: Monitors the share of free memory pages of the *mdb* back end of SLAPD for multiple directories.
de: Überwacht den Anteil der freien Speicherseiten des *mdb* Backends von SLAPD für mehrere Verzeichnisse.

source: ``UNIVENTION_LISTENER_MDB_MAXSIZE`` and ``UNIVENTION_LISTENER_MDB_MAXSIZE_WARNING``
de: ``UNIVENTION_LISTENER_MDB_MAXSIZE`` und ``UNIVENTION_LISTENER_MDB_MAXSIZE_WARNING``

source: Monitors the share of free memory pages of the *mdb* back end of SLAPD for multiple directories regarding the Univention listener.
de: Überwacht den Anteil der freien Speicherseiten des *mdb* Backends von SLAPD für mehrere Verzeichnisse.
