Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/print-services.po
Languages: de

source: Setting the local configuration properties of a print server
de: Einstellung lokaler Konfigurationseigenschaften eines Druckservers

source: The configuration of the CUPS print server is performed via settings from the LDAP directory service and |UCSUCR|. If the |UCSUCRV| :envvar:`cups/include/local` is set to ``true``, the :file:`/etc/cups/cupsd.local.conf` file is included, in which arbitrary options can be defined. Changes in this file require :command:`ucr commit /etc/cups/cupsd.conf` to get applied.
de: Die Konfiguration von CUPS als Druckserver erfolgt über Einstellungen aus dem LDAP-Verzeichnisdienst und |UCSUCR|. Wird die |UCSUCRV| :envvar:`cups/include/local` auf ``true`` gesetzt, wird zusätzlich die Datei :file:`/etc/cups/cupsd.local.conf` eingebunden, in der beliebige weitere Optionen hinterlegt werden können. Änderungen an dieser Datei benötigen :command:`ucr commit /etc/cups/cupsd.conf` um aktiv zu werden.

source: If an error occurs when working through a printer queue (e.g., because the connected printer is switched off), the further processing of the queue is stopped by default. This must then be reactivated by the administrator (see :ref:`umc-modules-printer`). If the |UCSUCRV| :envvar:`cups/errorpolicy` is set to ``retry-job``, CUPS automatically attempts to process unsuccessful print jobs again every 30 seconds.
de: Tritt bei der Verarbeitung einer Drucker-Warteschlange ein Fehler auf (z.B. weil der angebundene Drucker ausgeschaltet ist), wird in der Grundeinstellung die weitere Bearbeitung der Warteschlange gestoppt. Diese muss dann durch den Administrator wieder aktiviert werden (siehe :ref:`umc-modules-printer`). Wird die |UCSUCRV| :envvar:`cups/errorpolicy` auf *retry-job* gesetzt, versucht CUPS alle dreißig Sekunden automatisch erfolglose Druckaufträge erneut durchzuführen.

source: Creating a printer group
de: Konfiguration von Druckergruppen

source: CUPS offers the possibility to group printers into classes. These are implemented in UCS as *printer groups*. Printer groups appear to clients as normal printers. The aim of such a printer group is to create a higher availability of printer services. If the printer group is used to print, the job is sent to the first printer in the printer group to become available. The printers are selected based on the round robin principle so that the degree of utilization is kept uniform.
de: CUPS bietet die Möglichkeit Drucker in Klassen zusammenzufassen. In UCS sind diese als *Druckergruppen* implementiert. Druckergruppen erscheinen für Clients wie normale Drucker. Eine Druckergruppe erhöht die Verfügbarkeit des Druckdienstes. Wird auf eine Druckergruppe gedruckt, wird der Auftrag an den ersten verfügbaren Drucker der Druckergruppe geschickt. Die Auswahl der Drucker erfolgt nach dem *Round Robin Prinzip*, so dass eine gleichmäßige Auslastung angestrebt wird.

source: A printer group must have at least one printer as a member. Only printers from the same server can be members of the group.
de: Eine Druckergruppe muss mindestens einen Drucker als Mitglied haben. Es können nur Drucker des gleichen Druckservers als Mitglieder der Gruppe gesetzt werden.

source: The possibility of grouping printers shares from different printer servers in a printer group makes it possible to select printer groups as members of a printer group. This could result in a printer group adopting itself as a group member. This must not be allowed to happen.
de: Die Fähigkeit, Druckerfreigaben von verschiedenen Druckservern in einer Druckergruppe zusammenzufassen, ermöglicht es auch, Druckergruppen als Mitglieder einer Druckergruppe zu setzen. Eine Druckergruppe könnte sich dadurch selbst als Gruppenmitglied enthalten. Dies ist unbedingt zu vermeiden.

source: Printer groups are administrated in the UMC module :guilabel:`Printers` with the *Printer share* object type (see :ref:`central-user-interface`).
de: Druckergruppen werden im UMC-Modul :guilabel:`Drucker` mit dem Objekttyp *Druckerfreigabe: Druckergruppe* verwaltet (siehe auch :ref:`central-user-interface`).

source: *General* tab
de: Reiter *Allgemein*

source: Attribute
de: Attribut

source: Description
de: Beschreibung

source: This input field contains the names of the printer group share, which is used by CUPS. The printer group appears under this name in Linux and Windows.
de: Dieses Eingabefeld enthält den Namen der Druckergruppenfreigabe, der von CUPS verwendet wird. Unter diesem Namen erscheint die Druckergruppe unter Linux und Windows.

source: The name may contain alphanumeric characters (i.e., uppercase and lowercase letters ``a`` to ``z`` and numbers ``0`` to ``9``) as well as hyphens and underscores. Other characters (including blank spaces) are not permitted.
de: Der Name darf alphanumerische Zeichen (also die Buchstaben ``a`` bis ``z`` in Groß- und Kleinschreibung und die Ziffern ``0`` bis ``9``) sowie Binde- und Unterstriche enthalten. Andere Zeichen (einschließlich Leerzeichen) sind nicht erlaubt.

source: Print server (*)
de: Druckserver (*)

source: A range of print servers (spoolers) can be specified here to expand the list of printers available for selection. Printers which are assigned to the servers specified here can then be adopted in the *Group members* list from the selection arranged below them.
de: Drucker, die hier angegebenen Servern zugeordnet sind, können in der darunter angeordneten Auswahl in die Liste der *Gruppenmitglieder* aufgenommen werden.

source: A printer group can also be assigned an additional name by which it can reached from Windows. Unlike the CUPS name (see *Name*), the Samba name may contain blank spaces and umlauts. The printer is then available to Windows under both the CUPS name and the Samba name.
de: Für eine Druckergruppe kann ein zusätzlicher Name vergeben werden, unter dem sie von Windows aus erreichbar sein soll. Im Gegensatz zum CUPS-Namen (siehe *Name*) darf der Samba-Name Leerzeichen und Umlaute enthalten. Der Drucker steht für Windows dann sowohl unter dem CUPS-Namen als auch unter dem Samba-Namen zur Verfügung.

source: Using a Samba name in addition to the CUPS name is practical, for example, if the printer group was already in use in Windows under a name which contains blank spaces or umlauts. The printer group can then still be reached under this name without the need to reconfigure the Windows computers.
de: Die Verwendung des Samba-Namens zusätzlich zum CUPS-Namen ist z.B. dann sinnvoll, wenn die Druckergruppe schon früher unter Windows mit einem Namen verwendet wurde, der Leerzeichen oder Umlaute enthielt. Die Druckergruppe kann dann weiterhin unter diesem Namen erreicht werden und die Windows-Rechner müssen nicht umkonfiguriert werden.

source: Group members
de: Gruppenmitglieder

source: This list is used to assign printers to the printer group.
de: Durch diese Liste werden Drucker der Druckergruppe zugeordnet.

source: Chapter contents:
de: Kapitelinhalte:

source: Print services
de: Druckdienste

source: |UCSUCS| includes a print system, which can also be used to realize complex environments. Printers and printer groups can be created and configured conveniently in the UMC module :guilabel:`Printers`.
de: |UCSUCS| beinhaltet ein Drucksystem, mit dem sich auch komplexe Umgebungen realisieren lassen. Drucker und Druckergruppen werden dabei im UMC-Modul :guilabel:`Drucker` verwaltet.

source: The print services are based on *CUPS (Common Unix Printing System)*. CUPS manages print jobs in print queues and converts print jobs into the native formats of the connected printers. The print queues are administrated via the UMC module :guilabel:`Print jobs`, see :ref:`umc-modules-printer`.
de: Die Druckdienste basieren auf *CUPS (Common Unix Printing System)*. Druckaufträge werden von CUPS in Warteschlangen verwaltet und in die Druckformate der angeschlossenen Drucker umgewandelt. Die Druckerwarteschlangen werden im UMC-Modul :guilabel:`Druckaufträge` verwaltet, siehe :ref:`umc-modules-printer`.

source: All printers set up in CUPS can be directly used by UCS systems and are automatically also provided for Windows computers when Samba is used.
de: Alle in CUPS eingerichteten Drucker können von UCS-Systemen direkt verwendet werden und werden bei Verwendung von Samba automatisch auch für Windows-Rechner bereitgestellt.

source: The technical capacities of a printer are specified in so-called PPD files. These files include for example whether a printer can print in color, whether duplex printing is possible, whether there are several paper trays, which resolutions are supported and which printer control languages are supported (e.g., PCL or PostScript).
de: Die technischen Fähigkeiten eines Druckers werden in sogenannten PPD-Dateien spezifiziert. In diesen Dateien ist beispielsweise festgehalten, ob ein Drucker farbig drucken kann, ob ein beidseitiger Druck möglich ist, welche Papierschächte vorhanden sind, welche Auflösungen unterstützt und welche Druckerbefehlssprachen unterstützt werden (z.B. PCL oder PostScript).

source: Print jobs are transformed by CUPS with the help of filters into a format that the respective printer can interpret, for example into PostScript for a PostScript-compatible printer.
de: Druckaufträge werden von CUPS mit Hilfe von Filtern in ein Format umgewandelt, das der jeweilige Drucker interpretieren kann, also z.B. in PostScript für einen PostScript-fähigen Drucker.

source: UCS already includes a wide variety of filters and PPD files. Consequently, most printers can be employed without the need to install additional drivers. The setting up of additional PPD files is described in :ref:`print-ppdlisten`.
de: UCS bringt eine Vielzahl von Filtern und PPD-Dateien direkt mit, so dass die meisten Drucker ohne zusätzlich zu installierende Treiber angesprochen werden können. Die Einrichtung weiterer PPD-Dateien ist in :ref:`print-ppdlisten` beschrieben.

source: A printer can either be connected directly to the print server locally (e.g., via the USB port or a parallel port) or communicate with a printer via remote protocols (e.g., TCP/IP compatible printers, which are connected via ``IPP`` or ``LPD``).
de: Ein Drucker kann entweder direkt an den Druckserver angeschlossen sein (z.B. über die USB-Schnittstelle oder einen Parallelport) oder über Remote-Protokolle mit einem Druckserver kommunizieren (z.B. TCP/IP-fähige Drucker, die über IPP oder LPD angebunden werden).

source: Network printers with their own IP address should be registered in the UMC module :guilabel:`Computers` as an IP client (see :ref:`system-roles`).
de: Netzwerkdrucker mit eigener IP-Adresse sollten als IP-Client im UMC-Modul :guilabel:`Rechner` registriert werden (siehe :ref:`system-roles`).

source: CUPS offers the possibility of defining printer groups. The included printers are used employed alternating, which allows automatic load distribution between neighboring printers.
de: CUPS bietet die Möglichkeit Druckergruppen zu definieren. Die darin enthaltenen Drucker werden abwechselnd zur Bearbeitung von Druckaufträgen herangezogen, was eine automatische Lastverteilung zwischen räumlich benachbarten Druckern ermöglicht.

source: Print shares from Windows systems can also be integrated in the CUPS print server, see :ref:`print-shares`.
de: Es können auch Druckerfreigaben von Windows-Systemen in den CUPS-Druckserver integriert werden, dies ist in :ref:`print-shares` dokumentiert.

source: Installing a print server
de: Installation eines Druckservers

source: A print server can be installed from the Univention App Center with the application :program:`Print server (CUPS)`. Alternatively, the software package :program:`univention-printserver` can be installed (:command:`univention-run-join-scripts` must be executed after installation). Additional information can be found in :ref:`computers-softwaremanagement-install-software`.
de: Ein Druckserver kann mit der Applikation :program:`Druckserver (CUPS)` aus dem Univention App Center installiert werden. Alternativ kann das Softwarepaket :program:`univention-printserver` installiert und :command:`univention-run-join-scripts` aufgerufen werden. Weitere Informationen finden sich in :ref:`computers-softwaremanagement-install-software`.

source: Generating PDF documents from print jobs
de: Generierung von PDF-Dokumenten aus Druckaufträgen

source: Installing the :program:`univention-printserver-pdf` package expands the print server with a special *cups-pdf* printer type, which converts incoming print jobs into PDF documents and adds them in a specified directory on the printer server where they are readable for the respective user. After the installation of the package, :command:`univention-run-join-scripts` must be run.
de: Durch die Installation des Pakets :program:`univention-printserver-pdf` wird ein Druckserver um den speziellen Druckertyp *cups-pdf* erweitert, der eingehende Druckaufträge in das PDF-Format umwandelt und für den jeweiligen Benutzer lesbar in ein Verzeichnis auf dem Druckserver ausgibt. Nach der Installation des Pakets sollte :command:`univention-run-join-scripts` aufgerufen werden.

source: The ``cups-pdf:/`` protocol must be selected when creating a PDF printer in the UMC module :guilabel:`Printers` (see :ref:`print-shares`); the destination field remains empty.
de: Beim Anlegen eines PDF-Druckers im UMC-Modul :guilabel:`Drucker` (siehe :ref:`print-shares`) muss als Protokoll ``cups-pdf:/`` ausgewählt werden, das Ziel-Feld bleibt leer.

source: ``PDF`` must be selected as *Printer producer* and ``Generic CUPS-PDF Printer`` as *Printer model*.
de: Als *Drucker-Hersteller* muss ``PDF`` und als *Drucker-Modell* ``Generic CUPS-PDF Printer`` ausgewählt werden.

source: The target directory for the generated PDF documents is set using the |UCSUCRV| :envvar:`cups/cups-pdf/directory`. As standard it is set to :file:`/var/spool/cups-pdf/%U` so that :program:`cups-pdf` uses a different directory for each user.
de: Das Zielverzeichnis für die generierten PDF-Dokumente wird über die |UCSUCRV| :envvar:`cups/cups-pdf/directory` festgelegt. Standardmäßig wird es auf :file:`/var/spool/cups-pdf/%U` gesetzt, so dass :program:`cups-pdf` für jeden Benutzer ein eigenes Verzeichnis verwendet.

source: Print jobs coming in anonymously are printed in the directory specified by the |UCSUCRV| :envvar:`cups/cups-pdf/anonymous` (standard setting: :file:`/var/spool/cups-pdf/`).
de: Anonym eingegangene Druckaufträge werden in das durch die |UCSUCRV| :envvar:`cups/cups-pdf/anonymous` vorgegebene Verzeichnis ausgegeben (Standardeinstellung: :file:`/var/spool/cups-pdf/`).

source: By default generated PDF documents are kept without any restrictions. If the |UCSUCRV| :envvar:`cups/cups-pdf/cleanup/enabled` is set to ``true``, old PDF print jobs are deleted via a Cron job. The storage time in days can be configured using the |UCSUCRV| :envvar:`cups/cups-pdf/cleanup/keep`.
de: In der Grundeinstellung werden die generierten PDF-Dokumente unbegrenzt aufbewahrt. Wird die |UCSUCRV| :envvar:`cups/cups-pdf/cleanup/enabled` auf ``true`` gesetzt werden alte PDF-Druckaufträge über einen Cron-Job gelöscht. Die Aufbewahrungszeit in Tagen kann mit der |UCSUCRV| :envvar:`cups/cups-pdf/cleanup/keep` konfiguriert werden.

source: Integrating additional PPD files
de: Integration weiterer PPD-Dateien

source: The technical capabilities of a printer are specified in so-called PPD files. These files include for example whether a printer can print in color, whether duplex printing is possible, whether there are several paper trays, which resolutions are supported and which printer control languages are supported (e.g., PCL or PostScript).
de: Die technischen Fähigkeiten eines Druckers werden in sogenannten PPD-Dateien spezifiziert. In diesen Dateien ist beispielsweise festgehalten, ob ein Drucker farbig drucken kann, ob ein beidseitiger Druck möglich ist, welche Papierschächte vorhanden sind, welche Auflösungen unterstützt und welche Druckerbefehlssprachen unterstützt werden (z.B. PCL oder PostScript).

source: In addition to the PPD files already included in the standard scope, additional ones can be added via UMC modules. The PPDs are generally provided by the printer manufacturer and need to be copied into the :file:`/usr/share/ppd/` directory on the print servers.
de: Neben den bereits im Standardumfang enthaltenen PPD-Dateien können weitere über UMC-Module hinzugefügt werden. Die PPD wird in der Regel vom Hersteller des Druckers bereitgestellt und muss auf den Druckservern in das Verzeichnis :file:`/usr/share/ppd/` kopiert werden.

source: The printer driver lists are administrated in the UMC module :guilabel:`LDAP directory`. There you need to switch to the ``univention`` container and then to the ``cups`` subcontainer. Printer driver lists already exist for the majority of printer manufacturers. These can be expanded or new ones can be added.
de: Die Druckertreiberlisten werden im UMC-Modul :guilabel:`LDAP-Verzeichnis` verwaltet. Dort muss in den Container ``univention`` und dort in den Untercontainer ``cups`` gewechselt werden. Für die meisten Druckerhersteller existieren bereits Druckertreiberlisten. Diese können ergänzt werden oder eine neue hinzugefügt werden.

source: The name of the printer driver list. The name under which the list appears in the *Printer model* selection list on the *General* tab for printer shares (see :ref:`print-shares`).
de: Der Name der Druckertreiberliste. Unter diesem Namen erscheint die Liste in der Auswahlliste *Drucker-Hersteller* auf der Karteikarte *Allgemein* der Druckerfreigaben (siehe :ref:`print-shares`).

source: Driver
de: Treiber

source: The path to the :file:`ppd` file or to the :file:`/usr/share/ppd/` directory. For example, if the :file:`/usr/share/ppd/laserjet.ppd` should be used, :file:`laserjet.ppd` must be entered here. :command:`gzip` compressed files (file ending :file:`.gz`) can also be entered here.
de: Der Pfad zur PPD-Datei, relativ zu dem Verzeichnis :file:`/usr/share/ppd/`. Soll beispielweise die Datei :file:`/usr/share/ppd/laserjet.ppd` verwendet werden, so ist hier :file:`laserjet.ppd` einzutragen. Es können auch :command:`gzip`-komprimierte Dateien (Dateiendung :file:`.gz`) angegeben werden.

source: A description of the printer driver, under which it appears in the *Printer model* selection list on the *General* tab for printer shares.
de: Eine Beschreibung des Druckertreibers, unter der er in der Auswahlliste *Drucker-Modell* auf der Reiter *Allgemein* der Druckerfreigaben erscheint.

source: Creating a printer share
de: Konfiguration von Druckerfreigaben

source: Print shares are administrated in the UMC module :guilabel:`Printers` with the *Printer share* object type (see :ref:`central-user-interface`).
de: Druckerfreigaben werden im UMC-Modul :guilabel:`Drucker` mit dem Objekttyp *Druckerfreigabe: Drucker* verwaltet (siehe auch :ref:`central-user-interface`).

source: When adding/deleting/editing a printer share, the printer is automatically configured in CUPS. CUPS does not have an LDAP interface for printer configuration, instead the :file:`printers.conf` file is generated via a listener module. If Samba is used, the printer shares are also automatically provided for Windows clients.
de: Beim Hinzufügen, Entfernen oder Bearbeiten einer Druckerfreigabe wird der Drucker automatisch auch in CUPS konfiguriert. CUPS verfügt über keine LDAP-Schnittstelle für die Druckerkonfiguration, stattdessen wird über ein Listener-Modul die CUPS-Druckerkonfiguration (:file:`printers.conf`) generiert. Wenn Samba eingesetzt wird, werden die Druckerfreigaben automatisch auch für Windows-Clients bereitgestellt.

source: Printers UMC module - General tab
de: Drucker UMC Modul - Reiter Allgemein

source: This input field contains the name of the printer share, which is used by CUPS. The printer appears under this name in Linux and Windows. The name may contain alphanumeric characters (i.e., uppercase and lowercase letters ``a`` to ``z`` and numbers ``0`` to ``9``) as well as hyphens and underscores. Other characters (including blank spaces) are not permitted.
de: Dieses Eingabefeld enthält den Namen der Druckerfreigabe, der von CUPS verwendet wird. Unter diesem Namen erscheint der Drucker unter Linux und Windows. Der Name darf alphanumerische Zeichen (also die Buchstaben ``a`` bis ``z`` in Groß- und Kleinschreibung und die Ziffern ``0`` bis ``9``) sowie Binde- und Unterstriche enthalten. Andere Zeichen (einschließlich Leerzeichen) sind nicht erlaubt.

source: A print server manages the printer queue for the printers to be shared. It converts the data to be printed into a compatible print format when this is necessary. If the printer is not ready, the print server saves the print jobs temporarily and forwards them on to the printer subsequently. If more than one print server is specified, the print job from the client will be sent to the first print server to become available.
de: Ein Druckserver verwaltet die Druckerqueue für den freizugebenden Drucker und wandelt - falls notwendig - die Druckdaten in das passende Druckerformat um. Ist der Drucker nicht bereit, speichert der Druckserver die anstehenden Druckaufträge zwischen und sendet sie später zum Drucker. Werden mehrere Druckserver angegeben, wird der Druckauftrag vom Client zum ersten Druckserver gesendet, der erreichbar ist.

source: Only UCS Directory Node and |UCSMANAGEDNODE|\ s on which the :program:`univention-printserver` package is installed are displayed in the list.
de: Nur UCS Directory Nodes und |UCSMANAGEDNODE|\ s, auf denen das Paket :program:`univention-printserver` installiert wurde, werden in der Liste angezeigt.

source: Protocol and Destination (*)
de: Protokoll und Ziel (*)

source: These two input fields specify how the print server accesses the printer.
de: Diese beiden Eingabefelder legen fest, wie der Druckserver auf den Drucker zugreift.

source: The following list describes the syntax of the individual protocols for the configuration of printers connected locally to the server:
de: Die folgende Liste beschreibt die Syntax der einzelnen Protokolle für die Konfiguration lokal an den Server angeschlossener Drucker:

source: Example: ``parallel://dev/lp0``
de: Beispiel: ``parallel://dev/lp0``

source: Example: ``socket://printer_03:9100``
de: Beispiel: ``socket://printer_03:9100``

source: Example: ``usb://dev/usb/lp0``
de: Beispiel: ``usb://dev/usb/lp0``

source: The following list describes the syntax of the individual protocols for the configuration of network printers:
de: Die folgende Liste beschreibt die Syntax der einzelnen Protokolle für die Konfiguration von Netzwerk-Druckern:

source: Example: ``http://192.0.2.10:631/printers/remote``
de: Beispiel: ``http://192.0.2.10:631/printers/remote``

source: Example: ``ipp://printer_01/printers/xerox``
de: Beispiel: ``ipp://printer_01/printers/xerox``

source: Example: ``lpd://192.0.2.30/bwdraft``
de: Beispiel: ``lpd://192.0.2.30/bwdraft``

source: The ``cups-pdf`` protocol is used for integrating a pseudo printer, which creates a PDF document from all the print jobs. The setup is documented in :ref:`pdf-printer`.
de: Das Protokoll ``cups-pdf`` wird zur Anbindung eines Pseudodruckers verwendet, der aus allen Druckaufträgen ein PDF-Dokument erzeugt. Die Einrichtung ist in :ref:`pdf-printer` dokumentiert.

source: The ``file:/`` protocol expects a filename as a target. The print job is then not sent to the printer, but instead written in this file, which can be useful for test purposes. The file is rewritten with every print job.
de: Das Protokoll ``file://`` erwartet als Ziel einen Dateinamen. Der Druckauftrag wird dann nicht auf einen Drucker geschrieben, sondern in diese Datei, was für Testzwecke nützlich sein kann. Die Datei wird mit jedem Druckauftrag neu geschrieben.
