Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/print-services.po
Languages: de

source: The ``smb://`` protocol can be used to mount a Windows print share. For example, to integrate the ``laser01`` printer share from Windows system ``win01``, ``win01/laser01`` must be specified as destination. The manufacturer and model must be selected according to the printer in question. The print server uses the printer model settings to convert the print jobs where necessary and send these directly to the URI ``smb://win01/laser01``. No Windows drivers are used in this.
de: Mit dem Protokoll ``smb://`` kann eine Windows-Druckerfreigabe eingebunden werden. Um beispielsweise die Druckerfreigabe *laser01* des Windows-Systems *win01* einzubinden, muss als Ziel *win01/laser01* angegeben werden. Dabei sollten Hersteller und Modell-Typ entsprechend des verwendeten Geräts gewählt werden. Der Druckserver nutzt dabei die verwendeten Druckermodell-Einstellungen um die Druckaufträge gegebenenfalls umzuwandeln und sendet diese anschließend an die URI ``smb://win01/laser01``. Hierbei werden keine Windows-Treiber verwendet.

source: Independent of these settings, the printer share can be mounted by other Windows systems with the corresponding printer drivers.
de: Unabhängig von diesen Einstellungen kann die Druckerfreigabe auch weiterhin von anderen Windows-Systemen mit den entsprechenden Druckertreibern eingebunden werden.

source: Manufacturer
de: Drucker-Hersteller

source: When the printer manufacturer is selected, the *Printer model* selection list updates automatically.
de: Nach der Auswahl des Herstellers des Druckers wird die Auswahlliste *Drucker-Modell* automatisch aktualisiert.

source: Printer model (*)
de: Drucker-Modell (*)

source: This selection list shows all the printers PPD files available for the selected manufacturer. If the required printer model is not there, a similar model can be selected and a test print used to establish correct function. :ref:`print-ppdlisten` explains how to expand the list of printer models.
de: Diese Auswahlliste zeigt alle verfügbaren Drucker-PPD-Dateien für den ausgewählten *Drucker-Hersteller* an. Wenn das gesuchte Drucker-Modell nicht vorhanden ist, kann ein ähnliches Modell ausgewählt werden und mit einem Drucktest die korrekte Funktion überprüft werden. In :ref:`print-ppdlisten` wird erläutert, wie die Liste der Drucker-Modelle erweitert werden kann.

source: A printer can also be assigned an additional name by which it can be reached from Windows. Unlike the CUPS name (see *Name*), the Samba name may contain blank spaces and umlauts. The printer is then available to Windows under both the CUPS name and the Samba name.
de: Für einen Drucker kann ein zusätzlicher Name vergeben werden, unter dem er von Windows aus erreichbar sein soll. Im Gegensatz zum CUPS-Namen (siehe *Name*) darf der Samba-Name Leerzeichen und Umlaute enthalten. Der Drucker steht für Windows dann sowohl unter dem CUPS-Namen als auch unter dem Samba-Namen zur Verfügung.

source: Using a Samba name in addition to the CUPS name is practical, for example, if the printer was already in use in Windows under a name which contains blank spaces or umlauts. The printer can then still be reached under this name without the need to reconfigure the Windows computers.
de: Die Verwendung des Samba-Namens zusätzlich zum CUPS-Namen ist z.B. dann sinnvoll, wenn der Drucker nach einer Migration unter Windows mit einem Namen verwendet wurde, der Leerzeichen oder Umlaute enthielt. Der Drucker kann dann weiterhin unter diesem Namen erreicht werden und die Windows-Rechner müssen nicht umkonfiguriert werden.

source: Location
de: Standort

source: This data is displayed by some applications when selecting the printer. It can be filled with any text.
de: Diese Angabe wird von einigen Anwendungen bei der Druckerauswahl angezeigt. Sie kann mit beliebigem Text gefüllt werden.

source: This is displayed by some applications when selecting the printer. It can be filled with any text.
de: Diese Angabe wird von einigen Anwendungen bei der Druckerauswahl angezeigt. Sie kann mit einem beliebigen Text gefüllt werden.

source: Printers UMC module - Access control tab
de: Drucker UMC Modul - Reiter Zugriffskontrolle

source: *Access control* tab
de: Reiter *Zugriffskontrolle*

source: Access control
de: Zugriffskontrolle

source: Access rights for the printer can be specified here. Access can be limited to certain groups or users or generally allowed and certain groups or users blocked specifically. As standard, access is available for all groups and users. These rights are also adopted for the corresponding Samba printer shares, so that the same access rights apply when printing via Samba as when printing directly via CUPS.
de: Über diese Auswahl lassen sich Zugriffsrechte für den Drucker festlegen. Der Zugriff kann auf bestimmte Gruppen oder Benutzer beschränkt werden oder er kann generell freigegeben und spezifisch für bestimmte Gruppen oder Benutzer gesperrt werden. Standardmäßig ist der Zugriff für alle Gruppen und Benutzer zugelassen. Diese Rechte werden auch für die entsprechende Samba-Druckerfreigabe übernommen, so dass beim Drucken über Samba die gleichen Zugriffsrechte gelten, wie beim Drucken direkt über CUPS.

source: This access control is useful for the management of printers spread across several locations, so that the users at location A do not see the printers of location B.
de: Die Zugriffskontrolle ist z.B. sinnvoll für die Verwaltung von Druckern an mehreren Standorten, so dass den Benutzern an Standort A nicht die Druckerfreigaben von Standort B angezeigt werden.

source: Allowed/denied users
de: Zugelassene/abgewiesene Benutzer

source: This lists individual users for whom access should be controlled.
de: Diese Auswahl führt einzelne Benutzer auf, für die der Zugriff reguliert werden soll.

source: Allowed/denied groups
de: Zugelassene/abgewiesene Gruppen

source: This lists individual groups for whom access should be controlled.
de: Diese Auswahl führt Gruppen auf, für die der Zugriff reguliert werden soll.

source: Administration of print jobs and print queues
de: Verwaltung von Druckaufträgen und Druckerwarteschlangen

source: The UMC module :guilabel:`Print jobs` allows you to check the status of the connected printers, restart paused printers and remove print jobs from the queues on printer servers.
de: Das UMC-Modul :guilabel:`Druckaufträge` erlaubt auf Druckservern den Status der angeschlossenen Drucker zu prüfen, angehaltene Drucker neu zu starten oder Druckaufträge aus den Warteschlagen zu entfernen.

source: Printer administration
de: Drucker-Administration

source: The start page of the module contains a search mask with which the available printers can be selected. The result list displays the server, name, status, location and description of the respective printer. The status of more than one printer can be changed simultaneously by selecting the printers and running either the *deactivate* or *activate* function.
de: Auf der Startseite des Moduls befindet sich eine Suchmaske, mit der die vorhandenen Drucker ausgewählt werden können. In der Ergebnisliste wird zu dem jeweiligen Drucker der Server, der Name, der Status, der Standort und die Beschreibung angezeigt. Durch Markieren der Drucker und Ausführen einer der beiden Aktionen *deaktivieren* oder *aktivieren*, kann der Status mehrerer Drucker gleichzeitig geändert werden.

source: Clicking on the printer name displays details of the selected printer. The information displayed includes a list of the print jobs currently in the printer queue. These print jobs can be deleted from the queue by selecting the jobs and running the *Delete* function.
de: Durch den Klick auf einen Druckernamen können Details zu dem ausgewählten Drucker angezeigt werden. Zu den angezeigten Informationen gehört auch eine Liste der aktuell existierenden Druckaufträge, die noch in der Warteschlange des Druckers sind. Durch Markieren der Druckaufträge und Auswahl der Aktion *Löschen* können Druckaufträge aus der Warteschlange entfernt werden.

source: Mounting of print shares in Windows clients
de: Einbinden von Druckerfreigaben auf Windows-Clients

source: The printer shares set up in the UMC module :guilabel:`Printers` can be added as network printers on Windows systems. This is done via the Control Panel under :menuselection:`Add a device --> Add a printer`. The printer drivers need to be set up during the first access. If the drivers are stored on the server side (see below), the drivers are assigned automatically.
de: Die im UMC-Modul :guilabel:`Drucker` eingerichteten Druckerfreigaben können auf Windows-Systemen als Netzwerkdrucker hinzugefügt werden. Dies erfolgt über die Systemsteuerung unter :menuselection:`Drucker --> Netzwerkdrucker hinzufügen`. Die Druckertreiber müssen beim ersten Zugriff eingerichtet werden. Wurden die Treiber serverseitig hinterlegt (siehe unten), erfolgt die Zuweisung des Treibers automatisch.

source: Printer shares are usually operated using the Windows printer drivers provided. The network printer can alternatively be set up on the Windows side with a standard PostScript printer driver. If a color printer should be accessed, a driver for a PostScript-compatible color printer should be used on the Windows side, e.g., *HP Color LaserJet 8550*.
de: Druckerfreigaben werden in der Regel mit den mitgelieferten Windows-Druckertreibern betrieben. Der Netzwerkdrucker kann auf Windows-Seite alternativ mit einem Standard-PostScript-Druckertreiber eingerichtet werden. Wenn auf einen Farbdrucker zugegriffen werden soll, sollte auf Windows-Seite ein Treiber für einen PostScript-fähigen Farbdrucker verwendet werden, z.B. *HP Color LaserJet 8550*.

source: The printer can only be accessed by regular users when they have local permissions for driver installation or the respective printer drivers were stored on the printer server. If this is not the case, Windows may issue an error warning that the permissions are insufficient to establish a connection to the printer.
de: Der Zugriff auf einen Drucker ist für einen regulären Benutzer nur möglich, wenn dieser über lokale Rechte zur Treiberinstallation verfügt oder ein entsprechender Druckertreiber auf dem Druckserver hinterlegt wurde. Ist dies nicht der Fall kann es zu einer Windows Fehlermeldung kommen, die besagt, dass die Berechtigungen nicht ausreichen, um eine Verbindung mit dem Drucker herzustellen.

source: Windows supports a mechanism for providing the printer drivers on the print server (*Point 'n' Print*). The following guide describes the provision of the printer drivers in Windows for a print share configured in the UMC module :guilabel:`Printers`. Firstly, the printer drivers must be stored on the print server. There are a number of pitfalls in the Windows user wizard, so it is important to follow the individual steps precisely.
de: Windows unterstützt ein Verfahren zur serverseitigen Bereitstellung von Druckertreibern auf dem Druckserver (*Point 'n' Print*). Die folgende Anleitung beschreibt die Bereitstellung der Druckertreiber unter Windows für eine im UMC-Modul :guilabel:`Drucker` konfigurierte Druckerfreigabe. Zuerst müssen die Druckertreiber auf dem Druckserver hinterlegt werden, danach werden die Drucker mit einem Druckertreiber verknüpft. Die Benutzerführung unter Windows bietet zahlreiche Stolperfallen, es ist wichtig den einzelnen Schritten exakt zu folgen.

source: Firstly, the printer drivers must be downloaded from the manufacturer's website. If you are using an environment in which 64-bit installations of Windows are used, you will need both versions of the drivers (32 and 64 bit). The :file:`INF` files are required.
de: Zuerst müssen die Druckertreiber von der Webseite des Herstellers heruntergeladen werden. Wird eine Umgebung verwendet, in der die 64 Bit-Versionen von Windows eingesetzt werden, müssen die Treiber unbedingt in beiden Versionen bezogen werden (32 und 64 Bit). Benötigt werden die :file:`INF`-Dateien.

source: Now you need to start the :program:`printmanagement.msc` program. Clicking on :guilabel:`Add/remove server` in the *Action* menu item allows you to add another server. The name of the printer server needs to be entered in the *Add server* input field.
de: Nun muss das Programm :program:`printmanagement.msc` (Druckerverwaltung) gestartet werden. Im Menüpunkt *Aktion* kann mit einem Klick auf :guilabel:`Server hinzufügen/entfernen` ein weiterer Server hinzugefügt werden. In dem Eingabefeld *Server hinzufügen* muss der Name des Druckerservers eingetragen werden.

source: Add printer server
de: Druckerserver hinzufügen

source: The newly added printer server should now be listed in the print management program. Clicking on :guilabel:`Printers` displays the printer shares currently set up on the printer server.
de: In der Druckerverwaltung sollte der neu hinzugefügte Druckserver nun aufgelistet werden. Durch einen Klick auf :guilabel:`Drucker` werden die aktuell auf dem Druckerserver eingerichteten Druckerfreigaben angezeigt.

source: Printer list
de: Druckerliste

source: Clicking on :guilabel:`Drivers` lists the saved printer drivers. Clicking on :guilabel:`Add driver` in the *Action* menu item opens the dialogue window for the driver installation.
de: Mit einem Klick auf den Eintrag :guilabel:`Treiber` werden die hinterlegten Druckertreiber aufgelistet. Im Menüpunkt *Aktion* kann mit einem Klick auf :guilabel:`Treiber hinzufügen` der Dialog für die Treiberinstallation gestartet werden.

source: We recommend downloading the printer drivers directly from the manufacturer and selecting them during the driver installation. If you are using an environment containing 64-bit versions of Windows, start by performing a check to see if the |UCSUCRV| :envvar:`samba/spoolss/architecture` is set to ``Windows x64`` on the UCS Samba system. If this is not the case, both the 32-bit and the 64-bit drivers must be uploaded; if your domain only uses 64-bit Windows systems, the 32-bit driver can be ignored. The drivers for the different Windows architectures can be uploaded one after the other or together.
de: Wir empfehlen die Druckertreiber direkt vom Hersteller herunterzuladen und diese während der Treiberinstallation auszuwählen. Wird eine Umgebung verwendet, in der die 64 Bit-Versionen von Windows eingesetzt werden, sollte zunächst geprüft werden, ob auf dem UCS Samba System die |UCSUCRV| :envvar:`samba/spoolss/architecture` auf ``Windows x64`` gesetzt ist. Falls das nicht der Fall ist, müssen die Treiber unbedingt für 32 und 64 Bit hochgeladen werden, andernfalls kann auf die 32 Bit Treiber verzichtet werden, wenn ausschliesslich 64 Bit Windows Systeme in der Domäne zum Einsatz kommen. Die Treiber können für verschiedene Windows-Architekturen entweder in getrennten Schritten nacheinander oder direkt in einem Vorgang hochgeladen werden.

source: If both driver architectures are selected for uploading at the same time, the 64-bit driver should be selected first in the subsequent file selection window. Once Windows has uploaded these files to the server, it asks for the location of the 32-bit drivers again. They are then also uploaded to the server.
de: Falls beide Treiberarchitekturen gleichzeitig zum Hochladen ausgewählt werden, dann muss im anschließenden Dateiauswahldialog als erstes der 64 Bit Treiber gewählt werden. Nachdem Windows diese Dateien zum Server hochgeladen hat, fragt es dann erneut nach dem Ort für die 32 Bit Treiber. Danach werden auch diese zum Server hochgeladen.

source: Driver installation
de: Treiberinstallation

source: After these steps the drivers are stored in the directory :file:`/var/lib/samba/drivers/` on the print server.
de: Nach diesen Schritten sind die Treiber auf dem UCS Druckserver im Verzeichnis :file:`/var/lib/samba/drivers/` gespeichert.

source: The print share now needs to be linked to the uploaded printer driver. To do so, the list of the printers available on the printer server is opened in the :program:`printmanagement.msc` program. The properties can be listed there by double-clicking on the *printer*.
de: Nun muss die Druckerfreigabe noch mit dem hochgeladenen Druckertreiber verknüpft werden. Dazu wird im Programm :program:`printmanagement.msc` die Liste der vom Druckserver bereitgestellten Drucker aufgerufen. Dort werden durch einen Doppelklick auf den *Drucker* die Eigenschaften aufgelistet.

source: Selecting a printer
de: Drucker auswählen

source: If no printer driver is saved, a message is displayed saying that there is no printer driver installed. The prompt to install the driver should be closed with :guilabel:`No` here.
de: Ist noch kein Druckertreiber hinterlegt, wird eine Meldung angezeigt, dass noch kein Druckertreiber installiert ist. Die Frage, ob der Treiber installiert werden soll, muss hier mit :guilabel:`Nein` bestätigt werden.

source: Error message on first access
de: Fehlermeldung beim ersten Zugriff

source: The uploaded driver now needs to be selected from the drop down menu under *Drivers* in the *Advanced* tab. Then click on :guilabel:`Apply` (Important: **DON'T** click on :guilabel:`OK`!).
de: Nun muss im Reiter *Erweitert* unter *Treiber* der hochgeladene Treiber aus dem Dropdown-Menü ausgewählt werden. Anschließend muss auf :guilabel:`Übernehmen` geklickt werden (Wichtig: **NICHT** auf :guilabel:`OK`!).

source: If the printer driver in question is being assigned to a printer for the first time, a dialogue window is shown, asking whether the printer can be trusted. This should be confirmed with :guilabel:`Install driver`. The printer drivers saved on the server side are now downloaded to the client. If the printer driver in question has already been downloaded to the Windows system in question in this manner before, Windows displays an error message at this point ``0x0000007a``. This can simply be ignored.
de: Falls der betreffende Druckertreiber das erste mal einem Drucker zugewiesen wird, dann wird ein Dialog angezeigt, in dem gefragt wird, ob dem Drucker vertraut wird. Dies muss mit :guilabel:`Treiber installieren` bestätigt werden. Nun werden die serverseitig hinterlegten Druckertreiber auf den Client heruntergeladen. Falls der betreffende Druckertreiber schon zuvor einmal auf diese Weise vom Druckerserver auf das betreffende Windows System heruntergeladen worden ist, dann meldet Windows an dieser Stelle eine Fehlermeldung ``0x0000007a``. Diese kann ignoriert werden.

source: **Important**: Now, instead of clicking directly on :guilabel:`OK`, you need to return to the *General* tab again. The old name for the printer share should still be displayed on the tab.
de: **Wichtig**: Nun sollte nicht direkt auf :guilabel:`OK` geklickt werden, sondern es muss noch einmal auf den Reiter *Allgemein* gewechselt werden. Auf dem Reiter muss weiterhin der alte Name der Druckerfreigabe angezeigt werden.

source: In UCS releases earlier than UCS 4.0-1, it is possible that the Windows system has changed the name of the printer share to the name of the printer driver. If that were accepted, the printer would no longer be associated with the share!
de: In UCS Releases vor UCS 4.0-1 kann es vorkommen, dass das Windows System hier den Namen der Druckerfreigabe in den Namen des Druckertreibers geändert hat. Wenn man dies so übernehmen würde, dann wäre der Drucker nicht mehr mit der Freigabe assoziiert!

source: If this is the case, the name of the printer on the *General* tab (the first input field next to the stylized printer symbol) needs to be reset to the name of the print share. This can be done using the *Windows name* field configured in the UMC module :guilabel:`Printers` (or if this was left blank, use the value from *Name*). If the name has had to be reset in this fashion, Windows then asks if you are sure that you want to change the name when :guilabel:`OK` is clicked. Confirm the prompt.
de: Wenn dieser Fall eingetreten ist, muss der Name des Druckers auf dem Reiter *Allgemein* (das erste Eingabefeld, neben dem stilisierten Druckersymbol) wieder auf den Namen der Druckerfreigabe geändert werden. Hier ist das im UMC-Modul :guilabel:`Drucker` konfigurierte Feld *Windows-Name* zu verwenden (oder falls dies leer gelassen wurde, dann der Wert aus *Name*). Wenn der Name auf diese Weise zurückgesetzt werden musste, dann fragt Windows beim abschließenden Klick auf :guilabel:`OK` nach, ob man sich sicher ist, dass man den Namen ändern möchte. Dies ist zu bestätigen.

source: To give the Windows printer driver the opportunity to save correct standard settings for the printer, you now need to switch to the *Device settings* tab. The name of the tab differs from manufacturer to manufacturer and may also be *Settings* or even just *Configuration*.
de: Um dem Windows Druckertreiber nun die Möglichkeit zu geben, korrekte Standard-Einstellungen für den Drucker zu speichern, sollte nun auf den Reiter *Geräteeinstellungen* gewechselt werden. Der Name dieses Reiters ist herstellerspezifisch und kann auch mit *Einstellungen* oder einfach *Konfiguration* bezeichnet sein.

source: Clicking on :guilabel:`OK` closes the window. You can then print a test page. If Windows displays an error message here ``0x00000006``, the printer settings must be checked again to see whether there is a manufacturer-specific tab called *Device settings* (or something similar). If so, it should be opened and then simply confirmed with :guilabel:`OK`. This closes the dialogue window and saves the printer drivers settings (``PrinterDriverData``) in the Samba registry.
de: Ein abschließender Klick auf :guilabel:`OK` schließt den Dialog. Danach kann direkt eine Testseite gedruckt werden. Sollte Windows hier eine Fehlermeldung ``0x00000006`` ausgeben, muss in den Druckereinstellungen erneut geprüft werden, ob sich ein herstellerspezifischer Reiter namens :guilabel:`Geräteeinstellungen` (oder ähnlich) findet. Dieser sollte geöffnet und dann einfach mit :guilabel:`OK` bestätigt werden. Dies schließt den Dialog und speichert Druckertreibereinstellungen (``PrinterDriverData``) in der Samba Registry.

source: At this point, it is also practical to make the settings for the paper size and other parameters, so that they are saved in the print share. Other Windows systems which subsequently access the print share will then find the correct settings automatically. These settings can usually be opened by clicking on the :guilabel:`Standard values...` button in the *Advanced* tab of the printer settings. The dialogue window which opens also varies from manufacturer to manufacturer. Typically, the settings for paper size and orientation are found on a tab called *Page setup* or *Paper/Quality*. Once the dialogue has been confirmed by clicking on :guilabel:`OK`, the printer driver saves these settings (as ``Default DevMode``) for the printer in the Samba registry.
de: Es ist sinnvoll zu diesem Zeitpunkt auch direkt die Papiergröße und ähnliche Einstellungen vorzunehmen, damit diese an der Druckerfreigabe gespeichert werden. Andere Windows Systeme, die später auf die Druckerfreigabe zugreifen, finden dann automatisch die korrekten Einstellungen. Diese Einstellungen lassen sich in den meisten Fällen dadurch öffnen, indem in den Druckereigenschaften auf dem Reiter *Erweitert* auf die Schaltfläche :guilabel:`Standardwerte...` geklickt wird. Der sich öffnende Dialog ist ebenfalls herstellerabhängig. Typischerweise findet sich die Einstellung für Papiergröße und Orientierung auf einem Reiter *Seite Einrichten* oder auch *Papier/Qualität*. Nach Bestätigung des Dialogs durch Klick auf :guilabel:`OK` speichert der Druckertreiber diese Einstellungen (als ``Default DevMode``) für den Drucker in der Samba Registry.
