Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/shares.po
Languages: de

source: If the |UCSUCRV| :envvar:`listener/shares/rename` is set to ``yes``, the contents of the existing directory are moved when the path is modified.
de: Ist die |UCSUCRV| :envvar:`listener/shares/rename` auf ``yes`` gesetzt, wird bei der Änderung des Pfads der Inhalt eines bestehenden Verzeichnisses verschoben.

source: No shares can be created in and below :file:`/proc`, :file:`/tmp`, :file:`/root`, :file:`/dev` and :file:`/sys` and no files can be moved there.
de: Auf und unterhalb von :file:`/proc`, :file:`/tmp`, :file:`/root`, :file:`/dev` und :file:`/sys` können keine Freigaben angelegt oder dorthin verschoben werden.

source: Directory owner of the share's root
de: Besitzer des Wurzelverzeichnis der Freigabe

source: The user to whom the root directory of the share should belong, see :ref:`shares-permissions`.
de: Der Benutzer, dem das Wurzelverzeichnis der Freigabe gehören soll, siehe :ref:`shares-permissions`.

source: Directory owner group of the share's root
de: Besitzergruppe für das Wurzelverzeichnis der Freigabe

source: The group to whom the root directory of the share should belong, see :ref:`shares-permissions`.
de: Die Gruppe, der das Wurzelverzeichnis der Freigabe gehören soll, siehe :ref:`shares-permissions`.

source: Permissions for the share's root
de: Dateiberechtigungen für das Wurzelverzeichnis der Freigabe

source: The read, write and access permissions for the root directory of the share, see :ref:`shares-permissions`.
de: Die Lese-, Schreib- und Zugriffsrechte für das Wurzelverzeichnis der Freigabe, siehe :ref:`shares-permissions`.

source: Shares UMC module - NFS tab
de: Freigaben UMC Modul - Reiter NFS

source: *NFS* tab
de: Reiter *NFS*

source: NFS write access
de: NFS-Schreibzugriff

source: Allows NFS write access to this share; otherwise the share can only be used in read-only mode.
de: Erlaubt schreibenden NFS-Zugriff auf diese Freigabe, ansonsten kann die Freigabe nur lesend verwendet werden.

source: Subtree checking
de: Subtree-Überprüfung

source: If only one subdirectory of a file system is exported, the NFS server has to check whether an accessed file is located on the exported file system and in the exported path, each time access is made. Path information is passed on to the client for this check. Activating this function might cause problems if a file opened by the client, is renamed.
de: Wird nur ein Unterverzeichnis eines Dateisystems exportiert, muss der NFS-Server bei jedem Zugriff überprüfen, ob die zugegriffene Datei auf dem exportierten Dateisystem und in dem exportierten Pfad liegt. Für diese Prüfung werden Pfad-Informationen an den Client übergeben. Die Aktivierung dieser Funktion kann zu Problemen führen, wenn eine auf dem Client geöffnete Datei umbenannt wird.

source: Modify user ID for root user (root squashing)
de: User-ID für Root-Benutzer ändern (Root-Squashing)

source: In the NFS standard procedure, identification of users is achieved via user IDs. To prevent a local root user from working with root permissions on other shares, root access can be redirected. If this option is activated, access operations are executed as user ``nobody``.
de: Die Identifikation von Nutzern im NFS-Standardverfahren erfolgt über User-IDs. Um zu verhindern, dass ein lokaler Root-Nutzer auf fremden Freigaben ebenfalls mit Root-Rechten arbeitet, kann der Root-Zugriff umgelenkt werden. Ist diese Option aktiviert, erfolgen Root-Zugriffe als Benutzer ``nobody``.

source: The local group ``staff``, which is by default empty, owns privileges which come quite close to ``root`` permissions, yet this group is not considered by the redirection mechanism. This fact should be borne in mind when adding users to this group.
de: Die standardmäßig leere lokale Gruppe ``staff`` verfügt über Privilegien, die ``root``-Rechten recht nahe kommen, wird aber von der Weiterleitung nicht berücksichtigt. Dies sollte bei der Aufnahme von Nutzern in diese Gruppe berücksichtigt werden.

source: NFS synchronization
de: NFS-Synchronisation

source: The synchronization mode for the share. The ``sync`` setting is used to write data directly on the underlying storage device. The opposite setting - ``async`` - can improve performance but also involves the risk of data loss if the server is shut down incorrectly.
de: Der Synchronisationsmodus für die Freigabe. Mit der Einstellung ``sync`` werden Daten direkt auf das unterliegende Speichermedium geschrieben. Die gegenteilige Einstellung - ``async`` - kann die Performance verbessern, birgt aber auch das Risiko von Datenverlusten wenn der Server ohne kontrolliertes Herunterfahren abgeschaltet wird.

source: Only allow access for these hosts, IP addresses or networks
de: Zugriff nur für diese Rechner, IP-Adressen oder Netze erlauben

source: By default, all hosts are permitted access to a share. In this selection list, host names and IP addresses can be included, to which the access to the share is to be restricted. For example, access to a share containing mail data could be restricted to the mail server of the domain.
de: Standardmäßig wird allen Rechnern der Zugriff auf eine Freigabe erlaubt. In die Auswahlliste können Rechnernamen und IP-Adressen aufgenommen werden, auf die dann der Zugriff auf die Freigabe beschränkt wird. Hier ließe sich etwa der Zugriff auf eine Freigabe mit Maildaten auf den Mailserver der Domäne einschränken.

source: Shares UMC module - Samba tab
de: Freigaben UMC Modul - Reiter Samba

source: *Samba* tab
de: Reiter *Samba*

source: The NetBIOS name of the share. This is the name under which the share is displayed on Windows computers in the network environment. When adding a directory share, the UMC module adopts the name entered in the *Name* field of the *General* tab as the default.
de: Der NetBIOS-Name der Freigabe. Unter diesem Namen wird die Freigabe auf Windows-Rechnern in der Netzwerkumgebung angezeigt. Das UMC-Modul übernimmt beim Hinzufügen einer Verzeichnisfreigabe als Vorgabe den Namen, der auf der Karteikarte *Allgemein* im Feld *Name* eingetragen ist.

source: Samba write access
de: Samba-Schreibzugriff

source: Permits write access to this share.
de: Erlaubt den Schreibzugriff auf diese Freigabe.

source: Show in Windows network environment
de: Freigabe wird in der Windows-Netzwerkumgebung angezeigt

source: Specifies whether the share in question is to show up on Windows clients within the network environment.
de: Konfiguriert, ob diese Freigabe auf Windows-Rechnern in der Netzwerkumgebung angezeigt werden soll.

source: Allow anonymous read-only access with a guest user
de: Anonymen Nur-Lese-Zugriff mit Gastbenutzer erlauben

source: Permits access to this share without a password. Every access is carried out by means of the common guest user ``nobody``.
de: Erlaubt den Zugriff auf diese Freigabe ohne Passwortabfrage. Alle Zugriffe werden dabei über einen gemeinsamen Gast-Nutzer ``nobody`` durchgeführt.

source: MSDFS root
de: MSDFS-Wurzel

source: This option is documented in :ref:`shares-msdfs`.
de: Diese Option ist in :ref:`shares-msdfs` dokumentiert.

source: Users with write access may modify permissions
de: Benutzer mit Schreibrechten dürfen die Berechtigungen verändern

source: If this option is activated, all users with write permission to a file are allowed to change permissions, ACL entries, and file ownership rights, see :ref:`shares-permissions`.
de: Wird diese Option aktiviert, erhalten alle Benutzer mit Schreibrechten auf eine Datei auch die Möglichkeiten Berechtigungen, ACL-Einträge und Dateibesitzrechte zu ändern, siehe :ref:`shares-permissions`.

source: Hide unreadable files/directories
de: Verstecke nicht lesbare Dateien und Verzeichnisse

source: If this option is activated, all files which are not readable for the user due to their file permissions, will be hidden.
de: Wenn diese Option aktiviert ist, werden Dateien, die anhand der Dateirechte für einen Benutzer nicht lesbar sind, für diesen nicht angezeigt.

source: VFS Objects
de: VFS-Objekte

source: Virtual File System (VFS) modules are used in Samba for performing actions before an access to the file system of a share is made, e.g., a virus scanner which stores every infected file accessed in the share in quarantine or server-side implementation of recycle bin deletion of files.
de: Virtual File System (VFS)-Module werden in Samba verwendet, um Aktionen vor dem Zugriff auf das Dateisystem einer Freigabe auszuführen, z.B. ein Virenscanner, der jede infizierte Datei, auf die in der Freigabe zugegriffen wird, in einem Quarantänebereich ablegt oder eine serverseitige Implementierung einer Papierkorb-Löschung von Dateien.

source: Shares UMC module - Samba permissions tab
de: Freigaben UMC Modul - Reiter Samba-Rechte

source: *Samba permissions* tab (advanced settings)
de: Reiter *Samba-Rechte* (erweiterte Einstellungen)

source: Force user
de: Erzwungener Benutzer

source: This username and its permissions and primary group is used for performing all the file operations of accessing users. The username is only used once the user has established a connection to the Samba share by using their real username and password. A common username is useful for using data in a shared way, yet improper application might cause security problems.
de: Der Benutzername, mit dessen Namen, Rechten und primärer Gruppe alle Dateioperationen zugreifender Benutzer ausgeführt werden sollen. Der Benutzername wird erst verwendet, nachdem der Benutzer mit seinem tatsächlichen Benutzernamen und gültigem Passwort eine Verbindung zur Samba-Freigabe aufgebaut hat. Ein gemeinsamer Benutzername ist nützlich, um Dateien gemeinsam zu benutzen, kann bei falscher Anwendung aber Sicherheitsprobleme verursachen.

source: Force group
de: Erzwungene Gruppe

source: A group which is to be used by all users connecting with this share, as their primary group. Thereby, the permissions of this group automatically apply as the group permissions of all these users. A group registered here has a higher priority than a group which was assigned as the primary group of a user via the *Force user* entry field.
de: Eine Gruppe, die alle Benutzer, die sich mit dieser Freigabe verbinden, als primäre Gruppe verwenden sollen. Dadurch gelten die Rechte dieser Gruppe als Gruppenrechte für alle diese Benutzer. Eine hier eingetragene Gruppe hat Vorrang über eine Gruppe, die über das Eingabefeld *Erzwungener Benutzer* zur primären Gruppe eines Benutzers geworden ist.

source: If a ``+`` sign is prefixed to the group name, then the group is assigned as a primary group solely to those users which are already members of this group. All other users retain their primary groups.
de: Wird dem Gruppennamen ein Plus-Zeichen (``+``) vorangestellt, wird die Gruppe nur solchen Benutzern als primäre Gruppe zugeschrieben, die bereits Mitglied dieser Gruppe sind. Alle anderen Benutzer behalten ihre gewöhnliche primäre Gruppe.

source: Valid users or groups
de: Gültige Benutzer oder Gruppen

source: Names of users or groups which are authorized to access this Samba share. To all other users, access is denied. If the field is empty, all users may access the share - if necessary after entering a password. This option is useful for securing access to a share at file server level beyond the file permissions.
de: Namen von Benutzern oder Gruppen, die auf diese Samba-Freigabe zugreifen dürfen. Alle anderen Benutzern wird der Zugriff verweigert. Wenn das Feld leer ist, dürfen alle Benutzer - gegebenenfalls mit ihrem Passwort - auf die Freigabe zugreifen. Diese Option ist nützlich, um Zugriffe auf eine Freigabe über die Dateiberechtigungen hinaus auf Ebene des Fileservers abzusichern.

source: The entries are to be separated by spaces. The special characters ``@``, ``+`` and ``&`` can be used in connection with the group name for assigning certain permissions to the users of the stated group for accessing the Samba share:
de: Die Einträge sind durch Leerzeichen zu trennen. Durch die Zeichen ``@``, ``+`` und ``&`` in Verbindung mit einem Gruppennamen kann den Mitgliedern der angegebenen Gruppe die Berechtigung zum Zugriff auf die Samba-Freigabe erteilt werden:

source: A name beginning with the character ``@`` will first be interpreted as a NIS net-group. Should no NIS net-group of this name be found, the name will be considered as a UNIX group.
de: Ein Name, der mit ``@`` beginnt, wird zunächst als NIS-Netgroup interpretiert. Wenn keine NIS-Netgroup mit diesem Namen gefunden wird, wird der Name als UNIX-Gruppe angesehen.

source: A name beginning with the character ``+`` will be exclusively considered as a UNIX group, a name beginning with the character ``&`` will be exclusively considered as a NIS net-group.
de: Ein Name, der mit ``+`` beginnt, wird ausschließlich als UNIX-Gruppe aufgefasst, ein Name, der mit ``&`` beginnt, ausschließlich als NIS-Netgroup.

source: A name beginning with the characters ``+&``, will first be interpreted as a UNIX group. Should no UNIX group of this name be found, the name will be considered as a NIS net-group. The characters ``&+`` as the beginning of a name correspond to the character ``@``.
de: Ein Name, der mit ``+&`` beginnt, wird zunächst als UNIX-Gruppe interpretiert. Wenn keine UNIX-Gruppe mit diesem Namen gefunden wird, wird der Name als NIS-Netgroup betrachtet. Die Zeichen ``&+`` als Namensanfang entsprechen ``@``.

source: Invalid users or groups
de: Nicht erlaubte Benutzer oder Gruppen

source: The users or groups listed here cannot access the Samba share. The syntax is identical to the one for valid users. If a user or group is included in the list of valid users and unauthorized users, access is denied.
de: Die hier aufgeführten Benutzer oder Gruppen dürfen auf diese Samba-Freigabe nicht zugreifen. Die Syntax ist identisch zu den gültigen Benutzern. Wenn ein Benutzer oder eine Gruppe in der Liste der gültigen Benutzer und der nicht erlaubten Benutzer enthalten ist, so wird der Zugriff verweigert.

source: Restrict write access to these users/groups
de: Schreibberechtigung auf diese Benutzer/Gruppen beschränken

source: Only the users and groups listed here have write permission for the corresponding share.
de: Nur die aufgeführten Benutzer oder Gruppen erhalten Schreibrecht auf die Freigabe.

source: Allowed hosts/networks
de: Zugelassene Rechner/Netze

source: Names of computers which are authorized to access this Samba share. All other computers are denied access. In addition to computer names, it is also possible to specify IP or network addresses, e.g., ``192.0.2.0/255.255.255.0``.
de: Namen von Rechnern, die auf diese Samba-Freigabe zugreifen dürfen. Allen anderen Rechnern wird der Zugriff verweigert. Neben Rechnernamen können auch IP- oder Netzwerkadressen angegeben werden, z. B. ``192.0.2.0/255.255.255.0``.

source: Denied hosts/networks
de: Nicht zugelassene Rechner/Netze

source: The opposite to the authorized computers. If a computer appears in both lists, the computer is permitted to access the Samba share.
de: Das Gegenteil von den zugelassenen Rechnern. Sollte ein Rechner in beiden Listen auftauchen, so wird dem Rechner der Zugriff auf die Samba-Freigabe gestattet.

source: If this option is activated, Samba will try to show POSIX ACLs under Windows, and to adopt changes to the ACLs, which were performed under Windows, for the POSIX ACLs.
de: Ist diese Option aktiviert, versucht Samba, POSIX-ACLs unter Windows anzuzeigen und Änderungen an den ACLs, die unter Windows vorgenommen werden, in die POSIX-ACLs zu übernehmen.

source: If this option is not set, existing POSIX ACLs are effective but not shown under Windows, and consequently cannot be changed under Windows.
de: Wenn die Option nicht gesetzt ist, werden vorhandene POSIX-ACLs beachtet, aber nicht unter Windows angezeigt und können von dort nicht verändert werden.

source: Inherit ACLs
de: Ererbte ACLs

source: When activating this option, each file created in this share will inherit the ACL (Access Control List) of the directory where the file was created.
de: Bei Aktivierung dieser Option erbt jede in dieser Freigabe neu erzeugte Datei die ACL (Access Control List) des Verzeichnisses, in dem sie angelegt wird.

source: Create files/directories with the owner of the parent directory
de: Neue Dateien und Verzeichnisse erhalten den Besitzer des übergeordneten Verzeichnisses

source: When activating this option, each newly created file will not be assigned of the user who created the file, but to the owner of the superior directory instead.
de: Bei Aktivierung dieser Option wird jede neu erzeugte Datei dem Besitzer des übergeordneten Verzeichnis zugeordnet und nicht dem Benutzer, der die Datei erstellt hat.

source: Create files/directories with permissions of the parent directory
de: Neue Dateien und Verzeichnisse erhalten die Zugriffsrechte des übergeordneten Verzeichnisses

source: When activating this option, for each file or directory created in this share, the UNIX permissions of the superior directory will automatically be adopted.
de: Bei Aktivierung dieser Option werden für jede Datei oder jedes Verzeichnis, die in einer Freigabe neu erzeugt werden, automatisch die UNIX-Rechte des übergeordneten Verzeichnisses übernommen.

source: If a new file is created on a Samba server from a Windows client, the file permissions will be set in several steps:
de: Wenn von einem Windows-Rechner aus eine neue Datei auf einem Samba-Server angelegt wird, werden die Rechte der Datei in mehreren Schritten gesetzt:

source: First, only the DOS permissions are translated into UNIX permissions.
de: Zunächst werden die DOS-Rechte in Unix-Rechte übersetzt.

source: Then the permissions are filtered via the *Filemode*. UNIX permissions which are marked in *File mode*, are the only ones preserved. Permissions not set here, will be removed. Thus, the permissions have to be set as UNIX permissions and in *File mode* in order to be preserved.
de: Anschließend werden die Rechte durch den *Datei-Modus* gefiltert. Nur die Unix-Rechte, die im Datei-Modus markiert sind, bleiben erhalten. Rechte, die hier nicht gesetzt sind, werden entfernt. Die Rechte müssen also als Unix-Rechte und im Datei-Modus gesetzt sein, um erhalten zu bleiben.

source: In the next step, the permissions under *Force file mode* are added. As a result, the file will have all the permissions set after step 2 or under *Force file mode*. This means, permissions marked under *Force file mode* are set in any case.
de: Im nächsten Schritt werden die Rechte um die unter *Erzwinge Datei-Modus* gesetzten Rechte ergänzt. Als Ergebnis hat die Datei alle Rechte, die nach Schritt 2 oder unter *Erzwinge Datei-Modus* gesetzt sind. Rechte, die unter *Erzwinge Datei-Modus* markiert sind, werden also auf jeden Fall gesetzt.

source: Accordingly, a newly created directory will initially be assigned the same permissions as that which are set as UNIX permissions and in *Directory mode* at the same time. Then these permissions are completed by those marked under *Force directory mode*.
de: Entsprechend erhält ein neu angelegtes Verzeichnis zunächst die Rechte, die sowohl als Unix-Rechte als auch im *Verzeichnis-Modus* gesetzt sind. Danach werden die Rechte ergänzt, die unter *Erzwinge Verzeichnis-Modus* markiert sind.

source: In a similar way, the security settings are adopted for existing files and directories the permissions of which are edited under Windows:
de: In ähnlicher Weise werden die Sicherheitseinstellungen auf bestehende Dateien und Verzeichnisse angewandt, deren Rechte unter Windows bearbeitet werden:

source: Only those permissions can be changed under Windows, which are marked in *Security mode* or in *Directory security mode*. Once this is done, the permissions marked under *Force security mode* or under *Force directory security mode* are set in any case.
de: Ausschließlich Rechte, die im *Sicherheits-Modus* oder *Sicherheits-Verzeichnis-Modus* markiert sind, können von Windows aus verändert werden. Anschließend werden die Rechte, die unter *Erzwinge Sicherheits-Modus* oder *Erzwinge Sicherheits-Verzeichnis-Modus* markiert sind, auf jeden Fall gesetzt.

source: Thus, the parameters *File mode* and *Force file mode*, or *Directory mode* and *Force directory mode* are applied during the creation of a file or directory, while the parameters *Security mode* and *Force Security Mode* or *Security directory mode* and *Force security directory mode* are applied when changing permissions.
de: Die Parameter *Datei-Modus* und *Erzwinge Datei-Modus* oder *Verzeichnis-Modus* und *Erzwinge Verzeichnis-Modus* finden also beim Anlegen einer Datei oder eines Verzeichnisses Anwendung, die Parameter *Sicherheits-Modus* und *Erzwinge Sicherheits-Modus* oder *Sicherheits-Verzeichnis-Modus* und *Erzwinge Sicherheits-Verzeichnis-Modus* beim Ändern der Rechte.

source: The security settings only relate to the access via Samba.
de: Es ist zu beachten, dass sich die Sicherheitseinstellungen nur auf den Zugriff über Samba beziehen.

source: The user on the Windows side does not receive any notification of the fact that the file or directory authorizations might by changed according to the Samba settings on this tab.
de: Der Benutzer auf Windows-Seite erhält keinen Hinweis, dass die Datei- oder Verzeichnisrechte gegebenenfalls entsprechend den Samba-Einstellungen auf dieser Karteikarte verändert werden.

source: Shares UMC module - Samba extended permissions tab
de: Freigaben UMC Modul - Reiter erweiterte Samba-Rechte

source: *Samba extended permissions* tab (advanced settings)
de: Reiter *Erweiterte Samba-Rechte* (erweiterte Einstellungen)

source: File mode
de: Datei-Modus

source: The permissions Samba is to adopt when creating a file, provided they are set under Windows.
de: Die Rechte, die Samba beim Anlegen einer Datei übernehmen soll, sofern sie unter Windows gesetzt sind.

source: Directory mode
de: Verzeichnis-Modus

source: The permissions Samba is to adopt when creating a directory, provided they are set under Windows.
de: Die Rechte, die Samba beim Anlegen eines Verzeichnisses übernehmen soll, sofern sie unter Windows gesetzt sind.

source: Force file mode
de: Erzwinge Datei-Modus

source: The permissions Samba is to set in any case when creating a file, irrespective of whether they are set under Windows or not.
de: Die Rechte, die Samba beim Anlegen einer Datei auf jeden Fall setzen soll, also unabhängig davon, ob sie unter Windows gesetzt wurden oder nicht.

source: Force directory mode
de: Erzwinge Verzeichnis-Modus

source: The permissions Samba is to set in any case when creating a directory, irrespective of whether they are set under Windows or not.
de: Die Rechte, die Samba beim Anlegen eines Verzeichnisses auf jeden Fall setzen soll, also unabhängig davon, ob sie unter Windows gesetzt wurden oder nicht.

source: Security mode
de: Sicherheitsmodus

source: The file permissions to which Samba is to permit changes made from Windows side.
de: Die Dateirechte, an denen Samba Änderungen von Windows-Seite aus zulassen soll.

source: Directory security mode
de: Verzeichnis Sicherheitsmodus

source: The directory authorizations to which Samba is to permit changes made from Windows side.
de: Die Verzeichnisrechte, an denen Samba Änderungen von Windows-Seite aus zulassen soll.

source: Force security mode
de: Erzwinge Sicherheitsmodus

source: The permissions Samba is to set in any case (irrespective of whether they are set under Windows or not), if file permissions are changed from Windows side.
de: Die Rechte, die Samba auf jeden Fall setzen soll (unabhängig davon, ob die Rechte unter Windows gesetzt wurden oder nicht), wenn die Rechte einer Datei von Windows-Seite aus geändert werden.

source: Force directory security mode
de: Erzwinge Verzeichnis Sicherheitsmodus
