Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/shares.po
Languages: de

source: The permissions Samba is to set in any case if directory permissions are changed from Windows side (irrespective of whether they are set under Windows or not).
de: Die Rechte, die Samba auf jeden Fall setzen soll, wenn die Rechte eines Verzeichnisses von Windows-Seite aus geändert werden (unabhängig davon, ob die Rechte unter Windows gesetzt wurden oder nicht).

source: Shares UMC module - Samba options tab
de: Freigaben UMC Modul - Reiter Samba-Optionen

source: *Samba options* tab (advanced settings)
de: Reiter *Samba-Optionen* (erweiterte Einstellungen)

source: Locking means preventing concurrent access to a file, making an exclusive access possible. When activating this checkbox, Samba will lock the access to files on the client's request.
de: Unter *Locking* versteht man das Sperren konkurrierender Zugriffe auf eine Datei. Bei Aktivierung dieses Auswahlkästchens sperrt Samba auf Client-Anfrage den Zugriff auf Dateien.

source: Deactivating this option can be useful for improving performance, yet it should generally not be set in shares with write access, since without locking, files might be corrupted due to concurrent access.
de: Das Deaktivieren von *Locking* kann nützlich sein, um die Performance zu erhöhen, sollte jedoch auf Freigaben mit Schreibzugriff grundsätzlich nicht gesetzt werden, weil Dateien bei konkurrierenden Schreibzugriffen ohne Locking korrumpiert werden können.

source: Clients can send a lock request with a time limit for a certain area of an open file.
de: Clients können eine Lock-Anfrage mit einem Zeitlimit für einen Bereich einer geöffneten Datei senden.

source: In case Samba is unable to comply with a the lock request, and this option is activated, then Samba will - in periodical intervals until the expiry of the time limit - try to lock the requested file area. If the option is deactivated, no further attempt will be made.
de: Kann Samba einer Lock-Anfrage nicht entsprechen und ist diese Option aktiviert, so versucht Samba bis zum Ablauf des Zeitlimits periodisch den angefragten Dateibereich zu sperren. Ist die Option deaktiviert, wird kein weiterer Versuch unternommen.

source: If this option is activated, Samba will with each read or write access check if the file is locked, and will deny access if required. On some systems, this procedure can take a long time.
de: Ist diese Option aktiviert, prüft Samba bei jedem Lese- und Schreibzugriff, ob die Datei gesperrt ist und verweigert gegebenenfalls den Zugriff. Auf einigen Systemen kann dies lange dauern.

source: If this option is deactivated, Samba will check if the file is locked on the client's request exclusively. Well configured clients ask for a check in all important cases, so that this option is usually unnecessary.
de: Ist die Option deaktiviert, prüft Samba nur auf Client-Anfrage, ob eine Datei gesperrt ist. Gut konfigurierte Clients bitten in allen wichtigen Fällen um eine Prüfung, so dass diese Option im Regelfall nicht notwendig ist.

source: If this option is activated, Samba will use so-called *opportunistic locks*. This can improve the speed of file access considerably. However, the option permits clients local caching of files on a large scale. In unreliable networks it might therefore be necessary to do without Oplocks.
de: Wird diese Option aktiviert, verwendet Samba so genannte *opportunistic locks*. Dies kann die Zugriffsgeschwindigkeit auf Dateien deutlich erhöhen. Allerdings erlaubt die Option Clients Dateien in großem Umfang lokal zwischenzuspeichern. Deswegen kann es in unzuverlässigen Netzwerken nötig sein, auf Oplocks zu verzichten.

source: When activating this option, Samba will support an extended form of Oplocks, the so-called *opportunistic read-only locks* or *Level 2 Oplocks*. Windows clients receiving a read/write Oplock for a file can then scale down this Oplock to a read-only Oplock instead of having to abandon the Oplock completely as soon as a second client opens the file. All clients supporting Level 2 Oplocks, will then cache read access processes to the file exclusively. Should one of the clients write to the file, all the other clients will be asked to abandon their Oplocks, and to empty their caches.
de: Bei Aktivierung dieser Option unterstützt Samba eine erweiterte Form der Oplocks, sogenannte *opportunistic read-only locks* oder auch Level-2-Oplocks. Windows-Clients, die ein Lesen-Schreiben-Oplock auf eine Datei halten, können dieses Oplock dann zu einem Nur-Lesen-Oplock herunterstufen anstatt das Oplock ganz aufgeben zu müssen, sobald ein zweiter Client die Datei öffnet. Alle Clients, die Level-2-Oplocks unterstützen, speichern dann nur Lesezugriffe auf die Datei zwischen. Wenn einer der Clients in die Datei schreibt, werden alle anderen Clients benachrichtigt, ihre Oplocks aufzugeben und ihre Zwischenspeicher zu löschen.

source: It is recommended to activate this option to speed up access to files which are normally not written to (e.g. programs / executable files).
de: Es wird empfohlen, diese Option zu aktivieren, um den Zugriff auf Dateien, die normalerweise nicht geschrieben werden (z.B. Programme/ausführbare Dateien) zu beschleunigen.

source: If kernel Oplocks are supported, Level 2 Oplocks will not be allowed, even if the option is activated. Only if the checkbox *Oplocks* is also ticked, this option will become valid.
de: Wenn Kernel-Oplocks unterstützt werden, werden Level-2-Oplocks nicht bewilligt, selbst wenn die Option aktiviert ist. Die Option ist nur wirksam, wenn das Auswahlkästchen *Oplocks* ebenfalls markiert ist.

source: When activating this option, Samba will allow all Oplock requests irrespective of the number of clients having access to a file. This method considerably improves performance, and is useful for shares which can only be accessed for reading (e.g. CD-ROMs), or where it is ensured that there can never occur a situation when several clients make access at the same time.
de: Bei Aktivierung dieser Option bewilligt Samba alle Oplock-Anfragen unabhängig von der Anzahl auf eine Datei zugreifender Clients. Dies verbessert die Performance deutlich und ist sinnvoll bei Freigaben, auf die nur lesend zugegriffen werden kann (z.B. CD-ROMs) oder bei denen sichergestellt ist, dass niemals mehrere Clients gleichzeitig auf sie zugreifen können.

source: If it cannot be excluded that several clients make reading and writing access to a file at the same time, this option should not be activated, since it may cause data loss.
de: Wenn nicht ausgeschlossen werden kann, dass mehrere Clients lesend und schreibend auf eine Datei zugreifen, sollte die Option nicht aktiviert werden, weil es sonst zu Datenverlusten kommen kann.

source: Block size
de: Blockgröße

source: The block size in bytes in which unoccupied disk space is to be reported to the clients. By default, this size is defined as 1024 bytes.
de: Die Blockgröße in Byte, in der freier Festplattenplatz an Clients gemeldet werden soll. Standardmäßig beträgt sie 1024 Byte.

source: Client-side caching policy
de: Richtlinie für das Caching beim Client

source: This option specifies in which way the clients are to cache the files of this share offline. The available alternatives are ``manua``, ``documents``, ``programs``, and ``disable``.
de: Konfiguriert, auf welche Weise Clients Dateien aus dieser Freigabe offline zwischenspeichern sollen. Zur Wahl stehen ``manuell``, ``Dokumente``, ``Programme`` und ``deaktiviert``.

source: Hide files
de: Verstecke Dateien

source: Files and directories to be accessed under Windows, yet not to be visible. Such files or directories are assigned the DOS attribute *hidden*.
de: Dateien und Verzeichnisse, die unter Windows nicht sichtbar sein sollen. Die Dateien oder Verzeichnisse erhalten das Datei-Attribut *hidden*.

source: When entering the names of files and directories, upper and lower case letters are to be differentiated. Each entry is to be separated from the next by a slash. Since the slash can thus not be used for structuring path names, the input of path names is not possible. All files and directories of this name within the share will be hidden. The names may include spaces and the wildcards ``*`` and ``?``.
de: Datei- und Verzeichnisnamen müssen unter Beachtung von Groß- und Kleinschreibung angegeben werden. Die einzelnen Einträge sind durch Schrägstriche zu trennen. Da der Schrägstrich nicht als Verzeichnistrenner eingegeben werden kann, dürfen nur Namen, aber keine Pfade eingetragen werden. Alle Dateien und Verzeichnisse mit diesen Namen innerhalb der Freigabe werden dann versteckt. Die Namen dürfen Leerzeichen und die Platzhalter ``*`` und ``?`` enthalten.

source: As an example, ``/.*/test/`` hides all files and directories the names of which begin with a *dot*, or which are called *test*.
de: Zum Beispiel versteckt ``/.*/test/`` alle Dateien und Verzeichnisse, die mit einem *Punkt* beginnen oder *test* heißen.

source: Entries in this field have an impact on the speed of Samba since every time particular contents of the share are to be displayed, all files and directories have to be checked according to the active filters.
de: Einträge in diesem Feld beeinflussen die Geschwindigkeit von Samba, da vor Anzeige von Freigabeinhalten alle Dateien und Verzeichnisse auf Übereinstimmung mit den gesetzten Filtern geprüft werden müssen.

source: Postexec script
de: Postexec-Skript

source: A script or command which is to be executed on the server if the connection to this share is finished.
de: Ein Skript oder ein Befehl, der auf dem Server ausgeführt werden soll, wenn die Verbindung zu dieser Freigabe beendet wird.

source: Preexec script
de: Preexec-Skript

source: A script or command which is to be executed on the server each time a connection to this share is established.
de: Ein Skript oder ein Befehl, der auf dem Server bei jeder Verbindungsaufnahme zu dieser Freigabe ausgeführt werden soll.

source: Shares UMC module - Samba custom settings tab
de: Freigaben UMC Modul - Reiter Samba-Erweiterte-Einstellungen

source: *Samba custom settings* tab (advanced settings)
de: Reiter *Samba-Erweiterte-Einstellungen* (erweiterte Einstellungen)

source: Custom share settings
de: Erweiterte Einstellungen für Freigaben

source: Apart from the properties which can, as a standard feature, be configured in a Samba share, this setting makes it possible to define further arbitrary Samba settings within the share. A list of available options can be obtained by the command :command:`man smb.conf`. In *Key* the name of the option is to be entered, and in the *Value* field the value to be set. Double entries of configuration options are not checked.
de: Neben den standardmäßig konfigurierbaren Eigenschaften einer Samba-Freigabe ermöglicht diese Einstellung beliebige weitere Samba-Einstellungen an einer Freigabe zu setzen. Eine Liste der verfügbaren Optionen kann mit dem Befehl :command:`man smb.conf` abgerufen werden. Unter *Schlüssel* ist der Name der Option anzugeben und unter *Value* der zu setzende Wert. Doppelt angegebene Konfigurationsoptionen werden nicht überprüft.

source: The definition of extended Samba settings is only necessary in very special cases. The options should be thoroughly checked since they might have security-relevant effects.
de: Das Setzen erweiterter Samba-Einstellungen ist nur in Sonderfällen nötig. Die Optionen sollten vor dem Setzen gründlich geprüft werden, da sie unter Umständen sicherheitsrelevante Auswirkungen haben können.

source: Shares UMC module - NFS custom settings tab
de: Freigaben UMC Modul - Reiter Erweiterte NFS-Einstellungen

source: *NFS custom settings* tab (advanced settings)
de: Reiter *Erweiterte NFS-Einstellungen* (erweiterte Einstellungen)

source: Custom NFS share settings
de: Erweiterte NFS-Einstellungen für Freigaben

source: Apart from the properties in the *NFS* tab, this setting makes it possible to define further arbitrary NFS settings for the share. A list of available options can be obtained by the command :command:`man 5 exports`. Double entries of configuration options are not checked.
de: Neben den im Reiter *NFS* konfigurierbaren Eigenschaften einer NFS-Freigabe ermöglicht diese Einstellung beliebige weitere NFS-Einstellungen an einer Freigabe zu setzen. Eine Liste der verfügbaren Optionen kann mit dem Befehl :command:`man 5 exports` abgerufen werden. Doppelt angegebene Konfigurationsoptionen werden nicht überprüft.

source: The definition of extended NFS settings is only necessary in special cases. The options should be thoroughly checked since they might have security-relevant effects.
de: Das Setzen erweiterter NFS-Einstellungen ist nur in Sonderfällen nötig. Die Optionen sollten vor dem Setzen gründlich geprüft werden, da sie unter Umständen sicherheitsrelevante Auswirkungen haben können.

source: Shares UMC module - Options tab
de: Freigaben UMC Modul - Reiter Optionen

source: *(Options)* tab
de: Reiter *(Optionen)*

source: Export for Samba clients
de: Für Samba-Clients exportieren

source: This option defines whether the share is to be exported for Samba clients.
de: Diese Option legt fest, ob die Freigabe für Samba-Clients exportiert werden soll.

source: Export for NFS clients
de: Für NFS-Clients exportieren

source: This option defines whether the share is to be exported for NFS clients.
de: Diese Option legt fest, ob die Freigabe für NFS-Clients exportiert werden soll.
