Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/software.po
Languages: de

source: The software deployment integrated in UCS offers extensive possibilities for the rollout and updating of UCS installations. Security and version updates can be installed via the UMC module :guilabel:`Software update`, a command line tool or based on policies. This is described in the section :ref:`software-ucs-updates`. The UCS software deployment does not support the updating of Microsoft Windows systems. An additional Windows software distribution is required for this.
de: Die in UCS integrierte Softwareverteilung bietet umfangreiche Möglichkeiten für den Rollout und die Aktualisierung von UCS-Installationen. Sicherheits- und Versionsupdates können über das UMC-Modul :guilabel:`Software-Aktualisierung`, über ein Kommandozeilen-Tool und richtliniengesteuert installiert werden. Dies wird in :ref:`software-ucs-updates` beschrieben. Die UCS-Softwareverteilung unterstützt nicht die Aktualisierung von Microsoft Windows-Systemen. Hierfür ist eine zusätzliche Windows-Softwareverteilung nötig.

source: For larger installations, there is the possibility of establishing a local repository server from which all further updates can be performed, see :ref:`software-config-repo`.
de: Für größere Installationen besteht die Möglichkeit, einen lokalen Repository-Server einzurichten, von dem aus alle weiteren Aktualisierungen durchgeführt werden (siehe :ref:`software-config-repo`).

source: The UCS software deployment is based on the underlying Debian package management tools, which are expanded through UCS-specific tools. The different tools for the installation of software are introduced in :ref:`computers-softwaremanagement-install-software`. The installation of version and errata updates can be automated via policies, see :ref:`computers-softwaremanagement-maintenance-policy`.
de: Die UCS-Softwareverteilung basiert auf den unterliegenden Debian-Paketmanagement-Tools, wird aber durch UCS-spezifische Werkzeuge ergänzt. Die verschiedenen Werkzeuge zur Installation von Software werden in :ref:`computers-softwaremanagement-install-software` vorgestellt. Die Installation von Versions- und Sicherheitsupdates kann über Richtlinien automatisiert werden, siehe :ref:`computers-softwaremanagement-maintenance-policy`.

source: The software monitor provides a tool with which all package installations statuses can be centrally stored in a database, see :ref:`computers-software-monitor`.
de: Mit dem Software-Monitor steht ein Werkzeug zur Verfügung, mit dem alle Paketinstallationsstände zentral in einer Datenbank erfasst werden, siehe :ref:`computers-software-monitor`.

source: The initial installation of UCS systems is not covered in this chapter, but is documented in :ref:`installation-chapter` instead.
de: Die Erstinstallation von UCS-Systemen ist nicht Bestandteil dieses Kapitels, sie wird stattdessen in :ref:`installation-chapter` beschrieben.

source: Specification of an update point using the package maintenance policy
de: Festlegung eines Aktualisierungszeitpunkts mit der Paketpflege-Richtlinie

source: A *Maintenance* policy (see :ref:`central-policies`) in the UMC modules for computer and domain management can be used to specify a point at which the following steps should be performed:
de: Mit einer :guilabel:`Paketpflege`-Richtlinie (siehe auch :ref:`central-policies`) in den UMC-Modulen zur Rechner- und Domänenverwaltung kann ein Zeitpunkt vorgegeben werden, an dem die folgenden Schritte durchgeführt werden:

source: Check for available release updates to be installed (see :ref:`computers-softwaremanagement-release-policy`) and, if applicable, installation.
de: Prüfung auf verfügbare und zu installierende Release-Updates (siehe :ref:`computers-softwaremanagement-release-policy`) und ggf. Installation

source: Installation/deinstallation of package lists (see :ref:`computers-softwaremanagement-package-lists`)
de: Installation/Deinstallation von Paketlisten (siehe :ref:`computers-softwaremanagement-package-lists`)

source: Installation of available errata updates
de: Installation verfügbarer Errata-Updates

source: Alternatively, the updates can also be performed when the system is booting or shut down.
de: Alternativ können die Aktualisierungen auch beim Systemstart oder beim Herunterfahren des Systems erfolgen.

source: Perform maintenance after system startup
de: Paketpflege durchführen nach Hochfahren des Systems

source: If this option is activated, the update steps are performed when the computer is started up.
de: Falls diese Option aktiviert ist, werden die Aktualisierungsschritte während des Startvorgangs des Rechners durchgeführt.

source: Perform maintenance before system shutdown
de: Paketpflege durchführen vor Herunterfahren des Systems

source: If this option is activated, the update steps are performed when the computer is shut down.
de: Falls diese Option aktiviert ist, werden die Aktualisierungsschritte beim Herunterfahren des Rechners durchgeführt.

source: Use Cron settings
de: Cron Einstellung benutzen

source: If this flag is activated, the fields *Month*, *Day of week*, *Day*, *Hour* and *Minute* can be used to specify an exact time when the update steps should be performed.
de: Wird dieses Feld aktiviert, kann über die Felder *Monat*, *Wochentag*, *Tag*, *Stunde* und *Minute* ein genauer Zeitpunkt angegeben werden, an dem die Aktualisierungsschritte durchgeführt werden sollen.

source: Reboot after maintenance
de: Nach Paketpflege neu starten

source: This option allows you to perform an automatic system restart after release updates either directly or after a specified time period of hours.
de: Diese Option ermöglicht es, nach Release-Aktualisierungen optional einen automatischen Neustart des Systems durchzuführen, entweder direkt oder nach dem angegebenen Zeitintervall in Stunden.

source: Configuration of the repository server for updates and package installations
de: Konfiguration des Repository-Servers für Updates und Paketinstallationen

source: Package installations and updates can either be performed from the Univention update server or from a locally maintained repository. A local repository is practical if there are a lot of UCS systems to update as the updates only need to be downloaded once in this case. As repositories can also be updated offline, a local repository also allows the updating of UCS environments without internet access.
de: Paketinstallationen und Updates können entweder vom Univention-Update-Server oder von einem lokal gepflegten Repository durchgeführt werden. Ein lokales Repository ist sinnvoll, wenn viele UCS-Systeme zu aktualisieren sind, da Updates in diesem Fall nur einmalig heruntergeladen werden müssen. Da Repositorys auch offline aktualisiert werden können, ermöglicht ein lokales Repository auch die Aktualisierung von UCS-Umgebungen ohne Internetanbindung.

source: A local repository can require a lot of disk space.
de: Ein lokales Repository kann viel Plattenplatz in Anspruch nehmen.

source: Using the registered settings, APT package sources are automatically generated in the :file:`/etc/apt/sources.list.d/` directory for release and errata updates as well as add-on components. If further repositories are required on a system, these can be entered in the :file:`/etc/apt/sources.list` file.
de: Anhand der registrierten Einstellungen werden APT-Paketquellen für Release- und Errata-Updates sowie Addon-Komponenten im Verzeichnis :file:`/etc/apt/sources.list.d/` automatisch generiert. Sollten auf einem System weitere Repositorys benötigt werden, können diese in die Datei :file:`/etc/apt/sources.list` eingetragen werden.

source: By default the Univention repository ``updates.software-univention.de`` is used for a new installation.
de: Bei einer Neuinstallation wird in der Grundeinstellung das Univention-Repository ``updates.software-univention.de`` verwendet.

source: The Univention repository contains all packages provided by Univention and Debian. A distinction is made between maintained and unmaintained packages.
de: Das Univention Repository enthält alle von Univention und Debian bereitgestellten Pakete. Dabei wird zwischen maintained und unmaintained Paketen unterschieden.

source: All packages in the standard package scope are in *maintained* status. Security updates are provided in a timely manner only for *maintained* packages. The list of *maintained* packages can be viewed on a UCS system in :file:`univention-errata-level/maintained-packages.txt`.
de: Alle Pakete im Standard-Paketumfang befinden sich im Status *maintained*. Sicherheitsupdates werden zeitnah nur für *maintained* Pakete bereitgestellt. Die Liste der *maintained* Pakete ist auf einem UCS System unter :file:`/usr/share/univention-errata-level/maintained-packages.txt` einsehbar.

source: *unmaintained* packages are not covered by security updates or other maintenance. To check if *unmaintained* packages are installed, the command :command:`univention-list-installed-unmaintained-packages` can be executed.
de: *unmaintained* Pakete sind nicht durch Sicherheitsupdates oder anderweitige Maintenance abgedeckt. Um zu prüfen ob *unmaintained* Pakete installiert sind, kann das Kommando :command:`univention-list-installed-unmaintained-packages` ausgeführt werden.

source: For additional repositories the installation of *unmaintained* packages is not possible by default. To enable installation, the |UCSUCRV| :envvar:`repository/online/component/.*/unmaintained` must be set to ``yes``.
de: Für zusätzliche eingebundene Repositories ist die Installation von *unmaintained* Paketen standardmäßig nicht möglich. Um die Installation zu ermöglichen, muss die |UCSUCRV| :envvar:`repository/online/component/.*/unmaintained` auf ``yes`` gesetzt werden.

source: Configuration via |UCSUMC| module
de: Konfiguration über |UCSUMC| Modul

source: The :guilabel:`Repository server` can be specified in the UMC module :guilabel:`Repository Settings`.
de: Im UMC-Modul :guilabel:`Repository-Einstellungen` kann der :guilabel:`Repository-Server` festgelegt werden.

source: Configuration via Univention Configuration Registry
de: Konfiguration über Univention Configuration Registry

source: The repository server to be used can be entered in the |UCSUCRV| :envvar:`repository/online/server` and is preset to ``updates.software-univention.de`` for a new installation.
de: Der zu verwendende Repository-Server wird in die |UCSUCRV| :envvar:`repository/online/server` eingetragen und ist bei einer Neuinstallation auf ``updates.software-univention.de`` voreingestellt.

source: Policy-based configuration of the repository server
de: Richtlinienbasierte Konfiguration des Repository-Servers

source: The repository server to be used can also be specified using the *Repository server* policy in the |UCSUMC| module :guilabel:`Computers`. Only UCS server systems for which a DNS entry has been configured are shown in the selection field (see :ref:`central-policies`).
de: Der zu verwendende Repository-Server kann auch über die Richtlinie *Repository-Server* im |UCSUMC|\ -Modul :guilabel:`Rechner` festgelegt werden. In dem Auswahlfeld werden UCS-Server-Systeme angezeigt, für die ein DNS-Eintrag hinterlegt ist (siehe auch :ref:`central-policies`).

source: Creating and updating a local repository
de: Einrichtung und Aktualisierung eines lokalen Repositorys

source: The local repository can be activated/deactivated using the |UCSUCRV| :envvar:`local/repository`.
de: Durch die |UCSUCRV| :envvar:`local/repository` kann das lokale Repository aktiviert/deaktiviert werden.

source: There is also the possibility of synchronizing local repositories, which means, for example, a main repository is maintained at the company headquarters and then synchronized to local repositories at the individual locations.
de: Es besteht auch die Möglichkeit lokale Repositorys zu synchronisieren, so dass beispielsweise in der Firmenzentrale ein Haupt-Repository gepflegt wird, das dann in lokale Repositorys der einzelnen Standorte synchronisiert wird.

source: To set up a repository, the :command:`univention-repository-create` command must be run as the ``root`` user.
de: Um ein Repository einzurichten, muss der Befehl :command:`univention-repository-create` als Benutzer ``root`` aufgerufen werden.

source: The packages in the repository can be updated using the :command:`univention-repository-update` tool. With :command:`univention-repository-update net` the repository is synchronized with another specified repository server. This is defined in the |UCSUCRV| :envvar:`repository/mirror/server` and typically points to ``updates.software-univention.de``.
de: Mit dem Tool :command:`univention-repository-update` werden die Pakete im Repository aktualisiert. Mit :command:`univention-repository-update net` wird das Repository mit einem angegebenen anderen Repository-Server synchronisiert. Dieser ist in der |UCSUCRV| :envvar:`repository/mirror/server` definiert (typischerweise ``updates.software-univention.de``).

source: An overview of the possible options is displayed with the following command:
de: Eine Übersicht über die möglichen Optionen kann mit folgendem Befehl aufgerufen werden:

source: The repository is stored in the :file:`/var/lib/univention-repository/mirror/` directory.
de: Das Repository wird im Verzeichnis :file:`/var/lib/univention-repository/mirror/` vorgehalten.

source: Central monitoring of software installation statuses with the software monitor
de: Zentrale Überwachung von Softwareinstallationsständen mit dem Software-Monitor

source: The software monitor is a database in which information is stored concerning the software packages installed across all UCS systems. This database offers an administrator an overview of which release and package versions are installed in the domain and offers information for the step-by-step updating of a UCS domain and for use in identifying problems.
de: Der Software-Monitor ist eine Datenbank, in der Informationen über die auf UCS-Systemen installierten Softwarepakete aufgezeichnet werden. Durch diese Datenbank kann sich ein Administrator einen Überblick verschaffen, welche Release- und Paketversionen auf den Systemen der Domäne installiert sind und diese Informationen bei der schrittweisen Aktualisierung einer UCS-Domäne nutzen und Installations-Probleme erkennen.

source: The software monitor can be installed from the Univention App Center with the application :program:`Software installation monitor`. Alternatively, the software package :program:`univention-pkgdb` can be installed. Additional information can be found in :ref:`computers-softwaremanagement-install-software`.
de: Der Software-Monitor kann mit der Applikation *Software-Installationsmonitor* aus dem Univention App Center installiert werden. Alternativ kann das Softwarepaket :program:`univention-pkgdb` installiert werden. Weitere Informationen finden sich in :ref:`computers-softwaremanagement-install-software`.

source: UCS systems update their entries automatically when software is installed, uninstalled or updated. The system on which the software monitor is operated is located by the DNS service record ``_pkgdb._tcp``.
de: UCS-Systeme aktualisieren ihre Einträge bei der Installation, Entfernung und Aktualisierung von Software automatisch. Das System, auf dem der Software-Monitor betrieben wird, wird dabei durch den DNS-Service-Record ``_pkgdb._tcp`` lokalisiert.

source: The software monitor brings its own UMC module :guilabel:`Software monitor`. The following functions are available:
de: Der Software-Monitor bringt sein eigenes UMC-Modul :guilabel:`Software-Monitor` mit. Folgende Funktionen stehen zur Verfügung:

source: Systems
de: Systeme

source: allows to search for the version numbers of installed systems. It is possible to search for system names, UCS versions and system roles.
de: erlaubt die Suche nach den installierten Versionsständen von UCS-Systemen. Es kann nach Systemnamen, UCS-Versionen und Systemrollen gesucht werden.

source: Packages
de: Pakete

source: allows to search in the installation data tracked by the package status database. Besides searching for a *Package name* there are various search possibilities available for the installation status of packages:
de: ermöglicht die Suche in den von der Paketstatusdatenbank erfassten Installationsdaten. Neben der Suche nach *Paketnamen* gibt es auch die folgenden Suchmöglichkeiten zu den Installationszuständen von Paketen:

source: Selection state
de: Auswahlstatus

source: The *selection state* influences the action taken when updating a package. ``Install`` is used to select a package for installation. If a package is configured to ``Hold`` it will be excluded from further updates. There are two possibilities for uninstalling a package: A package removed with ``DeInstall`` keeps locally created configuration data, whilst a package removed with ``Purge`` is completely deleted.
de: Der *Auswahlstatus* beeinflusst das Verhalten bei der Aktualisierung eines Pakets. Durch ``Install`` wird ein Paket zur Installation ausgewählt. Ist ein Paket auf ``Hold`` konfiguriert, so wird es von weiterer Aktualisierung ausgenommen. Es existieren zwei Möglichkeiten ein Paket zu deinstallieren: Ein mit ``DeInstall`` entferntes Paket hält lokal erzeugte Konfigurations-Daten weiterhin vor, während ein mit ``Purge`` entferntes Paket komplett gelöscht wird.

source: Installation state
de: Installationsstatus

source: The *installation state* describes the status of an installed package in relation to upcoming updates. The normal status is ``Ok``, which leads to a package being updated when a newer version exists. If a package is configured to ``Hold`` it will be excluded from the update.
de: Der *Installationsstatus* beschreibt den Status eines installierten Pakets im Hinblick auf kommende Aktualisierungen. Der Normalfall ist ``Ok``, was dazu führt, dass ein Paket bei Vorhandensein einer aktuelleren Version aktualisiert würde. Ist ein Paket auf ``Hold`` konfiguriert, so wird es von der Aktualisierung ausgenommen.

source: Package state
de: Paketstatus

source: The *package state* describes the status of a setup package. The normal status here is ``Installed`` for installed packages and ``ConfigFiles`` for removed packages. All other statuses appear when the package's installation was canceled in different phases.
de: Der *Paketstatus* beschreibt den Zustand eines eingerichteten Pakets. Der Normalfall ist ``Installed`` für installierte und ``ConfigFiles`` für entfernte Pakete, alle übrigen Zustände entstehen, wenn die Installation des Pakets in verschiedenen Phasen abgebrochen wurde.

source: Searching for packages in the software monitor
de: Suche nach Paketen im Software-Monitor

source: If you do not wish UCS systems to store installation processes in the software monitor (e.g., when there is no network connection to the database), this can be arranged by setting the |UCSUCRV| :envvar:`pkgdb/scan` to ``no``.
de: Wenn verhindert werden soll, dass UCS-Systeme Installationsvorgänge im Software-Monitor aufzeichnen, etwa weil keine Netzwerkverbindung zur Datenbank besteht, kann dies durch Setzen der |UCSUCRV| :envvar:`pkgdb/scan` auf ``no`` abgeschaltet werden.

source: Should storing be reactivated at a later date, the command :command:`univention-pkgdb-scan` must be executed to ensure that package versions installed in the meanwhile are also adopted in the database.
de: Wenn die Aufzeichnungen danach wieder aktiviert werden, muss das Kommando :command:`univention-pkgdb-scan` ausgeführt werden, damit die in der Zwischenzeit installierten Paketversionen in die Datenbank übernommen werden.

source: The following command can be used to remove a system's program inventory from the database again:
de: Mit dem folgenden Befehl kann der Programmbestand eines Systems wieder aus der Datenbank entfernt werden:

source: Differentiation of update variants / UCS versions
de: Unterscheidung der Update-Varianten / Aufbau der UCS-Versionen

source: Four types of UCS updates are differentiated:
de: Vier Arten von UCS-Updates werden unterschieden:

source: *Major releases* appear approximately every three to four years. Major releases can differ significantly from previous major releases in terms of their scope of services, functioning and the software they contain.
de: *Major Releases* erscheinen ca. alle drei bis vier Jahre. Major Releases können sich von vorhergehenden Major Releases signifikant hinsichtlich ihres Leistungsumfangs, ihrer Funktionsweise und der darin enthaltenen Software unterscheiden.

source: During the maintenance period of a major release, *minor releases* are released approximately every 10-12 months. These updates include corrections to recently identified errors and the expansion of the product with additional features. At the same time and as far as this is possible, the minor releases are compatible with the previous versions in terms of their functioning, interfaces and operation. Should a change in behavior prove practical or unavoidable, this will be noted in the release notes when the new version is published.
de: Während der Wartungsdauer eines Major Releases erscheinen *Minor Releases* in einem Rhythmus von ca. 10-12 Monaten. Diese Updates beinhalten die Behebung neu bekannt gewordener Fehler, sowie die Ergänzung des Produkts um zusätzliche Funktionen. Dabei erhalten Minor Releases so weit wie möglich die Kompatibilität zu vorhergehenden Versionen hinsichtlich Funktionsweise, Schnittstellen und Bedienung. Sollte eine Änderung des Verhaltens sinnvoll oder unvermeidbar sein, so wird bei der Veröffentlichung der neuen Version in den Release Notes darauf hingewiesen.

source: *Patchlevel releases* are released approximately every three months and combine all errata updates published until then.
de: *Patchlevel Releases* fassen ca. alle drei Monate die bis dahin veröffentlichten Errata-Updates zusammen.

source: Univention continuously releases *errata updates*. Errata updates provide fixes for security vulnerabilities, bug fixes, and smaller enhancements to make them available to customer systems quickly. An overview of all errata updates can be found at https://errata.software-univention.de/.
de: Univention veröffentlicht fortlaufend *Errata-Updates*. Errata-Updates enthalten Korrekturen für Sicherheitslücken und Bugfixes/kleinere Erweiterungen, die zeitnah für Kundensysteme zur Verfügung gestellt werden sollen. Eine Aufstellung aller Errata-Updates findet sich unter https://errata.software-univention.de/.

source: Every released UCS version has an unambiguous version number; it is composed of a figure (the major version), a full stop, a second figure (the minor version), a hyphen and a third figure (the patch level version). The version UCS 4.2-1 thus refers to the first patch level update for the second minor update for the major release UCS 4.
de: Jede ausgelieferte UCS-Version besitzt eine eindeutige Versionsbezeichnung. Sie besteht aus einer Zahl (der Majorversion), einem Punkt, einer zweiten Zahl (der Minorversion) einem Bindestrich und einer dritten Zahl (der Patchlevelversion). Mit der Version UCS 4.2-1 wird also das erste Patchlevel-Update für das zweite Minor Update für das Major-Release UCS 4 bezeichnet.

source: The *pre-update script* :file:`preup.sh` is run before every release update. It checks for example whether any problems exist, in which case the update is canceled in a controlled manner. The *post-update script* :file:`postup.sh` is run at the end of the update to perform additional cleanups, if necessary.
de: Vor jedem Release-Update wird das *Pre-update-Skript* :file:`preup.sh` aufgerufen. Dieses prüft z.B. ob Probleme bestehen und bricht das Update dann kontrolliert ab. Nach dem Update wird das *Post-Update-Skript* :file:`postup.sh` aufgerufen, das ggf. weitere Aufräumarbeiten durchführt.
