Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/software.po
Languages: de

source: The Univention App Center allows simple integration of software components in a UCS domain. The applications are provided both by third parties and by Univention itself (e.g., UCS\@school). The maintenance and support for the applications are provided by the respective manufacturer.
de: Das Univention App Center erlaubt die einfache Einbindung von Softwarekomponenten in eine UCS-Domäne. Die Applikationen werden sowohl von Drittanbietern wie auch von Univention selbst (z.B. UCS\@school) bereitgestellt. Die Software-Pflege und der Support für die Applikationen erfolgt durch den jeweiligen Hersteller.

source: Overview of applications available in the App Center
de: Überblick der verfügbaren Applikationen im App Center

source: The Univention App Center can be opened via the UMC module :guilabel:`App Center`. It shows by default all installed as well as available software components. :guilabel:`Search Apps...` can be used to search for available applications. Furthermore, the applications can also be filtered using the *Category* panel. More filters like the *Badges* and the *App License* can be used. For example, the view can be limited to applications with the categories ``Education`` or ``Office``. To only show the ``Recommended Apps`` for theses categories, it is sufficient to activate the appropriate filter.
de: Das Univention App Center kann über das UMC-Modul :guilabel:`App Center` aufgerufen werden. Es zeigt standardmäßig alle installierten sowie verfügbare Softwarekomponenten an. Mit :guilabel:`Suche Applikationen...` kann die Liste der angezeigten Applikationen auf Suchbegriffe eingeschränkt werden. Außerdem können die Applikationen anhand der *Kategorien* gefiltert werden. Weitere Filterkriterien sind die *App Badges* und die *App Lizenz*. So ist auch eine Kombination der Filter möglich. So kann die Ansicht beispielsweise auf Applikationen aus den Kategorien ``Bildung`` oder ``Office`` eingeschränkt werden. Um hieraus dann die *Recommended Apps* anzuzeigen, genügt die Aktivierung des entsprechenden Filters.

source: If you click on one of the displayed applications, further details on it are shown, for example description, manufacturer, contact information and screenshots or videos. The *Notification* field displays whether the manufacturer of the software component is notified when it is installed/uninstalled. A rough classification of the licensing can be found under the *License* section. Some applications provide a :guilabel:`Buy` button with a link to detailed licensing information. For all other applications, it is recommended to contact the manufacturer of the application about detailed licensing information using the email address shown under *Contact*.
de: Klickt man auf eine der angezeigten Applikationen, werden weitergehende Details zu der Komponente angezeigt, u.a. Beschreibung, Hersteller, Ansprechpartner und Screenshots oder Videos. Im Feld *Benachrichtigung* wird angezeigt, ob der Hersteller der Softwarekomponente bei der Installation/Deinstallation benachrichtigt wird. Ein grobe Einordnung der Lizenzierung kann unter *Lizenz* entnommen werden. Detaillierte Informationen zur Lizenzierung können bei einigen Applikationen direkt über einen :guilabel:`Kaufen` Button bezogen werden. Für alle anderen Applikationen wird die Kontaktaufnahme mit dem Hersteller der Applikation über die unter *Kontakt* angezeigte E-Mail-Adresse empfohlen.

source: Details for an application in the App Center
de: Details einer Applikation im App Center

source: With *Vote Apps* there is a special form of Apps in the App Center that do not install anything on the UCS system. Voting helps Univention and the potential app provider to determine the interest in this app. Vote apps are usually only displayed for a limited voting period. That Vote Apps are available, can be recognized by the shown *Vote Apps* filter option in the App Center overview.
de: Mit *Vote Apps* gibt es eine spezielle Form von Apps im App Center, die nichts auf dem UCS System installieren. Hierbei handelt es sich um Apps, für die im App Center abgestimmt werden kann. Die Abstimmungen helfen Univention und dem potentiellen App Anbieter dabei, das Interesse für diese App festzustellen. *Vote Apps* werden in der Regel nur für einen begrenzten Abstimmungszeitraum angezeigt. Dass *Vote Apps* verfügbar sind, kann an der angezeigten Filteroption *Vote Apps* in der App Center Übersicht erkannt werden.

source: Example Vote Apps in App Center overview and detail view
de: Beispiel Vote Apps in App Center Übersicht und Detailansicht

source: Example *Vote Apps* in App Center overview and detail view
de: Beispiel *Vote Apps* in App Center Übersicht und Detailansicht

source: Some applications may not be compatible with other software packages from UCS. For instance, most groupware packages require the UCS mail stack to be uninstalled. Every application checks whether incompatible versions are installed and then prompts which *Conflicts* exist and how they can be resolved. The installation of these packages is then prevented until the conflicts have been resolved.
de: Einige Applikationen sind möglicherweise inkompatibel mit anderen Softwarepaketen aus UCS. So setzen beispielsweise die meisten Groupwarepakete voraus, dass der UCS-Mailstack deinstalliert ist. Jede Applikation prüft, ob inkompatible Versionen installiert sind und gibt einen Hinweis, welche *Konflikte* bestehen und wie sie beseitigt werden können. Die Installation dieser Pakete wird dann zurückgehalten, bis die Konflikte beseitigt sind.

source: Some components integrate packages that need to be installed on the |UCSPRIMARYDN| (usually LDAP schema extensions or new modules for the UCS management system). These packages are automatically installed on the |UCSPRIMARYDN|. If this is not possible, the installation is aborted. In addition, the packages are set up on all accessible |UCSBACKUPDN| systems. If several UCS systems are available in the domain, it can be selected on which system the application is to be installed.
de: Einige Komponenten integrieren Pakete, die auf dem |UCSPRIMARYDN| installiert werden müssen (in der Regel LDAP-Schema-Erweiterungen oder Erweiterungen für das UCS-Managementsystem). Diese Pakete werden automatisch auf dem |UCSPRIMARYDN| installiert. Ist dieser nicht erreichbar, wird die Installation abgebrochen. Außerdem werden die Pakete auf allen erreichbaren |UCSBACKUPDN|\ s eingerichtet. Sofern mehrere UCS Systeme in der Domäne vorhanden sind, kann ausgewählt werden, auf welchem der Systeme die Applikation installiert werden soll.

source: Some applications use the container technology :program:`Docker`. In these cases, the application (and its direct environment) is encapsulated from the rest and both security as well as the compatibility with other applications are increased.
de: Einige Applikationen nutzen die Container-Technologie :program:`Docker`. Dadurch wird die Applikation (und ihre unmittelbare Umgebung) vom Rest gekapselt und die Sicherheit sowie die Kompatibilität von Applikationen untereinander erhöht.

source: From a technical perspective, the app is started as Docker container and joined into the UCS domain as |UCSMANAGEDNODE|. A corresponding computer object is created for the |UCSMANAGEDNODE| in the LDAP directory.
de: Technisch wird die App als Docker Container gestartet und als |UCSMANAGEDNODE| in die UCS Domäne gejoint. Für den |UCSMANAGEDNODE| wird im LDAP ein zugehöriges Rechner-Objekt angelegt.

source: On the network side, the container can only be reached from the computer on which the app is installed. The app can, however, open certain ports, which can be forwarded from the actual computer to the container. UCS' firewall is correspondingly configured automatically to allow access to these ports.
de: Der Container ist per Netzwerk nur von dem Rechner aus zu erreichen, auf dem die App installiert ist. Die App kann aber bestimmte Ports öffnen, die dann vom eigentlichen Rechner in den Container weitergeleitet werden. Die Firewall von UCS wird entsprechend automatisch konfiguriert, damit der Zugriff auf die Ports möglich ist.

source: If a command line is required in the app's environment, the first step is to switch to the container. This can be done by running the following command (using the fictitious app :program:`demo-docker-app` as an example in this case):
de: Wird eine Kommandozeile in der Umgebung der App benötigt, muss zunächst in den Container gewechselt werden. Dazu kann folgender Befehl ausgeführt werden (hier am Beispiel der fiktiven App :program:`demo-docker-app`):

source: Docker apps can be further configured via the UMC module. The app can be started and stopped and the *autostart* option be set:
de: Docker Apps lassen sich über das UMC-Modul weiter konfigurieren. Die App kann gestartet und gestoppt, sowie die *Autostart*-Option gesetzt werden:

source: Started automatically
de: Automatisch gestartet

source: ensures that the app is started automatically when the server is started up.
de: sorgt dafür, dass die App automatisch beim Hochfahren des Servers gestartet wird.

source: Started manually
de: Manuell gestartet

source: prevents the app from starting automatically, but it can be started via the UMC module.
de: verhindert den automatischen Start der App, sie kann aber über das UMC-Modul gestartet werden.

source: Starting is prevented
de: Start wird verhindert

source: prevents the app from starting at any time; it cannot even be started via the UMC module.
de: unterbindet grundsätzlich den Start der App; sie kann dann auch nicht über das UMC-Modul gestartet werden.

source: In addition, apps can also be adjusted using additional parameters. The menu for doing so can be opened using the :guilabel:`App Settings` button of an installed app.
de: Darüber hinaus können Apps ggf. über weitere Parameter angepasst werden. Das Menü dafür ist über den Button App-Einstellungen einer installierten App zu erreichen.

source: Setting of an application in the App Center
de: Einstellungen einer Applikation im App Center

source: After its installation, one or several new options are shown when clicking on the icon of an application:
de: Nach der Installation einer Applikation werden beim Klick auf das Icon einer Applikation eine oder mehrere neue Optionen angezeigt:

source: Uninstall
de: Deinstallieren

source: removes an application.
de: entfernt eine Applikation.

source: Open
de: Öffnen

source: refers you to a website or a UMC module with which you can further configure or use the installed application. This option is not displayed for applications which do not have a web interface or a UMC module.
de: verweist auf eine Webseite oder ein UMC-Modul, mit dem die installierte Applikation weitergehend konfiguriert oder verwendet werden kann. Bei Applikationen ohne Webinterface oder UMC-Modul wird die Option nicht angezeigt.

source: Updates for applications are published independently of the |UCSUCS| release cycles. If a new version of an application is available, the :guilabel:`Upgrade` menu item is shown, which starts the installation of the new version. If updates are available, a corresponding message is also shown in the UMC module :guilabel:`Software update`.
de: Aktualisierungen für Applikationen erfolgen unabhängig von den Release-Zyklen für |UCSUCS|. Ist eine neue Version einer Applikation verfügbar, wird der Menüpunkt :guilabel:`Aktualisieren` angezeigt, der die Installation der neuen Version startet. Wenn Aktualisierungen verfügbar sind, wird außerdem im UMC-Modul :guilabel:`Software-Aktualisierung` ein entsprechender Hinweis ausgegeben.

source: Installations and the removal of packages are documented in the :file:`/var/log/univention/management-console-module-appcenter.log` log file.
de: Installationen und das Entfernen von Paketen werden in der Logdatei :file:`/var/log/univention/management-console-module-appcenter.log` protokolliert.

source: Installation of further software
de: Installation weiterer Software

source: The initial selection of the software components of a UCS system is performed within the scope of the installation. The software components are selected relative to the functions, whereby e.g. the *Proxy server* component is selected, which then procures the actual software packages via a meta package. The administrator does not need to know the actual package names. However, individual packages can also be specifically installed and removed for further tasks. When installing a package, it is sometimes necessary to install additional packages, which are required for the proper functioning of the package. These are called package dependencies. All software components are loaded from a repository (see :ref:`software-config-repo`).
de: Die Erstauswahl der Softwarekomponenten eines UCS-Systems erfolgt im Rahmen der Installation. Die Auswahl der Softwarekomponenten erfolgt dabei funktionsbezogen, indem etwa die Komponente *Proxy-Server* ausgewählt wird, die dann über ein Meta-Paket die eigentlichen Software-Pakete nachzieht. Der Administrator muss dazu die eigentlichen Paketnamen nicht kennen. Für weitergehende Aufgaben können aber auch einzelne Pakete gezielt installiert und entfernt werden. Bei der Installation eines Pakets werden unter Umständen Pakete mitinstalliert, die für die Funktion des angegebenen Pakets erforderlich sind, die sogenannten Paketabhängigkeiten. Alle Softwarekomponenten werden aus einem Repository geladen (siehe :ref:`software-config-repo`).

source: Software which is not available in the Debian package format should be installed into the :file:`/opt/` or :file:`/usr/local/` directories. These directories are not used for installing UCS packages, thus a clean separation between UCS packages and other software is ensured.
de: Fremdsoftware, die nicht im Debian-Paketformat vorliegt, sollte in die Verzeichnisse :file:`/opt/` oder :file:`/usr/local/` installiert werden. UCS-Pakete nutzen diese Verzeichnisse nicht, so dass eine saubere Trennung von UCS- und Fremdsoftware gewährleistet ist.

source: There are several possibilities for installing further packages subsequently on an installed system, as the following sections describe.
de: Um auf einem bereits installierten System nachträglich weitere Pakete zu installieren, stehen mehrere Möglichkeiten zur Verfügung.

source: Installation/deinstallation of UCS components in the Univention App Center
de: Installation/Deinstallation von UCS-Komponenten im Univention App Center

source: All software components offered in the Univention Installer can also be installed and removed at a later point in time via the Univention App Center. This is done by selecting the *UCS components* package category. Further information on the Univention App Center can be found in :ref:`software-appcenter`.
de: Alle Softwarekomponenten, die im Univention Installer angeboten werden, können auch über das Univention App Center nachträglich installiert und entfernt werden. Dazu muss die Paket-Kategorie *UCS-Komponenten* ausgewählt werden. Weitere Hinweise zum Univention App Center finden sich in :ref:`software-appcenter`.

source: Selection of UCS components in the App Center
de: Auswahl von UCS-Komponenten im App Center

source: Installation/removal of individual packages via |UCSUMC| module
de: Installation/Deinstallation von UCS-Komponenten im Univention App Center

source: The UMC module :guilabel:`Package Management` can be used to install and uninstall individual software packages.
de: Mit dem UMC-Modul :guilabel:`Paket-Verwaltung` können einzelne Softwarepakete installiert und deinstalliert werden.

source: Installing the package univention-squid via |UCSUMC| module 'Package management'
de: Installation des Pakets univention-squid im UMC-Modul 'Paket-Verwaltung'

source: Installing the package :program:`univention-squid` via |UCSUMC| module 'Package management'
de: Installation des Pakets :program:`univention-squid` mittels |UCSUMC| Modul *Paket-Verwaltung*

source: A search mask is displayed on the start page in which the user can select the package category or a search filter (name or description). The results are displayed in a table with the following columns:
de: Auf der Startseite wird eine Suchmaske angezeigt in der die Paketkategorie und ein Suchfilter (Name oder Beschreibung) zur Auswahl stehen. Die Ergebnisliste besteht aus einer Tabelle mit den folgenden Spalten:

source: Package name
de: Paketname

source: Package description
de: Paketbeschreibung

source: Installation status
de: Installationsstatus

source: Clicking an entry in the result list opens a detailed information page with a comprehensive description of the package.
de: Durch einen Klick auf eine Zeile in der Ergebnisliste wird eine detaillierte Informationsseite zu dem Softwarepaket angezeigt, u.a. eine ausführliche Beschreibung und die Versionsnummer.

source: In addition, one or more buttons will be displayed. They have the following meanings:
de: Zusätzlich werden ein oder mehrere Buttons angezeigt. Sie haben die folgenden Bedeutungen:

source: Install
de: Installieren

source: is displayed if the software package is not installed yet.
de: wird angezeigt, falls das Softwarepaket noch nicht installiert ist.

source: is displayed if the software package is installed.
de: wird angezeigt, falls das Paket installiert ist.

source: Upgrade
de: Aktualisieren

source: is displayed if the software package is installed but not updated.
de: wird angezeigt, falls das Softwarepaket bereits installiert, aber nicht aktuell ist.

source: Close
de: Schließen

source: can be used for returning to the previous search request.
de: kann verwendet werden, um zur vorherigen Suchanfrage zurück zu kehren.

source: Installation/removal of individual packages in the command line
de: Installation/Deinstallation von einzelnen Paketen auf der Kommandozeile

source: The following steps must be performed with ``root`` user rights.
de: Die folgenden Schritte müssen mit ``root``-Rechten durchgeführt werden.

source: Individual packages are installed using the command:
de: Die Installation einzelner Pakete erfolgt mit dem Kommando

source: Packages can be removed with the following command:
de: Pakete können mit dem folgenden Befehl entfernt werden:

source: If the name of a package is unknown, the command :command:`apt-cache search` can be used to search for the package. Parts of the name or words which appear in the description of the package are listed, for example:
de: Wenn der Name eines Pakets nicht bekannt ist, kann mit dem Kommando :command:`apt-cache search` nach Paketen gesucht werden. Als Aufrufparameter können Teile des Namens oder Wörter, die in der Beschreibung eines Paketes vorkommen, angegeben werden, z.B.

source: Hook scripts for administrators
de: Hook Skripte für Administratoren

source: Custom scripts can be called after each app installation, -upgrade or -removal. Such scripts can be used to automate repeating administrative tasks.
de: Benutzerdefinierte Skripte können nach jeder Installation, Aktualisierung oder Deinstallation von Apps ausgeführt werden. Solche Skripte erlauben die Automatisierung wiederkehrender administrativer Aufgaben.

source: To use this feature custom scripts can be placed in one of the directories listed below. If such a directory does not yet exist, it can be manually created:
de: Um von dieser Eigenschaft Gebrauch zu machen, können Skripte in einem der folgenden Verzeichnisse abgelegt werden. Wenn ein solches Verzeichnis noch nicht existiert, kann es manuell angelegt werden.

source: Where ``{appid}`` is the name of the app for which the scripts should be executed.
de: Wobei ``{appid}`` der Name einer App ist, für welche die Skripte ausgeführt werden sollen.

source: Script file names are only allowed to consist of lower case letters and numbers (``^[a-z0-9]+$``). Additionally scripts have to be marked as executable (:command:`chmod +x [filename]`), because they are internally called by :program:`run-parts`. As a consequence :command:`run-parts --test [directory]` can be used to verify if and which files would be executed. Further information can be found in the manual with :command:`man run-parts`.
de: Dateinamen dürfen nur aus Kleinbuchstaben und Zahlen bestehen (``^[a-z0-9]+$``). Außerdem müssen die Dateien als ausführbar markiert sein (:command:`chmod +x [Dateiname]`) denn sie werden intern von :command:`run-parts` aufgerufen. Daher kann mit :command:`run-parts --test [Verzeichnis]` getestet werden, ob und welche Dateien ausgeführt werden würden. Weitere Informationen können der Manpage entnommen werden mit :command:`man run-parts`.

source: The :file:`/var/log/univention/appcenter.log` contains possible scripting error messages and further hints.
de: Die :file:`/var/log/univention/appcenter.log` enthält mögliche Fehler bei der Ausführung der Skripte und weitere Hinweise.

source: Policy-based installation/deinstallation of individual packages via package lists
de: Richtlinienbasierte Installation/Deinstallation von einzelnen Paketen über Paketlisten

source: Package lists can be used to install and remove software using policies. This allows central software deployment for a large number of computer systems.
de: Mit Paketlisten kann richtlinienbasiert Software installiert und entfernt werden. Dadurch lassen sich auch große Stückzahlen an Rechnersystemen zentral mit neuer Software versehen.

source: Each system role has its own package policy type.
de: Jede Systemrolle verfügt über eine eigenen Paket-Richtlinien-Typ.

source: Package policies are managed in the UMC module :guilabel:`Policies` with the *Policy: Packages + system role*.
de: Paketrichtlinien werden im UMC-Modul :guilabel:`Richtlinien` mit dem Objekttyp *Richtlinie: Pakete + Systemrolle* verwaltet.

source: *General* tab
de: Reiter *Allgemein*

source: Attribute
de: Attribut

source: Description
de: Beschreibung

source: An unambiguous name for this package list, e.g., *mail server*.
de: Ein eindeutiger Name für diese Paketliste, z.B. *Standort-Server*.

source: Package installation list
de: Pakete Installationsliste

source: A list of packages to be installed.
de: Eine Liste zu installierender Pakete.

source: Package removal list
de: Pakete Deinstallationsliste

source: A list of packages to be removed.
de: Eine Liste zu entfernender Pakete.

source: The software packages defined in a package list are installed/uninstalled at the time defined in the :guilabel:`Maintenance` policy (for the configuration see :ref:`computers-softwaremanagement-maintenance-policy`).
de: Die in einer Paketliste definierten Softwarepakete werden zu dem in der :guilabel:`Paketpflege`-Richtlinie definierten Zeitpunkt (zur Konfiguration siehe :ref:`computers-softwaremanagement-maintenance-policy`) installiert, bzw. deinstalliert.

source: The software assignable in the package policies are also registered in the LDAP.
de: Die in den Pakete-Richtlinien zuordbaren Softwarepakete werden ebenfalls im LDAP registriert.

source: Chapter contents:
de: Kapitelinhalte:

source: Software deployment
de: Softwareverteilung
