Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/software.po
Languages: de

source: Errata updates always refer to certain minor releases, e.g., for UCS 5.0. Errata updates can generally be installed for all patch level versions of a minor release.
de: Errata-Updates beziehen sich immer auf bestimmte Minor-Releases, also beispielsweise für UCS 5.0. Errata-Updates können in der Regel für alle Patchlevelversionen eines Minor Releases installiert werden.

source: If a new release or errata updates are available, a corresponding notification is given when a user opens a UMC module. The availability of new updates is also notified via email; the corresponding newsletters - separated into release and error updates - can be subscribed on the Univention website. A changelog document is published for every release update listing the updated packages, information on error corrections and new functions and references to the Univention Bugzilla.
de: Wenn neue Release- oder Errata-Updates verfügbar sind, wird beim Öffnen eines UMC-Moduls ein entsprechender Hinweis ausgegeben. Die Verfügbarkeit neuer Updates wird außerdem per E-Mail angekündigt, entsprechende Newsletter - getrennt nach Release- und Errata-Updates - können auf der Univention-Webseite abonniert werden. Zu jedem Release-Update wird ein Dokument mit Release Notes veröffentlicht, in dem die aktualisierten Pakete, Hinweise zu Fehlerkorrekturen und neuen Funktionen aufgeführt sind.

source: Updates of UCS systems
de: Aktualisierung von UCS-Systemen

source: There are two ways to update UCS systems; either on individual systems (via UMC module :guilabel:`Software update` or command line) or via a computer policy for larger groups of UCS systems.
de: UCS-Systeme können auf zwei Wegen aktualisiert werden; entweder pro einzelnem System (über das UMC-Modul :guilabel:`Software-Aktualisierung` oder auf der Kommandozeile) oder für größere Gruppen von UCS-Systemen automatisiert über eine UMC-Rechner-Richtlinie.

source: Update strategy in environments with more than one UCS system
de: Update-Strategie in Umgebungen mit mehr als einem UCS-System

source: In environments with more than one UCS system, the update order of the UCS systems must be borne in mind.
de: In Umgebungen mit mehr als einem UCS-System muss die Update-Reihenfolge der UCS-Systeme beachtet werden:

source: The authoritative version of the LDAP directory service is maintained on the |UCSPRIMARYDN| and replicated on all the remaining LDAP servers of the UCS domain. As changes to the LDAP schemes (see :ref:`domain-ldap-schema`) can occur during release updates, the |UCSPRIMARYDN| **must always be the first system** to be updated during a release update.
de: Auf dem |UCSPRIMARYDN| wird die authoritative Version des LDAP-Verzeichnisdienstes vorgehalten, die an alle übrigen LDAP-Server der UCS-Domäne repliziert wird. Da bei Release-Updates Veränderungen an den LDAP-Schemata auftreten können (siehe :ref:`domain-ldap-schema`) **muss** der |UCSPRIMARYDN| bei einem Release-Update **immer als erstes System aktualisiert werden**.

source: It is generally advisable to update all UCS systems in one maintenance window whenever possible. If this is not possible, all not-updated UCS systems should only be one release version older compared with the |UCSPRIMARYDN|.
de: Generell ist es empfehlenswert, alle UCS-Systeme möglichst in einem Wartungsfenster zu aktualisieren. Wo dies nicht möglich ist, sollten die nicht-aktualisierten UCS-Systeme gegenüber dem |UCSPRIMARYDN| nur eine Release-Version älter sein.

source: Updating individual systems via |UCSUMC| module
de: Aktualisierung eines einzelnen Systems im |UCSUMC| Modul Software-Aktualisierung

source: The UMC module :guilabel:`Software update` allows the installation of release updates and errata updates.
de: Mit dem UMC-Modul :guilabel:`Software-Aktualisierung` können Versions- und Errata-Updates installiert werden.

source: :numref:`software-umc-update` shows the overview page of the module. The currently installed version is displayed under :guilabel:`Release updates`.
de: :numref:`software-umc-update` zeigt die Übersichtsseite des Moduls. Im oberen Teil des Dialogs wird unter :guilabel:`Release-Aktualisierungen` der aktuelle Installationsstand angezeigt.

source: Updating a UCS system via UMC module 'Software update'
de: Aktualisierung eines UCS-Systems über das UMC-Modul 'Software-Aktualisierung'

source: Updating a UCS system via UMC module *Software update*
de: Aktualisierung eines UCS-Systems über das UMC-Modul *Software-Aktualisierung*

source: If a newer UCS version is available, a selection list is displayed. After clicking on :guilabel:`Install release updates` and confirmation all updates up to the respective version are installed. Before the installation process is started, a message will be displayed informing the user of possible restrictions of the server's services during the update. Any intermediate versions are also installed automatically.
de: Sollte eine neuere UCS-Version vorhanden sein, wird eine Auswahlliste präsentiert. Durch einen Klick auf :guilabel:`Release-Aktualisierungen installieren` werden nach Bestätigung alle Updates bis zur jeweiligen Version eingespielt. Zuvor wird ein Hinweis auf mögliche Einschränkungen der Serverdienste während des Updates angezeigt. Eventuelle Zwischenversionen werden automatisch mitinstalliert.

source: Clicking on :guilabel:`Install available errata updates` installs all the available errata updates for the current release and all installed components.
de: Durch einen Klick auf :guilabel:`Errata-Aktualisierungen installieren` werden alle für das aktuelle Release und die eingebundenen Komponenten verfügbaren Errata-Updates eingerichtet.

source: :guilabel:`Check for package updates` activates an update of the package sources currently entered. This can be used, for example, if an updated version is provided for a component.
de: Mit :guilabel:`Paket-Aktualisierungen prüfen` wird eine Aktualisierung der momentan eingetragenen Paketquellen aktiviert. Dies kann etwa verwendet werden, wenn für eine Komponente eine aktualisierte Version bereitgestellt wurde.

source: The messages created during the update are written to the file :file:`/var/log/univention/updater.log`
de: Die während der Aktualisierung erzeugten Meldungen werden in die Datei :file:`/var/log/univention/updater.log` geschrieben.

source: Updating individual systems via the command line
de: Aktualisierung eines einzelnen Systems auf der Kommandozeile

source: An individual UCS system can be updated using the :command:`univention-upgrade` command in the command line. A check is performed to establish whether new release or application updates are available and these are then installed if a prompt is confirmed. In addition, package updates are also performed (e.g., in the scope of an errata update).
de: Ein einzelnes UCS-System kann auf der Kommandozeile mit dem Befehl :command:`univention-upgrade` aktualisiert werden. Es wird geprüft, ob neue Release- oder Applikations-Updates vorliegen, die dann nach Bestätigung einer Nachfrage installiert werden. Außerdem werden Paket-Aktualisierungen durchgeführt, z.B. im Rahmen eines Errata-Updates.

source: Remote updating over SSH is not advisable as this may result in the update procedure being aborted. If updates should occur over a network connection nevertheless, it must be verified that the update continues despite disconnection from the network. This can be done, for example, using the tools :program:`screen` and :program:`at`, which are installed on all system roles.
de: Von einer Remote-Aktualisierung über SSH wird abgeraten, da dies zum Abbruch des Update-Vorgangs führen kann. Sollte dennoch eine Aktualisierung über eine Netzverbindung durchgeführt werden, ist sicherzustellen, dass das Update bei Unterbrechung der Netzverbindung trotzdem weiterläuft. Hierfür können beispielsweise die Tools :command:`screen` oder :command:`at` eingesetzt werden, die auf allen Systemrollen installiert sind.

source: Updating systems via a policy
de: Aktualisierung von Systemen über eine Rechner-Richtlinie

source: An update for more than one computer can be configured with an *Automatic updates* policy in the UMC modules :guilabel:`Computers` and :guilabel:`LDAP directory` (see :ref:`central-policies`).
de: Mit einer *Automatische Updates*-Richtlinien im UMC-Modul :guilabel:`Rechner` lässt sich ein Update für mehrere Rechner konfigurieren (siehe auch :ref:`central-policies`).

source: Updating UCS systems using an update policy
de: Aktualisierung eines UCS-Systems über eine Update-Richtlinie

source: A release update is only run when the *Activate release updates* selection field is activated.
de: Nur wenn das Auswahlfeld *Aktiviere Release-Updates* aktiviert ist, wird eine Release-Aktualisierung durchgeführt.

source: The *Update to this UCS version* input field includes the version number up to which the system should be updated, for example ``5.0-0``. If no entry is made, the system continues updating to the highest available version number.
de: Das Eingabefeld *Bis zu dieser UCS-Version aktualisieren* enthält die Versionsnummer, bis zu der das System aktualisiert werden soll, z.B. ``5.0-0``. Wird keine Angabe gemacht, aktualisiert sich das System bis zur höchsten verfügbaren Versionsnummer.

source: The point at which the update should be performed is configured via a *Maintenance* policy (see :ref:`computers-softwaremanagement-maintenance-policy`).
de: Der Zeitpunkt, zu dem die Aktualisierung durchgeführt wird, wird über eine *Paketpflege*-Richtlinie konfiguriert (siehe :ref:`computers-softwaremanagement-maintenance-policy`).

source: The messages created during the update are written to the file :file:`/var/log/univention/updater.log`.
de: Die während der Aktualisierung erzeugten Meldungen werden in die Datei :file:`/var/log/univention/updater.log` geschrieben.

source: Post-processing of release updates
de: Nachbereitung von Release-Updates

source: Once a release update has been performed successfully, a check should be made for whether new or updated join scripts need to be run.
de: Nach erfolgreicher Durchführung eines Release-Updates sollte geprüft werden, ob neue oder aktualisierte Join-Skripte ausgeführt werden müssen.

source: Either the UMC module :guilabel:`Domain join` or the command line program :command:`univention-run-join-scripts` is used for checking and starting the join scripts (see :ref:`linux-domain-join`).
de: Zur Überprüfung und zum Starten der Join-Skripte kann entweder das UMC-Modul :guilabel:`Domänenbeitritt` verwendet werden oder das Kommandozeilenprogramm :command:`univention-run-join-scripts` (siehe :ref:`linux-domain-join`).

source: Troubleshooting in case of update problems
de: Fehlersuche bei Updateproblemen

source: The messages generated during updates are written to the :file:`/var/log/univention/updater.log` file, which can be used for more in-depth error analysis.
de: Die während der Aktualisierung erzeugten Meldungen werden in die Datei :file:`/var/log/univention/updater.log` geschrieben, die zur weiteren Fehleranalyse herangezogen werden kann.

source: The status of the |UCSUCR| variables before the release update is saved in the :file:`/var/univention-backup/update-to-TARGETRELEASEVERSION/` directory. This can then be used to check whether and which variables have been changed during the update.
de: Der Stand der |UCSUCR|-Variablen vor der Release-Aktualisierung wird in dem Verzeichnis :file:`/var/univention-backup/update-to-ZIELRELEASEVERSION/` gesichert. Damit kann geprüft werden, ob und welche Variablen im Rahmen des Updates verändert wurden.
