Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/user-management.po
Languages: de

source: The default value always applies if you don't set a policy and you activated the *Override password check* checkbox. This means it even applies if you deleted the *default-settings* password policy.
de: Der Standardwert gilt immer, wenn Sie keine Richtlinie festlegen und Sie das Kontrollkästchen *Passwortprüfung außer Kraft setzen* aktiviert haben. Das heißt, er gilt auch wenn Sie die Passwortrichtlinie *Standard-Einstellungen* gelöscht haben.

source: To deactivate the validation for the password length, set the value to ``0``.
de: Um die Überprüfung der Passwortlänge zu deaktivieren, setzen Sie den Wert auf ``0``.

source: You can configure a default value per UCS system through the |UCSUCRV| :envvar:`password/quality/length/min`. The setting applies to users that aren't subject to a *UDM password policy*.
de: Sie können einen Standardwert pro UCS-System über die |UCSUCRV| :envvar:`password/quality/length/min` konfigurieren. Die Einstellung gilt für Benutzer, die nicht einer *UDM-Passwortrichtlinie* unterliegen.

source: Password expiry interval
de: Passwortablaufintervall

source: A *Password expiry interval* demands regular password changes. UCS requires a user to change their password during sign-in to |UCSWEB|\ s, to Kerberos, and on UCS systems when the expiry interval in days passed. UCS displays the remaining validity of the user password in the user management module at *Password expiry date* in the *Account* tab.
de: Ein *Passwort-Ablaufintervall* verlangt regelmäßige Passwortänderungen. UCS verlangt von einem Benutzer, dass er sein Passwort bei der Anmeldung an der |UCSWEB|, an Kerberos, und an UCS-Systemen ändert, wenn das Ablaufintervall verstrichen ist. UCS zeigt die Restlaufzeit des Benutzerpassworts im Benutzerverwaltungsmodul unter *Passwortablaufdatum* im Reiter *Konto* an.

source: To deactivate the *Password expiry interval*, leave the value blank.
de: Um das *Passwort-Ablaufintervall* zu deaktivieren, lassen Sie den Wert leer.

source: Password quality check
de: Passwortqualitätsprüfung

source: If you activate the option *Password quality check*, UCS runs additional password checks, including dictionary checks, for password changes in UMC and Kerberos.
de: Wenn Sie die Option *Passwortqualitätsprüfung* aktivieren, führt UCS zusätzliche Passwortprüfungen, einschließlich Wörterbuchprüfungen, für Passwortänderungen in UMC und Kerberos durch.

source: You configure the quality checks through the following |UCSUCR| variables. For more information, refer to linked variable descriptions.
de: Sie konfigurieren die Qualitätsprüfungen über die folgenden |UCSUCR| Variablen. Weitere Informationen finden Sie in den verlinkten Variablenbeschreibungen.

source: You can enforce the following checks:
de: Sie können die folgenden Kontrollen erzwingen:

source: To apply the *password quality check* on all UCS sign-in systems, you need to set the |UCSUCRVs| on **all** UCS sign-in servers.
de: Um die *Passwortqualitätsprüfung* auf alle UCS Anmeldesysteme anzuwenden, müssen Sie die |UCSUCRVs| auf **allen** UCS Anmeldeservern setzen.

source: Password settings for Windows clients when using Samba
de: Passwort-Einstellungen für Windows-Clients bei Verwendung von Samba

source: With the Samba domain object, you can set the requirements for user account passwords in a Samba domain.
de: Mit dem Samba-Domänenobjekt können Sie die Anforderungen an Passwörter für Benutzerkonten in einer Samba-Domäne festlegen.

source: You can manage the Samba domain object through the UMC module :guilabel:`LDAP directory`. The Samba domain object locates in the ``samba`` container and has the domain's NetBIOS name. You find the ``samba`` container under the LDAP base.
de: Sie können das Samba-Domänenobjekt über das UMC-Modul :guilabel:`LDAP-Verzeichnis` verwalten. Das Samba-Domänen-Objekt befindet sich im ``samba``-Container und hat den NetBIOS-Namen der Domäne. Sie finden den ``samba``-Container unter der LDAP-Basis.

source: It's a strong recommendation to design the password requirement settings of the Samba domain object identical to the user password policy as described in :ref:`users-passwords`.
de: Es wird dringend empfohlen, die Einstellungen der Passwortanforderungen des Samba-Domänenobjekts identisch mit der Benutzerpasswortrichtlinie zu gestalten, wie in :ref:`users-passwords` beschrieben.

source: In the *Password* section on the *General* tab of the *Samba Domain* object, you can configure the following settings.
de: Im Abschnitt *Passwort* auf dem Reiter *Allgemein* des Objekts *Samba Domain* können Sie die folgenden Einstellungen vornehmen.

source: The minimum number of characters for a user password.
de: Die Anzahl an Zeichen, die ein Benutzerpasswort mindestens enthalten muss.

source: Password history
de: Passworthistorie

source: UCS stores password changes in the form of hashes. Users can't use passwords from history when setting a password. For example, with a password history value of ``5``, user must set five other passwords before they can reuse a password from the history.
de: UCS speichert Passwortänderungen in Form von Hashes. Benutzer können keine Passwörter aus der Historie verwenden, wenn sie ein Passwort setzen. Zum Beispiel, mit einem Wert für die Länge der Passworthistorie von ``5`` muss der Benutzer fünf andere Passwörter festlegen, bevor er ein Passwort aus der Historie wiederverwenden kann.

source: Minimum password age
de: Minimales Passwortalter

source: Defines the period of time that must elapse, before users can change their password.
de: Legt die Zeitspanne fest, die vergehen muss, bevor die Benutzer ihr ihr Passwort ändern können.

source: Maximum password age
de: Maximales Passwortalter

source: Defines the maximum age for a password. When the period of time is over, UCS requires the user to change their password upon next sign-in.
de: Legt das maximale Alter für ein Passwort fest. Nach Ablauf dieser Zeitspanne, fordert UCS den Benutzer auf, sein Passwort bei der nächsten Anmeldung zu ändern.

source: To define an infinite period of time, leave the value empty.
de: Um eine unendliche Zeitspanne zu definieren, lassen Sie den Wert leer.

source: Password must meet complexity requirements
de: Das Passwort muss die Komplexitätsanforderungen erfüllen

source: Activating the checkbox activates `Microsoft Password complexity requirements <microsoft-password-complexity-requirements_>`_. A tooltip shows the required characters in a password. The library :file:`Passfilt.dll` enforces the complexity requirements. Administrators can't change them.
de: Das Aktivieren des Kontrollkästchens aktiviert die `Microsoft Password complexity Anforderungen <microsoft-password-complexity-requirements_>`_. Ein Tooltip zeigt die erforderlichen Zeichen in einem Passwort an. Die Bibliothek :file:`Passfilt.dll` erzwingt die Komplexitätsanforderungen. Administratoren können sie nicht ändern.

source: Prevent reuse of user property values
de: Wiederverwendung von Benutzereigenschaften verhindern

source: Since :uv:erratum:`5.0x974`, UCS supports block lists to prevent the reuse of user or group property values.
de: Seit :uv:erratum:`5.0x974` unterstützt UCS Blocklisten, um die Wiederverwendung von Benutzer- oder Gruppeneigenschaftswerten zu verhindern.

source: Block lists is a module in UDM. It allows to configure block lists for UDM properties. When an administrator or software modifies or removes a UDM property on a UDM object, the block list automatically adds an entry about this property with its value to the block list. The entry in the block list prevents that another UDM object can use the same value of the UDM property. Block lists operate on the UDM level.
de: Blocklisten ist ein Modul in UDM. Es ermöglicht die Konfiguration von Blocklisten für UDM Eigenschaften. Ändert oder entfernt ein Administrator oder eine Software eine UDM Eigenschaft an einem UDM Objekt, fügt die Blockliste automatisch einen Eintrag über diese Eigenschaft mit ihrem Wert in die Blockliste ein. Der Eintrag in der Blockliste verhindert, dass ein anderes UDM Objekt den gleichen Wert der UDM Eigenschaft verwenden kann. Blocklisten arbeiten auf der UDM Ebene.

source: For example, you want to prevent that UCS reuses values of the UDM property ``mailPrimaryAddress`` of the UDM objects *user*. You configure a block list for the UDM property ``mailPrimaryAddress``. If you then remove the value ``chef@example.com`` for the UDM property ``mailPrimaryAddress`` from a UDM user object, the UDM block list creates an entry for that value. If you change the value from ``james@example.com`` to ``john@example.com`` for the UDM property ``mailPrimaryAddress``, the UDM block list creates another entries for ``james@example.com``.
de: Sie wollen zum Beispiel verhindern, dass UCS die Werte der UDM Eigenschaft ``mailPrimaryAddress`` der UDM Objekte *user* wiederverwendet. Sie konfigurieren eine Blockliste für die UDM Eigenschaft ``mailPrimaryAddress``. Wenn Sie dann den Wert ``chef@example.com`` für die UDM Eigenschaft ``mailPrimaryAddress`` aus einem UDM Benutzerobjekt entfernen, erzeugt die UDM Blockliste einen Eintrag für diesen Wert. Wenn Sie den Wert von ``james@example.com`` auf ``john@example.com`` für die UDM Eigenschaft ``mailPrimaryAddress`` ändern, erzeugt die UDM Blockliste einen weiteren Eintrag für ``james@example.com``.

source: UDM block lists now prevents reusing the values ``chef@example.com`` and ``james@example.com``. You can't use them on other UDM user objects for the UDM property ``mailPrimaryAddress``.
de: UDM Blocklisten verhindern nun die Wiederverwendung der Werte ``chef@example.com`` und ``james@example.com``. Sie können in anderen UDM Benutzerobjekten für die UDM Eigenschaft ``mailPrimaryAddress`` nicht mehr verwendet werden.

source: Activate block lists
de: Aktivieren von Blocklisten

source: Before you can activate the block lists, you first need to update the UCS systems, where you manage UDM objects, to at least :uv:erratum:`5.0x974`.
de: Bevor Sie die Blocklisten aktivieren können, müssen Sie zuerst die UCS Systeme, in denen Sie UDM Objekte verwalten, mindestens auf :uv:erratum:`5.0x974` aktualisieren.

source: Second, you need to set the |UCSUCRV| :envvar:`directory/manager/blocklist/enabled` to ``true`` with :option:`ucr set` on all UCS systems, where you manage UDM objects.
de: Zweitens müssen Sie die |UCSUCRV| :envvar:`directory/manager/blocklist/enabled` mit :option:`ucr set` auf allen UCS-Systemen, auf denen Sie UDM Objekte verwalten, auf ``true`` setzen.

source: Configure block lists
de: Konfigurieren von Blocklisten

source: You can create, list, and remove block list entries in the UMC module *Blocklists*, or through the command line tool :program:`udm blocklists/list`.
de: Sie können Blocklisteneinträge mit dem UMC-Modul *Blocklisten* oder über das Kommandozeilenwerkzeug :program:`udm blocklists/list` erstellen, auflisten und entfernen.

source: On every block list you need to define the following properties:
de: Für jede Blockliste müssen Sie die folgenden Eigenschaften festlegen:

source: Provides a human-readable name for the block list for later identification.
de: Gibt der Blockliste einen menschenlesbaren Namen für die spätere Identifizierung.

source: Retention time
de: Aufbewahrungszeit

source: Defines the retention time for entries in this block list. The retention time is the time period that needs to expire to automatically remove entries from the block list. For example ``1m 20d`` which results in one month and twenty days.
de: Legt die Aufbewahrungszeit für Einträge in dieser Blockliste fest. Die Aufbewahrungszeit ist der Zeitraum, der ablaufen muss, um Einträge automatisch aus der Blockliste zu entfernen. Zum Beispiel ``1m 20d``, was für einen Monat und zwanzig Tage steht.

source: Properties to block
de: Zu blockierende Eigenschaften

source: Defines the UDM modules and their properties that the block list prevents from reuse.
de: Definiert die UDM Module und ihre Eigenschaften, deren Wiederverwendung die Blockliste verhindert.

source: The following example for :program:`udm blocklists/list` shows how to create a block list through the command line. The block list prevents the reuse of the UDM property ``mailPrimaryAddress`` for ``users/user`` objects and the UDM property ``mailAddress`` for ``groups/group`` objects.
de: Das folgende Beispiel für :program:`udm blocklists/list` zeigt, wie man eine Blockliste über die Befehlszeile erstellt wird. Die Blockliste verhindert die Wiederverwendung der UDM Eigenschaft ``mailPrimaryAddress`` für ``users/user`` Objekte und die UDM Eigenschaft ``mailAddress`` für ``groups/group`` Objekte.

source: Manage block list entries
de: Einträge in der Blockliste verwalten

source: You can manage block list entries in the UMC module *Blocklists*, or through the command line tool :program:`udm blocklists/list`.
de: Sie können Blocklisteneinträge im UMC-Modul *Blocklisten* oder über das Kommandozeilenwerkzeug :program:`udm blocklists/list` verwalten.

source: When you activated block lists, UDM automatically creates entries in the configured block list, when you remove a value from a UDM property of a UDM object. UDM automatically deletes expired entries from the block list.
de: Wenn Sie Blocklisten aktiviert haben, erstellt UDM automatisch Einträge in der konfigurierten Blockliste, wenn Sie einen Wert aus einer UDM Eigenschaft eines UDM Objekts entfernen. UDM löscht abgelaufene Einträge automatisch aus der Blockliste.

source: Every block list entry has the following properties:
de: Jeder Blocklisteneintrag hat die folgenden Eigenschaften:

source: Value
de: Wert

source: A SHA-256 hash representing the value that the block list is blocking from reuse. The UDM property value is a clear text value. Before UDM creates the block list entry, it converts the value to lowercase text. All uppercase and lowercase variants of the value then match the block list entry when validated by UDM.
de: Ein SHA-256-Hash, der den Wert darstellt, den die Blockliste für die Wiederverwendung blockiert. Der Wert für die UDM Eigenschaft ist ein Klartextwert. Bevor UDM den Blocklisteneintrag erstellt, wird der Wert in Kleinbuchstaben umgewandelt. Alle groß- und kleingeschriebenen Varianten des Wertes stimmen dann mit dem Blocklisteneintrag überein, wenn er von UDM validiert wird.

source: Blocked until
de: Blockiert bis

source: The timestamp when the block list entry expires. It uses the `GeneralizedTime-LDAP-Syntax <ldap-generalized-time_>`_ format.
de: Der Zeitstempel, zu dem der Eintrag in der Blockliste abläuft. Er verwendet das `GeneralizedTime-LDAP-Syntax <ldap-generalized-time_>`_ Format.

source: When UDM creates a block list entry, it takes the current date and time, adds the configured retention time of the corresponding block list and writes the result to *Blocked until*.
de: Wenn UDM einen Blocklisteneintrag erstellt, nimmt es das aktuelle Datum und die aktuelle Uhrzeit, addiert die konfigurierte Aufbewahrungszeit der entsprechenden Blockliste und schreibt das Ergebnis nach *Blockiert bis*.

source: Changing the retention time of the block list doesn't update the *Blocked until* property of the block list entry.
de: Eine Änderung der Aufbewahrungszeit der Blockliste führt nicht zur Aktualisierung der Eigenschaft *Blockiert bis* des Blocklisteneintrags.

source: Origin ID
de: ID des Ursprungsobjekts

source: The ID of the UDM object that caused the block list entry. You can still use the value of the block list entry on this UDM object.
de: Die ID des UDM Objekts, das den Blocklisteneintrag verursacht hat. Sie können weiterhin den Wert des Blocklisteneintrags für dieses UDM Objekt verwenden.

source: Listing block list entries gives you only the hashes of the blocked values.
de: Wenn Sie die Einträge der Blockliste auflisten, erhalten Sie nur die Hashes der blockierten Werte.

source: Nevertheless, you can search for the clear text value of a particular entry, for example, in case you want to delete that entry.
de: Sie können jedoch nach dem Klartextwert eines bestimmten Eintrags suchen, z. B. wenn Sie diesen Eintrag löschen möchten.

source: Expired block list entries
de: Abgelaufene Blocklisteneinträge

source: Every entry in a block list has a *Blocked until* property. Block list entries expire after the timestamp passed. A cron job on the |UCSPRIMARYDN| deletes expired block list entries.
de: Jeder Eintrag in einer Blockliste hat eine Eigenschaft *Blockiert bis*. Blocklisteneinträge laufen nach Ablauf dieses Zeitstempels ab. Ein Cron-Job auf dem |UCSPRIMARYDN| löscht abgelaufene Blocklisteneinträge.

source: You can configure how often cron runs the job with the |UCSUCRV| :envvar:`directory/manager/blocklist/cleanup/cron`. The log file :file:`/var/log/univention/blocklist-clean-expired-entries.log` lists the expired entries that UDM deleted.
de: Sie können die Häufigkeit, mit der Cron den Job ausführt, mit dem Parameter |UCSUCRV| :envvar:`directory/manager/blocklist/cleanup/cron` konfigurieren. Die Protokolldatei :file:`/var/log/univention/blocklist-clean-expired-entries.log` listet die abgelaufenen Einträge auf, die UDM gelöscht hat.

source: LDAP ACLs for block lists
de: LDAP ACLs für Blocklisten

source: By default every UCS node in the domain and every member of the ``Domain Admins`` group can write block list entries. And everybody can read. You can configure the permissions on the |UCSPRIMARYDN| and the |UCSBACKUPDN|\ s with the following |UCSUCRVs|:
de: Standardmäßig kann jeder UCS Knoten in der Domäne und jedes Mitglied der Gruppe ``Domain Admins`` Blocklisteneinträge schreiben. Und jeder kann lesen. Sie können die Berechtigungen für den |UCSPRIMARYDN| und den |UCSBACKUPDN|\ s mit den folgenden |UCSUCRVs| konfigurieren:

source: For example, if you want to give a user the permission to delete block list entries who isn't member of the ``Domain Admins`` group, you need to create a group with that user as member and add the LDAP DN of this group to :envvar:`ldap/database/internal/acl/blocklists/groups/write`.
de: Wenn Sie zum Beispiel einem Benutzer das Recht geben wollen, Einträge in der Blockliste zu löschen, der nicht Mitglied der Gruppe ``Domain Admins`` ist, müssen Sie eine Gruppe mit diesem Benutzer als Mitglied erstellen und den LDAP DN dieser Gruppe zu :envvar:`ldap/database/internal/acl/blocklists/groups/write` hinzufügen.

source: User management via |UCSUMC| module
de: Verwaltung von Benutzern über |UCSUMC| Modul

source: Users are managed in the UMC module *Users* (see :ref:`central-user-interface`).
de: Benutzer werden im UMC-Modul :guilabel:`Benutzer` verwaltet (siehe auch :ref:`central-user-interface`).

source: Creating a user in the UMC module 'Users'
de: Anlegen eines Benutzers im UMC-Modul 'Benutzer'

source: Creating a user in the UMC module *Users*
de: Anlegen eines Benutzers im UMC-Modul *Benutzer*

source: With :guilabel:`Next` on :numref:`user-create` the second page :numref:`user-password` is shown, where the initial password can be set.
de: Über :guilabel:`Weiter` in :numref:`user-create` gelangt man auf die zweite Seite in :numref:`user-password`, auf der dann das initiale Passwort gesetzt werden kann.

source: Password setting for a new user
de: Passwortvergabe für einen neuen Benutzer

source: As an alternative the user may set the initial password himself if the :program:`Self Service` app is installed. For this to work an external email address must be given, which is registered at the contact email address. The user will then receive an email to that address containing a web address and a token, which can be used to set the password and unlock the account. For this also see :ref:`user-management-password-changes-by-users-self-service`.
de: Alternativ besteht bei installierter :program:`Self Service` App die Möglichkeit, das Setzen des Passworts dem Benutzer selbst zu überlassen. Dafür ist dann eine externe E-Mail-Adresse anzugeben, die als Kontakt-E-Mail-Adresse registriert wird. An diese erhält dann der Benutzer eine E-Mail mit einer Web-Adresse und einem Token, mit dem er sein Passwort setzen und seinen Zugang freischalten kann. Siehe dazu auch :ref:`user-management-password-changes-by-users-self-service`.

source: Initial user password
de: Initiales Benutzerpasswort

source: By default a simplified wizard for creating a user is shown, which only requests the most important settings. All attributes can be shown by clicking on :guilabel:`Advanced`. The simplified wizard can be deactivated by setting the |UCSUCRV| :envvar:`directory/manager/web/modules/users/user/wizard/disabled` to ``true``.
de: In der Grundeinstellung wird zum Anlegen eines Benutzers ein vereinfachter Assistent angezeigt, der nur die wichtigsten Einstellungen abfragt. Alle Attribute können mit einem Klick auf :guilabel:`Erweitert` angezeigt werden. Der vereinfachte Assistent kann deaktiviert werden, indem die |UCSUCRV| :envvar:`directory/manager/web/modules/users/user/wizard/disabled` auf ``true`` gesetzt wird.

source: Advanced user settings
de: Erweiterte Benutzeransicht

source: User management module - General tab
de: Modul Benutzerverwaltung - Reiter Allgemein

source: *General* tab
de: Reiter *Allgemein*

source: Attribute
de: Attribut

source: Description
de: Beschreibung

source: Title
de: Anrede

source: The title of the user is to be entered here.
de: Die Anrede des Benutzers kann hier eingegeben werden.

source: First name
de: Vorname

source: The first name of the user is to be entered here.
de: Hier wird der Vorname des Benutzers eingetragen.

source: Last name
de: Nachname

source: The last name of the user is to be entered here.
de: Hier wird der Nachname des Benutzers angegeben.

source: Username
de: Benutzername

source: This is the name, by which the user logs into the system. For recommended characters for the user, see :ref:`users-recommendation-usernames`.
de: Mit diesem Namen meldet sich der Benutzer am System an. Für empfohlene Zeichen für einen Benutzernamen, siehe :ref:`users-recommendation-usernames`.

source: In order to ensure compatibility to non-UCS systems the creation of users which are only distinguished from each other by upper and lower case letters is prevented. Thus, if the username ``smith`` already exists, then the username ``Smith`` cannot be created.
de: Um die Kompatibilität mit Nicht-UCS-Systemen zu gewährleisten, wird das Anlegen von Benutzern, die sich lediglich in der Groß- und Kleinschreibung unterscheiden, verhindert. Wenn beispielsweise der Benutzername ``meier`` bereits existiert, wird der Benutzername ``Meier`` nicht mehr zugelassen.

source: By default it is not possible to create a user with the same name as an existing group. If the |UCSUCRV| :envvar:`directory/manager/user_group/uniqueness` is set to ``false``, this check is removed.
de: In der Grundeinstellung kann kein Benutzer mit dem Namen einer existierenden Gruppe angelegt werden. Wird die |UCSUCRV| :envvar:`directory/manager/user_group/uniqueness` auf ``false`` gesetzt, wird diese Prüfung aufgehoben.

source: Arbitrary descriptions for the user can be entered here.
de: Hier kann eine beliebige Beschreibung für den Benutzer eingetragen werden.

source: Password
de: Passwort

source: The user's password has to be entered here.
de: Hier wird das Passwort des Benutzers eingegeben.

source: Password (retype)
de: Passwort (Wiederholung)

source: In order to avoid spelling errors, the user's password has to be entered for a second time.
de: Um Tippfehler auszuschließen wird das Passwort des Benutzers erneut eingegeben.

source: Override password history
de: Passworthistorie ignorieren
