Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/user-management.po
Languages: de

source: By checking this box, the password history is overridden for this user and for this password change. This means, with this change the user can be assigned a password which is already in use.
de: Durch die Aktivierung dieses Auswahlkästchens wird die Passworthistorie für diesen Benutzer und für diese Passwortänderung außer Kraft gesetzt. Dadurch kann dem Benutzer mit dieser Änderung ein bereits verwendetes Passwort zugewiesen werden.

source: Further details on user password management can be found in :ref:`users-passwords`.
de: Weitere Hinweise zur Passwortverwaltung finden sich in :ref:`users-passwords`.

source: Override password check
de: Passwort-Prüfungen ignorieren

source: By checking this box, the requirements for the length of the password and for password quality checks are overridden for this user and for this password change. This means, the user can e.g. be assigned a shorter password than would be possible according to the defined minimum length.
de: Wird diese Option aktiviert, wird die Prüfung der Passwortlänge und -qualität für diesen Benutzer und für diese Passwortänderung außer Kraft gesetzt. Dadurch kann dem Benutzer mit dieser Änderung z.B. ein kürzeres Passwort zugewiesen werden, als in der Mindestlänge vorgegeben ist.

source: Further details on the password policies for users can be found in :ref:`users-passwords`.
de: Weitere Hinweise zur Passwortverwaltung finden sich in :ref:`users-passwords`.

source: Primary email address (mailbox)
de: Primäre E-Mail-Adresse (Mailbox)

source: The email address of the user is declared here, see :ref:`mail-management-users`.
de: Hier wird die E-Mail-Adresse des Benutzers eingetragen, siehe :ref:`mail-management-users`.

source: Display name
de: Anzeigename

source: The display name is automatically composed of the first and surnames. It generally does not need to be changed. The screen name is used for the synchronization with Active Directory and Samba/AD among other things.
de: Der Anzeigename wird automatisch aus Vor- und Nachname gebildet. In der Regel muss er nicht angepasst werden. Der Anzeigename wird u.a. in der Synchronisation mit Active Directory und Samba/AD verwendet.

source: Birthday
de: Geburtsdatum

source: This field is used to save a user's birthday.
de: In diesem Feld kann das Geburtsdatum des Benutzers gespeichert werden.

source: Organization
de: Organisation

source: The organization is to be entered here.
de: Die Organisation/das Unternehmen, dem der Benutzer angehört, wird in diesem Feld eingetragen.

source: Employee number
de: Mitarbeiternummer

source: Numbers for staff members can be entered in this field.
de: Die Mitarbeiter- oder Personalnummer kann in dieses Feld eingetragen werden.

source: Employee type
de: Mitarbeiterkategorie

source: The category of the staff member can be entered here.
de: Hier kann die Kategorie des Mitarbeiters festgelegt werden.

source: Superior
de: Vorgesetzter

source: The superior of the user can be selected here.
de: Der Vorgesetzte des Benutzers kann hier ausgewählt werden.

source: Picture of the user (JPEG format)
de: Bild des Benutzers (JPEG-Format)

source: This mask can be used to save a picture of the user in LDAP in JPEG format. In the default settings the file size is limited to 512 kilobytes.
de: Über diese Maske kann ein Bild des Benutzers im JPEG-Format im LDAP hinterlegt werden. Standardmäßig ist die Dateigröße auf 512 Kilobyte limitiert.

source: User management module - Groups tab
de: Modul Benutzerverwaltung - Reiter Gruppen

source: *Groups* tab
de: Reiter *Gruppen*

source: Primary group
de: Primäre Gruppe

source: This selection list can be used for specifying the user's primary group. All the groups registered in the domain are open for selection. By default, the group ``Domain Users`` is preset.
de: In dieser Auswahlliste kann die primäre Gruppe für den Benutzer festgelegt werden. Zur Auswahl stehen alle in der Domäne eingetragenen Gruppen. Standardmäßig ist die Gruppe ``Domain Users`` als Vorgabe eingestellt.

source: Groups
de: Gruppen

source: Here it is possible to set further group memberships for the user in addition to the primary group.
de: Hier können weitere Gruppenzugehörigkeiten des Benutzers neben der primären Gruppe eingestellt werden.

source: User management module - Account tab
de: Modul Benutzerverwaltung - Reiter Konto

source: *Account* tab
de: Reiter *Konto*

source: Account is deactivated
de: Konto ist deaktiviert

source: The *Account is deactivated* checkbox can be used to deactivate the user account. If the checkbox is selected, the user cannot log into the system. This affects all authentication methods. This is typically used when a user leaves the company. In a heterogeneous environment, an account deactivation might also be caused by external tools.
de: Mir dem Auswahlkästchen *Konto ist deaktiviert* kann das Benutzerkonto deaktiviert werden. Wenn das Auswahlkästchen gesetzt ist, kann sich der Benutzer nicht am System anmelden. Das betrifft alle Methoden für die Authentifikation. Ein typischer Anwendungsfall ist ein Benutzer, der das Unternehmen verlassen hat. Eine Kontodeaktivierung kann in einer heterogenen Umgebung gegebenenfalls auch durch externe Tools ausgelöst werden.

source: Account expiry date
de: Konto-Ablaufdatum

source: A date is specified in this input field on which the account will automatically be locked. This is practical for user accounts that only need to be active for a certain period of time, e.g., for interns.
de: In diesem Eingabefeld wird ein Datum vorgegeben, an dem das Konto automatisch gesperrt wird. Dies ist sinnvoll für zeitlich befristete Benutzerkonten, z.B. für Praktikanten.

source: If the date is deleted or replaced by a different, future date, the user will regain the right to sign in.
de: Wenn das Datum entfernt oder ein anderes, zukünftiges Datum eingetragen wird, kann sich der Benutzer wieder anmelden.

source: User has to change password on next login
de: Passwort bei der nächsten Anmeldung ändern

source: If this checkbox is ticked, then the user has to change their password during the next login procedure.
de: Wenn dieses Auswahlkästchen aktiviert ist, muss der Benutzer bei der nächsten Anmeldung an der Domäne sein Passwort ändern.

source: Password expiry date
de: Passwortablaufdatum

source: If the password is subject to an expiry date, then this date is displayed in this entry field. This entry field cannot be edited directly, see :ref:`users-passwords`.
de: Wenn das Passwort zu einem bestimmten Datum abläuft, wird dieses Datum in diesem Eingabefeld angezeigt. Das Eingabefeld ist nicht direkt änderbar, siehe :ref:`users-passwords`.

source: If a password expiry interval is defined, the password expiry date is automatically adjusted when passwords are changed.
de: Ist ein Passwortablaufintervall definiert, wird das Passwortablaufdatum bei Passwortänderungen automatisch angepasst.

source: If no *Expiry interval* is declared, the old expiry date will be deleted and no new date will be set.
de: Wird kein *Passwortablaufdatum* gesetzt, werden vielleicht bestehende frühere Ablaufdaten entfernt.

source: Unlock lockout
de: Aussperrung zurücksetzen

source: If the account has automatically been locked temporarily for security reasons, usually because the user has entered the password incorrectly too often, this checkbox can be used to unlock the account again manually before the lockout is lifted automatically when the lockout duration has passed. This temporary account lockout can happen if a corresponding domain wide policy setting has been defined by an administrator. There are three different mechanisms that may trigger lockout if configured properly:
de: Wenn das Benutzerkonto aus Sicherheitsgründen automatisch gesperrt worden ist, meist weil ein Benutzer sein Passwort zu oft fehlerhaft eingegeben hat, kann dieses Auswahlkästchen dazu verwendet werden, um das Konto manuell schon vor Ablauf der Sperrzeit zu entsperren. Eine temporäre Aussperrung kann auftreten, wenn ein Administrator eine entsprechende domänenweite Einstellung definiert hat. Es gibt drei unterschiedliche Mechanismen, die eine Aussperrung auslösen können, falls sie konfiguriert wurden:

source: Failed PAM authentication attempts to an UCS server (see :ref:`users-faillog`).
de: Fehlgeschlagene Authentifikation per PAM an einem UCS-Server (siehe :ref:`users-faillog`).

source: Failed LDAP authentication attempts (if the :program:`ppolicy` overlay has been activated and configured).
de: Fehlgeschlagene Authentifikation per LDAP (falls das Overlay-Modul :file:`ppolicy` aktiviert und konfiguriert wurde).

source: Failed Samba/AD authentication attempts (if the Samba domain ``passwordsettings`` have been configured).
de: Fehlgeschlagene Authentifikation per Samba/AD (falls die Samba domain ``passwordsettings`` konfiguriert wurden).

source: Lockout till
de: Aussperrung endet

source: If the account has automatically been locked temporarily for security reasons, usually because the user has entered the password incorrectly too often, this field shows the time when the account automatically gets unlocked.
de: Wenn das Benutzerkonto aus Sicherheitsgründen automatisch gesperrt worden ist, meist weil ein Benutzer sein Passwort zu oft fehlerhaft eingegeben hat, zeigt dieses Feld den Zeitpunkt an, ab dem das Konto regulär automatisch entsperrt wird.

source: Activation date
de: Aktivierungsdatum

source: If a user account shall only become usable at a later date, this can be set here. A cron job periodically checks if accounts need to be activated. It runs every 15 minutes by default. When saving the changes, the account is automatically marked as deactivated in case a date in the future has been specified.
de: Wenn ein Benutzerkonto erst an einem bestimmten, zukünftigen Datum aktiviert werden soll, kann hier das Datum eingestellt werden. Ein Cron-Job prüft periodisch, ob Benutzerkonten aktiviert werden müssen. Per Voreinstellung geschieht das alle 15 Minuten. Wird hier ein Datum eingestellt, das in der Zukunft liegt, dann wird beim Speichern automatisch auch das Konto als deaktiviert markiert.

source: Windows home drive
de: Laufwerk für das Windows-Heimatverzeichnis

source: If the Windows home directory for this user is to show up on a different Windows drive than that specified by the Samba configuration, then the corresponding drive letter can be entered here, e.g. :file:`M:`.
de: Wenn das Windows-Heimatverzeichnis bei diesem Benutzer auf einem anderen Windows-Laufwerk erscheinen soll, als in der Samba-Konfiguration vorgegeben, so kann hier ein Laufwerksbuchstabe eingetragen werden, z.B. :file:`M:`.

source: Windows home path
de: Windows-Heimatverzeichnis

source: The path of the directory which is to be the user's Windows home directory, is to be entered here, e.g. :file:`\\ucs-file-server\smith`.
de: Hier wird der Pfad zu dem Verzeichnis angegeben, das als Windows-Heimatverzeichnis für den Benutzer dienen soll, z.B. :file:`\\ucs-file-server\meier`.

source: Windows logon script
de: Anmeldeskript

source: The user-specific logon script relative to the NETLOGON share is entered here, e.g. :file:`user.bat`.
de: Hier wird das benutzerspezifische Anmeldeskript relativ zur Netlogon-Freigabe eingetragen, z.B. :file:`user.bat`.

source: Windows profile directory
de: Profilverzeichnis

source: The profile directory for the user can be entered here, e.g. :file:`\\ucs-file-server\user\profile`.
de: Das Profilverzeichnis für den Benutzer kann hier angegeben werden, e.g. :file:`\\ucs-file-server\user\profile`.

source: The relative ID (RID) is the local part of the SID. If a user is to be assigned a certain RID, the ID in question can be entered in this field. If no RID is assigned, the next available RID will automatically be used. The RID cannot be subsequently changed. Integers from 1000 upwards are permitted. RIDs below 1000 are reserved to standard groups and other special objects.
de: Die relative ID (RID) ist der lokale Teil der SID-Domänenkennung. Wenn ein Benutzer eine bestimmte RID erhalten soll, so kann diese hier eingetragen werden. Wenn keine RID eingetragen wird, so wird automatisch die nächste freie RID verwendet. Die RID kann nachträglich nicht geändert werden, es sind ganze Zahlen ab 1000 zulässig. RIDs unter 1000 sind Standard-Gruppen und anderen speziellen Objekten vorbehalten.

source: Samba privilege(s)
de: Samba-Privilegien

source: This selection mask can be used to assign a user selected Windows systems rights, for example the permission to join a system to the domain.
de: Mit dieser Auswahlmaske können einem Benutzer ausgewählte Windows-Systemrechte zugewiesen werden, etwa die Berechtigung ein System in die Domäne zu joinen.

source: Permitted times for Windows logins
de: Erlaubte Zeiten für Windows-Anmeldungen

source: This input field contains time periods for which this user can sign in to Windows computers.
de: In diesem Eingabefeld werden Zeitspannen festgelegt, zu denen sich dieser Benutzer an Windows-Rechnern anmelden kann.

source: If no entry is made in this field, the user can sign in at any time of day.
de: Wird keine Einstellung in diesem Feld vorgenommen, so kann sich der Benutzer zu jeder Tageszeit anmelden.

source: Allow the authentication only on these Microsoft Windows host(s)
de: Anmeldung nur an diesen Microsoft Windows-Rechnern zulassen

source: This setting specifies the clients where the user may sign in. If no settings are made, the user can sign in to any client.
de: Diese Einstellung gibt an, an welchen Rechnern sich der Benutzer anmelden darf. Werden keine Einstellungen vorgenommen, ist der Benutzer berechtigt, sich an jedem Rechner anzumelden.

source: UNIX home directory
de: UNIX-Heimatverzeichnis

source: The path of the user's home directory.
de: Der Verzeichnispfad zum Heimatverzeichnis des Benutzers.

source: The user's login shell is to be entered in this field. This program is started if the user performs a text-based login. By default, :file:`/bin/bash` is preset.
de: In diesem Feld wird die Login-Shell des Benutzers eingetragen. Dieses Programm wird bei der textbasierten Anmeldung des Benutzers gestartet. Standardmäßig wird hier :file:`/bin/bash` eingetragen.

source: User ID
de: Benutzer-ID

source: If the user is to be assigned a certain user ID, the ID in question can be entered in this field. If no value is specified, a free user ID is assigned automatically.
de: Wenn der Benutzer eine bestimmte Benutzer-ID erhalten soll, so kann die Benutzer-ID in dieses Feld eingetragen werden. Wird kein Wert vorgegeben, wird automatisch eine freie Benutzer-ID zugewiesen.

source: The user ID can only be declared when adding the user. When the user data are subsequently edited, the user ID will be represented in gray and barred from change.
de: Die Benutzer-ID kann nur beim Hinzufügen des Benutzers angegeben werden, beim späteren Bearbeiten des Benutzers kann die Benutzer-ID nicht geändert werden und wird ausgegraut dargestellt.

source: Group ID of the primary group
de: Gruppen-ID der primären Gruppe

source: The group ID of the user's primary group is shown here. The primary group can be changed in the *General* tab.
de: Hier wird die Gruppen-ID der primären Gruppe des Benutzers angezeigt. Die primäre Gruppe kann im Reiter *Allgemein* geändert werden.

source: Home share
de: Heimatverzeichnisfreigabe

source: If a share is selected here, the home directory is stored on the specified server. If no selection is made, the user data are saved on the respective login system.
de: Wird hier eine Freigabe ausgewählt, wird das Heimatverzeichnis auf dem angegebenen Server gespeichert. Erfolgt keine Auswahl, werden die Benutzerdaten auf dem jeweiligen Anmeldesystem gespeichert.

source: Home share path
de: Pfad der Heimatverzeichnisfreigabe

source: The path of the home directory relative to the *Home share* is declared here. The username is already preset as a default value when creating a user.
de: Hier wird der Pfad zum Heimatverzeichnis relativ zur *Heimatverzeichnisfreigabe* angegeben. Beim Neuanlegen eines Benutzers ist der Benutzername als Vorgabewert bereits eingetragen.

source: User management module - Contact tab
de: Modul Benutzerverwaltung - Reiter Kontakt

source: *Contact* tab
de: Reiter *Kontakt*

source: Email address(es)
de: E-Mail-Adresse(n)

source: Additional email addresses can be saved here. These are not evaluated by the mail server.
de: Hier können weitere E-Mail-Adressen hinterlegt werden. Diese werden nicht vom Mailserver ausgewertet.

source: The values of this attribute are stored in the LDAP attribute ``mail``. Most address book applications using an LDAP search function will search for an email address by this attribute.
de: Die Werte werden im LDAP-Attribut ``mail`` gespeichert. Die meisten Adressbuch-Applikationen suchen im LDAP nach diesem Attribut.

source: Telephone number(s)
de: Telefonnummer(n)

source: This field contains the user's business phone number.
de: Dieses Feld beinhaltet die geschäftlichen Telefonnummern des Benutzers.

source: Room number(s)
de: Raumnummer

source: The room number of the user.
de: Die Raumnummer des Benutzers.

source: Department number(s)
de: Abteilungsnummer

source: The department number of the user can be entered here.
de: Hier kann die Abteilungsnummer des Mitarbeiters angegeben werden.

source: Street
de: Straße

source: The street and house number of the user's business address can be entered here.
de: Die Straße und die Hausnummer der Geschäftsadresse des Benutzers kann hier eingetragen werden.

source: Postal code
de: Postleitzahl

source: This field contains the postal code of the user's business address.
de: Dieses Feld beinhaltet die Postleitzahl der Geschäftsadresse des Benutzers.

source: City
de: Stadt

source: This field contains the city of the user's business address.
de: Dieses Feld beinhaltet die Stadt der Geschäftsadresse des Benutzers.

source: Private telephone number(s)
de: Telefonnummer(n) Festnetz

source: The private fixed network phone number can be entered here.
de: Die privaten Festnetznummern können hier angegeben werden.

source: Mobile telephone number(s)
de: Telefonnummer(n) Mobil

source: The user's mobile numbers can be entered here.
de: Hier werden die privaten Mobilfunknummern des Benutzers eingetragen.

source: Pager telephone number(s)
de: Rufnummer(n) Pager

source: Pager numbers can be entered here.
de: Pager-Rufnummern werden in diesem Feld angegeben.

source: Private postal address(es)
de: Private Adresse

source: One or more of the user's private postal addresses can be entered in this field.
de: Eine oder mehrere private Postadressen des Benutzers können in diesem Feld angegeben werden.

source: User management module - Mail tab
de: Modul Benutzerverwaltung - Reiter Mail

source: This tab is displayed in the advanced settings.
de: Diese Karteikarte wird in den erweiterten Einstellungen angezeigt.

source: The settings are described in :ref:`mail-management-users`.
de: Die Einstellungen sind in :ref:`mail-management-users` beschrieben.

source: User management module - Options tab
de: Modul Benutzerverwaltung - Reiter Optionen

source: *(Options)* tab
de: Reiter *(Optionen*)

source: Public key infrastructure account
de: Public Key Infrastruktur-Konto

source: If this checkbox is not ticked, the user will not be assigned the object class ``pkiUser``.
de: Wenn dieses Auswahlkästchen nicht markiert ist, erhält der Benutzer die Objektklasse ``pkiUser`` nicht.

source: User activation for apps
de: Benutzeraktivierung für Apps

source: Many apps from the App Center are compatible with the central identity management in UCS. This allows system administrators to activate the users for apps. In some cases, app specific settings for the user can be made. This depends on the app and how it uses the identity management.
de: Viele Apps aus dem App Center sind mit dem zentralen Identity Management in UCS verknüpft. Dadurch können Systemadministratoren die Benutzer für Apps aktivieren. In manchen Fällen können noch weitere App spezifische Einstellungen für den Benutzer vorgenommen werden. Das ist abhängig von der App und wie diese das Identity Management nutzt.

source: User activation for installed apps
de: Benutzeraktivierung für installierte Apps

source: Once an app with user activation is installed in the UCS environment, it will appear with the logo in the :guilabel:`Apps` tab of the user in the UMC module *Users*. With a tick in the checkbox the user is activated for the app. If the app offers specific settings another tab with the name of the app will appear to set these parameters. The app activation and the parameters are stored at the user object in the LDAP directory service.
de: Sobald eine App in der UCS-Umgebung installiert ist, die die Benutzeraktivierung verwendet, erscheint sie mit Logo im Reiter :guilabel:`Apps` des Benutzers im UMC-Modul *Benutzer*. Mit einem Haken in der Checkbox wird der Benutzer für die App aktiviert. Wenn noch weitere Einstellungen für die Berechtigung gemacht werden können, erscheint ein zusätzlicher Reiter mit dem Namen der App, um diese Parameter zu setzen. Die App Aktivierung und die Parameter werden am Benutzerobjekt im LDAP-Verzeichnisdienst von UCS gespeichert.

source: To withdraw a user activation for an app, it is sufficient to deselect the checkbox.
de: Um einem Benutzer die Berechtigung zur Nutzung einer App wieder zu entziehen, genügt es, den Haken aus Checkbox zu entfernen.

source: When the app is uninstalled, the checkbox of the user activation for the app is removed from the :guilabel:`Apps` tab of the user in the UMC module.
de: Wenn die App deinstalliert wird, wird die Checkbox der Benutzeraktivierung für die App vom Reiter :guilabel:`Apps` des Benutzers im UMC-Modul entfernt.

source: Automatic lockout of users after failed login attempts
de: Automatisches Sperren von Benutzern nach fehlgeschlagenen Anmeldungen

source: By default, a user can enter their password incorrectly any number of times. To hinder brute force attacks on passwords, an automatic lockout for user accounts can be activated after a configured number of failed login attempts.
de: Standardmäßig kann ein Benutzer sein Passwort beliebig oft falsch eingeben. Um Brute Force-Angriffe auf Passwörter zu erschweren, kann eine automatische Sperre von einem Benutzerkonto nach einer konfigurierbaren Anzahl von fehlerhaften Anmeldungen aktiviert werden.

source: UCS unifies various methods for user authentication and authorization. Depending on the installed software components, there may be different mechanisms for configuring and counting failed login attempts.
de: UCS vereinheitlicht verschiedene Methoden zur Authentifizierung und Autorisierung von Benutzern. Abhängig von den installierten Softwarekomponenten kann es verschiedene Mechanismen geben, wie fehlgeschlagene Anmeldeversuche konfiguriert und gezählt werden.

source: The three different methods are described in the next sections.
de: Im folgenden werden die drei unterschiedlichen Methoden beschrieben.

source: Samba Active Directory Service
de: Samba Active Directory Dienste

source: In Samba Active Directory environments, various services are provided by Samba, such as Kerberos. To lockout users after too many failed login attempts, the tool :command:`samba-tool` can be used.
de: In Samba Active Directory Umgebungen werden diverse Dienste von Samba bereitgestellt, wie zum Beispiel Kerberos. Um Benutzer nach fehlgeschlagenen Anmeldungen zu sperren, kann das Tool :command:`samba-tool` verwendet werden.

source: To show the currently configured values:
de: Um die aktuell konfigurierten Werte anzuzeigen:
