Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/user-management.po
Languages: de

source: Chapter contents:
de: Kapitelinhalte:

source: User management
de: Benutzerverwaltung

source: UCS integrates central identity management. All user information are managed centrally in UCS via the |UCSUMC| module :guilabel:`Users` and stored in the LDAP directory service.
de: UCS integriert ein zentrales Identity-Management. Alle Benutzerinformationen werden in UCS zentral über das UMC-Modul :guilabel:`Benutzer` verwaltet und im LDAP-Verzeichnisdienst gespeichert.

source: All the services integrated in the domain access the central account information, i.e., the same username and password are used for the user login to a Windows client as for the login on the IMAP server.
de: Alle in die Domäne integrierten Dienste greifen dabei auf die zentralen Kontoinformationen zu, d.h. für die Benutzeranmeldung an einem Windows-Client wird die gleiche Benutzerkennung und das gleiche Passwort verwendet wie etwa bei der Anmeldung am IMAP-Server.

source: The domain-wide management of user data reduces the administrative efforts as changes do not need to be subsequently configured on different individual systems. Moreover, this also avoids subsequent errors arising from inconsistencies between the individual datasets.
de: Die domänenweite Verwaltung von Benutzerdaten verringert den administrativen Aufwand, da Änderungen nicht auf verschiedenen Einzelsystemen nachkonfiguriert werden müssen. Darüber hinaus vermeidet dies Folgefehler, die sich durch Inkonsistenzen zwischen den einzelnen Datenbeständen ergeben können.

source: User account types
de: Arten von Benutzerkonten

source: There are three different types of user accounts in UCS:
de: In UCS gibt es drei unterschiedliche Arten von Benutzerkonten:

source: **Normal user accounts** have all available properties. These users can log in to UCS or Windows systems and, depending on the configuration, also to the installed Apps. The users can be administered via the UMC module :guilabel:`Users` (see :ref:`users-management`).
de: *Vollwertige Benutzerkonten*: Normale, vollwertige Benutzerkonten haben sämtliche verfügbaren Eigenschaften. Diese Benutzer können sich an UCS- oder Windows-Systemen anmelden und je nach Konfiguration auch an den installierten Apps. Die Benutzer können über das UMC-Modul :guilabel:`Benutzer` (siehe :ref:`users-management`) administriert werden.

source: **Address book entries** can be used to maintain internal or external contact information. These contacts can't sign in to UCS or Windows systems. Address book entries can be managed via the UMC module :guilabel:`Contacts`.
de: *Adressbucheinträge*: Adressbucheinträge können für die Pflege von internen oder externen Kontaktinformationen verwendet werden. Diese Kontakte können sich nicht an UCS- oder Windows-Systemen anmelden. Adressbucheinträge können über das UMC-Modul :guilabel:`Kontakte` verwaltet werden.

source: **Simple authentication account**: With a simple authentication account, a user object is created, which has only a username and a password. With this account, only authentication against the LDAP directory service is possible, but no login to UCS or Windows systems. Simple authentication accounts can be accessed via the UMC module :guilabel:`LDAP directory` (see :ref:`central-navigation`).
de: *Einfaches Authentisierungskonto*: Mit einem einfachen Authentisierungskonto wird ein Benutzer-Objekt angelegt, welches ausschließlich einen Benutzernamen und ein Passwort hat. Mit diesem Konto ist ausschließlich eine Authentisierung gegen den LDAP-Verzeichnisdienst möglich, aber keine Anmeldung an UCS- oder Windows-Systemen. Einfache Authentisierungskonten können über das UMC-Modul :guilabel:`LDAP-Verzeichnis` (siehe :ref:`central-navigation`) erstellt werden.

source: Recommendation for username definition
de: Empfehlung zur Definition von Benutzernamen

source: One very important and required attribute for user accounts is the *username*. To avoid conflicts with the different tools handling user accounts in UCS, adhere to the following recommendations for the definition of usernames:
de: Ein sehr wichtiges und erforderliches Attribut für Benutzerkonten ist der Benutzername. Um Konflikte mit den verschiedenen Werkzeugen zu vermeiden, die Benutzerkonten in UCS verarbeiten, berücksichtigen Sie die folgenden Empfehlungen für die Definition von Benutzernamen:

source: Only use lower case letters (``a-z``), digits (``0-9``) and the hyphen (``-``) from the ASCII character set for usernames.
de: Verwenden Sie für Benutzernamen nur Kleinbuchstaben (``a-z``), Ziffern (``0-9``) und den Bindestrich (``-``) aus dem ASCII-Zeichensatz.

source: The username starts with a lower case letter from the ASCII character set. The hyphen is not allowed as last character.
de: Der Benutzername beginnt mit einem Kleinbuchstaben aus dem ASCII-Zeichensatz. Der Bindestrich als letztes Zeichen ist nicht erlaubt.

source: In UCS the username has at least a length of 4 characters and at most 20 characters.
de: In UCS hat der Benutzername eine Länge von mindestens 4 und höchstens 20 Zeichen.

source: The recommendation results in the following regular expression: :regexp:`^[a-z][a-z0-9-]{2,18}[a-z0-9]$`.
de: Die Empfehlung ergibt den folgenden regulären Ausdruck: :regexp:`^[a-z][a-z0-9-]{2,18}[a-z0-9]$`.

source: Besides the recommendation, usernames also contain underscores (``_``) and upper case ASCII letters in practice. Consider the recommendation as a guideline and not a rule and keep potential side-effects in mind when defining usernames outside the recommendation.
de: Neben der Empfehlung enthalten Benutzernamen in der Praxis auch Unterstriche (``_``) und ASCII-Großbuchstaben. Betrachten Sie die Empfehlung als Richtlinie und nicht als harte Regel und bedenken Sie mögliche Nebenwirkungen, wenn Sie Benutzernamen außerhalb der Empfehlung definieren.

source: Overlay module for recording an account's last successful LDAP bind
de: Overlay-Modul zur Aufzeichnung der letzten erfolgreichen LDAP-Anmeldung eines Kontos

source: Before using this feature please read :uv:kb:`support article about activating the OpenLDAP lastbind overlay module <14404>`.
de: Bevor Sie diese Funktion verwenden, lesen Sie :uv:kb:`Support-Artikel über die Aktivierung des lastbind Overlay-Moduls <14404>`.

source: The optional `lastbind overlay module <lastbind-overlay_>`_ for OpenLDAP allows recording the timestamp of the last successful LDAP bind in the ``authTimestamp`` attribute and can for example be used to detect unused accounts.
de: Das optionale `lastbind Overlay-Modul <last-bind-overlay_>`_ für OpenLDAP ermöglicht die Aufzeichnung des Zeitstempels der letzten erfolgreichen LDAP-Anmeldung im ``authTimestamp`` Attribut und kann z.B. zur Erkennung nicht genutzter Konten verwendet werden.

source: The ``lastbind`` overlay module can be activated by setting the |UCSUCRV| :envvar:`ldap/overlay/lastbind` to ``yes`` and restarting the OpenLDAP server. When the module is activated on an UCS server, a timestamp is written to the account's ``authTimestamp`` attribute when that account logs into the LDAP server. The |UCSUCRV| :envvar:`ldap/overlay/lastbind/precision` can be used to configure the time in seconds that has to pass before the ``authTimestamp`` attribute is updated. This prevents a large number of write operations that can impair performance.
de: Das ``lastbind`` Overlay-Modul kann aktiviert werden, indem die |UCSUCRV| :envvar:`ldap/overlay/lastbind` auf ``yes`` gesetzt und der OpenLDAP-Server neu gestartet wird. Wenn das Modul auf einem UCS-Server aktiviert ist, wird der Zeitstempel einer erfolgreichen LDAP-Anmeldung eines Kontos, in das ``authTimestamp`` Attribut jenes Kontos geschrieben. Die |UCSUCRV| :envvar:`ldap/overlay/lastbind/precision` kann verwendet werden, um die Zeit in Sekunden zu konfigurieren, die vergehen muss, bevor das ``authTimestamp`` Attribut aktualisiert wird. Dies verhindert eine große Anzahl von Schreiboperationen, die die Leistung beeinträchtigen können.

source: The ``authTimestamp`` attribute can only be queried on the LDAP server where the ``lastbind`` overlay module is activated. It is not replicated to other LDAP servers. For that reason the :file:`/usr/share/univention-ldap/univention_lastbind.py` script can be executed to collect the youngest ``authTimestamp`` value from all reachable LDAP servers in the UCS domain and save it into the ``lastbind`` extended UDM attribute of a user. The script can be invoked to update the ``lastbind`` extended attribute of one or all users. The ``lastbind`` extended attribute maps to the ``univentionAuthTimestamp`` LDAP attribute.
de: Das ``authTimestamp`` Attribut kann nur auf dem LDAP-Server abgefragt werden, auf dem das ``lastbind`` Overlay-Modul aktiviert ist. Es wird nicht auf andere LDAP-Server repliziert. Aus diesem Grund kann das Skript :file:`/usr/share/univention-ldap/univention_lastbind.py` ausgeführt werden, um den jüngsten ``authTimestamp`` Wert von allen erreichbaren LDAP-Servern in der UCS-Domäne zu sammeln und in das erweiterte UDM Attribut ``lastbind`` eines Benutzers zu speichern. Das Skript kann aufgerufen werden, um das erweiterte Attribut ``lastbind`` eines oder aller Benutzer zu aktualisieren. Das erweiterte Attribut ``lastbind`` wird auf das LDAP-Attribut ``univentionAuthTimestamp`` abgebildet.

source: One way to keep the ``lastbind`` extended attribute up-to-date is by creating a cron job via UCR:
de: Eine Möglichkeit, das erweiterte Attribute ``lastbind`` aktuell zu halten, ist durch das Anlegen eines Cron-Jobs via UCR:

source: $ ucr set cron/update_lastbind_attribute/command='\ /usr/share/univention-ldap/univention_lastbind.py --allusers'\ cron/update_lastbind_attribute/time='00 06 * * *' # daily at 06:00 a.m.
de: $ ucr set cron/update_lastbind_attribute/command='\ /usr/share/univention-ldap/univention_lastbind.py --allusers'\ cron/update_lastbind_attribute/time='00 06 * * *' # täglich um 06:00 Uhr.

source: More information on how to set cron jobs via UCR can be found in :ref:`computers-defining-cron-jobs-in-univention-configuration-registry`.
de: Weitere Informationen über die Einstellung von Cron-Jobs über UCR können in :ref:`computers-defining-cron-jobs-in-univention-configuration-registry` gefunden werden.

source: User password management
de: Verwaltung der Benutzerpasswörter

source: Most internet users find it difficult to choose the right password. The password is the key to accessing user accounts, even in a UCS domain. Passwords that are difficult to guess and regular passwords changes are an essential element of the system security of a UCS domain. To prevent users from choosing passwords that are too easy, administrators can configure several properties in a *password policy*.
de: Den meisten Internetnutzern fällt es schwer, das richtige Passwort zu wählen. Das Passwort ist der Schlüssel zum Zugriff auf Benutzerkonten, auch in einer UCS-Domäne. Schwer zu erratende Passwörter und regelmäßiger Wechsel der Passwörter sind ein wesentliches Element der Systemsicherheit einer UCS-Domäne. Um zu verhindern, dass Benutzer zu einfache Passwörter wählen, können Administratoren mehrere Eigenschaften in einer *Passwortrichtlinie* konfigurieren.

source: This section describes how to define password policies, such as a minimum password length and an expiration time interval. UCS applies the password policy when users change their passwords.
de: Dieser Abschnitt beschreibt, wie Sie Passwortrichtlinien definieren, z. B. eine Mindestlänge des Passworts und ein Zeitintervall für den Ablauf. UCS wendet die Passwortrichtlinie an, wenn Benutzer ihre Passwörter ändern.

source: UCS stores the user password for every user as hash in different attributes of the corresponding LDAP user account object:
de: UCS speichert das Benutzerpasswort für jeden Benutzer als Hash in verschiedenen Attributen des entsprechenden LDAP-Objekts des Benutzerkontos:

source: stores the Kerberos password.
de: speichert das Kerberos-Passwort.

source: stores the Unix password. Other Linux distributions store it in :file:`/etc/shadow`.
de: speichert das Unix-Passwort. Andere Linux Distributionen speichern es in :file:`/etc/shadow`.

source: stores the NT password hash used by Samba.
de: speichert den von Samba verwendeten NT-Passwort-Hash.

source: `Creating Secure Passwords <bsi-secure-password_>`_ by German Federal Office of Information Security
de: `Sichere Passwörter erstellen <bsi-secure-password_>`_ von Bundesamt für Sicherheit in der Informationstechnik

source: for more information and tips about creating a secure and good password.
de: für weitere Informationen und Tipps zur Erstellung eines sicheren und guten Passworts.

source: Password policy types
de: Arten von Passwortrichtlinien

source: UCS has several types of password policy settings as outlined in this section. What policy applies depends on who runs the password change and if the UCS domain has Samba installed through the app :program:`Active Directory Domain Controller`.
de: UCS verfügt über mehrere Arten von Kennwortrichtlinieneinstellungen, die in diesem Abschnitt beschrieben sind. Welche Richtlinie gilt, hängt davon ab, wer die Passwortänderung durchführt und ob in der UCS-Domäne Samba über die App :program:`Active Directory Domain Controller` installiert ist.

source: Password Policy in UDM
de: Passwortrichtlinie in UDM

source: The *Password Policy* is a UDM policy that applies to user password changes done through UMC modules which in turn use UDM in the backend. The *Password Policy* applies, when an **administrator** changes a user's password through UMC or UDM. It also applies, when a **user** changes their password and if the UCS domain **hasn't** Samba installed.
de: Die *Passwortrichtlinie* ist eine UDM Richtlinie, die für die Änderung von Benutzerpasswörtern durch UMC-Module gilt, die ihrerseits UDM im Backend verwenden. Die *Passwortrichtlinie* gilt, wenn ein **Administrator** das Passwort eines Benutzers über UMC oder UDM ändert. Dies gilt auch, wenn ein **Benutzer** sein Passwort ändert und die UCS-Domäne **kein** Samba installiert hat.

source: UCS defines a default password policy. :ref:`users-passwords-policy-settings-umc` describes the available settings for the *Password Policy*.
de: UCS definiert eine Standard-Passwortrichtlinie. :ref:`users-passwords-policy-settings-umc` beschreibt die verfügbaren Einstellungen für die *Passwortrichtlinie*.

source: You can enhance the *Password quality check* with |UCSUCRVs| mentioned in :ref:`users-passwords-policy-settings-umc`.
de: Sie können die *Passwort-Qualitätsprüfung* mit |UCSUCRVs| erweitern, wie in :ref:`users-passwords-policy-settings-umc` erwähnt.

source: You can create additional password policies and assign them to user account objects in the LDAP directory tree. For more information about policies, see :ref:`central-policies`.
de: Sie können zusätzliche Passwortrichtlinien erstellen und sie den Benutzerkonten im LDAP-Verzeichnisbaum zuweisen. Weitere Informationen über Richtlinien finden Sie unter :ref:`central-policies`.

source: When you have Samba installed, design the password requirement settings of the user password policy identical to the Samba domain object as described in :ref:`users-password-samba`.
de: Wenn Sie Samba installiert haben, entwerfen Sie die Einstellungen für die Passwortanforderungen der Benutzerpasswortrichtlinie so, dass sie mit dem Samba-Domänenobjekt identisch ist, wie in :ref:`users-password-samba` beschrieben.

source: Password policy for the Samba domain
de: Passwortrichtlinie für die Samba-Domäne

source: When you have Samba installed in your UCS domain, the Samba domain has it's own password policy. The Samba password policy **always** applies, when a **user** changes their password, regardless of the used service, through Univention Portal, User Self Service, Microsoft Windows, or Kerberos.
de: Wenn Sie Samba in Ihrer UCS-Domäne installiert haben, hat die Samba-Domäne eine eigene Passwortrichtlinie. UCS wendet die Samba-Passwortrichtlinie an, wenn ein **Benutzer** sein Passwort ändert, egal über welchen Dienst, über das Univention Portal, den User Self Service, Microsoft Windows oder Kerberos.

source: To configure the password policy for the Samba domain, see :ref:`users-password-samba`.
de: Um die Passwortrichtlinie für die Samba-Domäne zu konfigurieren, siehe :ref:`users-password-samba`.

source: :ref:`windows-setup4` of Samba
de: :ref:`windows-setup4` von Samba

source: for more information about the installation of Samba.
de: für weitere Informationen über die Installation von Samba.

source: for general information about Samba providing Services for Windows.
de: für allgemeine Informationen über die Services für Windows.

source: Change the user password
de: Ändern des Benutzerpassworts

source: Changing the user password has the following triggers:
de: Das Ändern des Benutzerpassworts hat folgende Auslöser:

source: The systems requires the user to change their password, for example, because the password reached the expiration interval.
de: Das System fordert den Benutzer auf, sein Passwort zu ändern, z. B. weil das Passwort sein Ablaufdatum erreicht hat.

source: Through a setting at the user account, an administrator requests the user to change their password upon next sign-in.
de: Durch eine Einstellung am Benutzerkonto, fordert ein Administrator den Benutzer auf, sein Passwort bei der nächsten Anmeldung zu ändern.

source: The user decides to change their password.
de: Der Benutzer beschließt, sein Passwort zu ändern.

source: When a user decides to change their password, they can use the following ways:
de: Wenn ein Benutzer sein Passwort ändern möchte, kann er dies auf folgende Weise tun:

source: Every UCS domain has the *Portal* installed. To change the password, use the following steps:
de: In jeder UCS-Domäne ist das *Portal* installiert. Um das Passwort zu ändern, gehen Sie wie folgt vor:

source: Sign in to the *Univention Portal*.
de: Melden Sie sich am *Univention Portal* an.

source: Navigate to the user menu. It's the *"burger menu"* in top right corner.
de: Navigieren Sie zum Benutzermenü. Es ist das *"Burger-Menü"* in der oberen rechten Ecke.

source: Select :menuselection:`User settings --> Change your password`.
de: Wählen Sie :menuselection:`Benutzereinstellungen --> Ihr Passwort ändern` aus.

source: Provide your current password and set a new password. Retype it and confirm.
de: Geben Sie Ihr aktuelles Passwort ein und setzen Sie ein neues Passwort. Geben Sie es erneut ein und bestätigen Sie es.

source: User Self Service
de: Benutzer Selbstverwaltung

source: The :ref:`user-management-password-changes-by-users` is a dedicated app in the :ref:`software-appcenter`. It offers a direct link to the password change so that administrators can add a prominent tile to the Univention Portal for the password change. Furthermore, the app offers a way to reset the user password when they forgot it.
de: Die :ref:`user-management-password-changes-by-users` ist eine eigene App im :ref:`software-appcenter`. Sie bietet einen direkten Link zur Passwortänderung, so dass Administratoren eine prominente Kachel im Univention Portal für die Passwortänderung hinzufügen können. Außerdem bietet die App eine Möglichkeit, das Passwort der Benutzer zurückzusetzen, wenn diese es vergessen haben.

source: Users can change their user password through their Microsoft Windows client that's joined in the UCS domain through Samba.
de: Benutzer können ihr Benutzerpasswort über ihren Microsoft Windows-Client ändern, der über Samba mit der UCS-Domäne verbunden ist.

source: Users can change their user password through clients that have joined in the UCS domain through Kerberos. They can use the default features of those clients to change the password.
de: Benutzer können ihr Benutzerpasswort über Clients ändern, die der UCS-Domäne über Kerberos beigetreten sind. Sie können die Standardfunktionen zur Änderung des Passworts dieser Clients verwenden.

source: For more information about joining Ubuntu and Linux systems to a UCS domain and the integration with Kerberos, see :cite:t:`ext-doc-domain`.
de: Für weitere Informationen über die Einbindung von Ubuntu- und Linux-Systemen in eine UCS Domäne und die Integration mit Kerberos, siehe :cite:t:`ext-doc-domain`.

source: Password policy settings in UMC
de: Passwortrichtlinieneinstellungen in UMC

source: With the password policy settings in UMC administrators can define the minimum password length, the expiry interval and the password history length. :numref:`password-policy` shows the password policy settings in UMC. Following the figure, you find a reference of the available settings.
de: Mit den Einstellungen der Passwortrichtlinie in UMC können Administratoren die Mindestpasswortlänge, das Ablaufintervall und die Länge der Passworthistorie festlegen. :numref:`password-policy` zeigt die Einstellungen der Passwortrichtlinie in UMC. Im Anschluss an die Abbildung finden Sie einen Referenz der verfügbaren Einstellungen.

source: Configuring a password policy
de: Konfiguration einer Passwortrichtlinie

source: On the *General* tab of a password policy, you can configure the following settings.
de: Auf dem Reiter *Allgemein* einer Passwortwortrichtlinie können Sie die folgenden Einstellungen vornehmen.

source: History length
de: Passworthistorie

source: The password history saves the last used password hashes. The *History length* determines the length of that history, for example if the history stores the last three or the last seven passwords. Users can't reuse passwords from the password history for setting a new password. UCS doesn't store the passwords retroactively.
de: Der Passworthistorie speichert die zuletzt verwendeten Passwort-Hashes. Die *History Länge* bestimmt die Länge der Historie, zum Beispiel, ob die Historie die letzten drei oder die letzten sieben Passwort-Hashes speichert. Benutzer können keine Passwörter aus der Passworthistorie wiederverwenden, um ein neues Passwort festzulegen. UCS speichert die Passwörter nicht rückwirkend.

source: To deactivate the validation for the password history, set the value to ``0``.
de: Um die Überprüfung der Passworthistorie zu deaktivieren, setzen Sie den Wert auf ``0``.

source: Example
de: Beispiel

source: If UCS stored ten passwords, and you reduce the value for the password history length to ``3``, UCS deletes the oldest seven passwords from the password history during the next password change. If you then change the password history length, the number of stored passwords stays at three and increases by each password change.
de: Wenn UCS zehn Passwort-Hashes gespeichert hat und Sie den Wert für die Länge der Passworthistorie auf ``3`` reduzieren, löscht UCS bei der nächsten Passwortänderung die älteren sieben Passwörter aus der Passworthistorie. Wenn Sie dann die Länge der Passworthistorie vergrößern, bleibt die Anzahl der gespeicherten Passwörter bei drei und erhöht sich mit jeder Passwortänderung.

source: Password length
de: Passwortlänge

source: The *Password length* is the minimum length in characters that a user password must comply with. If you don't set a value, UCS applies the minimum length of ``8`` characters.
de: Die *Passwortlänge* ist die Mindestlänge in Zeichen, die ein Benutzerpasswort einhalten muss. Wenn Sie keinen Wert angeben, verwendet UCS die Mindestlänge von ``8`` Zeichen.
