Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/user-management.po
Languages: de

source: Aspects about the *verification email* and the verification token can be configured with the following |UCSUCRVs|. These |UCSUCRVs| have to be set on the :program:`Self Service Backend` that is defined via the |UCSUCRV| :envvar:`self-service/backend-server`, since requests regarding these variables are forwarded to the :program:`Self Service Backend`.
de: Aspekte der *Verifizierungsmail* und des Verifizierungstokens können über die folgenden |UCSUCRVs| konfiguriert werden. Diese Variablen müssen auf dem *Self Service Backend* gesetzt werden, der über die |UCSUCRV| :envvar:`self-service/backend-server` definiert ist, da Anfragen bezüglich dieser Variablen an den *Self Service Backend* weitergeleitet werden.

source: Defines the ``host`` part to use in the verification link URL. The default is to use the FQDN of the :program:`Self Service Backend` defined via the |UCSUCRV| :envvar:`self-service/backend-server` since this |UCSUCRV| is evaluated there.
de: Definiert den ``host`` Teil, der in dem Verifizierungslink verwendet werden soll. Standardmäßig wird der FQDN des über die |UCSUCRV| :envvar:`self-service/backend-server` definierten :program:`Self Service Backend` verwendet, da diese |UCSUCRV| dort ausgewertet wird.

source: Defines the sender address of the verification email. Default is :samp:`Account Verification Service <noreply@{FQDN}>`.
de: Definiert die Absenderadresse der Verifizierungsmail. Die Voreinstellung ist :samp:`Account Verification Service <noreply@{FQDN}>`.

source: Server name or IP address of the mail server to use.
de: Servername oder IP-Adresse des zu verwendenden Mail-Servers.

source: A path to a text file whose content will be used for the body of the verification email. The text can contain the following strings which will be substituted accordingly: ``{link}``, ``{token}``, ``{tokenlink}`` and ``{username}``. As default the file :file:`/usr/share/univention-self-service/email_bodies/verification_email_body.txt` is used.
de: Ein Pfad zu einer Textdatei, deren Inhalt für den Körper der Verifizierungsmail verwendet wird. Der Text kann die folgenden Zeichenfolgen enthalten, die entsprechend ersetzt werden: ``{link}``, ``{token}``, ``{tokenlink}`` und ``{username}``. Als Standard wird die Datei :file:`/usr/share/univention-self-service/email_bodies/verification_email_body.txt` verwendet.

source: Defines the number of characters that is used for the verification token. Defaults to ``64``.
de: Definiert die Anzahl der Zeichen, die für den Verifizierungstoken verwendet wird. Als Standard werden 64 Zeichen verwendet.

source: Account verification
de: Kontoverifizierung

source: Following the verification link from the email, the user will land on the *Account verification* page of the :program:`Self Service`.
de: Wenn der Benutzer dem Verifizierungslink aus der E-Mail folgt, gelangt er auf die Seite *Kontoverifizierung* des :program:`Self Service`.

source: The account verification and request of new verification tokens can be disabled/enabled with the |UCSUCRV| :envvar:`umc/self-service/account-verification/backend/enabled`. This |UCSUCRV| has to be set on the systems that is defined as :program:`Self Service Backend` via the |UCSUCRV| :envvar:`self-service/backend-server`.
de: Die Kontoverifizierung und die Anforderung neuer Verifizierungstoken kann mit der |UCSUCRV| :envvar:`umc/self-service/account-verification/backend/enabled` deaktiviert/aktiviert werden. Diese Variablen muss auf dem :program:`Self Service Backend` gesetzt werden, das über die |UCSUCRV| :envvar:`self-service/backend-server` definiert ist.

source: Account verification message
de: Kontoverifizierung

source: The SSO login can be configured to deny login from unverified, self registered accounts. This is configured through the |UCSUCRV| :envvar:`saml/idp/selfservice/check_email_verification`. This needs to be set on the |UCSPRIMARYDN| and all |UCSBACKUPDN|\ s. The setting has no effect on accounts created by an administrator.
de: Der SSO Login kann konfiguriert werden, die Anmeldung für unverifizierte, selbst registrierte Konten zu verbieten. Dies wird über die |UCSUCRV| :envvar:`saml/idp/selfservice/check_email_verification` konfiguriert. Diese Einstellung muss auf dem |UCSPRIMARYDN| und allen |UCSBACKUPDN|\ s vorgenommen werden. Für Konten, die durch einen Administrator angelegt wurden, hat diese Einstellung keine Auswirkung.

source: The message on the SSO login page for unverified, self registered accounts, can be set with the |UCSUCRVs| :envvar:`saml/idp/selfservice/account-verification/error-title` and :envvar:`saml/idp/selfservice/account-verification/error-descr`. A localized message can be configured by adding a *locale* like ``en`` to the variable, for example :samp:`saml/idp/selfservice/account-verification/error-title/{en}`.
de: Die Nachricht, welche auf der SSO Login Seite für unverifizierte, selbst registrierte Konten angezeigt wird, kann mit den |UCSUCRVs| :envvar:`saml/idp/selfservice/account-verification/error-title` und :envvar:`saml/idp/selfservice/account-verification/error-descr` konfiguriert werden. Eine lokalisierte Nachricht kann konfiguriert werden, indem eine *Locale* wie z.B. ``de`` an die Variable angehängt wird. Z.B. :samp:`saml/idp/selfservice/account-verification/error-title/{de}`.

source: If the :program:`Keycloak` app is used as identity provider see :ref:`uv-keycloak-ref:app-settings` in the :cite:t:`ucs-keycloak-doc` for the corresponding settings.
de: Falls die :program:`Keycloak` App als Identity Provider eingesetzt wird,schauen Sie bitte in der :cite:t:`ucs-keycloak-doc` unter :ref:`uv-keycloak-ref:app-settings` für die entsprechenden Einstellungen.

source: Self deregistration
de: Selbst-Deregistrierung

source: The :program:`Self Service` allows for users to request the deletion of their own account. This feature can be activated with the |UCSUCRV| :envvar:`umc/self-service/account-deregistration/enabled`, which will show a :guilabel:`Delete my account` Button on the *Your profile* page of the Self Service (:ref:`users-templates`).
de: Der :program:`Self Service` ermöglicht es Benutzern, die Löschung ihres eigenen Kontos zu beantragen. Diese Funktion kann mit der |UCSUCRV| :envvar:`umc/self-service/account-deregistration/enabled` aktiviert werden, wodurch der Button :guilabel:`Meinen Account löschen` auf der Seite *Ihr Profil* des *Self Service* angezeigt wird (:ref:`users-templates`).

source: If a user has requested to delete their account, it will not be deleted directly but deactivated. In addition the ``DeregisteredThroughSelfService`` attribute of the user will be set to ``TRUE`` and the ``DeregistrationTimestamp`` attribute of the user will be set to the current time in the `GeneralizedTime LDAP syntax <ldap-generalized-time_>`_. If the user has a ``PasswordRecoveryEmail`` set they will receive a notification email which can be configured with the following |UCSUCRVs|.
de: Wenn ein Benutzer beantragt hat, sein Konto zu löschen, wird es nicht direkt gelöscht sondern deaktiviert. Zusätzlich wird das ``DeregistredThroughSelfService`` Attribut des Benutzers auf ``TRUE`` gesetzt und das ``DeregistrationTimestamp`` Attribut des Benutzers wird in der `GeneralizedTime-LDAP-Syntax <ldap-generalized-time_>`_ auf die aktuelle Zeit gesetzt. Wenn der Benutzer eine ``PasswordRecoveryEmail`` angegeben hat, wird er eine E-Mail-Benachrichtigung erhalten, die mit den folgenden |UCSUCRVs| konfiguriert werden kann.

source: Defines the sender address of the email. Default is :samp:`Password Reset Service <noreply@{FQDN}>`.
de: Definiert die E-Mail-Adresse des Absenders für Benachrichtigung. Die Voreinstellung ist :samp:`Password Reset Service <noreply@{FQDN}>`.

source: A path to a text file whose content will be used for the body of the email. The text can contain the following strings which will be substituted accordingly: ``{username}``. As default the file :file:`/usr/share/univention-self-service/email_bodies/deregistration_notification_email_body.txt` is used.
de: Ein Pfad zu einer Textdatei, deren Inhalt für den Körper der E-Mail verwendet wird. Der Text kann die folgenden Zeichenfolgen enthalten, die entsprechend ersetzt werden: ``{username}``. Als Standard wird die Datei :file:`/usr/share/univention-self-service/email_bodies/deregistration_notification_email_body.txt` verwendet.

source: The Self Service provides a script under :file:`/usr/share/univention-self-service/delete_deregistered_accounts.py` that can be used to delete all users/user objects which have ``DeregisteredThroughSelfService`` set to ``TRUE`` and whose ``DeregistrationTimestamp`` is older than a specified time.
de: Der *Self Service* stellt unter :file:`/usr/share/univention-self-service/delete_deregistered_accounts.py` ein Skript zur Verfügung, das zum Löschen aller users/user Objekte verwendet werden kann, bei denen ``DeregistredThroughSelfService`` auf ``TRUE`` gesetzt ist und deren ``DeregistrationTimestamp`` älter ist als eine angegebene Zeit.

source: The following command would delete users whose ``DeregistrationTimestamp`` is older than 5 days and 2 hours:
de: Der folgende Befehl würde Benutzer löschen, deren ``DeregistrationTimestamp`` älter als 5 Tage und 2 Stunden ist:

source: For all possible arguments to the script see:
de: Für alle möglichen Argumente zum Skript siehe:

source: The script can be run regularly by creating a cron job via |UCSUCR|.
de: Das Skript kann regelmäßig ausgeführt werden, indem ein Cron-Job über |UCSUCR| erstellt wird.

source: More information on how to set cron jobs via |UCSUCR| can be found in :ref:`computers-defining-cron-jobs-in-univention-configuration-registry`.
de: Weitere Informationen über die Einstellung von Cron-Jobs über UCR können in :ref:`computers-defining-cron-jobs-in-univention-configuration-registry` gefunden werden.

source: User templates
de: Benutzervorlagen

source: A user template can be used to preset settings when creating a user. If at least one user template is defined, it can be selected when creating a user.
de: Mit einer Benutzervorlage können beim Anlegen eines Benutzers Einstellungen vorgegeben werden. Ist mindestens eine Benutzervorlage definiert, kann sie beim Anlegen eines Benutzer ausgewählt werden.

source: Selecting a user template
de: Auswahl einer Benutzervorlage

source: User templates are administrated in the UMC module :guilabel:`LDAP directory`. There one needs to switch to the ``univention`` container and then to the ``templates`` subcontainer. A new user template can be created here via the :guilabel:`Add` with the object type ``Settings: User template``.
de: Benutzervorlagen werden im UMC-Modul :guilabel:`LDAP-Verzeichnis` verwaltet. Dort muss in den Container ``univention`` und dort in den Untercontainer ``templates`` gewechselt werden. Hier kann über :guilabel:`Hinzufügen` mit dem Objekt-Typ ``Einstellungen: Benutzervorlage`` eine neue Benutzervorlage angelegt werden.

source: In a user template, either a fixed value can be specified (e.g., for the address) or an attribute of the user management referenced. Attributes are then referenced in chevrons.
de: In einer Benutzervorlage kann entweder ein fester Wert vorgegeben werden (z.B. für die Anschrift) oder ein Attribut der Benutzerverwaltung referenziert werden. Attribute werden dabei in spitzen Klammern referenziert.

source: A list of possible attributes can be displayed with the following command in the section *users/user variables* of the output:
de: Eine Liste möglicher Attribute kann mit dem folgenden Befehl im Abschnitt *users/user variables* der Ausgabe angezeigt werden:

source: If a user template is used for adding a user, this template will overwrite all the fields with the preset values of the template. In doing so, an empty field is set to ``""``.
de: Wird beim Hinzufügen eines Benutzers eine Benutzervorlage verwendet, überschreibt diese alle in der Vorlage vorkommenden Felder mit dem in der Vorlage gesetzten Wert. Dabei gilt ein leeres Feld ebenfalls als auf ``""`` gesetzt.

source: It is also possible to only use partial values of attributes or convert values in uppercase/lowercase.
de: Es können auch nur Teilwerte von Attributen übernommen werden und Werte in Groß-/Kleinschreibung konvertiert werden.

source: For example, the UNIX home directory can be stored under :file:`/home/<title>.<lastname>` or the primary email address can be predefined with ``<firstname>.<lastname>@company.com``. Substitutions are generally possibly for any value, but there is no syntax or semantics check. So, if no first name is specified when creating a user, the above e-mail address would begin with a dot and would thus be invalid according to the e-mail standard. Similar sources of error can also occur when handling file paths etc. Non-resolvable attributes (for instance due to typing errors in the template) are deleted.
de: So kann beispielsweise das UNIX-Heimatverzeichnis unter :file:`/home/<title>.<lastname>` angelegt werden oder die primäre E-Mail-Adresse mit ``<firstname>.<lastname>@firma.com`` vordefiniert werden. Ersetzungen sind grundsätzlich für beliebige Werte möglich, eine syntaktische oder semantische Überprüfung erfolgt jedoch nicht. Wird beispielsweise beim Anlegen des Benutzers kein Vorname angegeben, würde die obige E-Mail-Adresse mit einem Punkt beginnen und wäre somit nach dem E-Mail-Standard ungültig. Ähnliche Fehlerquellen können auch im Umgang mit Dateipfaden auftreten. Nicht auflösbare Attribute (etwa durch Tippfehler in der Vorlage) werden gelöscht.

source: If only a single character of an attribute is required instead of the complete attribute value, the index of the required character can be entered in the user template in square parentheses after the name of the attribute. The count of characters of the attribute begins with ``0``, so that index ``1`` corresponds to the second character of the attribute value. Accordingly, ``<firstname>[0].<lastname>@company.com`` means an e-mail address will consist of the first letter of the first name plus the last name.
de: Wird nicht der komplette Attributwert, sondern nur ein einzelnes Zeichen des Attributs benötigt, kann in der Benutzervorlage nach dem Attributnamen der Index des benötigten Zeichens in eckigen Klammern angegeben werden. Die Zählung der Zeichen des Attributs beginnt bei ``0``, so dass z.B. der Index ``1`` dem zweiten Zeichen des Attributwertes entspricht. Mit ``<firstname>[0].<lastname>@firma.com`` wird beispielsweise eine E-Mail-Adresse aus dem ersten Buchstaben des Vornamens sowie dem Nachnamen gebildet.

source: A sub string of the attribute value can be defined by entering a range in square parentheses. In doing so, the index of the first required character and the index of the last required character plus one are to be entered. For example, the input ``<firstname>[2:5]`` returns the third to fifth character of the first name.
de: Eine Teilzeichenkette des Attributwerts kann über die Angabe eines Bereichs in eckigen Klammern erreicht werden. Dabei ist der Index des ersten benötigten Zeichens sowie der Index des letzten benötigten Zeichens plus 1 anzugeben. Die Angabe ``<firstname>[2:5]`` gibt z.B. das dritte bis fünfte Zeichen des Vornamens zurück.

source: Adding ``:lower`` or ``:upper`` to the attribute name converts the attribute value to lowercase or uppercase, e.g., ``<firstname:lower>``. If a modifier like ``:lower`` is appended to the entire field, the complete value is transformed, e.g. ``<lastname>@company.com<:lower>``.
de: Das Anhängen von ``:lower`` oder ``:upper`` an den Attributnamen führt dazu, dass der Attributwert in Klein- oder Großschreibung umgewandelt wird, z.B. ``<firstname:lower>``. Wird ein Modifikator wie ``:lower`` an das Ende des Feldes angehängt, wird der komplette Wert umgewandelt, z.B. ``<lastname>@company.com<:lower>``.

source: The option ``:umlauts`` can be used to convert special characters such as *è*, *ä* or *ß* into the corresponding ASCII characters.
de: Durch die Option ``:umlauts`` werden Sonderzeichen wie *è*, *ä* oder *ß* in entsprechende ASCII-Zeichen umgewandelt.

source: The option ``:alphanum`` can be used to remove all non alphanumeric characters such as ````` (backtick) or ``#`` (hash). A whitelist of characters that are ignored by this option can be defined in the UCR variable :envvar:`directory/manager/templates/alphanum/whitelist`. If this option is applied to an entire field, even manually placed symbols like the ``@`` in an email address are removed. To avoid that, this option should be applied to specific attributes only or needed symbols should be entered into the whitelist.
de: Durch die Option ``:alphanum`` werden alle nicht alphanumerischen Zeichen, wie ````` oder ``#`` (Hash) entfernt. In der UCR Variable :envvar:`directory/manager/templates/alphanum/whitelist` können Zeichen definiert werden, die von dieser Option ignoriert werden. Zu beachten ist, dass wenn diese Option auf das ganze Feld angewendet wird, auch manuell gesetzte Zeichen entfernt werden. Zum Beispiel das @-Zeichen in der E-Mail-Adresse. Daher sollte man diese Option nur auf einzelne Attribute anwenden oder die Whitelist anpassen.

source: The options ``:strip`` or ``:trim`` remove all white space characters from the start and end of the string.
de: Die Optionen ``:strip`` oder ``:trim`` entfernen alle Leerzeichen am Anfang und Ende der Zeichenkette.

source: It is also possible to combine options, e.g: ``:umlauts,upper``.
de: Optionen können auch kombiniert werden, z.B: ``:umlauts,upper``.
