Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/user-management.po
Languages: de

source: To specify how often a user can attempt to sign in with an incorrect password before the account is locked:
de: Um festzulegen, wie oft ein Benutzer versuchen kann, sich mit einem falschen Passwort anzumelden, bevor das Konto gesperrt wird:

source: To specify the number of minutes an account will be locked after too many incorrect passwords have been entered:
de: Um festzulegen, wie viele Minuten ein Konto gesperrt wird, nachdem zu viele falsche Passwörter eingegeben wurden:

source: To define the number of minutes after which the counter is reset:
de: Um die Anzahl der Minuten festzulegen, nach der der Zähler zurückgesetzt wird:

source: If an account gets automatically unlocked after the lockout duration, the counter is not reset immediately, to keep the account under strict monitoring for some time. During the time window between the end of the lockout duration and the point when the counter gets reset, a single attempt to sign in with an incorrect password will lock the account immediately again.
de: Wenn ein Konto automatisch nach der konfigurierten Aussperrungsdauer entsperrt wird, dann wird der Zähler nicht direkt mit zurückgesetzt, um das Konto noch eine gewisse Zeit unter strikter Beobachtung zu halten. In dem Zeitfenster nach dem Ende der Aussperrung und vor der endgültigen Rücksetzung des Zählers führt ein einziger erneuter Login-Versuch mit einem falschen Passwort direkt wieder zu einer Sperrung des Kontos.

source: The manual unlocking of a user is done in the user administration on the tab :guilabel:`Account` by activating the checkbox *Unlock account*.
de: Die manuelle Entsperrung eines Benutzers erfolgt in der Benutzerverwaltung auf dem Reiter :guilabel:`Konto` über die Aktivierung der Checkbox *Aussperrung zurücksetzen*.

source: The automatic locking of users after failed logins in the PAM stack can be enabled by setting the |UCSUCRV| :envvar:`auth/faillog` to ``yes``. The upper limit of failed login attempts at which an account lockout is configured in the |UCSUCRV| :envvar:`auth/faillog/limit`. The counter is reset each time the password is entered correctly.
de: Das automatische Sperren von Benutzern nach fehlgeschlagenen Anmeldungen im PAM-Stack kann durch Setzen der |UCSUCRV| :envvar:`auth/faillog` auf ``yes`` aktiviert werden. Die Obergrenze an fehlerhaften Passworteingaben, bei der eine Kontosperre aktiviert wird, wird in der |UCSUCRV| :envvar:`auth/faillog/limit` konfiguriert. Unterhalb des Limits wird nach einer korrekten Passworteingabe der Zähler jedesmal wieder zurückgesetzt.

source: The lockout is activated locally per system by default. In other words, if a user enters their password incorrectly too many times on one system, they can still login on another system. Setting the |UCSUCRV| :envvar:`auth/faillog/lock_global` will make the lock effective globally and register it in the LDAP directory. The global lock can only be set on |UCSPRIMARYDN|/Backup systems as other system roles do not have the necessary permissions in the LDAP directory. On all systems with any of these system roles, the lockout gets automatically activated locally or deactivated again via the listener module, depending on the current lock state in the LDAP directory.
de: Die Sperre im PAM-Stack ist standardmäßig nur auf ein lokales System begrenzt. Wenn ein Benutzer also auf einem System zu oft sein Passwort falsch eingegeben hat, kann er sich auf einem anderen System weiterhin anmelden. Durch Setzen der |UCSUCRV| :envvar:`auth/faillog/lock_global` kann die Sperre auch global erfolgen und wird im LDAP registriert. Die globale Sperrung kann nur auf |UCSPRIMARYDN|/Backup-Systemen eingesetzt werden, da andere Systemrollen nicht über die nötigen Berechtigungen im LDAP-Verzeichnis verfügen. Auf allen Servern der genannten Systemrollen wird die Aussperrung aber automatisch auch lokal umgesetzt oder über das verwendete Listener-Modul auch wieder zurückgenommen, abhängig vom aktuellen Aussperrungszustands des Kontos im LDAP-Verzeichnis.

source: As standard, the lockout is not subject to time limitations and must be reset by the administrator. However, it can also be reset automatically after a certain time interval has elapsed. This is done by specifying a time period in seconds in the |UCSUCRV| :envvar:`auth/faillog/unlock_time`. If the value is set to ``0``, the lock is reset immediately.
de: Standardmäßig ist die Sperre über den PAM-Stack unbegrenzt gültig, sie kann aber auch nach Ablauf eines Intervalls automatisch wieder aufgehoben werden. Hierzu ist in der |UCSUCRV| :envvar:`auth/faillog/unlock_time` ein Zeitraum in Sekunden anzugeben. Wird der Wert auf ``0`` gesetzt, wird die Sperre direkt wiederaufgehoben.

source: By default, the ``root`` user is excluded from the password lock, but can also be subjected to it by setting the |UCSUCRV| :envvar:`auth/faillog/root` to ``yes``.
de: Der ``root``-Benutzer ist standardmäßig von der Passwort-Sperre ausgenommen, kann aber durch Setzen der |UCSUCRV| :envvar:`auth/faillog/root` auf ``yes`` ebenfalls aufgenommen werden.

source: If accounts are only locked locally, the administrator can unlock a user account by entering the command:
de: Werden Konten nur lokal gesperrt, kann der Administrator ein Benutzerkonto durch Eingabe des folgenden Befehls entsperren:

source: If the lock occurs globally in the LDAP directory, the user can be reset in the |UCSUMC| module :guilabel:`Users` on the tab *Account* via the checkbox *Unlock account*.
de: Erfolgt die Sperrung global im LDAP, kann der Benutzer im UMC-Modul :guilabel:`Benutzer` unter dem Reiter *Konto* mit der Optionen *Aussperrung zurücksetzen* zurückgesetzt werden.

source: On UCS Directory Nodes, automatic account locking can be enabled for too many failed LDAP server login attempts. The MDB LDAP backend must be used. This is the default backend since UCS 4, previous systems must be migrated to the MDB LDAP backend, see :cite:t:`ucs-performance-guide`.
de: Bei UCS Directory Nodes kann die automatische Kontosperre für den Fall eines wiederholten LDAP-Authentifizierungsfehlers aktiviert werden. Voraussetzung ist, dass das MDB LDAP-Backend verwendet wird. Dies ist seit UCS 4 das Standard Backend, vorherige Systeme müssen auf das MDB LDAP-Backend migriert werden, siehe :cite:t:`ucs-performance-guide`.

source: Automatic account locking must be enabled for each UCS Directory Node. To do this, the |UCSUCRV| :envvar:`ldap/ppolicy/enabled` must be set to ``yes`` and the OpenLDAP server must be restarted:
de: Die automatische Kontosperrung muss für jeden UCS Directory aktiviert werden. Dazu muss die |UCSUCRV| :envvar:`ldap/ppolicy/enabled` auf ``yes`` gesetzt und der OpenLDAP-Server neu gestartet werden:

source: The default policy is designed so that five repeated failed LDAP server login attempts within five minutes cause the lockout. A locked account can only be unlocked by a domain administrator through the UMC module :guilabel:`Users` via the checkbox *Unlock account* on the *Account* tab.
de: Die Standardrichtlinie ist so ausgelegt, dass fünf wiederholte LDAP-Authentifizierungsfehler innerhalb eines Überwachungsintervalls von fünf Minuten dazu führen, dass das authentifizierende Konto gesperrt wird. Ein gesperrtes Konto kann nur von einem Domain-Administrator über das UMC-Modul :guilabel:`Benutzer` über die Checkbox *Aussperrung zurücksetzen* im Reiter *Konto* freigeschaltet werden.

source: The number of repeated failed LDAP server login attempts can be adjusted in the configuration object with the *objectClass* ``pwdPolicy``:
de: Die Anzahl der wiederholten LDAP-Authentifizierungsfehler kann in dem Konfigurationsobjekt mit der *objectClass* ``pwdPolicy`` angepasst werden:

source: attribute determines the number of LDAP authentication errors before locking.
de: Das Attribut bestimmt die Anzahl der LDAP-Authentifizierungsfehler vor der Sperrung.

source: attribute determines the time interval in seconds that is considered. Failed login attempts outside this interval are ignored in the count.
de: Das Attribut bestimmt das Zeitintervall in Sekunden, das berücksichtigt wird. LDAP-Authentifizierungsfehler außerhalb dieses Intervalls werden bei der Zählung vernachlässigt.

source: The following command can be used to block the account after 10 attempts:
de: Um den Account erst nach 10 Versuchen zu sperren kann der folgende Befehl verwendet werden:

source: The manual unlocking of a user is done in the user administration on the tab *Account* by activating the checkbox *Unlock account*.
de: Die manuelle Entsperrung eines Benutzers erfolgt in der Benutzerverwaltung auf dem Reiter *Konto* über die Aktivierung der Checkbox *Aussperrung zurücksetzen*.

source: User self services
de: Benutzer Selbstverwaltung

source: For information about setting a user password policy, refer to :ref:`users-passwords`.
de: Informationen zum Festlegen einer Benutzer-Passwortrichtlinie finden Sie unter :ref:`users-passwords`.

source: Password change by user via UCS portal page
de: Passwortwechsel über UCS Portal

source: Every logged in user can change their own password by opening the menu via the hamburger icon in the top right corner and selecting :menuselection:`User settings --> Change password`. The change is performed directly via the PAM stack (see :ref:`computers-authentication-pam`) and is then available centrally for all services.
de: Jeder angemeldete Benutzer kann sein eigenes Passwort ändern, indem er das Menü in der oberen rechten Ecke öffnet und :menuselection:`Benutzereinstellungen --> Passwort ändern` auswählt. Die Änderung wird dann direkt über den PAM-Stack (siehe :ref:`computers-authentication-pam`) durchgeführt und ist danach zentral für alle Dienste verfügbar.

source: Password management via Self Service app
de: Passwort-Verwaltung über Self Service App

source: By installing the UCS components :program:`Self Service Backend` and :program:`Self Service` in the domain via the :guilabel:`App Center`, users are enabled to take care of their password management without administrator interaction.
de: Durch die Installation der UCS-Komponenten :program:`Self Service Backend` auf dem UCS |UCSPRIMARYDN| und :program:`Self Service` in der Domäne über das :guilabel:`App Center` werden Benutzer dazu befähigt, ihr Passwort ohne die Interaktion mit einem Administrator zu verwalten.

source: The :program:`Self Service` app creates its own portal, accessible at the web URI ``/univention/selfservice/``, which bundles all its functionality. The original portal has the same entries registered at its user menu. They allow users to update their password given their old password as well as to reset their lost password by requesting a token to be sent to a previously registered contact email address. The token has to be entered on the dedicated password reset web page.
de: Die *Self Service* App erzeugt ein eigenes Portal, das unter ``/univention/selfservice/`` aufgerufen werden kann und alle Funktionen über entsprechende Einträge zur Verfügung stellt. Es werden aber auch im eigentlichen Portal verschiedene Menüeinträge im Benutzermenü registriert. Sie erlauben es Benutzern, unter Angabe ihres alten Passworts ein neues Passwort zu setzen, oder aber ihr vergessenes Passwort zurückzusetzen. Für das Zurücksetzen des Passworts wird ein Token an eine vorher dafür registrierte Kontakt-E-Mail-Adresse gesendet, das dann auf der Webseite vom Benutzer einzugeben ist.

source: The following |UCSUCRVs| can be used to activate or deactivate individual features of the password management.
de: Mit den folgenden |UCSUCRVs| können einzelne Funktionen der Passwort-Verwaltung aktiviert oder deaktiviert werden.

source: Activates or deactivates the backend of the *Password forgotten* page. This |UCSUCRV| has to be set on the systems that is defined as :program:`Self Service backend` via the |UCSUCRV| :envvar:`self-service/backend-server`, since requests regarding these variables are forwarded to the :program:`Self Service backend`.
de: Aktiviert oder deaktiviert die Backend-Funktionalität der *Passwort vergessen*-Seite. Diese |UCSUCR| muss auf dem *Self Service Backend* gesetzt werden, das über die |UCSUCRV| :envvar:`self-service/backend-server` definiert ist, da Anfragen bezüglich dieser Variablen an das *Self Service Backend* weitergeleitet werden.

source: Activates or deactivates the backend of the *Protect account* page. This |UCSUCRV| has to be set on the systems that is defined as :program:`Self Service backend` via the |UCSUCRV| :envvar:`self-service/backend-server`, since requests regarding these variables are forwarded to the :program:`Self Service backend`.
de: Aktiviert oder deaktiviert die Backend-Funktionalität der *Kontozugang schützen*-Seite. Diese |UCSUCR| muss auf dem *Self Service Backend* gesetzt werden, das über die |UCSUCRV| :envvar:`self-service/backend-server` definiert ist, da Anfragen bezüglich dieser Variablen an das *Self Service Backend* weitergeleitet werden.

source: Activates or deactivates the backend for service specific passwords. Currently, only the service RADIUS is supported. Find more information in :ref:`ip-config-radius-configuration-service-specific-password`.
de: Aktiviert oder deaktiviert die Backend-Funktionalität für dienst-spezifische Passwörter. Momentan wird nur RADIUS als Dienst unterstützt. Weitere Informationen finden sich in :ref:`ip-config-radius-configuration-service-specific-password`.

source: Those variables also activate or deactivate the corresponding entries in the portal. However, you can also adjust them manually, they are in fact just normal portal entries.
de: Die entsprechenden Einträge im Portal werden damit auch aktiviert oder deaktiviert. Sie können die Einträge aber auch manuell anpassen. Sie verhalten sich wie normale Einträge im Portal.

source: Contact information
de: Profilverwaltung

source: Additional personal data can be stored in LDAP with the users account. This may include a picture, the users private address and other contact information. By default only administrators can modify them. As an alternative selected attributes may be unlocked for the user to change himself. The user then can do this using the :program:`Self Service` app.
de: Am Benutzerkonto im LDAP-Verzeichnisdienst können weitere personenbezogene Daten gespeichert werden. Dies beinhaltet u.a. ein Bild, private Adressen und weitere Kontaktinformationen. Standardmäßig können diese nur von Administratoren aktualisiert werden. Alternativ können aber auch ausgewählte Felder für den Benutzer selber freigeschaltet werden. Der kann diese Daten über die *Self Service* App selber pflegen.

source: User profile self-service
de: Benutzerprofilselbstverwaltung

source: For this the following |UCSUCRVs| must be configured:
de: Dafür müssen folgende |UCSUCRVs| konfiguriert werden:

source: This variable configures the *LDAP* attributes a user can modify at its own user account. The names of the attributes must be separated by comma. This variable must be set on |UCSPRIMARYDN| (and |UCSBACKUPDN|\ s).
de: Über diese Variable werden die *LDAP* Attribute konfiguriert, die ein Benutzer selber an seinem Benutzerkonto modifizieren kann. Die Namen der Attribute sind durch Komma zu trennen. Diese Variable ist auf dem |UCSPRIMARYDN| (und |UCSBACKUPDN|\ s) zu setzen.

source: This variable configures the *UDM* attributes a user can modify. The names of the attributes must be separated by comma. This variable must be set on all hosts, where the :program:`Self Service` app is installed (incl. |UCSPRIMARYDN|).
de: Über diese Variable werden die *UDM* Attribute konfiguriert, die ein Benutzer modifizieren kann. Die Namen der Attribute sind durch Komma zu trennen. Diese Variable ist auf allen beteiligten Server-Systemen zu setzen, auf denen die *Self Service* App installiert ist (ebenso auf dem |UCSPRIMARYDN|).

source: This variable sets *UDM* attributes specified in |UCSUCRV| :envvar:`self-service/udm_attributes` to read-only. Use a comma-separated list for multiple values. Set this variable on all hosts, where the :program:`Self Service` app is installed, including |UCSPRIMARYDN|.
de: Diese Variable setzt *UDM* Attribute, welche in |UCSUCRV| :envvar:`self-service/udm_attributes` gesetzt sind, auf schreibgeschützt. Trennen Sie mehrere Werte durch Kommata. Setzen Sie diese Variable auf allen Hosts, auf denen die :program:`Self Service` App installiert ist, einschließlich |UCSPRIMARYDN|.

source: To prevent this variable's intended behavior from being prohibited, remove the *LDAP* attributes specified in |UCSUCRV| :envvar:`self-service/ldap_attributes` that should be read-only. Otherwise, these *LDAP* attributes will keep the corresponding *UDM* attributes writable.
de: Entfernen Sie die *LDAP* Attribute, welche in |UCSUCRV| :envvar:`self-service/ldap_attributes` gesetzt sind und schreibgeschützt werden sollen, damit diese Variable wie vorgesehen funktioniert. Andernfalls werden diese *LDAP* Attribute verhindern, dass die in dieser Variable angegebenen *UDM* Attribute schreibgeschützt werden.

source: This variable must be set to ``true`` on all involved server systems to enable the mechanism.
de: Diese Variable muss auf allen beteiligten Server-Systemen auf ``true`` gesetzt werden, um den Mechanismus zu aktivieren.

source: This variable defines whether the specification of user name and password is necessary when opening and modifying your own user profile if you are already logged in to Univention Portal.
de: Diese Variable definiert, ob beim Öffnen und Modifizieren des eigenen Benutzerprofils die Angabe von Benutzername und Passwort notwendig ist, wenn man bereits am Univention Portal angemeldet ist.

source: As of UCS 4.4-7, this |UCSUCRV| is automatically set to ``true`` when the :program:`Self Service` is installed for the first time. The ``true`` value activates the use of an existing Univention Portal session. The fields *Username* and *Password* are then automatically filled in or no longer displayed.
de: Ab UCS 4.4-7 wird diese |UCSUCRV| bei Erstinstallationen des *Self Service* automatisch auf ``true`` gesetzt, was die Verwendung einer vorhandenen Portalsitzung aktiviert. Die Felder *Benutzername* und *Passwort* werden dann automatisch ausgefüllt oder nicht mehr angezeigt.

source: Systems upgraded to UCS 4.4-7 will retain the old behavior by automatically setting the value to ``false``. Note that this variable must be set to the same value on all participating systems where the :program:`Self Service` app is installed (incl. |UCSPRIMARYDN|).
de: Systeme, die auf UCS 4.4-7 aktualisiert werden, behalten die alte Verhaltensweise bei, indem automatisch der Wert auf ``false`` gesetzt wird. Es ist zu beachten, dass diese Variable auf allen beteiligen Systemen inklusive |UCSPRIMARYDN| auf den gleichen Wert gesetzt sein muss.

source: Both ``*attributes`` variables must match each other. The names of the attributes and their mapping can be fetched from the following command:
de: Beide ``*attributes`` Variablen müssen zueinander passen. Die Namen der Attribute und deren Zuordnung kann man über folgenden Aufruf erhalten:

source: Self registration
de: Selbstregistrierung

source: The Self Service allows for users to register themselves, which will create a user account that has to be verified via email.
de: Der *Self Service* ermöglicht es Benutzern, sich selbst zu registrieren, wodurch ein Benutzerkonto erstellt wird, das per E-Mail verifiziert werden muss.

source: User accounts that are created via the Self Service will have the ``RegisteredThroughSelfService`` attribute of the user set to ``TRUE`` and the ``PasswordRecoveryEmailVerified`` attribute set to FALSE. After the user has verified their account via the verification email the ``PasswordRecoveryEmailVerified`` attribute will be set to ``TRUE``.
de: Bei Benutzerkonten, die über den *Self Service* erstellt werden, wird das ``RegisteredThroughSelfService`` Attribut des Benutzers auf ``TRUE`` und das ``PasswordRecoveryEmailVerified`` Attribut auf ``FALSE`` gesetzt. Nachdem der Benutzer sein Konto über die Verifizierungsmail verifiziert hat, wird das ``PasswordRecoveryEmailVerified`` Attribut auf ``TRUE`` gesetzt.

source: Account creation
de: Kontoerstellung

source: Account registration
de: Selbstregistrierung

source: Aspects about the *Create an account* page and the account creation itself can be configured with the following |UCSUCRVs|. These |UCSUCRVs| have to be set on the systems that is defined as :program:`Self Service Backend` via the |UCSUCRV| :envvar:`self-service/backend-server`, since requests regarding these variables are forwarded to the Self Service backend.
de: Aspekte der *Konto erstellen* Seite und der Kontoerstellung selbst können mit den folgenden |UCSUCRVs| konfiguriert werden. Diese Variablen müssen auf dem :program:`Self Service Backend` gesetzt werden, das über die |UCSUCRV| :envvar:`self-service/backend-server` definiert ist, da Anfragen bezüglich dieser Variablen an das Self Service Backend weitergeleitet werden.

source: With this variable the account registration can be disabled/enabled.
de: Mit dieser Variable kann die Selbstregistrierung deaktiviert/aktiviert werden.

source: With this variable a :ref:`user template <users-templates>` can be specified that will be used for the creation of self registered accounts.
de: Mit dieser Variable kann eine :ref:`Benutzervorlage <users-templates>` angegeben werden, die für die Erstellung von selbst registrierten Konten verwendet wird.

source: With this variable a container can be specified under which the self registered users are created.
de: Mit dieser Variable kann ein Container angegeben werden, unter dem die selbst registrierten Benutzer angelegt werden.

source: This variable configures which UDM attributes of a user account are shown on the *Create an account* page of the Self Service. The names of the UDM attributes must be provided as a comma separated list.
de: Diese Variable konfiguriert, welche UDM-Attribute eines Benutzerkontos auf der Seite *Konto erstellen* des *Self Service* angezeigt werden. Die Namen der UDM-Attribute müssen als kommaseparierte Liste angegeben werden.

source: This variable configures which of the UDM attributes set via the |UCSUCRV| :envvar:`umc/self-service/account-registration/udm_attributes` are required for the user to provide. The names of the UDM attributes must be provided as a comma separated list.
de: Diese Variable konfiguriert, welche der über die |UCSUCRV| :envvar:`umc/self-service/account-registration/udm_attributes` definierten UDM-Attribute vom Benutzer angegeben werden müssen. Die Namen der UDM-Attribute müssen als kommaseparierte Liste angegeben werden.

source: Verification email
de: Verifizierungsmail

source: After a user has clicked on :guilabel:`Create account`, they will see a message that an email for the account verification has been sent.
de: Nachdem ein Benutzer auf :guilabel:`Konto erstellen` geklickt hat, sieht er eine Nachricht, dass eine E-Mail für die Kontoverifizierung versendet wurde.

source: Sending the verification email
de: Senden der Verifizierungsmail
