Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/windows.po
Languages: de

source: Active Directory Connection
de: Active Directory-Verbindung

source: |UCSUCS| can be operated together with an existing Active Directory domain (AD domain) in two different ways. Both modes can be set up using the :program:`Active Directory Connection` application from the Univention App Center (see :ref:`computers-softwaremanagement-install-software`). This is available on a |UCSPRIMARYDN| and |UCSBACKUPDN|.
de: |UCSUCS| kann auf zwei unterschiedliche Arten mit einer bestehenden Active Directory-Domäne (AD-Domäne) zusammen betrieben werden. Beide Varianten lassen sich durch die Applikation :program:`Active Directory-Verbindung` aus dem Univention App Center einrichten (siehe :ref:`computers-softwaremanagement-install-software`). Diese steht auf einem |UCSPRIMARYDN| und |UCSBACKUPDN| zur Verfügung.

source: The two modes are:
de: Die beiden Varianten sind:

source: UCS as a part (domain member) of an AD domain (see :ref:`ad-connector-ad-member-setup`)
de: UCS als Teil (Domänen-Mitglied) einer AD-Domäne (siehe :ref:`ad-connector-ad-member-setup`)

source: Synchronization of account data between an AD domain and a UCS domain (see :ref:`ad-connector-ad-connector-setup`).
de: Synchronisation von Kontendaten zwischen einer AD-Domäne und einer UCS-Domäne (siehe :ref:`ad-connector-ad-connector-setup`).

source: In both modes, the :program:`Active Directory Connection` service is used in UCS (UCS AD Connector for short), which can synchronize the directory service objects between a Windows 2012/2016/2019 server with Active Directory (AD) and the OpenLDAP directory of |UCSUCS|.
de: In beiden Modi wird unter UCS der Dienst :program:`Active Directory-Verbindung` verwendet (kurz UCS AD-Connector), der Verzeichnisdienstobjekte zwischen einem Windows 2012/2016/2019-Server mit Active Directory (AD) und dem OpenLDAP-Verzeichnis aus |UCSUCS| synchronisieren kann.

source: In the first case, the configuration of a UCS server system as a member of an AD domain, the AD functions as the primary directory service and the respective UCS system joins the trust context of the AD domain. The domain membership gives the UCS system restricted access to the account data of the Active Directory domain. The setup of this operating mode is described in detail in :ref:`ad-connector-ad-member-setup`.
de: Im ersten Fall, der Konfiguration eines UCS-Serversystems als Mitglied einer AD-Domäne, dient das AD als führender Verzeichnisdienst und das jeweilige UCS-System tritt dem Vertrauenskontext der AD-Domäne bei. Durch die Domänenmitgliedschaft hat das UCS-System limitierten Zugriff auf Kontodaten der Active Directory-Domäne. Die Einrichtung dieses Betriebsmodus ist im Detail in :ref:`ad-connector-ad-member-setup` beschrieben.

source: The second mode, which can be configured via the :program:`Active Directory Connection` app, is used to run the UCS domain parallel to an existing AD domain. In this mode, each domain user is assigned a user account with the same name in both the UCS and the AD domain. Thanks to the use of the name identity and the synchronization of the encrypted password data, this mode allows transparent access between the two domains. In this mode, the authentication of a user in the UCS domain occurs directly within the UCS domain and as such is not directly dependent on the AD domain. The setup of this operating mode is described in detail in :ref:`ad-connector-ad-connector-setup`.
de: Der zweite Modus, der sich über die App *Active Directory-Verbindung* konfigurieren lässt, dient dazu, die UCS Domäne parallel zu einer bestehenden AD-Domäne zu betreiben. In diesem Modus ist jedem Domänen-Benutzer sowohl in der UCS- als auch in der AD-Domäne ein gleichnamiges Benutzerkonto zugeordnet. Durch die Namensidentität und die Synchronisation der verschlüsselten Passwortdaten ermöglicht dieser Modus einen transparenten Zugriff zwischen beiden Domänen. Die Authentifikation eines Benutzers in der UCS-Domäne geschieht in diesem Modus direkt innerhalb der UCS-Domäne und ist damit nicht direkt abhängig von der AD-Domäne. Die Einrichtung diese Betriebsmodus ist im Detail in :ref:`ad-connector-ad-connector-setup` beschrieben.

source: UCS as a member of an Active Directory domain
de: UCS als Mitglied einer Active Directory-Domäne

source: In the configuration of a UCS server system as a member of an AD domain (*AD member* mode), the AD functions as the primary directory service and the respective UCS system joins the trust context of the AD domain. The UCS system is not able to operate as an Active Directory domain controller itself. The domain membership gives the UCS system restricted access to the account data of the Active Directory domain, which it exports from the AD by means of the UCS AD Connector and writes locally in its own OpenLDAP-based directory service. In this configuration, the UCS AD Connector does not write any changes in the AD.
de: Bei der Konfiguration eines UCS-Serversystems als Mitglied einer AD-Domäne (*AD member*-Modus) dient das AD als führender Verzeichnisdienst und das jeweilige UCS-System tritt dem Vertrauenskontext der AD-Domäne bei. Das UCS-System ist nicht in der Lage selbst als Active Directory Domänencontroller zu arbeiten. Durch die Domänenmitgliedschaft hat das UCS-System limitierten Zugriff auf Kontodaten der Active Directory-Domäne, die es über den UCS AD-Connector aus dem AD ausliest und lokal in den eigenen OpenLDAP-basierten Verzeichnisdienst schreibt. In dieser Konfiguration schreibt der UCS AD-Connector keine Änderungen in das AD.

source: The *AD member* mode is ideal for expanding an AD domain with applications that are available on the UCS platform. Apps installed on the UCS platform can then be used by the users of the AD domain. The authentication is still performed against native Microsoft AD domain controllers.
de: Der *AD Member*-Modus eignet sich, um eine AD-Domäne durch Applikationen zu erweitern, die auf der UCS-Plattform zur Verfügung stehen. Auf der UCS-Plattform installierte Apps sind dann für Benutzer der AD-Domäne nutzbar. Die Authentifikation erfolgt dabei weiter gegen native Microsoft AD-Domänencontroller.

source: The setup wizard can be started directly from the UCS installation by selecting *Join into an existing Active Directory domain*. Subsequently, the setup wizard can be installed with the app :program:`Active Directory Connection` from the Univention App Center. Alternatively, the software package :program:`univention-ad-connector` can be installed. Further information can be found in :ref:`computers-softwaremanagement-install-software`.
de: Der Einrichtungsassistent kann direkt bei der UCS Installation durch die Auswahl *Einer bestehenden Active-Directory-Domäne beitreten* gestartet werden. Nachträglich kann der Einrichtungsassistent mit der Applikation :program:`Active Directory-Verbindung` aus dem Univention App Center installiert werden. Alternativ kann das Softwarepaket :program:`univention-ad-connector` installiert werden. Weitere Informationen finden sich in :ref:`computers-softwaremanagement-install-software`.

source: The *AD member* mode can only be configured on a |UCSPRIMARYDN|.
de: Der *AD member*-Modus kann nur auf einem |UCSPRIMARYDN| konfiguriert werden.

source: The name of the DNS domain of the UCS systems must match that of the AD domain. The hostname must of course be different.
de: Der Name der DNS-Domäne des UCS-Systems muss mit dem der AD-Domäne übereinstimmen. Die Hostnamen selbst müssen natürlich unterschiedlich sein.

source: All the AD and UCS servers in a connector environment must use the same time zone.
de: Alle AD- und UCS-Server in einer Connector-Umgebung sollten dieselbe Zeitzone verwenden.

source: Configuration of the operating mode as part of an AD domain
de: Konfiguration des Betriebsmodus als Teil einer AD-Domäne

source: In the first dialogue window of the setup wizard, the point *Configure UCS as part of an AD domain* is preselected and can be confirmed with :guilabel:`Next`.
de: Im ersten Dialog des Einrichtungsassistenten ist der Punkt *UCS als Teil einer AD-Domäne konfigurieren* vorausgewählt und kann mit :guilabel:`Weiter` bestätigt werden.

source: The next dialogue window requests the address of an AD domain controller as well as the name of the standard administrator account of the AD domain and its password. The standard AD administrator account should be used here. The specified AD domain controller should also provide DNS services for the domain. Pressing the :guilabel:`Join AD domain` button starts the domain join.
de: Im nächsten Dialog wird die Adresse eines AD-Domänencontrollers sowie der Name des Standard-Administrator-Kontos der AD-Domäne und dessen Passwort abgefragt. Hier sollte das Standard AD Administrator-Konto verwendet werden. Der angegebene AD-Domänencontroller muss auch DNS-Dienste für die Domäne bereitstellen. Durch Betätigen der Schaltfläche :guilabel:`AD-Domäne beitreten` wird der Domänenbeitritt gestartet.

source: Domain join of an AD domain
de: Domänenbeitritt zu einer AD-Domäne

source: If the system time of the UCS system is more than 5 minutes ahead of the system time of the AD domain controller, manual adjustment of the system times is required. This is necessary because the AD Kerberos infrastructure is used for the authentication. System times should not, however, be turned back, in order to avoid inconsistencies.
de: Falls die Systemzeit des UCS-Systems mehr als 5 Minuten gegenüber der Systemzeit des AD-Domänencontrollers vorgeht, ist eine manuelle Angleichung der Systemzeiten notwendig. Dies ist notwendig, da die AD-Kerberos-Infrastruktur zur Authentifizierung verwendet wird. Systemzeiten sollten dabei nicht zurückgestellt werden, um Inkonsistenzen zu vermeiden.

source: The domain join is performed automatically. The subsequent dialogue window should be confirmed with :guilabel:`Finish`. Then the UMC server should be restarted by clicking :guilabel:`Restart`.
de: Der Domänenbeitritt läuft automatisch ab. Der abschließende Dialog sollte mit :guilabel:`Fertigstellen` bestätigt werden. Danach sollte mit einem Klick auf :guilabel:`Neustart` der UMC-Server neu gestartet werden.

source: Once the *AD member* mode has been set up, the authentication is performed against the AD domain controller. **Consequently, the password from the AD domain now applies for the administrator.** If an AD domain with a non-English language convention has been joined, the ``administrator`` account from UCS is automatically changed to the spelling of the AD during the domain join. The same applies for all user and group objects with *Well Known SID* (e.g., ``Domain Admins``).
de: Nach Einrichtung des *AD member*-Modus findet die Authentifikation gegen den AD-Domänencontroller statt. **Daher gilt für den Administrator jetzt das Passwort aus der AD-Domäne.** Falls einer AD-Domäne mit nicht-englischsprachiger Sprachkonvention beigetreten wurde, dann wird das ``Administrator``-Konto aus UCS während des Domänenbeitritts automatisch in die Schreibweise des AD umbenannt. Gleiches gilt für alle Benutzer- und Gruppenobjekte mit *Well Known SID* (z.B. ``Domain Admins``).

source: If additional UCS systems were already part of the UCS domain in addition to the |UCSPRIMARYDN|, they must also join the domain anew. At the same time they recognize that the |UCSPRIMARYDN| is in *AD member* mode and also join the authentication structure of the AD domain and can then also provide Samba file shares, for example.
de: Falls zuvor neben dem |UCSPRIMARYDN| weitere UCS-Systeme schon Teil der UCS-Domäne waren, dann müssen diese der Domäne neu beitreten. Dabei erkennen sie, dass der |UCSPRIMARYDN| sich im *AD member*-Modus befindet und treten ebenfalls der Authentifikationsstruktur der AD-Domäne bei und können dann z.B. zusätzlich Samba-Dateifreigaben bereitstellen.

source: As the AD Kerberos infrastructure is used for the authentication of users in this mode, it is essential that the system times of UCS and the AD domain controller are synchronized (with a tolerance of 5 minutes). For this purpose, the AD domain controller is configured as the NTP time server in UCS. In the case of authentication problems, the system time should always be the first thing to be checked.
de: Da in diesem Modus die AD-Kerberos-Infrastruktur zur Authentifizierung von Benutzern verwendet wird, ist es essenziell, dass die Systemzeiten von UCS und AD-Domänencontroller synchron sind (mit einer Toleranz von 5 Minuten). Zu diesem Zweck ist unter UCS der AD-Domänencontroller als NTP-Zeitserver konfiguriert. Im Falle von Authentifikationsproblemen sollte immer als erstes die Systemzeit überprüft werden.

source: Following this setup, the UMC module :guilabel:`Active Directory Connection` can be used for further administration, e.g., for checking whether the service is running and to restart it if necessary (see :ref:`ad-connector-restart`).
de: Nach dieser Einrichtung kann das UMC-Modul :guilabel:`Active Directory-Verbindung` zur weiteren Administration verwendet werden, z.B. um zu prüfen, ob der Dienst läuft und ihn gegebenenfalls neu zu starten (siehe :ref:`ad-connector-restart`).

source: To use an encrypted connection between Active Directory and the |UCSPRIMARYDN| not only for the authentication, but also for data exchange itself, the root certificate of the certification authority can be exported from the AD domain controller and uploaded via the UMC module. Further information on this topic is available in :ref:`ad-connector-ad-certificate`.
de: Um eine verschlüsselte Verbindung zwischen Active Directory und |UCSPRIMARYDN| nicht nur für die Authentifikation, sondern auch für den Datenaustausch an sich zu verwenden, kann auf dem AD-Domänencontroller das Root-Zertifikat der Zertifizierungsstelle exportiert und über das UMC-Modul hochgeladen werden. Weitere Informationen dazu liefert :ref:`ad-connector-ad-certificate`.

source: By default the Active Directory connection setup in this way does not transfer any password data from AD to the UCS directory service. Some apps from the Univention App Center require encrypted password data. If an app needs it, a note is shown in the App Center.
de: Per Voreinstellung überträgt die so eingerichtete Active Directory-Verbindung keine Passwortdaten aus AD in den UCS-Verzeichnisdienst. Einige Apps aus dem App Center benötigen verschlüsselte Passwortdaten. Sofern eine App diese benötigt, wird ein entsprechender Hinweis im App Center angezeigt.

source: In *AD member* mode the UCS AD Connector exports object data from the AD with the authorizations of the |UCSPRIMARYDN|'s machine account by default. These authorizations are not sufficient for exporting encrypted password data. In this case, the LDAP DN of a privileged replication user can be adjusted manually in the |UCSUCRV| :envvar:`connector/ad/ldap/binddn`. This must be a member of the ``Domain Admins`` group in the AD. The corresponding password must be saved in a file on the |UCSPRIMARYDN| and the filename entered in the |UCSUCRV| :envvar:`connector/ad/ldap/bindpw`. If the access password is changed at a later point in time, the new password must be entered in this file. The access rights for the file should be restricted so that only the ``root`` owner has access.
de: Im *AD member*-Modus liest der UCS AD-Connector Objektdaten per Voreinstellung mit den Berechtigungen des Maschinenkontos des |UCSPRIMARYDN|\ s aus dem AD. Für das Auslesen von verschlüsselten Passwortdaten sind dessen Berechtigungen nicht ausreichend. Daher muss in diesem Fall zusätzlich manuell die LDAP-DN eines privilegierten Replikationsbenutzers in die |UCSUCRV| :envvar:`connector/ad/ldap/binddn` eingetragen werden. Dieser muss im AD Mitglied der Gruppe ``Domänen-Admins`` sein. Das entsprechende Passwort muss auf dem |UCSPRIMARYDN| in eine Datei gespeichert werden und ihr Dateiname muss in die |UCSUCRV| :envvar:`connector/ad/ldap/bindpw` eingetragen werden. Falls zu einem späteren Zeitpunkt das Zugriffspasswort geändert wurde, muss das neue Passwort in diese Datei eingetragen werden. Die Zugriffsrechte für die Datei sollten so eingeschränkt werden, dass nur der Besitzer ``root`` Zugriff hat.

source: The following commands demonstrate the steps in an example:
de: Die folgenden Kommandos zeigen die Schritte beispielhaft:

source: If needed, the AD domain controller can also be replaced by the |UCSPRIMARYDN| at a later point in time. This is possible via the :program:`Active Directory Takeover` application (see :ref:`windows-ad-takeover`).
de: Falls gewünscht, kann zu einem späteren Zeitpunkt der AD-Domänencontroller auch durch den |UCSPRIMARYDN| abgelöst werden. Dies ist über die Applikation *Active Directory Takeover* möglich (siehe :ref:`windows-ad-takeover`).

source: Setup of the UCS AD connector
de: Einrichtung des UCS AD-Connectors

source: As an alternative to membership in an AD domain, as described in the previous section, the :program:`Active Directory Connection` can be used to synchronize user and group objects between a UCS domain and an AD domain. In addition to unidirectional synchronization, this operating mode also allows bidirectional synchronization. In this operating mode, both domains exist in parallel and their authentication systems function independently. The prerequisite for this is the synchronization of the encrypted password data.
de: Als Alternative zur Mitgliedschaft in einer AD-Domäne, die im vorherigen Abschnitt beschrieben ist, kann der UCS Active Directory-Connector dazu verwendet werden, Benutzer- und Gruppenobjekte zwischen einer UCS-Domäne und einer AD-Domäne zu synchronisieren. Diese Betriebsart erlaubt über die unidirektionale Synchronisation hinaus auch die bidirektionale Synchronisation. In dieser Betriebsart bestehen beide Domänen parallel und ihre Authentifikationssysteme funktionieren unabhängig. Dieser Betriebsmodus setzt die Synchronisation verschlüsselter Passwortdaten voraus.

source: By default containers, organizational units, users, groups and computers are synchronized.
de: In der Standardeinstellung werden Container, Organisationseinheiten, Benutzer, Gruppen und Rechner synchronisiert.

source: The UCS AD connector can only be installed on a |UCSPRIMARYDN| or |UCSBACKUPDN| system.
de: Der UCS AD Connector kann nur auf einem |UCSPRIMARYDN| oder einem |UCSBACKUPDN| installiert werden.

source: Information on the attributes configured in the basic setting and particularities to take into account can be found in :ref:`ad-connector-details-on-preconfigured-synchronization`.
de: Hinweise zu den in der Grundeinstellung konfigurierten Attributen und zu beachtende Besonderheiten finden sich in :ref:`ad-connector-details-on-preconfigured-synchronization`.

source: The identical user settings in both domains allow users to access services in both environments transparently. After logging in to a UCS domain, subsequent connection to a file share or to an Exchange server with Active Directory is possible without a renewed password request. Users and administrators will find users and groups of the same name on the resources of the other domain and can thus work with their familiar permission structures.
de: Durch die in beiden Domänen gleichen Benutzereinstellungen können Benutzer transparent auf Dienste beider Umgebungen zugreifen. Nachdem eine Domänenanmeldung an einer UCS-Domäne durchgeführt wurde, ist anschließend eine Verbindung zu einer Dateifreigabe oder einem Exchange-Server mit Active Directory ohne erneute Passwortabfrage möglich. Auf den Ressourcen der anderen Domäne finden Benutzer und Administratoren gleichnamige Benutzer und Gruppen vor und können so mit den gewohnten Rechtestrukturen arbeiten.

source: The initialization is performed after the first start of the connector. All the entries are read out of the UCS, converted to AD objects according to the mapping set and added (or modified if already present) on the AD side. All the objects are then exported from the AD and converted to UCS objects and added/modified accordingly on the UCS side. As long as there are changes, the directory service servers continue to be requested. The UCS AD connector can also be operated in a unidirectional mode.
de: Nach dem erstmaligen Start des Connectors wird die Initialisierung vorgenommen. Dabei werden alle Einträge aus dem UCS gelesen und entsprechend dem eingestellten Mapping in AD-Objekte umgewandelt und auf AD-Seite hinzugefügt, und, falls bereits vorhanden, modifiziert. Anschließend werden alle Objekte aus dem AD gelesen und in UCS-Objekte umgewandelt und entsprechend auf UCS-Seite hinzugefügt oder modifiziert. Solange noch Änderungen vorliegen, werden die Verzeichnisdienst-Server weiter abgefragt. Der UCS AD-Connector kann auch in einem unidirektionalen Modus betrieben werden.

source: Following the initial sync, additional changes are requested at a set interval. This value is set to five seconds and can be adjusted manually using the |UCSUCR| variable :envvar:`connector/ad/poll/sleep`.
de: Nach dem initialen Sync werden weitere Änderungen in einem festen Intervall abfragt. Dieser Wert ist auf fünf Sekunden eingestellt und kann manuell per |UCSUCR|-Variable :envvar:`connector/ad/poll/sleep` angepasst werden.

source: If an object cannot be synchronized, it is firstly reset (*rejected*). Following a configurable number of cycles – the interval can be adjusted using the |UCSUCR| variable :envvar:`connector/ad/retryrejected` – another attempt is made to import the changes. The standard value is ten cycles. In addition, when the UCS AD Connector is restarted, an attempt is also made to synchronize the previously rejected changes again.
de: Sollte ein Objekt nicht synchronisiert werden können, so wird dieses Objekt zunächst zurückgestellt (*rejected*). Nach einer konfigurierbaren Anzahl von Durchläufen - das Intervall kann im per |UCSUCR|-Variable :envvar:`connector/ad/retryrejected` angepasst werden - wird erneut versucht diese Änderungen wieder einzuspielen. Der Standardwert beträgt zehn Durchläufe. Außerdem wird bei einem Neustart des UCS AD-Connectors ebenfalls versucht, die zuvor zurückgewiesenen Änderungen erneut zu synchronisieren.

source: Basic configuration of the UCS AD Connector
de: Grundkonfiguration des UCS AD-Connectors

source: The UCS AD Connector is configured using a wizard in the UMC module :guilabel:`Active Directory Connection`.
de: Der UCS AD-Connector wird über einen Assistenten im UMC-Modul :guilabel:`Active Directory-Verbindung` konfiguriert.

source: The module can be installed from the Univention App Center with the application :program:`Active Directory Connection`. Alternatively, the software package :program:`univention-ad-connector` can be installed. Additional information can be found in :ref:`computers-softwaremanagement-install-software`.
de: Das Modul kann mit der Applikation :program:`Active Directory-Verbindung` aus dem Univention App Center installiert werden. Alternativ kann das Softwarepaket :program:`univention-ad-connector` installiert werden. Weitere Informationen finden sich in :ref:`computers-softwaremanagement-install-software`.

source: All AD and UCS servers in a connector environment must use the same time zone.
de: Alle AD- und UCS-Server in einer Connector-Umgebung müssen dieselbe Zeitzone verwenden.
