Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/windows.po
Languages: de

source: If a global group :samp:`{A}` is accepted as a member of another global group :samp:`{B}` in |UCSUDM|, this membership does not appear in Active Directory because of the internal AD limitations in :program:`Windows 2000/2003`. If group :samp:`{A}`'s name is then changed, the group membership to group :samp:`{B}` will be lost. Since :program:`Windows 2008` this limitation no longer exists and thus global groups can also be nested in Active Directory.
de: Wird im |UCSUDM| eine globale Gruppe ``A`` als Mitglied einer anderen globalen Gruppe ``B`` aufgenommen, so erscheint diese Mitgliedschaft aufgrund von AD-internen Beschränkungen unter :program:`Windows 2000/2003` nicht im Active Directory. Wird Gruppe ``A`` anschließend umbenannt, geht die Gruppenmitgliedschaft in Gruppe ``B`` verloren. Ab :program:`Windows 2008` besteht diese Einschränkung nicht mehr, dort können im Active Directory auch globale Gruppen verschachtelt werden.

source: Custom mappings
de: Benutzerdefinierte Mappings

source: For custom mappings, see :ref:`uv-dev-ref:ad-connection-custom-mappings` in :cite:t:`developer-reference`.
de: Für benutzerdefinierte Mappings, siehe :ref:`uv-dev-ref:ad-connection-custom-mappings` in :cite:t:`developer-reference`.

source: Users
de: Benutzer

source: Users are synchronized like groups using the username or using the AD pre Windows 2000 name. The *First name*, *Last name*, *Primary group* (in so far as present on the other side), *Organization*, *Description*, *Street*, *City*, *Postal code*, *Windows home path*, *Windows login script*, *Disabled* and *Account expiry date* attributes are transferred. Indirectly *Password*, *Password expiry date* and *Change password on next login* are also synchronized. *Primary email address* and *Telephone number* are prepared, but commented out due to differing syntax in the mapping configuration.
de: Benutzer werden wie Gruppen anhand des Benutzernamens und anhand des AD-Windows 2000 Namens synchronisiert. Direkt übermittelt werden die Attribute *Vorname*, *Nachname*, *primäre Gruppe* (sofern auf der anderen Seite vorhanden), *Organisation*, *Beschreibung*, *Straße*, *Stadt*, *PLZ*, *Profilpfad*, *Anmeldeskriptpfad*, *Deaktiviert* und *Kontoablaufdatum*. Indirekt werden zusätzlich *Passwort*, *Passwortablaufdatum* und *Ändern des Passwortes beim nächsten Login* synchronisiert. Vorbereitet, aber auf Grund unterschiedlicher Syntax in der Mapping-Konfiguration auskommentiert, sind *Primäre Mail-Adresse* und *Telefonnummer*.

source: The ``root`` and ``Administrator`` users are exempted.
de: Ausgenommen werden die Benutzer ``root`` und ``Administrator``.

source: Users are also identified using the name, so that for users created before the first synchronization on both sides, the same process applies as for groups as regards the position in LDAP.
de: Benutzer werden ebenfalls anhand des Namens identifiziert, so dass für Benutzer, die vor der ersten Synchronisation auf beiden Seiten angelegt wurden, hinsichtlich der Position im LDAP das gleiche Verhalten gilt wie bei Gruppen.

source: In some cases, a user to be created under AD, for which the password has been rejected, is deleted from AD immediately after creation. The reasoning behind this is that AD created this user firstly and then deletes it immediately once the password is rejected. If these operations are transmitted to UCS, they are transmitted back to AD. If the user is re-entered on the AD side before the operation is transmitted back, it is deleted after the transmission. The occurrence of this process is dependent on the polling interval set for the connector.
de: Es kann vorkommen, dass ein unter AD anzulegender Benutzer, dessen Passwort zurückgewiesen wurde, nach sofortigem erneuten Anlegen aus AD gelöscht wird. Grund dafür ist, das AD diesen Benutzer zunächst anlegt und nach dem Abweisen des Passwortes sofort wieder löscht. Werden diese Operationen nach UCS übertragen, werden sie auch wieder zurück nach AD übermittelt. Wurde der Benutzer auf AD-Seite schon vor der Rückübertragung der Operation erneut eingetragen, so wird er nach der Rückübertragung gelöscht. Das Auftreten dieses Verhaltens ist abhängig von dem eingestellten Abfrageintervall des Connectors.

source: AD and UCS create new users in a specific primary group (usually ``Domain Users`` or ``Domänen-Benutzer``) depending on the presetting. During the first synchronization from UCS to AD the users are therefore always a member in this group.
de: AD und UCS legen neue Benutzer per Voreinstellung in eine bestimmte primäre Gruppe (meist ``Domain Users`` und ``Domänen Benutzer``). Während der ersten Synchronisation von UCS nach AD werden die Benutzer daher immer in dieser Gruppe Mitglied.

source: Migrating an Active Directory domain to UCS using Univention AD Takeover
de: Migration einer Active Directory-Domäne zu UCS mit Univention AD Takeover

source: UCS supports the takeover of user, group and computer objects as well as Group Policy Objects (GPOs) from a Microsoft Active Directory (AD) domain. Windows clients do not need to rejoin the domain. The takeover is an interactive process consisting of three distinct phases:
de: UCS unterstützt die Übernahme von Benutzern, Gruppen, Rechnerobjekten und Gruppenrichtlinienobjekten (GPOs) aus einer bestehenden Active Directory (AD)-Domäne. Die Windows-Clients müssen dabei nicht erneut der Domäne beitreten. Diese Übernahme ist ein interaktiver Prozess, der aus drei Phasen besteht:

source: Copy all objects from Active Directory to UCS
de: Kopieren aller Objekte aus Active Directory nach UCS

source: Copy of the group policy files from the AD server to UCS
de: Kopieren der Gruppenrichtliniendateien aus Active Directory nach UCS

source: Deactivate the AD server and assign all FSMO roles to the UCS DC
de: Abschalten des AD-Servers und Zuweisung der FSMO-Rollen auf den UCS Directory Node

source: The following requirements must be met for the takeover:
de: Die folgenden Voraussetzungen müssen für die Übernahme erfüllt sein:

source: The UCS Directory Node (|UCSPRIMARYDN|) needs to be installed with a unique hostname, not used in the AD domain.
de: Der UCS Directory Node (|UCSPRIMARYDN|) muss mit einem eindeutigen Rechnernamen installiert werden, der nicht in der AD-Domäne vorhanden ist.

source: The UCS Directory Node needs to be installed with the same DNS domain name, NetBIOS (pre Windows 2000) domain name and Kerberos realm as the AD domain. It is also recommended to configure the same LDAP base DN.
de: Der UCS Directory Node muss mit demselben DNS-Domänennamen, NetBIOS-Domänennamen und Kerberos-Domänennamen installiert werden wie die AD-Domäne. Es wird empfohlen auch die selbe LDAP-Basis-DN zu verwenden.

source: The UCS Directory Node needs to be installed with a unique IPv4 address in the same IP subnet as the Active Directory domain controller that is used for the takeover.
de: Der UCS Directory Node muss eine IPv4-Adresse im selben Subnetz wie der zu übernehmende Active Directory-Domänencontroller verwenden.

source: If the system is already a member of an Active Directory Domain, installing the *Active Directory Takeover* application removes this membership. Therefore, the installation of the *Takeover* application has to take place only shortly before the actual takeover of the AD domain.
de: Sofern das System bereits Mitglied in einer Active Directory Domäne ist, wird durch die Installation der *Active Directory Takeover* Applikation diese Mitgliedschaft entfernt. Deshalb sollte die Installation der *Takeover* Applikation erst kurz vor der eigentlichen Übernahme der Active Directory Domäne erfolgen.

source: The *Active Directory Takeover* application must be installed from the Univention App Center for the migration. It must be installed on the system where the Univention S4 Connector is running (see :ref:`windows-s4-connector`, usually the |UCSPRIMARYDN|).
de: Für die Migration muss die Applikation :program:`Active Directory Takeover` aus dem Univention App Center installiert werden. Sie muss auf dem System installiert werden, auf dem der Univention S4 Connector läuft (siehe :ref:`windows-s4-connector`, normalerweise der |UCSPRIMARYDN|).

source: Preparation
de: Vorbereitung

source: The following steps are strongly recommended before attempting the takeover:
de: Es wird empfohlen die folgenden Schritte durchzuführen, bevor die Übernahme initiiert wird:

source: A backup of the AD server(s) should be performed.
de: Ein Backup des/der AD-Server(s) sollte durchgeführt werden.

source: If user logins to the AD server are possible (e.g. through domain logins or terminal server sessions) it is recommended to deactivate them and to stop any services in the AD domain, which deliver data, e.g. mail servers. This ensures that no data is lost in case of a rollback to the original snapshot/backup.
de: Sind Benutzeranmeldungen auf dem AD-Server erlaubt (durch Domänenanmeldungen oder Terminalserversitzungen), wird empfohlen, diese zu deaktivieren und alle Dienste zu stoppen, die Daten verarbeiten (z.B. Mailserver). Dies stellt sicher das durch den Rollback auf ein Backup oder einen Snapshot keine Daten verloren gehen.

source: It is recommended to set the same password for the ``Administrator`` account on the AD server as the corresponding account in the UCS domain. In case different passwords are used, the password that was set last, will be the one that is finally valid after the takeover process (timestamps are compared for this).
de: Es wird empfohlen auf dem AD-Server dasselbe ``Administrator``-Passwort zu verwenden wie in der UCS-Domäne. Werden verschiedene Passwörter verwendet, wird anhand der Zeitstempel verglichen, welches Passwort aktueller ist und dieses verwendet.

source: In a default installation the ``Administrator`` account of the AD server is deactivated. It should be activated in the local user management module.
de: In der Grundeinstellung ist das lokale ``Administrator`` Konto auf dem AD-Server deaktiviert. Es sollte in der lokalen Benutzerverwaltung aktiviert werden.

source: The activation of the ``Administrator`` account on the AD server is recommended because this account has all the required privileges to copy the GPO SYSVOL files. The activation can be achieved by means of the :guilabel:`Active Directory Users and Computers` module or by running the following two commands:
de: Die Aktivierung des ``Administrator``-Kontos wird empfohlen, weil dieses Konto über die nötigen Berechtigungen verfügt, um die Gruppenrichtlinien-Dateien in der SYSVOL-Freigabe zu kopieren. Der Benutzer kann entweder im AD-Verwaltungs-Tool für Benutzer und Gruppen oder mit den folgenden Kommandos auf der Kommandozeile aktiviert werden:

source: Domain migration
de: Domänenmigration

source: The takeover must be initiated on the UCS Directory Node that runs the Univention S4 Connector (by default the |UCSPRIMARYDN|). During the takeover process Samba must only run on this UCS system. If other UCS Samba/AD Nodes are present in the UCS domain, Samba needs to be stopped on those systems. This is important to avoid data corruption by mixing directory data taken over from Active Directory with Samba/AD directory data replicated from other UCS Samba/AD Nodes.
de: Die Übernahme muss auf dem UCS Directory Node gestartet werden, auf dem der Univention S4 Connector läuft (normalerweise der |UCSPRIMARYDN|). Während der Übernahme sollte Samba nur auf diesem UCS-System laufen. Gibt es weitere UCS Samba/AD Nodes, muss Samba auf diesen angehalten werden. Dies ist wichtig um replikationsbedingte Dateninkonsistenzen zu vermeiden.

source: Other UCS Samba/AD systems can be stopped by logging into each of the other UCS Directory Nodes as the ``root`` user and running
de: Andere UCS Samba/AD-Systeme können gestoppt werden, indem auf jedem UCS Directory Node als Benutzer ``root`` folgender Befehl ausgeführt wird

source: After ensuring that only the Univention S4 Connector host runs Samba/AD, the takeover process can be started. If the UCS domain was installed initially with a UCS version before UCS 3.2, the following |UCSUCRV| needs to be set first:
de: Nachdem sichergestellt wurde, dass keine anderen Samba/AD-Domänencontroller laufen, kann die Übernahme beginnen. Wurde die UCS-Domäne mit einer UCS-Version vor 3.2 installiert, muss zuerst die folgende |UCSUCRV| gesetzt werden:

source: The takeover is performed with the UMC module :guilabel:`Active Directory Takeover`. The IP address of the AD system must be specified under *Name or address of the Domain Controller*. An account from the AD domain must be specified under *Active Directory Administrator account* which is a member of the AD group ``Domain Admins`` (e.g., the ``Administrator``) and the corresponding password entered under *Active Directory Administrator password*.
de: Die Übernahme erfolgt mit dem UMC-Modul :guilabel:`Active Directory Takeover`. Unter *Name oder Adresse des Domänencontrollers* muss die IP-Adresse des AD-Systems angegeben werden. Unter *Active Directory Administratorkonto* muss ein Konto der AD-Domäne angegeben werden, das Mitglied der AD-Gruppe ``Domain Admins`` ist (z.B. der ``Administrator``) und unter *Active Directory Administratorpasswort* das dazugehörige Passwort.

source: First phase of domain migration
de: Erste Phase der Domänenmigration

source: The module checks whether the AD domain controller can be accessed and displays the domain data to be migrated.
de: Das Modul prüft, ob der AD-Domänencontroller erreicht werden kann und zeigt die zu migrierenden Domänendaten an.

source: Overview of the data to be migrated
de: Übersicht über die zu migrierenden Daten

source: When :guilabel:`Next` is clicked, the following steps are performed automatically:
de: Nach einem Klick auf :guilabel:`Weiter` werden die folgenden Schritte automatisch durchgeführt:

source: Adjust the system time of the UCS system to the system time of the Active Directory domain controller in case the UCS time is behind by more than three minutes.
de: Anpassung der Systemzeit des UCS-Systems auf die Systemzeit der Active Directory-Domäne (wenn diese um mehr als drei Minuten nachgeht).

source: Join the UCS Directory Node into the Active Directory domain.
de: Beitritt des UCS Directory Nodes in die Active Directory-Domäne.

source: Start Samba and the Univention S4 connector to replicate the Active Directory objects into the UCS OpenLDAP directory.
de: Start von Samba und dem Univention S4 Connector zur Replikation der AD-Objekte in das UCS-OpenLDAP-Verzeichnis.

source: When "*Well Known*" account and group objects (identified by their special RIDs) are synchronized into the UCS OpenLDAP, a listener module running on each UCS system sets a |UCSUCR| variable to locally to map the English name to the non-English AD name.
de: Wenn ein Benutzerkonto oder eine Gruppe mit einer "*Well Known*" RID nach UCS OpenLDAP synchronisiert wird, setzt ein Listener-Modul auf jedem UCS-System lokal eine |UCSUCR| Variable, die dem englischen Namen den nicht-englischen Namen zuordnet.

source: These variables are used to translate the English names used in the UCS configuration files to the specific names used in Active Directory. To give an example, if ``Domain Admins`` has a different name in the AD, then the |UCSUCR| variable :envvar:`groups/default/domainadmins` is set to that specific name (likewise for uses, e.g. :envvar:`users/default/administrator`).
de: Diese Variablen werden verwendet, um die in den UCS-Konfigurationsdateien verwendeten englischen Begriffe in die im Active Directory verwendeten Namen zu übersetzen. Wenn zum Beispiel ``Domain Admins`` einen anderen Namen im AD hat, dann wird die |UCSUCR| Variable :envvar:`groups/default/domainadmins` auf den spezifischen Namen gesetzt (analog für Benutzer, z.B. :envvar:`users/default/administrator`).

source: Additional information is logged to :file:`/var/log/univention/ad-takeover.log` as well as to :file:`/var/log/univention/management-console-module-adtakeover.log`.
de: Zusätzliche Informationen werden nach :file:`/var/log/univention/ad-takeover.log` sowie nach :file:`/var/log/univention/management-console-module-adtakeover.log` protokolliert.

source: The UCS Directory Node now contains all users, groups and computers of the Active Directory domain. In the next step, the SYSVOL share is copied, in which among other things the group policies are stored.
de: Nun enthält der UCS Directory Node alle Benutzer, Gruppen und Rechner aus der Active Directory-Domäne. Im nächsten Schritt wird die SYSVOL-Freigabe kopiert, in der u.a. die Gruppenrichtlinien gespeichert werden.

source: This phase requires the login to the Active Directory domain controller as the ``Administrator`` (or the equivalent non-English name). There a command needs to be started to copy the group policy files from the Active Directory SYSVOL share to the UCS SYSVOL share.
de: Nun muss eine Anmeldung als ``Administrator`` am Active Directory-Domänencontroller erfolgen und dort die Dateien mit den Gruppenrichtlinien aus der SYSVOL-Freigabe des AD-Servers auf den UCS-Server kopiert werden.

source: The command to be run in shown in the UMC module. If it has been successfully run, it must be confirmed with :guilabel:`Next`.
de: Das aufzurufende Kommando wird im UMC-Modul angezeigt. Wenn es erfolgreich aufgerufen wurde, muss mit :guilabel:`Weiter` bestätigt werden.

source: Copying the SYSVOL share
de: Kopieren der SYSVOL-Freigabe

source: It may be necessary to install the required :command:`robocopy` tool, which is part of the Windows Server 2003 Resource Kit Tools. Starting with Windows 2008 the tool is already installed.
de: Wenn :command:`robocopy` nicht vorhanden ist, kann es mit den Windows Server 2003 Resource Kit Tools nachinstalliert werden. Ab Windows 2008 ist es vorinstalliert.

source: The ``/mir`` option of :command:`robocopy` mirrors the specified source directory to the destination directory. Please be aware that if you delete data in the source directory and execute this command a second time, this data will also be deleted in the destination directory.
de: Hinweis: Die :command:`robocopy`-Option ``/mir`` spiegelt das Quellverzeichnis mit dem Zielverzeichnis. Es muss beachtet werden, dass bei einem erneuten Aufruf des Tools Dateien, die im Quellverzeichnis gelöscht wurden, auch im Zielverzeichnis gelöscht werden.

source: After successful completion of this step, it is now necessary to shutdown all domain controllers of the Active Directory domain. Then :guilabel:`Next` must be clicked in the UMC module.
de: Nach erfolgreichem Abschluss dieser Schritte sollten der/die AD-Domänencontroller heruntergefahren werden. Anschließend muss im UMC-Modul auf :guilabel:`Weiter` geklickt werden.

source: Shutdown of the AD server(s)
de: Herunterfahren des/der AD-Systeme

source: The following steps are now automatically performed:
de: Die folgenden Schritte werden nun automatisch durchgeführt:

source: Claiming all FSMO roles for the UCS Directory Node. These describe different tasks that a server can take on in an AD domain.
de: Übertragung der FSMO-Rollen auf den UCS Directory Node. Diese kennzeichnen verschiedene Aufgaben, die ein Server in einer AD-Domäne übernehmen kann.

source: Register the name of the Active Directory domain controller as a DNS alias (see :ref:`ip-config-cname-record-alias-records`) for the UCS DNS server.
de: Einrichten des Rechnernamens des AD-Servers als DNS-Alias (siehe :ref:`ip-config-cname-record-alias-records`) für den UCS-Server.

source: Configure the IP address of the Active Directory domain controller as a virtual Ethernet interface.
de: Konfiguration der IP-Adresse des AD-Servers als zusätzliche virtuelle IP-Adresse des UCS-Servers.

source: Perform some cleanup, e.g. removal of the AD domain controller account and related objects in the Samba SAM account database.
de: Verschiedene Anpassungen, z.B. Entfernen des alten AD-Domänencontroller-Eintrags aus der Samba SAM-Datenbank.

source: Finally restart Samba and the DNS server.
de: Abschließender Neustart von Samba und DNS-Server.

source: Final steps of the takeover
de: Abschluss der Übernahme

source: Finally the following steps are required:
de: Abschließend müssen noch die folgenden Schritte durchgeführt werden:

source: The domain function level of the migrated Active Directory domain needs to be checked by running the following command:
de: Der Domänenfunktionslevel der migrierten AD-Domäne muss mit dem folgenden Kommando geprüft werden:

source: In case this command returns the message ``ATTENTION: You run SAMBA 4 on a forest function level lower than Windows 2000 (Native).`` the following commands should be run to fix this:
de: Wenn das Kommando die Meldung ``ATTENTION: You run SAMBA 4 on a forest function level lower than Windows 2000 (Native)`` anzeigt, müssen die folgenden Befehle aufgerufen werden:

source: In case there has been more than one Active Directory domain controller in the original Active Directory domain, all the host accounts of the other domain controllers must be removed in the computers management UMC modules. In addition their accounts must be removed from the Samba SAM database. This may be done by logging in to a migrated Windows client as member of the group ``Domain Admins`` and running the tool :program:`Active Directory Users and Computers`.
de: Gab es in der migrierten AD-Domäne mehr als einen Domänencontroller, müssen die Rechnerkonten der weiteren Domänencontroller im UMC-Modul *Rechnerverwaltung* gelöscht werden. Außerdem müssen sie aus der Samba SAM-Datenbank gelöscht werden. Dies kann erreicht werden, indem von einem migrierten Windows-Client eine Anmeldung als Mitglied der Gruppe ``Domain Admins`` erfolgt und das AD-Verwaltungstool für Benutzer und Computer aufgerufen wird.

source: If more than one UCS Directory Node with Samba/AD has been installed, these servers need to be re-joined.
de: Gibt es weitere Samba-Domänencontroller, müssen diese neu der Domäne beitreten.

source: All Windows clients need to be rebooted.
de: Alle Windows-Clients müssen neu gestartet werden.

source: It is recommended to perform thorough tests with Windows client systems, e.g.
de: Es wird empfohlen nach der Übernahme gründliche Tests mit Windows-Clients durchzuführen, z.B.

source: Login to a migrated client as a migrated user.
de: Anmeldung auf einem migrierten Client mit einem migrierten Benutzer.

source: Login to a migrated client as the *Administrator*.
de: Anmeldung auf einem migrierten Client als *Administrator*.

source: Test group policies.
de: Test der Gruppenrichtlinien.

source: Join of a new Windows client.
de: Domänenbeitritt eines neuen Windows-Clients.

source: Create a new UCS user and login to a Windows client.
de: Anlegen eines neuen Benutzers und Anmeldung an einem Windows-Client.

source: Chapter contents:
de: Kapitelinhalte:

source: Services for Windows
de: Services für Windows

source: UCS can offer Active Directory (AD) services, be a member of an Active Directory domain or synchronize objects between Active Directory domains and a UCS domain.
de: UCS kann Active Directory (AD) Dienste anbieten, Mitglied einer Active Directory-Domäne sein oder Objekte zwischen Active Directory-Domänen und einer UCS-Domäne synchronisieren.

source: For the purposes of Windows systems, UCS can assume the tasks of Windows server systems:
de: Aus Sicht von Windows-Systemen kann UCS die Aufgaben von Windows-Serversystemen übernehmen:

source: Domain controller function / authentication services
de: Domänencontrollerfunktionalität / Authentifizierungsdienste

source: File services
de: Dateidienste

source: Print services
de: Druckdienste
