Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/windows.po
Languages: de

source: Despite intensive tests it is not possible to rule out that the results of the synchronization may affect the operation of a productive domain. The connector should therefore be tested for the respective requirements in a separate environment in advance.
de: Trotz intensiver Tests kann aufgrund der Vielfalt der Konfigurations- und Betriebsvarianten einer AD-Domäne nicht ausgeschlossen werden, dass die Ergebnisse des Synchronisationsvorgangs den Betrieb einer produktiven Domäne beeinträchtigen. Der UCS AD-Connector sollte daher vorab in einer getrennten Umgebung auf die jeweiligen Anforderungen geprüft werden.

source: It is convenient to perform the following steps with a web browser from the AD domain controller, as the files need to be downloaded from the AD domain controller and uploaded to the wizard.
de: Es ist zu empfehlen, die folgenden Schritte mit einem Webbrowser vom AD-Domänencontroller aus durchzuführen, da Dateien auf den AD-Domänencontroller herunter geladen und im Assistenten hochgeladen werden müssen.

source: In the first dialog window of the setup wizard, the point *Synchronization of content data between an AD and this UCS domain* must be selected and confirmed with :guilabel:`Next`.
de: Im ersten Dialog der Einrichtungsassistenten muss der Punkt *Synchronisation von Kontendaten zwischen einer AD und dieser UCS-Domäne* ausgewählt und mit :guilabel:`Weiter` bestätigt werden.

source: Configuration of the UCS AD Connector via UMC module
de: Konfiguration des UCS AD-Connectors über UMC-Modul

source: The address of an AD domain controller is requested in the next dialogue window. Here you can specify the IP address of a fully qualified DNS name. If the UCS system is not be able to resolve the computer name of the AD system, the AD DNS server can either be configured as the DNS forwarder under UCS or a DNS host record can be created for the AD system in the UMC module :guilabel:`DNS` (see :ref:`networks-dns-hostrecord`).
de: Im nächsten Dialog wird die Adresse eines AD-Domänencontrollers abgefragt. Hier kann die IP-Adresse oder ein voll qualifizierter DNS-Name eingegeben werden. Wenn der Rechnername des AD-Systems für das UCS-System nicht auflösbar sein sollte, kann entweder unter UCS der AD DNS-Server als DNS-Forwarder konfiguriert werden oder es kann im UMC-Modul :guilabel:`DNS` ein DNS-Host-Record für das AD-System angelegt werden (siehe :ref:`networks-dns-hostrecord`).

source: Alternatively, a static entry can also be adopted in :file:`/etc/hosts` via |UCSUCR|, e.g.
de: Alternativ kann auch über |UCSUCR| ein statischer Eintrag in :file:`/etc/hosts` aufgenommen werden, z.B. mit

source: In the *Active Directory account* field, the user is configured which is used for the access on the AD. The setting is saved in the |UCSUCRV| :envvar:`connector/ad/ldap/binddn`. The replication user must be a member of the ``Domain Admins`` group in the AD.
de: Im Feld *Active Directory-Konto* wird der Benutzer konfiguriert, der für den Zugriff auf das AD verwendet wird. Die Einstellung wird in der |UCSUCRV| :envvar:`connector/ad/ldap/binddn` gespeichert. Der Replikationsbenutzer muss im AD Mitglied der Gruppe ``Domänen-Admins`` sein.

source: The password used for the access must be entered in the *Active Directory password* field. On the UCS system it is only saved locally in a file which only the ``root`` user can read.
de: Das verwendete Passwort für den Zugriff muss im Feld *Active Directory-Passwort* eingetragen werden. Es wird auf dem UCS-System lokal in einer Datei gespeichert, die nur für den Benutzer ``root`` lesbar ist.

source: :ref:`ad-connector-ad-password` describes the steps required if these access data need to be adjusted at a later point in time.
de: :ref:`ad-connector-ad-password` beschreibt die Schritte, die notwendig sind, falls diese Zugangsdaten zu einem späteren Zeitpunkt angepasst werden müssen.

source: Clicking on :guilabel:`Next` prompts the setup wizard to check the connection to the AD domain controller. If it is not possible to create an SSL/TLS-encrypted connection, a warning is emitted in which you are advised to install a certification authority on the AD domain controller. It is recommended to follow this advice.
de: Nach Klick auf :guilabel:`Weiter` prüft der Einrichtungsassistent die Verbindung zum AD-Domänencontroller. Falls keine SSL/TLS-verschlüsselte Verbindung aufgebaut werden kann, wird eine Warnung ausgegeben, in der zur Installation einer Zertifizierungsstelle auf dem AD-Domänencontroller geraten wird. Es wird empfohlen diesem Rat zu folgen.

source: UCS 5.0 requires TLS 1.2, which needs to be activated manually for Windows Server Releases prior to 2012R2. UCS 5.0 doesn't support the hash algorithm SHA-1 any longer. If this has been used in the creation of the AD root certificate or for the certificate of the Windows server then they should be replaced.
de: UCS 5.0 erfordert TLS 1.2, welches für Windows Server Releases vor 2012R2 manuell auf dem Windows Server aktiviert werden muss. UCS 5.0 unterstützt die Hash-Funktion SHA-1 nicht mehr. Falls für die Erstellung des AD Root-Zertifikat oder des Zertifikat des Windows Servers dieses Verfahren verwendet wurde, dann sollten diese ersetzt werden.

source: Following this step, the setup can be continued by clicking :guilabel:`Next` again. If it is still not possible to create an SSL/TLS-encrypted connection, a security query appears asking whether to set up the synchronization without SSL encryption. If this is needed, the setup can be continued by clicking :guilabel:`Continue without encryption`. In this case, the synchronization of the directory data is performed unencrypted.
de: Nach diesem Schritt kann die Einrichtung durch erneuten Klick auf :guilabel:`Weiter` fortgesetzt werden. Falls weiterhin keine SSL/TLS-verschlüsselte Verbindung aufgebaut werden kann, wird in einem Sicherheitshinweis nachgefragt, ob die Synchronisation ohne SSL-Verschlüsselung eingerichtet werden soll. Falls dies gewünscht ist, kann die Einrichtung durch Klick auf :guilabel:`Fortfahren ohne Verschlüsselung` fortgesetzt werden. In diesem Fall findet die Synchronisation der Verzeichnisdaten unverschlüsselt statt.

source: If the AD domain controller supports SSL/TLS-encrypted connections, the setup wizard offers :guilabel:`Upload AD root certificate` in the next step. This certificate must be exported from the AD certification authority in advance (see :ref:`ad-connector-ad-certificate`). In contrast, if this step is skipped, the certificate can also be uploaded via the UMC module at a later point in time and the SSL/TLS encryption enabled (until that point all directory data will, however, be synchronized unencrypted).
de: Falls der AD-Domänencontroller SSL/TLS-verschlüsselte Verbindungen unterstützt, bietet der Einrichtungsassistent im nächsten Schritt das :guilabel:`Hochladen des AD-Root-Zertifikats` an. Dieses Zertifikat muss vorher aus der AD-Zertifizierungsstelle exportiert werden (siehe :ref:`ad-connector-ad-certificate`). Falls dieser Schritt hingegen übersprungen wird, kann das Zertifikat auch zu einem späteren Zeitpunkt über das UMC-Modul hochgeladen und die SSL/TLS-Verschlüsselung aktiviert werden (bis dahin werden dann aber alle Verzeichnisdaten unverschlüsselt synchronisiert).

source: The connector can be operated in different modes, which can be selected in the next dialogue window *Configuration of Active Directory domain synchronization*. In addition to bidirectional synchronization, replication can also be performed in one direction from AD to UCS or from UCS to AD. Once the mode has been selected, :guilabel:`Next` needs to be clicked.
de: Der Connector kann in verschiedenen Modi betrieben werden, die im nächsten Dialog *Konfiguration der Active Directory-Domänensynchronisation* ausgewählt werden können. Neben einer bidirektionalen Synchronisation kann auch unidirektional von AD nach UCS oder unidirektional von UCS in das AD repliziert werden. Nach Auswahl des Modus muss auf :guilabel:`Weiter` geklickt werden.

source: Once :guilabel:`Next` is clicked, the configuration is taken over and the UCS AD Connector started. The subsequent dialogue window needs to be closed by clicking on :guilabel:`Finish`.
de: Nach einem Klick auf :guilabel:`Weiter` wird die Konfiguration übernommen und der UCS AD-Connector wird gestartet. Der abschließende Dialog muss dann durch Klick auf :guilabel:`Fertigstellen` geschlossen werden.

source: Following this setup, the UMC module :guilabel:`Active Directory Connection` can be used for further administration of the Active Directory Connection, e.g., for checking whether the service is running and restart it if necessary (see :ref:`ad-connector-restart`).
de: Nach dieser Einrichtung kann das UMC-Modul :guilabel:`Active Directory-Verbindung` zur weiteren Administration des UCS Active Directory Connectors verwendet werden, z.B. um zu prüfen, ob der Dienst läuft und ihn gegebenenfalls neu zu starten (siehe :ref:`ad-connector-restart`).

source: The connector can also synchronize several AD domains within one UCS domain; this is documented in :cite:t:`ext-doc-win`.
de: Der Connector kann auch mehrere AD-Domänen mit einer UCS-Domäne synchronisieren; dies ist in :cite:t:`ext-doc-win` dokumentiert.

source: Administration dialogue for the Active Directory Connection
de: Administrationsdialog für die Active Directory-Verbindung

source: Importing the SSL certificate of the Active Directory
de: Import des SSL-Zertifikats des Active Directory

source: A SSL certificate must be created on the Active Directory system and the root certificate exported to allow encrypted communication. The certificate is created by the Active Directory's certificate service. The necessary steps depend on the Windows versions used. Three versions are shown below as examples.
de: Auf dem Active Directory-System muss nun ein SSL-Zertifikat erzeugt und das Root-Zertifikat exportiert werden, damit eine verschlüsselte Kommunikation stattfinden kann. Erzeugt wird das Zertifikat mit dem Zertifikatsdienst des Active Directory. Die nötigen Schritte sind abhängig von der eingesetzten Windows-Version und werden hier beispielhaft für drei Varianten dargestellt.

source: The encrypted communication between the UCS system and Active Directory can also be deactivated by setting the |UCSUCRV| :envvar:`connector/ad/ldap/ssl` to ``no``. This setting does not affect the replication of encrypted password data.
de: Die verschlüsselte Verbindung zwischen UCS-System und Active Directory kann auch deaktiviert werden, indem die |UCSUCRV| :envvar:`connector/ad/ldap/ssl` auf ``no`` gesetzt wird. Diese Einstellung betrifft nicht die Synchronisation der verschlüsselten Passwortdaten.

source: Exporting the certificate on Windows 2012 / 2016 / 2019
de: Export unter Windows Server 2012 / 2016 / 2019

source: If the certificate service isn't installed yet, add it to your domain with the following steps before you proceed:
de: Falls der Zertifizierungsdienst noch nicht installiert ist, installieren Sie ihn in Ihre Domäne mit den folgenden Schritten, bevor sie fortfahren:

source: Open the *Server Manager*.
de: Öffnen Sie den *Server Manager*.

source: Select the role *Active Directory Certificate Services* in :menuselection:`Manage --> Add Roles and Features`.
de: Wählen Sie unter :menuselection:`Verwalten --> Rollen und Features hinzufügen` die Rolle :guilabel:`Active Directory-Zertifikatsdienste` aus.

source: In the services list, select :guilabel:`Certification Authority`. The top bar in the *Server Manager* shows a yellow warning triangle.
de: Wählen Sie in der Liste der Dienste die :guilabel:`Zertifizierungsstelle` aus. Die obere Leiste des *Server Manager*\ s zeigt ein gelbes Warndreieck an.

source: Select the option :guilabel:`Configure Active Directory Certificate Services on the server` and configure the *Certification Authority* as selected role service.
de: Wählen Sie die Option :guilabel:`Active Directory-Zertifikatsdienste konfigurieren` auf dem Server und konfigurieren Sie die *Zertifizierungsstelle* als ausgewählten Rollendienst.

source: Choose :menuselection:`Enterprise CA --> Root CA` as type of installation.
de: Wählen Sie :menuselection:`Unternehmenszertifizierungsstelle --> Stammzertifizierungsstelle` als Installationstyp.

source: Click :guilabel:`Create a new private key`, confirm the suggested encryption settings and the name of the certification authority.
de: Klicken Sie :guilabel:`Neuen privaten Schlüssel erstellen`, bestätigen Sie die vorgeschlagenen Verschlüsselungseinstellungen und den Namen der Zertifizierungsstelle.

source: Choose any period for validity and use the standard paths for the database location.
de: Wählen Sie einen beliebigen Zeitraum für die Gültigkeit und verwenden Sie die Standardpfade für den Speicherort der Datenbank.

source: Finally, restart your Windows Active Directory server to let the changes come into effect.
de: Starten Sie abschließend Ihren Windows Active Directory Server neu, damit die Änderungen wirksam werden.

source: `Install the Certification Authority <microsoft-install-the-certification-authority_>`_
de: `Installieren der Zertifizierungsstelle <microsoft-install-the-certification-authority_>`_

source: for detailed procedure about installing the certificate authority in :cite:t:`microsoft-install-the-certification-authority`.
de: für eine detaillierte Beschreibung der Installation der Zertifizierungsstelle in :cite:t:`microsoft-install-the-certification-authority`.

source: To export the certificate authority certificate, use the following steps:
de: Um das Zertifikat der Zertifizierungsstelle zu exportieren, gehen Sie wie folgt vor:

source: Select the role *Active Directory Certificate Services* (AD CS).
de: Wählen Sie die Rolle *AD-Zertifikatsdienste*.

source: Right-click the name of the Windows server and select :guilabel:`Certification Authority`. A window with the certification authority opens. A tree of hosts below *Certification Authority* shows up on the left side.
de: Klicken Sie mit der rechten Maustaste auf den Namen des Windows-Servers und wählen Sie :guilabel:`Zertifizierungsstelle`. Das Fenster mit der Zertifizierungsstelle öffnet sich. Ein Baum von Rechnern erscheint unter *Zertifizierungsstelle* auf der linken Seite.

source: Every host has the elements *Revoked Certificates*, *Issued Certificates*, *Pending Requests*, *Failed Requests*, and *Certificate Templates* underneath.
de: Unter jedem aufgelisteten Rechner befinden sich die Elemente *Gesperrte Zertifikate*, *Ausgestellte Zertifikate*, *Ausstehende Anforderungen*, *Fehlgeschlagene Anforderungen* und *Zertifikatsvorlagen*.

source: In the server list, right-click the Windows host that serves your certificate authority and select :guilabel:`Properties`. Don't mix it up with one of the other elements.
de: Klicken Sie in der Serverliste mit der rechten Maustaste auf den Windows-Server, der Ihre Zertifizierungsstelle bedient, und wählen Sie :guilabel:`Eigenschaften`. Verwechseln Sie ihn nicht mit einem der anderen Elemente.

source: In the *Properties* window, select :menuselection:`General --> CA certificates --> Certificate #0` and click :guilabel:`View Certificate`.
de: Im Fenster *Eigenschaften* wählen Sie :menuselection:`Generell --> Stammzertifikat --> Zertifikat Nr. 0` und klicken auf :guilabel:`Zertifikat anzeigen`.

source: It's important to copy the certificate usually with the name ``Certificate #0``, because :program:`AD Connection` needs exactly this certificate for a secure connection.
de: Es ist wichtig, das Zertifikat zu kopieren, das normalerweise den Namen ``Zertifikat Nr. 0`` trägt, da die App :program:`AD Connection` genau dieses Zertifikat für eine sichere Verbindung benötigt.

source: In the opening *Certificate* window, select the tab *Details* and click :guilabel:`Copy to File …`.
de: Wählen Sie im sich öffnenden Fenster *Zertifikat* die Registerkarte *Details* und klicken Sie auf :guilabel:`In Datei kopieren …`.

source: Copying the Active Directory certificate to the UCS system
de: Kopieren des AD-Zertifikats auf das UCS-System

source: The SSL AD certificate should now be imported into the UCS system using the UMC module.
de: Nun muss das SSL-AD-Zertifikat über das UMC-Modul in das UCS-System importiert werden.

source: This is done by clicking on :guilabel:`Upload` in the sub menu *Active Directory connection SSL configuration*. This opens a window in which a file can be selected, which is being uploaded and integrated into the UCS AD Connector.
de: Dies erfolgt durch einen Klick auf :guilabel:`Hochladen` im Untermenü *Active Directory-Verbindung SSL-Konfiguration*. Hierbei öffnet sich ein Fenster, in dem eine Datei ausgewählt wird. Das hochgeladene Zertifikat wird dadurch für den UCS AD-Connector verfügbar gemacht.

source: Starting/Stopping the Active Directory Connection
de: Start/Stopp des Active Directory Connectors

source: The connector can be started using *Start Active Directory connection service* and stopped using *Stop Active Directory connection service*. Alternatively, the starting/stopping can also be performed with the :file:`/etc/init.d/univention-ad-connector` init-script.
de: Abschließend kann der Connector über *Active Directory-Verbindungsdienst starten* gestartet werden und bei Bedarf über *Active Directory-Verbindungsdienst stoppen* angehalten werden. Alternativ kann ein Starten/Stoppen auch über Kommandozeile durch die Befehle :command:`/etc/init.d/univention-ad-connector start` und :command:`/etc/init.d/univention-ad-connector stop` erfolgen.

source: Functional test of basic settings
de: Funktionstest der Grundeinstellungen

source: The correct basic configuration of the connector can be checked by searching in Active Directory from the UCS system. Here one can search e.g. for the administrator account in Active Directory with:
de: Die korrekte Grundkonfiguration des Connectors lässt sich prüfen, indem vom UCS-System aus im Active Directory gesucht wird. Mit folgendem Befehl kann z.B. nach dem Administrator-Konto im Active Directory gesucht werden:

source: As :command:`univention-adsearch` accesses the configuration saved in |UCSUCR|, this allows you to check the reachability/configuration of the Active Directory access.
de: Da :command:`univention-adsearch` auf die in |UCSUCRV| gespeicherte Konfiguration zugreift, kann auf diesem Weg die Erreichbarkeit/Konfiguration des Active Directory-Zugriffs geprüft werden.

source: Changing the AD access password
de: Änderung des AD-Zugriffspassworts

source: The access data required by the UCS AD Connector for Active Directory are configured via the |UCSUCRV| :envvar:`connector/ad/ldap/binddn` and :envvar:`connector/ad/ldap/bindpw`. If the password has changed or you wish to use another user account, these variables must be adapted manually.
de: Die vom UCS AD-Connector benötigten Zugangsdaten zum Active Directory werden über die |UCSUCRV| :envvar:`connector/ad/ldap/binddn` und :envvar:`connector/ad/ldap/bindpw` konfiguriert. Falls das Passwort sich geändert hat oder ein anderes Benutzerkonto verwendet werden soll, können diese Variablen manuell angepasst werden.

source: The |UCSUCRV| :envvar:`connector/ad/ldap/binddn` is used to configure the LDAP DN of a privileged replication user. This must be a member of the ``Domain Admins`` group in the AD. The corresponding password must be saved locally in a file on the UCS system, the name of which must be entered in the |UCSUCRV| :envvar:`connector/ad/ldap/bindpw`. The access rights for the file should be restricted so that only the ``root`` owner has access. The following commands show this as an example:
de: Über die |UCSUCRV| :envvar:`connector/ad/ldap/binddn` wird die LDAP-DN eines privilegierten Replikationsbenutzers konfiguriert. Dieser muss im AD Mitglied der Gruppe ``Domänen-Admins`` sein. Das entsprechende Passwort muss lokal auf dem UCS-System in eine Datei gespeichert werden, deren Dateiname in der |UCSUCRV| :envvar:`connector/ad/ldap/bindpw` eingetragen sein muss. Die Zugriffsrechte für die Datei sollten so eingeschränkt werden, dass nur der Besitzer ``root`` Zugriff hat. Die folgenden Kommandos zeigen dies beispielhaft:

source: Additional tools / Debugging connector problems
de: Werkzeuge / Fehlersuche

source: The :program:`Active Directory Connection` provides the following tools and log files for diagnosis:
de: Die :program:`Active Directory Connection` stellt die folgenden Werkzeuge und Protokolldateien für die Diagnose zur Verfügung:

source: This tool facilitates a LDAP search in Active Directory. Objects deleted in AD are always shown (they are still kept in an LDAP sub tree in AD). As the first parameter the script awaits an LDAP filter; the second parameter can be a list of LDAP attributes to be displayed.
de: Dieses Tool ermöglicht die einfache LDAP-Suche im Active Directory. In AD gelöschte Objekte werden immer mit angezeigt (diese werden in AD weiterhin in einem LDAP-Unterbaum vorgehalten). Als erste Option erwartet das Skript einen LDAP-Filter, die zweite Option kann eine Liste der anzuzeigenden LDAP-Attribute sein, z.B.:

source: Example:
de: Beispiel:

source: This tool lists the DNs of non-synchronized objects. In addition, in so far as temporarily stored, the corresponding DN in the respective other LDAP directory will be displayed. In conclusion ``lastUSN`` shows the ID of the last change synchronized by AD.
de: Dieses Tool führt die DNs nicht synchronisierter Objekte auf. Zusätzlich wird, sofern zwischengespeichert, die korrespondierende DN im jeweils anderen LDAP-Verzeichnis angegeben. Abschließend gibt ``lastUSN`` die ID der letzten von AD synchronisierten Änderung an.

source: This script may display an error message or an incomplete output if the AD connector is in operation.
de: Dieses Skript könnte eine Fehlermeldung oder eine unvollständige Ausgabe anzeigen, wenn der AD Connector in Betrieb ist.

source: You can use this script to remove an AD object from the AD rejected list located in the internal database file :file:`/etc/univention/{connector}/internal.sqlite`.
de: Sie können dieses Skript verwenden, um ein AD-Objekt aus der Liste der abgelehnten AD-Objekte zu entfernen, das sich in der internen Datenbankdatei :file:`/etc/univention/{connector}/internal.sqlite` befindet.

source: You can use this script to remove an UCS directory object from the UCS rejected list located in the internal database file :file:`/etc/univention/{connector}/internal.sqlite`.
de: Mit diesem Skript können Sie ein UCS Verzeichnisobjekt aus der Liste der abgelehnten UCS-Objekte entfernen, das sich in der internen Datenbankdatei :file:`/etc/univention/{connector}/internal.sqlite` befindet.

source: You can use this script to re-synchronize directory objects from AD to UCS. Use it to synchronize a single or multiple directory objects.
de: Sie können dieses Skript verwenden, um Verzeichnisobjekte von AD zu UCS erneut zu synchronisieren. Verwenden Sie es, um ein einzelnes oder mehrere Verzeichnisobjekte zu synchronisieren.

source: You can use this script to re-synchronize directory objects from UCS to AD. Use it to synchronize a single or multiple directory objects.
de: Sie können dieses Skript verwenden, um Verzeichnisobjekte von UCS nach AD erneut zu synchronisieren. Verwenden Sie es, um ein einzelnes oder mehrere Verzeichnisobjekte zu synchronisieren.

source: Examples:
de: Beispiele:

source: You can use this script to create AD connection instances. The script copies the required files and sets specific UCR variables.
de: Sie können dieses Skript verwenden, um AD-Verbindungsinstanzen zu erstellen. Das Skript kopiert die erforderlichen Dateien und setzt bestimmte UCR-Variablen.
