Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/windows.po
Languages: de

source: :program:`Group Policy Management` can be installed as a component of the *Remote Server Administration Tools* on Windows clients. They can be found at `Remote Server Administration Tools (RSAT) for Windows 10 <microsoft-rsat-tools_>`_.
de: Die :program:`Gruppenrichtlinienverwaltung` kann als Teil der *Remote Server Administration Tools* auf Windows Clients installiert werden. Sie können für Windows 10 unter `Remote Server Administration Tools (RSAT) for Windows 10 <microsoft-rsat-tools_>`_ bezogen werden.

source: Activating the Group Policy Management tools
de: Aktivierung der Gruppenrichtlinienverwaltung

source: Following the installation, Group Policy Management must still be enabled in the Windows Control Panel. This is done by enabling the *Group Policy Management Tools* option under :menuselection:`Start --> Control Panel --> Programs --> Turn Windows features on or off --> Remote Server Administration Tools --> Feature Administration Tools`.
de: Nach der Installation muss die Gruppenrichtlinienverwaltung in der Windows-Systemsteuerung noch aktiviert werden, in dem unter :menuselection:`Start --> Systemsteuerung --> Programme --> Windows-Funktionen aktivieren und deaktivieren --> Remoteserver-Verwaltungstools --> Featureverwaltungs-Tools` die Option *Tools für die Gruppenrichtlinienverwaltung* aktiviert wird.

source: Following the enabling, Group Policy Management can be run under :menuselection:`Start --> Administrative Tools --> Group Policy Management`.
de: Nach der Aktivierung kann die Gruppenrichtlinienverwaltung unter :menuselection:`Start --> Verwaltung --> Gruppenrichtlinienverwaltung` aufgerufen werden.

source: Configuration of policies with Group Policy Management
de: Konfiguration von Richtlinien mit der Gruppenrichtlinienverwaltung

source: Group policies can only be configured by users who are members of the ``Domain Admins`` group (e.g., the ``Administrator``). When logging in, attention must be paid to logging in with the domain Administrator account and not the local Administrator account. Group Policy Management can be run on any system in the domain.
de: Gruppenrichtlinien können nur von Benutzern konfiguriert werden, die Mitglied der Gruppe ``Domain Admins`` sind (z.B. der ``Administrator``). Bei der Anmeldung muss beachtet werden, dass keine Anmeldung mit dem lokalen Administrator-Konto erfolgt, sondern mit dem Administrator-Konto der Domäne. Die Gruppenrichtlinienverwaltung kann auf einem beliebigen System der Domäne aufgerufen werden.

source: If more than one Samba domain controller is in use, consideration must be given to the replication of the GPO data, see :ref:`gpo-gposync`.
de: Wenn mehr als ein Samba-Domänencontroller eingesetzt wird, muss die Replikation der GPO-Daten berücksichtigt werden, siehe :ref:`gpo-gposync`.

source: There are two basic possibilities for creating GPOs:
de: Es gibt zwei prinzipielle Möglichkeiten GPOs zu erstellen:

source: They can be created in the *Group Policy Objects* folder and then linked to different positions in the LDAP. This is practical if a policy is to be linked to several positions in the LDAP.
de: Sie können im *Gruppenrichtlinienobjekte*-Order angelegt und dann mit verschiedenen Positionen im LDAP verknüpft werden. Dies ist sinnvoll, wenn eine Richtlinie mit mehreren Positionen im LDAP verknüpft werden soll.

source: The GPO can also be created at an LDAP position ad hoc and then directly linked to it. This is the simpler means for small and medium-sized domains. Domains created ad hoc are also shown in the *Group Policy Objects* folder.
de: Die GPO kann ad hoc an einer LDAP-Position erstellt und dabei direkt verknüpft werden. Für kleine und mittlere Domänen ist das der einfachere Weg. Auch ad hoc erstellte Domänen werden im *Gruppenrichtlinienobjekte*-Ordner angezeigt.

source: A policy can have one of three statuses: ``enabled``, ``disabled`` or ``unset``. The effect is always based on the formulation of the policy. For example, if it says *Disable feature xy*, the policy must be enabled to switch off the feature. Some policies have additional options, for example the *Enable mail quota* policy could include an additional option for managing the storage space.
de: Eine Richtlinie kann drei Zustände annehmen; sie kann ``aktiviert``, ``deaktiviert`` oder ``nicht gesetzt`` sein. Die Auswirkung bezieht sich immer auf die Formulierung der Richtlinie. Wenn diese beispielsweise *Deaktiviere Feature xy* heißt, muss die Richtlinie aktiviert werden um das Feature abzuschalten. Einige Richtlinien haben zusätzliche Optionen, z.B. könnte die Richtlinie *Aktiviere Mail-Quota* eine zusätzliche Option mitbringen um die Speichermenge zu verwalten.

source: Editing a policy
de: Bearbeiten einer Richtlinie

source: Two standard policy objects are predefined:
de: Zwei Standard-Richtlinienobjekte sind vordefiniert:

source: The *Default Domain Policy* object can be used to configure global policies for all users and computers within the same domain.
de: Das *Default Domain Policy* Objekt kann verwendet werden, um globale Richtlinien für alle Benutzer und Rechner der gesamten Domäne zu konfigurieren.

source: The *Default Domain Controllers Policy* object has no use in a Samba domain (in a Microsoft AD domain the policies for Microsoft domain controllers would be performed via this object). The configuration of the Samba domain controllers in UCS is largely performed via |UCSUCR|.
de: Das *Default Domain Controllers Policy* Objekt hat in einer Samba-Domäne keine Verwendung (in einer Microsoft AD-Domäne würden die Richtlinien für Microsoft-Domänencontroller über dieses Objekt erfolgen). Die Konfiguration der Samba-Domänencontroller erfolgt in UCS weitgehend über |UCSUCR|.

source: AD domains can be structured in sites. All the sites are listed in the main menu of *Global Policy Management*. There is also a list of the domains there. The current Samba versions do not support forest domains, so there is only ever one domain displayed here.
de: AD-Domänen können in Sites strukturiert werden. Dies kann z.B. verwendet werden um Standorte in einer Domäne zu gruppieren. Im Hauptmenü der Gruppenrichtlinienverwaltung werden alle Sites aufgeführt. Dort findet sich auch eine Liste von Domänen. Die aktuellen Samba-Versionen unterstützen keine Forest-Domänen, so dass hier immer nur eine Domäne angezeigt wird.

source: One domain can be structured in different organizational units (OUs). This can, for example, be used to store the employees from accounting and the users in the administration department in different LDAP positions.
de: Eine Domäne kann in verschiedene Organisationseinheiten (OUs) strukturiert werden. Dies kann z.B. verwendet werden, um die Mitarbeiter der Buchhaltung und die Benutzer der Verwaltung in unterschiedlichen LDAP-Positionen zu speichern.

source: Group policies can mutually overlap. In this case, the inheritance principle applies, e.g., the superordinate policies overwrite the subordinate ones. The applicable policies for a user can be displayed on the Windows client either with the modeling wizard in *Group Policy Management* or by entering the command :command:`gpresult /user USERNAME /v` in the Windows command line.
de: Gruppenrichtlinien können sich gegenseitig überlagern. Es gilt das Prinzip der Vererbung, d.h. höherliegende Richtlinien überschreiben die untergeordneten. Die effektiven Richtlinien für einen Benutzer können sowohl mit dem Modellierungsassistenten der *Gruppenrichtlinienverwaltung* als auch an der Windows-Kommandozeile mit dem Befehl :command:`gpresult /user BENUTZERNAME /v` auf dem Windows-Client angezeigt werden.

source: Evaluating the GPO for the user ``user01``
de: Auswertung der GPO für den Benutzer ``user01``

source: The policies are evaluated in the following order:
de: Die Richtlinien werden in folgender Reihenfolge ausgewertet:

source: By default *Default Domain Policy* settings apply for all the users and computers within the domain.
de: Richtlinien der *Default Domain Policy* gelten als Grundeinstellung für alle Benutzer und Rechner der gesamten Domäne.

source: Policies linked to an OU overwrite policies from the default domain policy. If the OUs are nested further, in the case of conflict, the "most subordinate" policies in each case, in other words the one most closely linked to the target object, apply. The following evaluation order applies:
de: Mit einer OU verknüpfte Richtlinien überschreiben Richtlinien aus der Default Domain Policy. Sind OUs weiter verschachtelt, greifen im Konfliktfall die jeweils "untersten" Richtlinien, d.h. die, die näher am Zielobjekt verknüpft sind. Es gilt folgende Auswertungsreihenfolge:

source: Assignment of a policy to an Active Directory site
de: Zuweisung einer Richtlinie zu einem Active Directory Standort

source: Settings of the default domain policy
de: Vorgaben der Default Domain Policy

source: Assignment of a policy to an organizational unit (OU) (in turn, each subordinate OU overrules policies from superordinate OUs).
de: Zuweisung einer Richtlinie zu einer Organisationseinheit / OU (jede unterliegende OU überstimmt wiederum Richtlinien aus übergeordneten OUs).

source: Example: A company blocks access to the :program:`Windows Task Manager` in general. This is done by enabling the :guilabel:`Remove Task Manager` policy in the *Default Domain Policy* object. However, the Task Manager should still be available to some staff with the requisite technical expertise. These users are saved in the *IT staff* OU. An additional group policy object is now created in which the :guilabel:`Remove Task Manager` policy is set to *disabled*. The new GPO is linked with the *IT staff* OU.
de: Ein Beispiel: Eine Firma verbietet allgemein den Zugriff auf den :program:`Windows Task Manager`. Dazu wird im *Default Domain Policy*-Objekt die Richtlinie :guilabel:`Zugriff auf Task Manager unterbinden` aktiviert. Für einige technisch versierte Benutzer soll der Task Manager dennoch verfügbar sein. Diese Benutzer sind in der OU *Technik* abgelegt. Nun wird ein zusätzliches Gruppenrichtlinienobjekt angelegt, in dem Richtlinie :guilabel:`Zugriff auf Task Manager unterbinden` auf *deaktiviert* gesetzt wird. Dieses neue GPO wird mit der OU *Technik* verbunden.

source: Configuration of group policies in environments with more than one Samba domain controller
de: Konfiguration von Gruppenrichtlinien in Umgebungen mit mehr als einem Samba-Domänencontroller

source: A group policy is technically composed of two parts: On the one hand there is a directory in the domain controllers' file system which contains the actual policy files which are to be implemented on the Window system (saved in the SYSVOL share (see :ref:`windows-sysvolshare`)). On the other hand there is an object with the same name in the LDAP tree of the Samba directory service (Samba AD/DS), which is usually saved below an LDAP container named *Group Policy Objects*.
de: Eine Gruppenrichtlinie besteht technisch aus zwei Teilen: Zum einen gibt es ein Verzeichnis im Dateisystem der Domänencontroller, das die eigentlichen Richtlinien-Dateien enthält, die auf dem Windows-System umgesetzt werden sollen (gespeichert in der SYSVOL-Freigabe (siehe :ref:`windows-sysvolshare`)). Zum anderen gibt es ein gleichnamiges Objekt im LDAP-Baum des Samba-Verzeichnisdienstes (Samba AD/DS), das üblicherweise unter einem LDAP-Container namens *Group Policy Objects* abgelegt ist.

source: Although the LDAP replication between the domain controllers is performed in just a few seconds, the files in the SYSVOL share are only replicated every five minutes in the default setting. It must be noted that the application of newly configured group policies in this period may fail if a client happens to consult a domain controller which has not yet replicated the current files.
de: Während die LDAP-Replikation zwischen Domänencontrollern innerhalb weniger Sekunden umgesetzt ist, werden die Dateien in der SYSVOL-Freigabe in der Grundeinstellung nur alle fünf Minuten repliziert. Es ist zu beachten, dass die Anwendung von neu konfigurierten Gruppenrichtlinien in diesem Zeitraum fehlschlagen kann, falls ein Client zufällig einen Domänencontroller konsultiert, der noch nicht die aktuellen Dateien zu sich repliziert hat.

source: Administrative templates (ADMX/ADM)
de: Administrative Vorlagen (ADMX/ADM)

source: The policies displayed in *Group Policy Management* can be expanded with so-called *administrative templates*. This type of template defines the name under which the policy should appear in Group Policy Management and which value should be set in the Windows registry. Administrative templates are saved in so-called *ADMX files* (previously *ADM files*), see :cite:t:`admx-reference`.
de: Die in der *Gruppenrichtlinienverwaltung* angezeigten Richtlinien können durch sogenannte *Administrative Vorlagen* erweitert werden. In einer solchen Vorlage wird definiert, unter welchem Namen die Richtlinie in der Gruppenrichtlinienverwaltung erscheinen soll und welcher Wert dadurch in der Windows-Registry gesetzt wird. Administrative Vorlagen werden in sogenannten *ADMX-Dateien* (früher *ADM-Dateien*) gespeichert, siehe :cite:t:`admx-reference`.

source: Among other things, ADMX files offer the advantage that they can be provided centrally across several domain controllers so that Group Policy Management on all Windows clients displays the same configuration possibilities, see :cite:t:`admx-central`.
de: ADMX-Dateien bieten unter anderem den Vorteil, dass sie zentral über mehrere Domänencontroller bereitgestellt werden können, damit die Gruppenrichtlinienverwaltung an allen Windows-Clients die gleichen Konfigurationsmöglichkeiten zeigt, siehe :cite:t:`admx-central`.

source: The following example of an ADM file defines a computer policy in which a registry key is configured for the (fictitious) Univention RDP client. ADM files can also be converted to the newer ADMX format using third-party tools. The administrative template must have the file suffix :file:`.adm`:
de: Das folgende Beispiel für eine ADM-Datei definiert eine Rechner-Richtlinie, in der ein Registry-Key des (fiktiven) Univention RDP-Client konfiguriert wird. ADM-Dateien können über Drittwerkzeuge in das neuere ADMX-Format umgewandelt werden. Die administrativen Vorlagen müssen die Dateiendung :file:`.adm` verwenden:

source: CLASS MACHINE CATEGORY "Univention" POLICY "RDP client" KEYNAME "Univention\RDP\StorageRedirect" EXPLAIN "If this option it activated, sound output is enabled in the RDP client" VALUENAME "Sound redirection" VALUEON "Activated" VALUEOFF "Deactivated" END POLICY END CATEGORY
de: CLASS MACHINE CATEGORY "Univention" POLICY "RDP-Client" KEYNAME "Univention\RDP\StorageRedirect" EXPLAIN "Ist diese Option aktiviert, wird Soundausgabe im RDP-Client aktiviert" VALUENAME "Sound-Weiterleitung" VALUEON "Aktiviert" VALUEOFF "Deaktiviert" END POLICY END CATEGORY

source: The activated administrative template
de: Die eingebundene administrative Vorlage

source: The ADM file can then be converted to the ADMX format or imported directly via Group Policy Management. This is done by following the context menu :menuselection:`Administrative templates --> Add/Remove Templates` option. :guilabel:`Add` can be used to import an ADM file. The administrative templates are also saved in the SYSVOL share and replicated, which allows Group Policy Management to access them from the Windows clients.
de: Die ADM-Datei kann anschließend in das ADMX-Format umgewandelt oder aber direkt über die Gruppenrichtlinienverwaltung importiert werden. Dazu wird im Kontextmenü :menuselection:`Administrativen Vorlagen --> Vorlagen hinzufügen --> entfernen` aufgerufen. Mit :guilabel:`Hinzufügen` kann dann eine ADM-Datei importiert werden. Die administrativen Vorlagen werden ebenfalls in der SYSVOL-Freigabe gespeichert und repliziert, wodurch die Gruppenrichtlinienverwaltung von den Windows-Clients aus auf sie zugreifen kann.

source: Application of policies based on computer properties (WMI filters)
de: Anwendung von Richtlinien auf Basis von Rechnereigenschaften (WMI-Filter)

source: It is also possible to configure policies based on system properties. These properties are provided via the Windows Management Instrumentation interface. The mechanism which builds on this is known as *WMI filtering*. This makes it possible, for example, to apply a policy only to PCs with a 64-bit processor architecture or with at least 8 GB of RAM. If a system property changes (e.g., if more memory is installed), the respective filter is automatically re-evaluated by the client.
de: Richtlinien können auch auf Basis von Systemeigenschaften konfiguriert werden. Diese Eigenschaften werden über die Windows Management Instrumentation-Schnittstelle (WMI) bereitgestellt. Der darauf aufbauende Mechanismus wird als *WMI-Filterung* bezeichnet. Damit ist es beispielsweise möglich, eine Richtlinie nur auf PCs mit einer 64 Bit-Prozessor-Architektur oder mit mindestens 8 GB RAM anzuwenden. Ändert sich eine Eigenschaft eines Systems (z.B. weil mehr Speicher eingebaut wurde), wird der jeweilige Filter automatisch vom Client neu ausgewertet.

source: The WMI filters are displayed in the domain structure in the *WMI Filters* container. :guilabel:`New` can be used to define an additional filter. The filter rules are defined under *Queries*. The rules are defined in a syntax similar to SQL. Examples rules can be found in :cite:t:`microsoft-wmi-filter` and :cite:t:`add-wmi-filters`.
de: Die WMI-Filter werden in der Domänenstruktur im Container *WMI-Filter* angezeigt. Mit :guilabel:`Neu` kann ein weiterer Filter definiert werden. Unter *Abfragen* werden die Filterregeln definiert. Die Regeln werden in einer SQL-ähnlichen Syntax definiert. Regel-Beispiele finden sich in :cite:t:`microsoft-wmi-filter` und :cite:t:`add-wmi-filters`.

source: Logon scripts / NETLOGON share
de: Anmeldeskripte / NETLOGON-Freigabe

source: The NETLOGON share serves the purpose of providing logon scripts in Windows domains. The logon scripts are executed following after the user login and allow the adaptation of the user's working environment. Scripts have to be saved in a format which can be executed by Windows, such as :file:`bat`.
de: Die NETLOGON-Freigabe dient der Bereitstellung von Anmeldeskripten in Windows-Domänen. Die Anmeldeskripte werden nach der erfolgreichen Anmeldung eines Benutzers ausgeführt und ermöglichen die Anpassung der Arbeitsumgebung des Benutzers. Die Skripte müssen in einem für Windows ausführbaren Format gespeichert werden, wie z.B. :file:`bat`.

source: The logon scripts are stored in :samp:`/var/lib/samba/sysvol/{Domainname}/scripts/` and provided under the share name *NETLOGON*. The filename of the script must be given relative to that directory.
de: Die Anmeldeskripte werden unter :samp:`/var/lib/samba/sysvol/{Domänenname}/scripts/` abgelegt und unter dem Freigabennamen *NETLOGON* bereitgestellt. Der Dateiname des Skripts muss relativ zu diesem Verzeichnis angegeben werden.

source: The NETLOGON share is replicated within the scope of the SYSVOL replication.
de: Die NETLOGON-Freigabe wird im Rahmen der SYSVOL-Replikation repliziert.

source: The logon script can be assigned for each user, see :ref:`users-management`.
de: Das Anmeldeskript kann pro Benutzer zugewiesen werden, siehe :ref:`users-management`.

source: Configuration of the file server for the home directory
de: Konfiguration des Servers, auf dem das Heimatverzeichnis abgelegt wird

source: The home directory can be defined user-specifically in the UMC module :guilabel:`Users`, see :ref:`users-management`. This is performed with the setting *`Windows home path*, e.g., :literal:`\\\\ucs-file-server\smith`.
de: Das Heimatverzeichnis wird benutzerbezogen im UMC-Modul :guilabel:`Benutzer` definiert, siehe :ref:`users-management`. Dies erfolgt mit der Einstellung *Windows-Heimatverzeichnis*, z.B. :file:`\\ucs-file-server\meier`.

source: The multi edit mode of UMC modules can be used to assign the home directory to multiple users at one time, see :ref:`central-user-interface-edit`.
de: Für das Zuweisen des Heimatverzeichnis-Servers an mehrere Benutzer auf einmal kann der Mehrfachbearbeitungsmodus von UMC-Modulen verwendet werden, siehe :ref:`central-user-interface-edit`.

source: Roaming profiles
de: Servergespeicherte Profile

source: Samba supports roaming profiles, i.e., user settings are saved on a central server. This directory is also used for storing the files which the user saves in the *My Documents* folder. Initially, these files are stored locally on the Windows computer and then synchronized onto the Samba server when the user logs off.
de: Samba unterstützt servergespeicherte Profile, d.h. Einstellungen der Benutzer werden auf einem Server gespeichert. In diesem Verzeichnis werden auch die Dateien gespeichert, die der Benutzer im Ordner *Eigene Dateien* speichert. Sie werden zwischenzeitlich lokal auf dem Windows-Rechner vorgehalten und erst bei der Abmeldung auf den Samba-Server synchronisiert.

source: No roaming profiles are used by default in Samba/AD.
de: In Samba-Domänen mit Active Directory-Support werden in der Voreinstellung keine serverseitigen Profile verwendet.

source: Roaming profiles can be configured via a group policy found under :menuselection:`Computer configuration --> Policies --> Administrative templates --> System --> User profiles --> Set roaming profile path for all users logging onto this computer`. If this is set to the UNC path :file:`%LOGONSERVER%\\%USERNAME%\\windows-profiles\\default` the profile data will get written to the directories :samp:`windows-profiles\\default.V{?}` in the home directory of the user located on the currently chosen logon server.
de: Das Profilverzeichnis kann über eine Gruppenrichtlinie konfiguriert werden, die unter :menuselection:`Computerkonfiguration --> Richtlinien --> Administrative Vorlagen --> System --> Benutzerprofile --> Pfad des servergespeicherten Profils für alle Benutzer festlegen` zu finden ist. Wenn hier z.B. der *UNC*-Pfad :file:`%LOGONSERVER%\\%USERNAME%\\windows-profiles\\default` eingetragen wird, dann werden die Verzeichnisse :samp:`windows-profiles\\default.V{?}` im Heimatverzeichnis des Benutzers auf dem jeweils gewählten Logonserver verwendet.

source: Alternatively the profile path can be defined for individual user accounts. This is possible in the UMC module :guilabel:`Users` under the *Account* tab by filling the field *Windows profile directory*. The corresponding UDM property is called ``profilepath``. In the OpenLDAP backend this is stored in the LDAP attribute ``sambaProfilePath``.
de: Alternativ kann das Profilverzeichnis individuell für einzelne Benutzerkonten definiert werden. Das ist im UMC-Modul :guilabel:`Benutzer` unter dem Reiter *Konto* des Benutzerkontos über das Feld *Profilverzeichnis* möglich. Der entsprechende UDM-Attributname heißt ``profilepath``. Mit OpenLDAP als Backend wird dies im LDAP-Attribut ``sambaProfilePath`` gespeichert.

source: If the profile path is changed, then a new profile directory will be created. The data in the old profile directory will be kept. These data can be manually copied or moved to the new profile directory. Finally, the old profile directory can be deleted.
de: Wird der Profilpfad geändert, wird ein neues Profilverzeichnis angelegt. Die Daten aus dem alten Profilverzeichnis bleiben dabei erhalten und können manuell in das neue Profilverzeichnis kopiert beziehungsweise verschoben werden. Abschließend kann das alte Profilverzeichnis gelöscht werden.
