Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/windows.po
Languages: de

source: In UCS all these services are provided by Samba.
de: Alle diese Dienste werden in UCS durch die Software Samba bereitgestellt.

source: UCS supports the mostly automatic migration of an existing Active Directory domain to UCS. All users, groups, computer objects and group policies are migrated without the need to rejoin the Windows clients. This is documented in :ref:`windows-ad-takeover`.
de: UCS unterstützt zusätzlich die weitgehend automatische Migration einer bestehenden Microsoft Active Directory Domäne zu UCS. Dabei werden alle Benutzer, Gruppen, Rechnerobjekte und Gruppenrichtlinien übernommen, ohne dass die Windows-Clients erneut der Domäne beitreten müssen. Dies ist in :ref:`windows-ad-takeover` beschrieben.

source: Microsoft Active Directory domain controllers cannot join the Samba domain. This functionality is planned at a later point in time.
de: Microsoft Active Directory-Domänencontroller können aktuell nicht einer UCS-Samba-Domäne beitreten. Diese Funktionalität ist zu einem späteren Zeitpunkt geplant.

source: Samba can not join an Active Directory Forest yet at this point.
de: Samba kann zum jetzigen Zeitpunkt noch nicht einem Active Directory Forest beitreten.

source: Incoming trust relationships with other Active Directory domains are configurable. In this setup the external Active Directory domain trusts authentication decisions of the UCS domain (Windows trusts UCS) so that UCS users can sign in to systems and Active Directory backed services in the Windows domain (see :ref:`windows-trust`). Outgoing trusts with Active Directory domain (UCS trusts Windows) are not supported currently.
de: Eingehende Vertrauensstellungen mit anderen Active Directory Domänen sind konfigurierbar. In dieser Konstellation vertraut die externe Active Directory Domäne den Authentifizierungsentscheidungen der UCS-Domäne (Windows vertraut UCS), so dass sich Benutzer auch an Systemen und Active Directory basierten Diensten in der Windows-Domäne anmelden können (siehe :ref:`windows-trust`). Ausgehende Vertrauensstellungen mit Active Directory Domänen (UCS vertraut Windows) sind aktuell nicht unterstützt.

source: Operation of a Samba domain based on Active Directory
de: Betrieb einer Samba-Domäne auf Basis von Active Directory

source: Samba as an AD domain controller can be installed on all UCS Directory Nodes from the Univention App Center with the application :program:`Active Directory-compatible domain controller`. Alternatively, the software package :program:`univention-samba4` can be installed. On the system roles |UCSPRIMARYDN| and |UCSBACKUPDN| the :program:`univention-s4-connector` package must also be installed and :command:`univention-run-join-scripts` command must be run after installation. Additional information can be found in :ref:`computers-softwaremanagement-install-software`.
de: Samba als AD-Domänencontroller kann auf allen UCS Directory Nodes mit der Applikation :program:`Active Directory-kompatibler Domänencontroller` aus dem Univention App Center installiert werden. Alternativ kann das Softwarepaket :program:`univention-samba4` installiert werden. Auf den Systemrollen |UCSPRIMARYDN| und |UCSBACKUPDN| muss zusätzlich :program:`univention-s4-connector` installiert werden. Anschließend muss der Befehl :command:`univention-run-join-scripts` aufgerufen werden. Weitere Informationen finden sich in :ref:`computers-softwaremanagement-install-software`.

source: A Samba member server can be installed on UCS Managed Nodes from the Univention App Center with the application :program:`Windows-compatible Fileserver`. Alternatively, the software package :program:`univention-samba` can be installed (:command:`univention-run-join-scripts` command must be run after installation). Additional information can be found in :ref:`computers-softwaremanagement-install-software`.
de: Ein Datei- und Druckserver kann auf UCS Managed Nodes mit der Applikation :program:`Windows-kompatibler Fileserver` aus dem Univention App Center installiert werden. Alternativ kann das Softwarepakete :program:`univention-samba` installiert werden. Anschließend muss der Befehl :command:`univention-run-join-scripts` aufgerufen werden. Weitere Informationen finden sich in :ref:`computers-softwaremanagement-install-software`.

source: Samba supports the operation as a *read-only domain controller*. The setup is documented in :cite:t:`ext-doc-win`.
de: Samba unterstützt auch den Betrieb als *read-only domain controller*. Die Einrichtung ist in :cite:t:`ext-doc-win` dokumentiert.

source: Services of a Samba domain
de: Dienste einer Samba-Domäne

source: Authentication services
de: Authentifizierungsdienst

source: User logins can only be performed on Microsoft Windows systems joined in the Samba domain. Domain joins are documented in :ref:`windows-domain-join`.
de: Benutzeranmeldungen können nur auf Microsoft Windows-Systemen erfolgen, die der Samba-Domäne beigetreten sind. Der Domänenbeitritt ist in :ref:`windows-domain-join` dokumentiert.

source: Users who login to a Windows system are supplied with a Kerberos ticket when they login. The ticket is then used for the further authentication. This ticket allows access to the domain's resources.
de: Benutzer, die sich an einem Windows-System anmelden, erhalten bei der Anmeldung ein Kerberos-Ticket, mit dem die weitere Authentifizierung durchgeführt wird. Mit diesem Ticket wird dann auf die Ressourcen der Domäne zugegriffen.

source: Common sources of error in failed logins are:
de: Häufige Fehlerquellen bei fehlschlagenden Anmeldungen sind:

source: Synchronization of the system times between the Windows client and domain controller is essential for functioning Kerberos authentication. By default the system time is updated via NTP during system startup. This can also be done manually using the command :command:`w32tm /resync` on the Windows client.
de: Für eine funktionierende Kerberos-Authentifizierung ist eine Synchronisation der Systemzeiten zwischen Windows-Client und Domänencontroller zwingend erforderlich. In der Grundeinstellung wird beim Systemstart die Systemzeit über NTP aktualisiert. Dies kann mit dem Befehl :command:`w32tm /resync` auch manuell erfolgen.

source: DNS service records need to be resolved during login. For this reason, the Windows client should use the domain controller's IP address as its DNS name server.
de: Während der Anmeldung müssen DNS-Service-Records aufgelöst werden. Der Windows-Client sollte daher als DNS-Nameserver die IP-Adresse des Domänencontrollers verwenden.

source: A file server provides files over the network and allows concentrating the storage of user data on a central server.
de: Ein Dateiserver stellt zentral benötigte Dateien über das Netz bereit und ermöglicht es unter anderem Benutzerdaten auf einem zentralen Server zu bündeln.

source: The file services integrated in UCS support the provision of shares using the CIFS protocol (see :ref:`shares-general`). Insofar as the underlying file system supports Access Control Lists (ACLs) (can be used with ``ext4`` and ``XFS``), the ACLs can also be used by Windows clients.
de: Die in UCS integrierten Dateidienste unterstützen eine Bereitstellung von Freigaben auf Basis von ``CIFS``/``SMB`` (siehe :ref:`shares-general`). Sofern das unterliegende Dateisystem Access Control Lists (ACLs) unterstützt (verwendbar bei ``ext4`` und ``XFS``) sind ACLs auch von Windows-Clients verwendbar.

source: Samba Active Directory domain controllers, i.e. UCS Directory Nodes, can also provide file services. As a general rule, it is recommended to separate domain controllers and file/print services in Samba environments - following the Microsoft recommendations for Active Directory - that means using UCS Directory Nodes for logins/authentication and UCS Managed Nodes for file/print services. This ensures that a high system load on a file server does not result in disruptions to the authentication service. For smaller environments in which it is not possible to run two servers, file and print services can also be run on a UCS Directory Node.
de: Dateidienste können auch von Samba Active Directory-Domänencontrollern, d.h. auf UCS Directory Nodes bereitgestellt werden. Generell wird in Samba-Umgebungen - analog zu den Microsoft-Empfehlungen für Active Directory - empfohlen Domänencontroller- und Datei/Druckdienste zu trennen, d.h. UCS Directory Nodes für die Anmeldung und Managed Nodes für Datei-/Druckdienste zu verwenden. Dies stellt sicher, dass hohe Last auf einem Fileserver nicht zu Störungen im Anmeldedienst führen. Für kleine Umgebungen, in denen keine Möglichkeit für den Betrieb zweier Server gegeben ist, können Datei- und Druckdienste auch mit auf einem Domänencontroller betrieben werden.

source: Samba supports the *CIFS* protocol and the successor *SMB2* to provide file services. Using a client which supports *SMB2* (as of :program:`Windows Vista`, i.e., :program:`Windows 7/8` too) improves the performance and scalability.
de: Samba unterstützt das ``CIFS``-Protokoll und den Nachfolger ``SMB2``. Verwendet man einen Client, der ``SMB2`` unterstützt (ab :program:`Windows Vista`, also auch :program:`Windows 7/8`), verbessert sich die Performance und die Skalierbarkeit.

source: The protocol can be configured using the |UCSUCR| variable :envvar:`samba/max/protocol`. It must be set on all Samba servers and then all Samba server(s) restarted.
de: Das Protokoll kann über die |UCSUCR|-Variable :envvar:`samba/max/protocol` konfiguriert werden. Sie muss auf allen Samba-Servern gesetzt und anschließend der/die Samba-Server neu gestartet werden.

source: ``NT1`` configures *CIFS* (supported by all Windows versions)
de: ``NT1`` konfiguriert *CIFS* (unterstützt von allen Windows-Versionen)

source: ``SMB2`` *SMB2* (supported as of :program:`Windows Vista` / :program:`Windows 7`)
de: ``SMB2`` konfiguriert *SMB2* (unterstützt ab :program:`Windows Vista`/:program:`Windows 7`)

source: ``SMB3`` configures *SMB3* (supported as of :program:`Windows 8`)
de: ``SMB3`` konfiguriert *SMB3* (unterstützt ab :program:`Windows 8`)

source: Samba offers the possibility of sharing printers set up under Linux as network printers for Windows clients. The management of the printer shares and the provision of the printer drivers is described in :ref:`print-general`.
de: Samba bietet die Möglichkeit, unter Linux eingerichtete Drucker als Netzwerkdrucker für Windows-Clients freizugeben. Die Verwaltung der Druckerfreigaben und die Integration der Druckertreiber ist in :ref:`print-general` beschrieben.

source: Samba AD domain controllers can also provide print services. In this case, the restrictions described in :ref:`windows-samba4-fileservices` must be taken into consideration.
de: Druckdienste können auch mit Samba AD-Domänencontrollern bereitgestellt werden. Hierbei sind die in :ref:`windows-samba4-fileservices` beschriebenen Einschränkungen zu beachten.

source: When using Samba as an Active Directory domain controller, Samba provides a separate LDAP directory service. The synchronization between the UCS LDAP and the Samba LDAP occurs via an internal system service, the *Univention S4 connector*. The connector is enabled on the |UCSPRIMARYDN| by default and typically requires no further configuration.
de: Samba stellt einen separaten LDAP-Verzeichnisdienst bereit. Die Synchronisation zwischen dem UCS-LDAP und dem Samba-LDAP erfolgt durch einen internen Systemdienst, den *Univention S4 Connector*. Der Connector ist standardmäßig auf dem |UCSPRIMARYDN| aktiviert und benötigt normalerweise keine weitere Konfiguration.

source: Further information on the status of the synchronization can be found in the log file :file:`/var/log/univention/connector-s4.log`. Additional information on analyzing connector replication problems can be found in :uv:kb:`Samba 4 Troubleshooting <32>`.
de: Hinweise zum Status der Synchronisation finden sich in der Logdatei :file:`/var/log/univention/connector-s4.log`. Weitere Informationen zur Fehleranalyse von eventuellen Connectorproblemen finden sich in :uv:kb:`Samba 4 Troubleshooting <32>`.

source: The :command:`univention-s4search` command can be used to search in the Samba directory service. If it is run as the ``root`` user, the required credentials of the machine account are used automatically:
de: Mit dem Befehl :command:`univention-s4search` kann im Samba-Verzeichnisdienst gesucht werden. Wird es als Benutzer ``root`` aufgerufen, werden automatisch die nötigen Credentials des Maschinenkontos verwendet:

source: Replication of directory data
de: DRS-Replikation der Verzeichnisdaten

source: Samba/AD domains use the Directory Replication System (DRS) to replicate the directory data. DRS allows multi-master replication, i.e., the write changes from multiple domain controllers are synchronized at protocol level. Consequently, the use of snapshots in virtualization solutions should be avoided when using Samba/AD and Samba/AD should be operated on a server which is never switched off.
de: Samba/AD-Domänen verwenden das Directory Replication System (DRS) zur Replikation der Verzeichnisdaten. DRS erlaubt Multimasterreplikation, d.h. die schreibenden Änderungen mehrerer Samba/AD-Domänencontroller werden auf Protokollebene synchronisiert. Die Verwendung von Snapshots in Virtualisierungslösungen sollte daher beim Einsatz von Samba/AD vermieden und Samba/AD auf einem Server betrieben werden, der durchgehend eingeschaltet bleibt.

source: The complexity of the multi-master replication increases with each additional Samba/AD domain controller. Consequently, it must be checked whether additional Samba/AD domain controllers provided by UCS Directory Nodes are necessary or if a UCS Managed Node would not be a better choice for new servers.
de: Mit jedem weiteren Samba/AD-Domänencontroller steigt die Komplexität der Multimasterreplikation. Es sollte daher geprüft werden, ob weitere Samba/AD-Domänencontroller auf Basis von UCS Directory Nodes nötig sind oder für neue Server nicht ein UCS Managed Node die bessere Wahl ist.

source: Additional information on troubleshooting replication problems can be found in :uv:kb:`Samba 4 Troubleshooting <32>`.
de: Hinweise zur Analyse von DRS-Replikationsproblemen finden sich in :uv:kb:`Samba 4 Troubleshooting <32>`.

source: Synchronization of the SYSVOL share
de: Synchronisation der SYSVOL-Freigabe

source: The SYSVOL share is a share which provides group policies and logon scripts in Active Directory/Samba. It is synchronized among all domain controllers and stored in the :file:`/var/lib/samba/sysvol/` directory.
de: Die SYSVOL-Freigabe ist eine Freigabe, die in Active Directory/Samba Gruppenrichtlinien und Anmeldeskripte bereitstellt. Sie wird zwischen allen Domänencontrollern synchronisiert und im Verzeichnis :file:`/var/lib/samba/sysvol/` gespeichert.

source: In Microsoft Active Directory, the SYSVOL share is synchronized by the File Replication Service (introduced with :program:`Windows 2000`) or the Distributed File System (as of :program:`Windows 2008 R2`). These replication methods are not yet fully implemented in Samba/AD. The synchronization between the Samba/AD domain controllers is performed in UCS via a Cron job (every five minutes as standard - can be configured using the |UCSUCRV| :envvar:`samba4/sysvol/sync/cron`).
de: In Microsoft Active Directory wird die SYSVOL-Freigabe durch den File Replication Service (eingeführt mit Windows 2000) oder durch das Distributed File System (ab Windows 2008 R2) synchronisiert. Diese Replikationsmethoden sind in Samba noch nicht vollständig implementiert. Die Synchronisation zwischen den Samba/AD-Domänencontrollern erfolgt in UCS durch einen Cron-Job (standardmäßig alle fünf Minuten, konfigurierbar durch die |UCSUCRV| :envvar:`samba4/sysvol/sync/cron`).

source: Configuration and management of Windows desktops
de: Konfiguration und Management von Windows-Desktops

source: Group policies
de: Gruppenrichtlinien

source: Group policies are an Active Directory feature which allows the central configuration of settings for computers and users. Group policies are also supported by Samba/AD domains. The policies only apply to Windows clients; Linux or Mac OS systems cannot evaluate the policies.
de: Gruppenrichtlinien sind eine Active Directory-Funktion, die die zentrale Konfiguration von Vorgaben für Rechner und Benutzer erlaubt. Gruppenrichtlinien werden auch von Samba/AD-Domänen unterstützt. Die Richtlinien greifen nur auf Windows-Clients; Linux- oder Mac OS-Systeme werten die Richtlinien nicht aus.

source: Group policies are often referred to as GPOs (*group policy objects*). Put more precisely, a GPO can contain a series of policies. Despite their name, group policy objects cannot be assigned directly to certain user groups, but instead are linked with certain AD administration units (domains, sites or organizational units) in the Samba directory service (Samba AD/DS) and thus refer to subordinate objects. A group-specific or user-specific evaluation is only indirectly possible via the *Security Filtering* of a group policy object, in which the *Apply group policy Allow/Deny* privilege can be directly restricted to certain groups, users or computers.
de: Gruppenrichtlinien werden ausgehend von der englischen Bezeichnung *Group policy objects* auch oft als GPOs bezeichnet. Genauer gesagt kann ein Gruppenrichtlinienobjekt eine Reihe von Richtlinien beinhalten. Trotz ihres Namens lassen sich Gruppenrichtlinienobjekte nicht direkt bestimmten Benutzergruppen zuweisen, sondern sie werden vielmehr mit bestimmten AD-Verwaltungseinheiten (Domänen, Sites oder Organisationseinheiten) im Samba-Verzeichnisdienst (Samba AD/DS) verknüpft und beziehen sich dadurch auf untergeordnete Objekte. Eine gruppen- oder benutzerspezifische Auswertung ist nur indirekt über die *Sicherheitseinstellungen* eines Gruppenrichtlinienobjekts möglich, in denen sich das Recht *Gruppenrichtlinie übernehmen* gezielt auf bestimmte Gruppen, Benutzer oder Computer einschränken lässt.

source: As a basic rule, a distinction must be made between *group policies* (GPOs) and the similarly named *group policy preferences (GPPs)*:
de: Grundsätzlich sind die *Gruppenrichtlinien* (*Group Policies* (GPO)) von den sehr ähnlich benannten *Gruppenrichtlinieneinstellungen* (*Group Policy Preferences* (GPP)) zu unterscheiden:

source: The settings made via *GPOs* are binding, whereas *GPPs* are merely used to enter preferences in the registry of Windows clients, which can still be overwritten on the client in certain circumstances.
de: Die über *Gruppenrichtlinien* (GPOs) getroffenen Vorgaben sind bindend, während sich über *Gruppenrichtlinieneinstellungen* (GPPs) nur Präferenzen in die Registry von Windows-Clients eintragen lassen, die aber unter Umständen am Client überschrieben werden können.

source: The settings made via *GPOs* are also dynamically applied to the target objects, whereas, in contrast, the settings made via *GPPs* are entered statically in the registry of Windows clients (this is also referred to as *tattooing*).
de: Die über *Gruppenrichtlinien* (GPOs) getroffenen Vorgaben werden zudem dynamisch auf die Zielobjekte angewendet, wo hingegen die über *Gruppenrichtlinieneinstellungen* (GPPs) getroffenen Einstellungen statisch in die Registry von Windows-Clients eintragen werden (man spricht hier auch von *Tattooing*).

source: For these reasons, *GPOs* are preferable to *GPPs* in the majority of cases. This remainder of this section deals exclusively with *GPOs*.
de: Aus diesen Gründen sind *Gruppenrichtlinien* (GPOs) in den meisten Fällen den *Gruppenrichtlinieneinstellungen* (GPPs) vorzuziehen. Dieses Kapitel bezieht sich im weiteren ausschließlich auf *Gruppenrichtlinien* (GPOs).

source: In contrast to UCS policies (see :ref:`central-policies`), group policies are not configured via UMC modules, but instead are configured in a separate editor, the *Group Policy Management* editor, which is a component of the *Remote Server Administration Tools (RSAT)*. The installation is described in :ref:`gpo-install`.
de: Gruppenrichtlinien werden im Gegensatz zu den UCS-Richtlinien (siehe :ref:`central-policies`) nicht über UMC-Module, sondern mit einem separaten Editor konfiguriert, mit der *Gruppenrichtlinienverwaltung*, die Teil der *Remote Server Administration Tools* (RSAT) ist. Die Einrichtung ist in :ref:`gpo-install` dokumentiert.

source: There are two types of policies:
de: Es existieren zwei Arten von Richtlinien:

source: User policies
de: Benutzerrichtlinien

source: *User policies* configure a user's settings, e.g., the configuration of the desktop. It is also possible to configure applications via group policies (e.g., the start page of a browser or settings in LibreOffice).
de: *Benutzerrichtlinien* konfigurieren die Einstellungen eines Benutzers, z.B. die Vorkonfiguration des Desktops. Auch Anwendungen können über Gruppenrichtlinien konfiguriert werden (z.B. die Startseite des Browsers oder Einstellungen in LibreOffice).

source: Computer policies
de: Computer-Richtlinien

source: *Computer policies* define a Windows client's settings.
de: *Computer-Richtlinien* definieren die Einstellungen von Windows-Clients.

source: Computer policies are evaluated for the first time the computer starts up; user policies during login. The policies are also continually evaluated for logged in users / running systems and updated (every 90-120 minutes by default. The period varies at random to avoid peak loads.)
de: Computerrichtlinien werden erstmals beim Systemstart ausgewertet, Benutzerrichtlinien bei der Anmeldung. Die Richtlinien werden auch für angemeldete Benutzer/laufende Systeme fortlaufend ausgewertet und aktualisiert (in der Grundeinstellung alle 90-120 Minuten, der Zeitraum wird zur Vermeidung von Lastspitzen nach dem Zufallsprinzip variiert).

source: The command :command:`gpupdate /force` can also be run specifically to start the evaluation of group policies.
de: Die Auswertung der Gruppenrichtlinien kann durch Aufruf des Befehls :command:`gpupdate /force` auch gezielt gestartet werden.

source: Some policies - e.g., for the installation of software or for login scripts - are only evaluated during login (user policies) or system startup (computer policies).
de: Einige Richtlinien - z.B. zur Installation von Software oder für Anmeldeskripte - werden nur bei der Anmeldung (Benutzerrichtlinien) oder beim Systemstart (Rechnerrichtlinien) ausgewertet.

source: The majority of group policies only set one value in the Windows registry, which is then evaluated by Windows or an application. As standard users cannot modify any settings in the corresponding section of the Windows registry, it is also possible to configure restricted user desktops in which, for example, users cannot open the Windows Task Manager.
de: Die meisten Gruppenrichtlinien setzen nur einen Wert in der Windows-Registry, der dann von Windows oder einer Applikation ausgewertet wird. Da Standardbenutzer keine Einstellungen in dem entsprechenden Teil der Windows Registry editieren können, können so auch eingeschränkte Benutzer-Desktops konfiguriert werden, in denen z.B. Benutzer den Windows Task Manager nicht aufrufen dürfen.

source: The group policies are stored in the SYSVOL share, see :ref:`windows-sysvolshare`. They are linked with user and host accounts in the Samba directory service.
de: Die Gruppenrichtlinien werden in der SYSVOL-Freigabe gespeichert, siehe :ref:`windows-sysvolshare`. Sie werden mit Benutzer- und Rechnerkonten im Samba-Verzeichnisdienst verknüpft.

source: Installation of Group Policy Management
de: Installation der Gruppenrichtlinienverwaltung
