Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/windows.po
Languages: de

source: Alternatively, you can use this script to delete an AD connection instance. The script then internally removes the files for the instance and resets the UCR variables.
de: Alternativ können Sie dieses Skript auch verwenden, um eine AD-Verbindungsinstanz zu löschen. Das Skript löscht dann intern die Dateien für die Instanz und setzt die UCR-Variablen zurück.

source: You can use this script to rename users and groups with well-known SIDs in UDM. The AD Connection uses it to rename users and groups with well-known SIDs.
de: Sie können dieses Skript verwenden, um Benutzer und Gruppen mit bekannten SIDs in UDM umzubenennen. Die :program:`AD Connection` verwendet es, um Benutzer und Gruppen mit bekannten SIDs umzubenennen.

source: You can use this script to grant list and read access to ``CN=Deleted Objects`` in Active Directory.
de: Sie können dieses Skript verwenden, um Zugriff zum Auflisten und Lesen auf ``CN=Deleted Objects`` in Active Directory zu gewähren.

source: Log files
de: Logdateien

source: For troubleshooting when experiencing synchronization problems, corresponding messages can be found in the following files on the UCS system:
de: Zur Fehlersuche bei Synchronisationsproblemen finden sich entsprechende Meldungen in folgenden Dateien auf dem UCS-System:

source: Selective synchronization
de: Selektive Synchronisation

source: You can configure the :program:`Active Directory Connection` to synchronize only a specific selection of source objects. You can select the source objects according to the following criteria, described in detail in the following sections:
de: Sie können die :program:`Active Directory Connection` so konfigurieren, dass nur eine bestimmte Auswahl von Quellobjekten synchronisiert wird. Sie können die Quellobjekte nach Kriterien auswählen, die in den folgenden Abschnitten ausführlich beschrieben werden:

source: Selecting objects by location in the LDAP subtree
de: Auswahl von Objekten nach Standort im LDAP-Teilbaum

source: Selecting objects by matching an LDAP filter
de: Auswahl von Objekten durch Übereinstimmung mit einem LDAP-Filter

source: Selecting all items except by location in the LDAP subtree
de: Auswahl aller Elemente außer nach Standort im LDAP-Teilbaum

source: Selecting all items except by matching an LDAP filter
de: Auswahl aller Elemente außer durch Übereinstimmung mit einem LDAP-Filter

source: Allow only specific LDAP subtrees
de: Nur bestimmte LDAP-Teilbäume zulassen

source: To configure the connector to synchronize only specific subtrees of the LDAP structure you can use the following UCR variables:
de: Um den Connector so zu konfigurieren, dass er nur bestimmte Teilbäume der LDAP-Struktur synchronisiert, können Sie die folgenden UCR-Variablen verwenden:

source: For synchronization from UCS LDAP directory to Active Directory
de: Für die Synchronisation von UCS LDAP-Verzeichnis zu Active Directory

source: Use this |UCSUCRV| to define a DN from your UCS LDAP directory for the synchronization to the connected Active Directory. Then the *AD Connection* only considers UCS LDAP objects for synchronization that locate in subtrees specified by one of these UCR variables. You must include the LDAP base in the DNs and the comparison of the DNs is case-insensitive.
de: Verwenden Sie diese |UCSUCRV|, um einen DN aus Ihrem UCS LDAP-Verzeichnis für die Synchronisation mit dem angeschlossenen Active Directory zu definieren. Die *AD-Verbindung* berücksichtigt dann nur UCS LDAP-Objekte für die Synchronisation, die sich in Teilbäumen befinden, die durch eine dieser UCR-Variablen spezifiziert sind. Die LDAP-Basis muss in den DNs enthalten sein und der Vergleich der DNs ist unabhängig von der Groß- und Kleinschreibung.

source: See the explanation of the ``.*`` placeholder below.
de: Siehe die Erklärung des Platzhalters ``.*`` weiter unten.

source: For example:
de: Zum Beispiel:

source: For synchronization from Active Directory to UCS LDAP directory
de: Für die Synchronisation von Active Directory zum UCS Verzeichnisdienst

source: Use this |UCSUCRV| to define a DN from your Active Directory for the synchronization to your UCS LDAP directory. Then the *AD Connection* only considers Active Directory objects for synchronization that locate in subtrees specified by one of these UCR variables. You must include the LDAP base in the DNs and the comparison of the DNs is case-insensitive.
de: Verwenden Sie diese |UCSUCRV|, um einen DN aus Ihrem Active Directory für die Synchronisation mit Ihrem UCS LDAP-Verzeichnis zu definieren. Die *AD-Verbindung* berücksichtigt dann nur Active Directory Objekte für die Synchronisation, die sich in Teilbäumen befinden, die durch eine dieser UCR-Variablen festgelegt sind. Die LDAP-Basis muss in den DNs enthalten sein, und beim Vergleich der DNs wird nicht zwischen Groß- und Kleinschreibung unterschieden.

source: Placeholder ``.*``
de: Platzhalter ``.*``

source: The ``.*`` part of the variable is a placeholder that you can use as an individual label for each variable. If you follow this approach, you create a series of UCR variables of the types described. Each variable contains only one DN.
de: Der Teil ``.*`` der Variable ist ein Platzhalter, den Sie als individuelle Bezeichnung für jede Variable verwenden können. Wenn Sie diesen Ansatz verfolgen, können Sie eine Reihe von UCR-Variablen der beschriebenen Typen erstellen. Jede Variable enthält nur einen DN.

source: For each LDAP subtree that you want to allow for synchronization, you have to configure a separate |UCSUCRV|.
de: Für jeden LDAP-Teilbaum, den Sie für die Synchronisierung zulassen möchten, müssen Sie eine separate |UCSUCRV| konfigurieren.

source: After you have defined or changed the UCR variables, you must restart the :program:`Active Directory Connection`.
de: Nachdem Sie die UCR-Variablen definiert oder geändert haben, müssen Sie die :program:`Active Directory Verbindung` neu starten.

source: The :program:`Active Directory Connection` determines the position of the target object by dynamic and static factors such as the mapping property attributes ``dn_mapping_function`` and ``position_mapping``, if they're configured in the mapping for individual object types. The position of the corresponding target object can therefore be outside the subtrees corresponding to the |UCSUCRV|.
de: Die :program:`Active Directory Verbindung` bestimmt die Position des Zielobjekts durch dynamische und statische Faktoren wie die Mapping Attribute ``dn_mapping_function`` und ``position_mapping``, sofern sie im Mapping für einzelne Objekttypen konfiguriert sind. Die Position des entsprechenden Zielobjekts kann also außerhalb der Teilbäume liegen, die den |UCSUCRV|\ n entsprechen.

source: If you use of the ``…/allowsubtree/.*/[ad|ucs]`` configuration and move a source object from inside a considered subtree to a position that's outside of the combined scope of all of your ``…/allowsubtree/.*/[ad|ucs]`` definitions, then the :program:`AD Connection` removes the object from the target directory.
de: Wenn Sie die Konfiguration ``…/allowsubtree/.*/[ad|ucs]`` verwenden und ein Quellobjekt aus einem betrachteten Teilbaum an eine Position verschieben, die außerhalb des kombinierten Geltungsbereichs aller Ihrer ``…/allowsubtree/.*/[ad|ucs]`` Definitionen liegt, dann entfernt die :program:`Active Directory Verbindung` das Objekt aus dem Zielverzeichnis.

source: Allow only objects that match an LDAP filter
de: Nur Objekte zulassen, die einem LDAP-Filter entsprechen

source: You can configure an LDAP filter for each type of object. :program:`Active Directory Connection` synchronizes only LDAP objects that match that filter. It ignores all other LDAP objects.
de: Sie können für jede Art von Objekt einen LDAP-Filter konfigurieren. :program:`Active Directory Verbindung` synchronisiert nur LDAP-Objekte, die diesem Filter entsprechen. Alle anderen LDAP-Objekte werden ignoriert.

source: For bi-directional synchronization, the filter must match both, the UCS object and the AD object. If an object matching the filter is deleted, the connector also deletes the corresponding object on the other side.
de: Für die bidirektionale Synchronisierung muss der Filter sowohl mit dem UCS Objekt als auch mit dem AD-Objekt übereinstimmen. Wird ein Objekt, das mit dem Filter übereinstimmt, gelöscht, löscht der Connector auch das entsprechende Objekt auf der anderen Seite.

source: The connector only synchronizes those objects with ``{type}`` object type that match this LDAP filter. ``{type}`` can be one of the following values:
de: Der Connector synchronisiert nur die Objekte mit dem Objekttyp ``{type}``, die diesem LDAP-Filter entsprechen. ``{type}`` kann einer der folgenden Werte sein:

source: After changing these settings you must restart the :program:`Active Directory Connection`.
de: Nach dem Ändern dieser Einstellungen müssen Sie die :program:`Active Directory Verbindung` neu starten.

source: However, this filter doesn't support the full LDAP filter syntax. It's always case-sensitive. You can only use the placeholder ``*`` as a single value without any other characters.
de: Dieser Filter unterstützt jedoch nicht die vollständige LDAP-Filtersyntax. Es wird immer zwischen Groß- und Kleinschreibung unterschieden. Sie können nur den Platzhalter ``*`` als Einzelwert ohne andere Zeichen verwenden.

source: If an object that matches the filter is changed so that the filter no longer matches, the connector **doesn't** synchronize the change. This means that the connector still applies changes from the other side to the object.
de: Wenn ein Objekt, das mit dem Filter übereinstimmt, so geändert wird, dass der Filter nicht mehr passt, **synchronisiert** der Connector keine Änderung. Das bedeutet, dass der Connector weiterhin Änderungen von der anderen Seite auf das Objekt anwendet.

source: If you want to turn off the synchronization for an object, you must make the change on both sides, UCS and Active Directory.
de: Wenn Sie die Synchronisierung für ein Objekt ausschalten wollen, müssen Sie die Änderung auf beiden Seiten, UCS und Active Directory, vornehmen.

source: Ignore objects from specific LDAP subtrees
de: Ignorieren von Objekten aus bestimmten LDAP-Teilbäumen

source: To configure the connector to ignore objects from certain LDAP subtrees you can use the following |UCSUCRV|:
de: Um den Connector so zu konfigurieren, dass er Objekte aus bestimmten LDAP-Teilbäumen ignoriert, können Sie die folgende |UCSUCRV| verwenden:

source: The variable defines the locations in the directory service that the connector excludes from the synchronization. The values can contain positions in Active Directory and in the UCS LDAP directory. By default, the variable isn't set.
de: Die Variable definiert die Stellen im Verzeichnisdienst, die der Connector von der Synchronisation ausschließt. Die Werte können Positionen in Active Directory und im UCS LDAP-Verzeichnis enthalten. Standardmäßig ist die Variable nicht gesetzt.

source: After changing this setting you must restart the :program:`Active Directory Connection`.
de: Nach der Änderung dieser Einstellung müssen Sie die :program:`Active Directory Verbindung` neu starten.

source: Ignore objects by LDAP filter
de: Objekte durch LDAP-Filter ignorieren

source: To exclude objects from the synchronization, you can add their names to the following |UCSUCRV|:
de: Um Objekte von der Synchronisierung auszuschließen, können Sie ihre Namen zu den folgenden |UCSUCRV| hinzufügen:

source: The connector **doesn't** synchronize the objects that this variable defines as values. Separate multiple values by commas. For the possible values for ``{type}``, see :numref:`ad-connector-allow-and-ignore-rules-type-value-mapping-tab`. The table also shows which LDAP attributes you need to consider in the filter depending on the object type.
de: Der Connector synchronisiert **keine** Objekte, die diese Variable als Werte definiert. Trennen Sie mehrere Werte durch Kommas. Für die möglichen Werte für ``{type}``, siehe :numref:`ad-connector-allow-and-ignore-rules-type-value-mapping-tab`. Die Tabelle zeigt auch, welche LDAP-Attribute Sie je nach Objekttyp im Filter berücksichtigen müssen.

source: Mapping for which ``{type}`` needs which LDAP attribute
de: Zuordnung, welcher ``{type}`` welches LDAP-Attribut benötigt

source: Value from LDAP attribute
de: Wert aus LDAP-Attribut

source: For example, the ``user`` type considers the LDAP attribute ``uid``:
de: Der Typ ``user`` berücksichtigt zum Beispiel das LDAP-Attribut ``uid``:

source: Some of the ``ignorelist`` settings have defaults that are important for the functionality of the connector. Make sure that you don't overwrite these settings. You can verify the current value of a |UCSUCRV| with the following command:
de: Einige der ``ignorelist``-Einstellungen haben Voreinstellungen, die für die Funktionalität des Connector wichtig sind. Achten Sie darauf, dass Sie diese Einstellungen nicht überschreiben. Sie können den aktuellen Wert einer |UCSUCRV| mit dem folgenden Befehl überprüfen:

source: For more flexibility you can also set an LDAP filter to ignore objects. Use the following |UCSUCRV|:
de: Für mehr Flexibilität können Sie auch einen LDAP-Filter setzen, um Objekte zu ignorieren. Verwenden Sie die folgende |UCSUCRV|:

source: The connector **doesn't** synchronize the objects that match this LDAP filter. ``{type}`` can be have one of the following values:
de: Der Connector synchronisiert **keine** Objekte, die diesem LDAP-Filter entsprechen. ``{type}`` kann einen der folgenden Werte haben:

source: After changing these settings, you must restart the :program:`Active Directory Connection`.
de: Nach dem Ändern dieser Einstellungen müssen Sie die :program:`Active Directory Verbindung` neu starten.

source: Priority of allow and ignore rules
de: Vorrang der Regeln

source: This section describes the processing order for the previously documented settings for selective synchronization.
de: In diesem Abschnitt wird die Verarbeitungsreihenfolge für die bisher dokumentierten Einstellungen zur selektiven Synchronisation beschrieben.

source: The :program:`Active Directory Connection` processes the allow and ignore rules in a defined order. Depending on the evaluation result, the connector behaves as follows:
de: Die :program:`Active Directory Verbindung` verarbeitet die Regeln für Erlauben und Ignorieren in einer definierten Reihenfolge. Abhängig vom Ergebnis der Auswertung verhält sich der Connector wie folgt:

source: If a rule results in the connector ignoring an object, the connector stops processing the rule and doesn't synchronize the object.
de: Wenn eine Regel dazu führt, dass der Connector ein Objekt ignoriert, stoppt der Connector die Verarbeitung der Regel und synchronisiert kein Objekt.

source: If a rule results in the connector not ignoring an object, the connector evaluates the next rule. If the rule was the last rule and there's no next rule, the connector synchronizes the object.
de: Wenn eine Regel dazu führt, dass der Connector ein Objekt verarbeitet, wertet der Connector die nächste Regel aus. Wenn die Regel die letzte Regel war und es keine nächste Regel gibt, synchronisiert der Connector das Objekt.

source: The connector evaluates the rules for each object in the following order:
de: Der Connector wertet die Regeln für jedes Objekt in der folgenden Reihenfolge aus:

source: **Allow subtree**:
de: **Teilbaum zulassen**:

source: UCR variables
de: UCR Variablen

source: :envvar:`connector/ad/mapping/allowsubtree/.*/ucs` and :envvar:`connector/ad/mapping/allowsubtree/.*/ad`
de: :envvar:`connector/ad/mapping/allowsubtree/.*/ucs` und :envvar:`connector/ad/mapping/allowsubtree/.*/ad`

source: No match
de: Keine Übereinstimmung

source: No synchronization. Stop.
de: Keine Synchronisation. Abarbeitung der Regeln beenden.

source: Match
de: Übereinstimmung

source: Continue.
de: Fortsetzen.

source: **Allow filter**:
de: **Filter zulassen**:

source: **Ignore subtree**:
de: **Unterbaum ignorieren**:

source: **Ignore filter**:
de: **Filter ignorieren**:

source: :envvar:`connector/ad/mapping/{type}/ignorelist` and :envvar:`connector/ad/mapping/{type}/ignorefilter`
de: :envvar:`connector/ad/mapping/{type}/ignorelist` und :envvar:`connector/ad/mapping/{type}/ignorefilter`

source: **End of rules**.
de: **Ende der Regeln**.

source: **Synchronize object**.
de: **Objekt synchronisieren**.

source: Details on preconfigured synchronization
de: Details zur vorkonfigurierten Synchronisation

source: By default, the :program:`Active Directory Connection` excludes some LDAP subtrees from the synchronization. You can find the list of ignored subtrees in the :file:`/var/log/univention/connector-ad-mapping.log` file under the ``ignore_subtree`` setting for each object type.
de: Standardmäßig schließt die :program:`Active Directory Verbindung` einige LDAP-Teilbäume von der Synchronisation aus. Sie finden die Liste der ignorierten Teilbäume in der Datei :file:`/var/log/univention/connector-ad-mapping.log` unter der Einstellung ``ignore_subtree`` für jeden Objekttyp.

source: Containers and organizational units
de: Container und Organisationseinheiten

source: Containers and organizational units are synchronized together with their description. In addition, the ``cn=mail`` and ``cn=kerberos`` containers are ignored on both sides. Some particularities must be noted for containers on the AD side. In the :guilabel:`User manager` Active Directory offers no possibility to create containers, but displays them only in the advanced mode (:menuselection:`View --> Advanced settings`).
de: Container und Organisationseinheiten werden zusammen mit ihrer Beschreibung synchronisiert. Die Container ``cn=mail`` und ``cn=kerberos`` werden auf beiden Seiten ignoriert. Bei Containern sind einige Besonderheiten auf AD-Seite zu beachten. Active Directory bietet im :guilabel:`Manager für Benutzer und Gruppen` keine Möglichkeit, Container anzulegen. AD zeigt diese im erweiterten Modus aber an (:menuselection:`Ansicht --> Erweiterte Funktionen`).

source: Take the following particularities into account:
de: Berücksichtigen Sie die folgenden Besonderheiten:

source: Containers or organizational units deleted in AD are deleted recursively in UCS, which means that any non-synchronized subordinate objects, which are not visible in AD, are also deleted.
de: Unter AD gelöschte Container oder Organisationseinheiten werden unter UCS rekursiv gelöscht, das bedeutet, dass nicht synchronisierte Unterobjekte, die in AD nicht zu sehen sind, ebenfalls entfernt werden.

source: Groups
de: Gruppen

source: Groups are synchronized using the group name, whereby a user's primary group is taken into account (which is only stored for the user in LDAP in AD).
de: Gruppen werden anhand des Gruppennamens synchronisiert, dabei findet eine Berücksichtigung der primären Gruppe eines Benutzers statt (die unter AD nur am Benutzer im LDAP hinterlegt wird).

source: Group members with no opposite in the other system, e.g., due to ignore filters, are ignored (thus remain members of the group).
de: Gruppenmitglieder, die im anderen System z.B. aufgrund von Ignore-Filtern kein Gegenstück haben, werden ignoriert (bleiben also Mitglied der Gruppe).

source: The description of the group is also synchronized.
de: Zusätzlich wird die Beschreibung der Gruppe synchronisiert.

source: Particularities
de: Besonderheiten

source: The *pre Windows 2000 name* (LDAP attribute ``samAccountName``) is used in AD, which means that a group in Active Directory can appear under a different name from in UCS.
de: Unter AD wird der *Prä-Windows 2000 Name* (LDAP-Attribut ``samAccountName``) verwendet, daher kann eine Gruppe im Active Directory mit anderem Namen erscheinen als unter UCS.

source: The connector ignores groups, which have been configured as a *Well-Known Group* under :guilabel:`Samba group type` in |UCSUDM|. There is no synchronization of the SID or the RID.
de: Der Connector ignoriert Gruppen, die im |UCSUDM| unter :guilabel:`Samba Gruppentyp` als *Bekannte Gruppe* konfiguriert wurden. Eine Synchronisation von SID oder RID findet nicht statt.

source: Groups which were configured as *Local Group* under :guilabel:`Samba group type` in |UCSUDM| are synchronized as a *global group* in the Active Directory by the connector.
de: Gruppen, die im |UCSUDM| unter :guilabel:`Samba Gruppentyp` als *Lokale Gruppe* konfiguriert wurden, werden vom Connector als *globale Gruppen* in das Active Directory synchronisiert.

source: Newly created or moved groups are always saved in the same subcontainer on the opposite side. If several groups with the same name are present in different containers during initialization, the members are synchronized, but not the position in LDAP. If one of these groups is migrated on one side, the target container on the other side is identical, so that the DNs of the groups can no longer be differentiated from this point onward.
de: Neu angelegte oder verschobene Gruppen werden immer im gleichen Untercontainer auf der Gegenseite angelegt. Existieren während der Initialisierung gleichnamige Gruppen in unterschiedlichen Containern, werden die Mitglieder synchronisiert, nicht jedoch die Position im LDAP. Wird eine solche Gruppe auf einer Seite verschoben ist der Zielcontainer auf der anderen Seite identisch, so dass sich die DNs der Gruppen ab diesem Zeitpunkt nicht mehr unterscheiden.

source: Certain group names are converted using a mapping table so that, for example in a German language setup, the UCS group ``Domain Users`` is synchronized with the AD group *Domänen-Benutzer*. When used in anglophone AD domains, this mapping can result in *germanophone* groups' being created and should thus be deactivated in this case. This can be done using the |UCSUCRV| :envvar:`connector/ad/mapping/group/language`.
de: Bestimmte Gruppennamen werden anhand einer Mapping-Tabelle umgesetzt, so dass z.B. die UCS-Gruppe ``Domain Users`` mit der AD-Gruppe ``Domänen-Benutzer``. synchronisiert wird. Dieses Mapping kann in englischsprachigen AD-Domänen dazu führen, das die deutschsprachigen Gruppen angelegt werden und sollte in diesem Fall deaktiviert werden. Dazu kann die |UCSUCRV| :envvar:`connector/ad/mapping/group/language` verwendet werden.

source: The complete table is:
de: Die vollständige Tabelle ist:

source: *UCS group*
de: *UCS-Gruppe*

source: *AD group*
de: *AD-Gruppe*

source: Nested groups are represented differently in AD and UCS. In UCS, if groups are members of groups, these objects can not always be synchronized on the AD side and appear in the list of rejected objects. Due to the existing limitations in Active Directory, nested groups should only be assigned there.
de: Die Repräsentation von Gruppen in Gruppen unterscheidet sich zwischen AD und UCS. Sind unter UCS Gruppen Mitglieder von Gruppen, so können diese Objekte nicht immer auf AD-Seite synchronisiert werden und erscheinen in der Liste der zurückgewiesenen Objekte. Verschachtelte Gruppen sollten daher aufgrund der in Active Directory vorliegenden Einschränkungen immer nur dort zugewiesen werden.
