Repository: univention/univention-corporate-server
Catalog: doc/manual/locales/*/LC_MESSAGES/windows.po
Languages: de

source: As standard, the ``Administrator`` accesses shares with ``root`` rights. If as a result the profile directory is created with the root user, it should be manually assigned to the ``Administrator`` with the command :command:`chown`.
de: Der Administrator-Benutzer greift standardmäßig mit root-Berechtigungen auf Freigaben zu. Wenn dadurch das Profilverzeichnis mit root als Benutzer angelegt wird, sollte es manuell mit dem Befehl :command:`chown` an den Administrator vergeben werden.

source: Trust relationships
de: Vertrauensstellungen

source: Trust relationships between domains make it possible for users from one domain to sign in to computers from another domain.
de: Vertrauensstellungen zwischen Domänen ermöglichen es den Benutzern einer Domäne, sich an Rechnern einer anderen Domäne anzumelden.

source: In general, Windows trust relations can be *unidirectional* or *bidirectional*. Technically a bidirectional trust is simply realized as two unidirectional trusts, one in each direction.
de: Vertrauensstellungen können unidirektional oder bidirektional eingerichtet werden. Technisch entspricht eine bidirektionale Vertrauensstellung zwei unidirektional konfigurierten Vertrauensstellungen in beide Richtungen.

source: The terminology of unidirectional trusts depends on the perspective of either the trusting or trusted domain: From the perspective of the trusting domain, the trust is called *outgoing*. From the perspective of the trusted domain, the trust is called *incoming*.
de: Die Terminologie von Vertrauensstellungen hängt von der Perspektive der vertrauenden oder der vertrauten Domäne ab: Aus Sicht der vertrauenden Domäne ist die Vertrauensstellung *ausgehend* und aus Sicht der vertrauten Domäne *eingehend*.

source: In UCS, outgoing trust (UCS trusts Windows) is not supported. As a consequence, bidirectional trust is not supported either.
de: Ausgehende Vertrauensstellungen (UCS vertraut Windows) werden in Samba/AD-Domänen nicht unterstützt. Entsprechend werden auch keine bidirektionalen Vertrauensstellungen unterstützt.

source: When setting up and using the trust relationship the domain controllers of both domains must be able to reach each other over the network and identify each other via DNS. At least the fully qualified DNS names of the domain controllers of the respective remote domain must be resolvable to allow communication between both domains to work. This can be achieved by configuring conditional DNS forwarding in both domains.
de: Während der Einrichtung und Nutzung von Vertrauensstellungen müssen sich die Domänencontroller der beiden Domänen über das Netzwerk erreichen und gegenseitig per DNS identifizieren können. Zumindest die voll qualifizierten DNS Namen der Domänencontroller der jeweils anderen Domäne müssen auflösbar sein, damit die Kommunikation zwischen den Domänen funktioniert. In beiden Domänen richtet man zu diesem Zweck eine bedingte DNS Weiterleitung ein.

source: The following example assumes, that the UCS Samba/AD DC |UCSPRIMARYDN| ``primary.ucsdom.example`` has the IP address ``192.0.2.10`` and that the Active Directory domain controller ``dc1.addom.example`` of the remote domain has the IP address ``192.0.2.20``.
de: Für das folgende Beispiel sei angenommen, dass der UCS Samba/AD DC |UCSPRIMARYDN| ``primary.ucsdom.example`` die IP-Adresse ``192.0.2.10`` hat und dass der Active Directory Domänencontroller ``dc1.addom.example`` der entfernten Domäne die IP-Adresse ``192.0.2.20`` hat.

source: On the UCS side the conditional forwarding of DNS queries can be set up as ``root`` with the following commands:
de: Auf der UCS-Seite lässt sich die bedingte Weiterleitung von DNS-Anfragen mit folgenden Schritten als ``root`` einrichten:

source: The success can be checked by running:
de: Der Erfolg kann mit folgendem Befehl überprüft werden:

source: In addition, it may be useful to create a static entry for the domain controller of the remote Active Directory domain in the file :file:`/etc/hosts`:
de: Zusätzlich kann es sinnvoll sein, für den Domänencontroller der entfernten Active Directory Domäne einen statischen Eintrag in der Datei :file:`/etc/hosts` anzulegen:

source: On a Windows AD DC, a so-called *conditional forwarding* can be set up for the UCS domain via the DNS server console.
de: Auf dem Windows AD DC kann über die DNS-Server Konsole eine sogenannte *Bedingte Weiterleitung* (*Conditional Forwarding*) für die UCS-Domäne eingerichtet werden.

source: Trust relationships can only be configured on domain controllers but they affect the whole domain.
de: Vertrauensstellungen können nur auf Domänencontrollern eingerichtet werden, gelten dann aber für die gesamte Domäne.

source: After this preliminary work, the trust relationship can be established directly from the command line of the UCS Samba/AD DC using the tool :command:`samba-tool`:
de: Nach dieser Vorarbeit kann die Vertrauensstellung direkt von der Kommandozeile des UCS Samba/AD DCs eingerichtet werden. In Samba/AD Domänen ist diese Konstellation sehr einfach an der Kommandozeile über das Werkzeug :command:`samba-tool` einzurichten:

source: The trust can be checked using the following commands:
de: Mit folgenden Kommandos kann die Vertrauensstellung überprüft werden:

source: After the setup, a UCS user should be able to sign in to systems of the remote Active Directory domain. Users must either use the format ``UCSDOM\username`` as login name or their Kerberos principal in the notation ``username@ucsdom.example``.
de: Nach der Einrichtung sollte sich ein Benutzer an Systemen der Windows Active Directory Domäne anmelden können. Als Login-Name muss dabei entweder das Format ``UCSDOM\username`` oder der Kerberos Prinzipal in der Notation ``username@ucsdom.example`` angegeben werden.
