Repository: univention/univention-corporate-server
Catalog: management/univention-management-console/www/management/*.po
Languages: de

source: "${moduleName}" module
de: Modul "${moduleName}"

source: %(label)s (retype)
de: %(label)s (Wiederholung)

source: %(num)d entries of %(total)d selected
de: %(num)d Einträge von %(total)d ausgewählt

source: %s loaded
de: %s geladen

source: 1 entry of %d selected
de: 1 Eintrag von %d ausgewählt

source: A reload of the Univention Management Console is required to use new modules.<br>Currently opened modules may not work properly.<br>Do you want to reload the page?
de: Es ist notwendig, die Univention Management Console neu zu laden, um neue Module benutzen zu können.<br>Momentan geöffnete Module funktionieren möglicherweise nicht mehr korrekt.<br>Soll die Seite neu geladen werden?

source: Access
de: Zugriff

source: Add
de: Hinzufügen

source: Add objects
de: Objekte hinzufügen

source: An assert statement failed
de: Ein Assert-Anweisung schlug fehl

source: An error occurred
de: Ein Fehler ist aufgetreten:

source: An error occurred while connecting to the server, please try again later.
de: Ein Fehler trat während des Verbindungsaufbaus zum Server auf. Bitte versuchen Sie es später noch einmal.

source: An error occurred:
de: Ein Fehler ist aufgetreten:

source: An unknown error with status code %s occurred while connecting to the server, please try again later.
de: Ein unbekannter Fehler mit Status-Code %s trat während des Verbindungsaufbaus zum Server auf. Bitte versuchen Sie es später noch einmal.

source: Authentication failure
de: Authentifizierungsfehler

source: Authentication required
de: Authentifizierung notwendig

source: Back
de: Zurück

source: Browser cookies are necessary for working with Univention Management Console. Please activate cookies in your browser.
de: Browser-Cookies sind notwendig für die Arbeit mit Univention Management Console. Bitte aktivieren sie Cookies in Ihrem Browser.

source: Cancel
de: Abbrechen

source: Changing password failed
de: Passwortänderung fehlgeschlagen

source: Clear data
de: Daten leeren

source: Clear image data
de: Bilddaten leeren

source: Close
de: Schließen

source: Confirmation
de: Bestätigung

source: Could not fulfill the request.
de: Die Anfrage konnte nicht ausgeführt werden.

source: Could not load search results
de: Es konnten keine Sucheergebnisse geladen werden

source: Could not process the request.
de: Die Anfrage konnte nicht bearbeitet werden.

source: All entries loaded
de: Alle Einträge geladen

source: Fetching information from the server failed!
de: Das Holen von Informationen vom Server schlug fehl!

source: Finish
de: Fertigstellen

source: Group
de: Gruppe

source: Hide server error message
de: Fehlernachricht des Servers ausblenden

source: Inform vendor
de: Dem Hersteller melden

source: Information
de: Hinweis

source: Information about the error will be sent to the vendor along with some data about the operating system.
de: Informationen zu diesem Fehler werden, zusammen mit Angaben über das Betriebssystem, an den Hersteller übermittelt.

source: Insecure Connection
de: Unsichere Verbindung

source: Internal UMC protocol error: The UMCP message body could not be parsed.
de: Interner UMC-Protokoll-Fehler: Der UMCP-Message-Body konnte nicht geparst werden.

source: Internal UMC protocol error: The UMCP message header could not be parsed.
de: Interner UMC-Protokoll-Fehler: Der UMCP-Message-Header konnte nicht geparst werden.

source: Internal module error: An error occurred during command processing.
de: Interner Modul-Fehler: Ein Fehler trat während des Ausführens des Befehls auf.

source: Internal module error: The initialization of the module caused a fatal error.
de: Interner Modul-Fehler: Die Initialisierung des Moduls erzeugte einen fatalen Fehler.

source: Internal server error.
de: Interner Server-Fehler.

source: Internal server error: Could not connect to the module process.
de: Interner Server-Fehler: Verbindung zum Modulprozess konnte nicht aufgebaut werden.

source: Internal server error: The SSL server certificate is not trustworthy. Please check your SSL configurations.
de: Interner Server-Fehler: Das SSL-Server-Zertifikat ist nicht vertrauenswürdig. Bitte überprüfen Sie ihre SSL-Konfiguration.

source: Internal server error: The module process died unexpectedly.
de: Interner Server-Fehler: Der Modulprozess wurde unerwartet beendet.

source: Internal server error: The service is temporarily not available.
de: Interner Server-Fehler: Der Dienst ist momentan nicht erreichbar!

source: Login
de: Anmelden

source: New Password
de: Neues Passwort

source: New Password (retype)
de: Neues Passwort (wiederholen)

source: New entry
de: Neuer Eintrag

source: Next
de: Weiter

source: No entries could be found
de: Es konnten keine Einträge gefunden werden

source: No message
de: Keine Nachricht

source: No object selected
de: Kein Objekt ausgewählt

source: No upload in progress
de: Keine laufende Dateiübertragung

source: Notification
de: Benachrichtigung

source: One time password
de: Einmalpasswort

source: One time password required
de: Einmalpasswort benötigt

source: Others
de: Andere

source: Owner
de: Besitzer

source: Password
de: Passwort

source: Please enable cookies
de: Bitte Cookies aktivieren

source: Please take a second to provide the following information:
de: Bitte nehmen Sie sich einen Augenblick Zeit, um die folgenden Informationen bereitzustellen:

source: Read
de: Lesen

source: Reload
de: Neu laden

source: Remarks (e.g. steps to reproduce) (optional)
de: Bemerkungen (z.B. Schritte, den Fehler nachzustellen) (optional)

source: Remove
de: Entfernen

source: Search
de: Suchen

source: Search results:
de: Suchergebnisse:

source: Search term
de: Suchbegriff

source: Send as email
de: Als E-Mail senden

source: Send to vendor
de: An den Hersteller senden

source: Sending the information to the vendor failed
de: Das Versenden der Informationen zum Hersteller ist fehlgeschlagen

source: Server error message:
de: Fehlernachricht des Servers:

source: Show error message
de: Fehlermeldung anzeigen

source: Show server error message
de: Fehlernachricht des Servers anzeigen

source: So far the authentication failed. Continuing nevertheless.
de: Bis jetzt schlug die Authentifizierung fehl. Nichtdestotrotz wird weiterhin probiert.

source: So far, the connection to the server could not be established after {time} seconds. This can be a normal behavior. In any case, the process will continue to establish the connection.
de: Gegenwärtig konnte die Verbindung zum Server seit {time} Sekunden nicht aufgebaut werden. Dies kann ein vorhergesehenes Verhalten sein. In jedem Fall wird der Prozess weiterhin versuchen die Verbindung wieder herzustellen.

source: Specified locale is not available.
de: Die angegebene Sprachdefinition ist nicht verfügbar.

source: Submit
de: Absenden

source: Thank you for your help
de: Vielen Dank für Ihre Hilfe

source: The following files cannot be uploaded because they exceed the maximum file size:
de: Die folgenden Dateien können nicht hochgeladen werden, da sie die maximale Dateigröße überschreiten:

source: The maximum size of a file is %.1f MB.
de: Die Maximalgröße einer Datei ist %.1f MB.

source: The password is expired
de: Das Passwort ist abgelaufen

source: The passwords do not match, please retype again.
de: Die Passwörter stimmen nicht überein. Bitte versuchen Sie es erneut.

source: This action requires you to supply your password.
de: Diese Aktion erfordert die Eingabe Ihres Passwortes.

source: This network connection is not encrypted. All personal or sensitive data will be transmitted in plain text. Please follow %s this link</a> to use a secure SSL connection.
de: Die Netzwerkverbindung ist nicht verschlüsselt. Alle persönlichen und sensiblen Daten werden im Klartext übertragen. Bitte verwenden Sie %s diesen Link</a> für eine verschlüsselte SSL-Verbindung.

source: UMC reload required
de: Erneutes Laden der UMC notwendig

source: Upload
de: Hochladen

source: Upload new image
de: Neues Bild hochladen

source: Uploading...
de: Datenübertragung...

source: Uploading... %(current)d of %(total)d files remaining.
de: Dateiübertragung... %(current)d von %(total)d Dateien verbleiben.

source: Uploads finished
de: Dateiübertragung beendet

source: Username
de: Benutzername

source: Validation error
de: Validierungsfehler

source: Warning
de: Warnung

source: Webfrontend error: The specified UMCP command arguments of the request are invalid.
de: Webfrontend-Fehler: Die angegebenen UMCP-Befehl-Argumente der Anfrage sind nicht zulässig.

source: Webfrontend error: The specified arguments for the UMCP module method are invalid or missing.
de: Webfrontend-Fehler: Die angegebenen Argumente für die UMCP-Modul-Methode sind nicht zulässig oder fehlen.

source: Webfrontend error: The specified request is unknown.
de: Webfrontend-Fehler: Die angegebene Anfrage ist nicht bekannt.

source: Write
de: Schreiben

source: You are not authorized to perform this action.
de: Sie sind nicht authorisiert, diese Aktion durchzuführen.

source: You can also send the information via mail:
de: Sie können die Informationen auch per Mail schicken:

source: Your browser is outdated
de: Ihr Browser ist veraltet

source: Your browser is outdated and should be updated. You may continue to use Univention Management Console but you may experience performance issues and other problems.
de: Ihr Browser ist veraltet und sollte aktualisiert werden. Sie können die Univention Management Console benutzen, aber es kann zu Geschwindigkeits- und anderen Problemen kommen.

source: Your email address (optional)
de: Ihre E-Mail Adresse (optional)

source: Your session has been closed due to inactivity. Please login again.
de: Ihre Sitzung wurde wegen Inaktivität geschlossen. Bitte melden Sie sich erneut an.

source: Your session has expired, please login again.
de: Ihre Sitzung ist abgelaufen, bitte melden Sie sich erneut an.

source: actual result
de: beobachtetes Ergebnis

source: expected result
de: erwartetes Ergebnis

source: more
de: mehr

source: steps to reproduce the failure
de: Schritte, um den Fehler zu reproduzieren

source: {number} errors occurred:
de: {number} Fehler sind aufgetreten:

source: User settings
de: Benutzereinstellungen

source: https://www.univention.com/feedback/
de: https://www.univention.de/produkt-feedback/

source: <p><a href="%s?umc=StartupDialog" target="_blank">Tell us your opinion!</a></p>
de: <p><a href="%s?umc=StartupDialog" target="_blank">Sagen Sie uns Ihre Meinung!</a></p>

source: Documentation and Support
de: Dokumentation und Support
