Repository: univention/univention-corporate-server
Catalog: */univention-system-setup/usr/share/univention-system-setup/www/*.po
Languages: de

source: %s Appliance could not be joined because the license on the DC Master is not activated.
de: %s Appliance kann nicht gejoined werden. Es liegt keine aktivierte Lizenz auf dem DC Master vor.

source: %s Appliance has been successfully set up.
de: %s Appliance wurde erfolgreich eingerichtet.

source: (Request address again)
de: (Adresse erneut anfordern)

source: (configure proxy settings)
de: (Einrichten von Proxy-Einstellungen)

source: <b>Unknown</b>
de: <b>Unbekannt</b>

source: <b>Warning:</b> At least {memory_min} RAM is required for the installation of {product_name}.
de: <b>Warnung:</b> Mindestens {memory_min} Arbeitsspeicher sind notwendig für die Installation von {product_name}.

source: <i>Bond</i> interfaces allows two or more physical network interfaces to be coupled.
de: <i>Bond</i> Netzwerkschnittstellen erlaubt einen Verbund von einem oder mehreren physikalischen Netzwerkgeräten.

source: <i>Bridge</i> interfaces allows a physical network interface to be shared to connect one or more network segments.
de: <i>Bridge</i> Netzwerkschnittstellen erlaubt physikalischen Netzwerkgeräten gemeinsam benutzt zu werden um ein oder mehrere Netzwerksegemente miteinander zu verbinden.

source: <i>Ethernet</i> is a standard physical interface.
de: <i>Ethernet</i> ist ein standard physikalisches Gerät.

source: <i>Language settings</i> incorporate all language relevant configurations, such as time zone, keyboard layout, and system locales.
de: Die <i>Spracheinstellungen</i> beinhalten alle sprachrelevanten Einstellungsmöglichkeiten wie Zeitzone, Tastaturlayout und Systemsprache.

source: <i>VLAN</i> interfaces can be used to separate network traffic logically while using only one or more physical network interfaces.
de: <i>VLAN</i> Netzwerkschnittstellen können benutzt werden, um Netzwerkverkehr logisch mit nur einem oder mehreren physikalischen Netzwerkgeräten zu trennen.

source: <p>Click on <i>Finish</i> to conclude the installation. The system will be prepared for the first boot procedure and will be rebooted afterwards.</p>
de: <p>Klicken Sie auf <i>Fertigstellen</i> um die Installation abzuschließen. Anschließend wird das System auf den ersten Bootvorgang vorbereitet und neu gestartet.</p>

source: <p>Click on <i>Finish</i> for putting UCS into operation.</p>
de: <p>Klicken Sie auf <i>Fertigstellen</i>, um UCS in Betrieb zu nehmen.</p>

source: <p>Click on <i>Finish</i> for putting this system into operation.</p>
de: <p>Klicken Sie auf <i>Fertigstellen</i>, um dieses System in Betrieb zu nehmen.</p>

source: <p>Enter the name of your organization and an e-mail address to activate UCS.</p>
de: <p>Geben Sie den Namen Ihrer Organisation und eine E-Mail-Adresse für die Aktivierung von UCS ein.</p>

source: <p>Enter the name of your organization, an e-mail address to activate %s Appliance and a password for your <i>Administrator</i> account.</p><p>The password is mandatory, it will be used for the domain Administrator as well as for the local superuser <i>root</i>.</p>
de: <p>Geben Sie den Namen Ihrer Organisation, eine E-Mail-Adresse für die Aktivierung der %s Appliance sowie ein Passwort für das Konto <i>Administrator</i> an.</p><p>Das Passwort ist ein Pflichtfeld. Es wird sowohl für das Domänen-Administrator-Konto als auch für den lokalen Superuser <i>root</i> verwendet.</p>

source: <p>Enter the name of your organization, an e-mail address to activate UCS and a password for your <i>Administrator</i> account.</p><p>The password is mandatory, it will be used for the domain Administrator as well as for the local superuser <i>root</i>.</p>
de: <p>Geben Sie den Namen Ihrer Organisation, eine E-Mail-Adresse für die Aktivierung von UCS sowie ein Passwort für das Konto <i>Administrator</i> an.</p><p>Das Passwort ist ein Pflichtfeld. Es wird sowohl für das Domänen-Administrator-Konto als auch für den lokalen Superuser <i>root</i> verwendet.</p>

source: <p>One or more network interfaces could not obtain an IP address via DHCP. These interfaces will use automatic generated private addresses instead (APIPA).</p> <ul> %s </ul> <p>Please adjust your DHCP settings or confirm use of private address(es).</p>
de: <p>Eine oder mehrere Netzwerkgeräte konnten keine IP Adresse durch DHCP beziehen. Diese Netzwerkgeräte werden stattdessen automatisch generierte private Adressen verwenden (APIPA).</p> <ul> %s </ul> <p>Bitte passen Sie ihre DHCP-Konfiguration an oder bestätigen Sie die Nutzung der privaten Adresse(n).</p>

source: <p>Select UCS software components for installation on this system. This step can be skipped; the components are also available in the Univention App Center in the category <i>UCS components</i>.</p><p>Third-party software (e.g., groupware) is also available through the Univention App Center.</p>
de: <p>Wählen Sie UCS-Software-Komponenten zur Installation auf dem System aus. Dieser Schritt kann übersprungen werden; die Komponenten sind auch über das Univention App Center in der Kategorie <i>UCS-Komponenten</i> verfügbar.</p><p>Software von Drittanbietern (bspw. Groupware) kann ebenfalls über das Univention App Center installiert werden.</p>

source: <p>When accessing the system for the first time, you will be asked to request and upload a new license.</p>
de: <p>Beim initialen Zugriff auf das System, werden Sie gebeten eine Lizenzdatei anzufordern und hochzuladen.</p>

source: <p>When accessing the system for the first time, you will be asked to upload a new license that has been sent to your email account.</p>
de: <p>Beim initialen Zugriff auf das System, werden Sie gebeten eine Lizenzdatei, die an Ihre E-Mail-Adresse gesendet wurde, hochzuladen.</p>

source: <p>With the current settings <b> no </b> internet access is available.</p><p>Because of this some functions like the App Center or software-updates will not be accessible</p>
de: <p>Mit den aktuellen Einstellungen ist <b> kein </b> Internetzugriff möglich.</p><p>Dadurch werden einige Funktionen wie zum Beispiel das App Center oder Software-Aktualisierungen nicht zur Verfügung stehen.</p>

source: <tr><td>City:</td><td>%s</td></tr>
de: <tr><td>Stadt:</td><td>%s</td></tr>

source: <tr><td>Default locale:</td><td>%s</td></tr>
de: <tr><td>Standard-Systemsprache:</td><td>%s</td></tr>

source: <tr><td>Keyboard layout:</td><td>%s</td></tr>
de: <tr><td>Tastaturlayout:</td><td>%s</td></tr>

source: <tr><td>Timezone:</td><td>%s</td></tr>
de: <tr><td>Zeitzone:</td><td>%s</td></tr>

source: A DC backup is the fallback system for the UCS DC master and can take over the role of the DC master permanently. It is recommended to use at least one DC backup in the domain.
de: Ein DC Backup fungiert als Ersatzsystem für den DC Master und kann die Rolle des DC Masters langfristig übernehmen. Es ist empfohlen, mindestens einen DC Backup in der Domäne zu verwenden.

source: A few questions are needed to complete the configuration process.
de: Ein paar Fragen sind notwendig, um die Einrichtung abzuschließen.

source: A new UCS domain will be created.
de: Eine neue UCS-Domäne wird erstellt.

source: A new domain directory is created on this system. User and management data are stored locally.
de: Ein neues Domänenverzeichnis wird auf diesem System erstellt. Benutzer- und Verwaltungsdaten werden lokal gespeichert.

source: A preconfigured test domain will be instantiated.
de: Eine vorkonfigurierte UCS-Test-Domäne wird instanziiert.

source: A proxy address needs to be specified in the format: <i>http://proxy.mydomain.intranet:3128</i><br/>Proxy access with username and password may be specified via the format: <i>http://username:password@proxy.mydomain.intranet:3128</i>
de: Eine Proxy-Adresse kann angegeben werden in dem Format: <i>http://proxy.meinedomaene.intranet:3128</i><br/>Für Proxy-Zugang mit Benutzername und Password kann das folgenden Format verwendet werden: <i>http://benutzername:passwort@proxy.meinedomaene.intranet:3128</i>

source: A valid e-mail address allows to activate the UCS system for using the Univention App Center. The address can be specified now or also at a later point in time. An e-mail with a personalized license key will then be sent to your e-mail address. This license can be uploaded via the license dialog in Univention Management Console.
de: Eine gültige E-Mail-Adresse ermöglicht, das UCS-System für die Verwendung des Univention App Centers freizuschalten. Die Adresse kann jetzt oder auch zu einem späteren Zeitpunkt angegeben werden. Eine E-Mail mit einem personalisierten Lizenzschlüssel wird Ihnen dann an diese Adresse zugesendet werden. Die Lizenz kann über den Lizenzdialog der Univention Management Console eingespielt werden.

source: A valid e-mail address is required to activate %s Appliance. The address can be specified now or also at a later point in time. An e-mail with a personalized license key will then be sent to your e-mail address. This license can be uploaded after the setup process.
de: Eine gültige E-Mail-Adresse ist für die Aktivierung von %s Appliance notwendig. Die Adresse kann jetzt oder auch zu einem späteren Zeitpunkt angegeben werden. An diese E-Mail-Adresse wird Ihnen dann ein personalisierter Lizenzschlüssel zugesendet. Die Lizenz kann über den Lizenzdialog der Univention Management Console eingespielt werden.

source: Account information
de: Kontoinformationen

source: Active Directory join information
de: Active Directory-Kontoinformationen

source: Adapt settings
de: Einstellungen anpassen

source: Add
de: Hinzufügen

source: Add a network interface
de: Ein Netzwerkgerät hinzufügen

source: Additional bonding options
de: Weitere Bonding-Optionen

source: Additional bridge options
de: Weitere Bridge-Optionen

source: Additional options for this network interface
de: Weitere Optionen für dieses Netzwerkgerät

source: Address configuration
de: Adresskonfiguration

source: Address for %s
de: Adresse für %s

source: Address of Active Directory domain controller or name of Active Directory domain
de: Adresse des Active Directory-Domänencontrollers oder Name der Active Directory-Domäne

source: Adjust settings
de: Einstellungen anpassen

source: Advanced configuration
de: Erweiterte Konfiguration

source: Alternate DNS server
de: Alternativer DNS-Server

source: Alternatively, you may click on the button <i>Finish</i> to exit the wizard and resolve the described problems at a later point.
de: Alternativ können Sie auf den Button <i>Fertigstellen</i> klicken, um den Einrichtungsassistenten zu beenden und die beschriebenen Probleme zu einem späteren Zeitpunkt zu beheben.

source: Alternatively, you may click on the button <i>Finish</i> to exit the wizard and resolve the described problems via Univention Management Console.
de: Alternativ können Sie auf den Button <i>Fertigstellen</i> klicken, um den Einrichtungsassistenten zu beenden und die beschriebenen Probleme mittels Univention Management Console zu beheben.

source: Apply changes
de: Änderungen übernehmen

source: At least one ip address have to be specified or DHCP or SLAAC have to be enabled.
de: Mindestens eine IP-Adresse muss angegeben werden oder DHCP oder SLAAC muss eingeschaltet sein.

source: At least one network device needs to be properly configured.
de: Wenigstens ein Netzwerkgerät muss konfiguriert werden.

source: Autoconfiguration (SLAAC)
de: Automatische Konfiguration (SLAAC)

source: Back to overview
de: Zurück zur Übersicht

source: Bond configuration
de: Bond konfiguration

source: Bond interface configuration
de: Bond Netzwerkkonfiguration

source: Bond primary
de: Primäre Bond-Netzwerkschnittstellen

source: Bond slaves
de: Bond Kindnetzwerkschnittstellen

source: Bonding
de: Kanalbündelung (Bonding)

source: Bridge
de: Netzwerk-Bridge

source: Bridge configuration
de: Bridge-Konfiguration

source: Bridge interface configuration
de: Bridge Netzwerkkonfiguration

source: Business unit
de: Abteilung

source: Cancel
de: Abbrechen

source: Category
de: Kategorie

source: Certificate
de: Zertifikat

source: Certificate settings
de: Zertifikateinstellungen

source: Changes in the SSL certificate settings will result in generating new root SSL certificates. Note that this will require an update of all host certificates in the domain as the old root certificate is no longer valid. Additional information can be found in the <a href="http://sdb.univention.de/1183" target="_blank">Univention Support Database</a>.
de: Durch Änderungen an den SSL-Zertifikat-Einstellungen wird ein neues Root-Zertifikat erstellt. Dies hat zur Folge, dass alle Host-Zertifikate der Domäne aktualisiert werden müssen, da das alte Root-Zertifkat nicht mehr gültig sein wird. Weitere Informationen können in der <a href="http://sdb.univention.de/1000" target="_blank">Univention Support Database</a> gefunden werden.

source: Changing IP address configurations may result in restarting or stopping services. This can have severe side-effects when the system is in productive use at the moment.
de: Änderungen der IP-Adressen kann Neustart oder Anhalten von diversen Diensten zur Folge haben. Dies kann ernsthafte Auswirkungen haben, sollte sich das System im Produktiveinsatz befinden.

source: Changing network settings is disabled due to specific UVMM settings. See %s for further information.
de: Ändern von Netzwerkeinstellungen ist durch spezifische UVMM Einstellungen deaktiviert. Für weitere Informationen siehe %s.

source: Changing network settings is disabled. It can be re enabled by unsetting the UCR variable "umc/modules/setup/network/disabled/by".
de: Das Ändern von Netzwerkeinstellungen ist deaktiviert. Es kann durch löschen der UCR-Variable "umc/modules/setup/network/disabled/by" wieder aktiviert werden.

source: Choose interface type
de: Wähle Netzwerkgerätetyp aus

source: Choose your language
de: Wählen Sie Ihre Sprache aus

source: Choose your system's localization settings.
de: Wählen Sie die Systemsprache.

source: Close
de: Schließen

source: Common name for the root SSL certificate
de: Allgemeiner Name (common name) für das Root-SSL-Zertifikat

source: Configuration
de: Konfiguration

source: Configuration finished
de: Konfiguration abgeschlossen

source: Configuration of IPv4 and IPv6 adresses
de: Konfiguration der IPv4 und IPv6 Adressen

source: Configure system
de: System konfigurieren

source: Configure this system as first system for the new domain. Additional systems can join the domain later.
de: Dieses System als erstes System einer neuen Domäne einrichten. Zusätzliche Systeme können der Domäne später beitreten.

source: Confirm configuration settings
de: Bestätigen der Einstellungen

source: Connect to Univention Management Console on this system either as user <b>Administrator</b> or as user <b>root</b> in case the system has not yet created a new UCS domain:
de: Verbinden Sie sich auf diesem System zur Univention Management Console entweder als Benutzer <b>Administrator</b> oder als Benutzer <b>root</b>, falls das System noch keine neue UCS-Domäne erstellt hat:

source: Connect to Univention Management Console on this system either as user <b>Administrator</b> or as user <b>root</b> in case the system has not yet joined the domain:
de: Verbinden Sie sich auf diesem System zur Univention Management Console entweder als Benutzer <b>Administrator</b> oder als Benutzer <b>root</b>, falls das System noch nicht der Domäne beigetreten ist:

source: Connection failed. Please recheck the address
de: Verbindungsaufbau gescheitert. Bitte überprüfen Sie die Adresse

source: Connection refused. Please recheck the password
de: Verbindungsaufbau abgelehnt. Bitte überprüfen Sie das Passwort

source: Continue
de: Fortfahren

source: Continue with 169.254.*.* addresse(s)
de: Fortfahren mit 169.254.*.* Adresse(n)

source: Continue with incomplete settings
de: Fortfahren mit unvollständigen Einstellungen

source: Continue without internet access
de: Ohne Internetzugriff fortfahren

source: Continuing the installation might lead to a not functioning or hung up system.
de: Ein Fortsetzen der Installation kann zu einem nicht funktionsfähigen oder nicht mehr reagierenden System führen.

source: Country
de: Land

source: Country code
de: Ländercode

source: Create a new UCS domain
de: Erstellen einer neuen UCS-Domäne

source: Created:
de: Erstellt:

source: DC slave systems are ideal for site servers, they provide authentication services for the domain. Local services running on a DC slave can access the local LDAP database.
de: DC Slave-Systeme bieten sich für Standortserver an, sie stellen Authentifizierungsdienste bereit. Lokale Dienste auf einem DC Slave haben Zugriff auf die lokale LDAP-Datenbank.

source: DHCP query failed.
de: DHCP-Anfrage schlug fehl.

source: DHCP-Query
de: DHCP-Anfrage

source: Default system locale
de: Standard-System-Sprachdefinition

source: Delete
de: Löschen

source: Do not use any domain
de: Keine Domäne benutzen

source: Domain and host configuration
de: Domänen- und Rechnereinstellung

source: Domain and network configuration
de: Domänen- und Netzwerkeinstellung

source: Domain controller backup
de: Domänencontroller Backup

source: Domain controller slave
de: Domänencontroller Slave

source: Domain join information
de: Informationen zum Domänenbeitritt

source: Domain name
de: Domänenname

source: Domain name server
de: Domänen-DNS-Server

source: Domain name server (max. 3)
de: Domänen-DNS-Server (max. 3)

source: Domain setup
de: Domäneneinstellungen

source: Dynamic (DHCP)
de: Dynamisch (DHCP)

source: E-mail address to activate %s Appliance
de: E-Mail-Adresse zur Aktivierung von %s Appliance

source: E-mail address to activate UCS
de: E-Mail-Adresse zur Aktivierung von UCS

source: Each IPv6 interface must have an identifier
de: Jedes IPv6 Gerät muss einen Bezeichner haben

source: Edit
de: Bearbeiten

source: Edit a network interface
de: Bearbeite ein Netzwerkgerät

source: Email address
de: E-Mail-Adresse

source: Enter a city nearby to preconfigure settings such as timezone, system language, keyboard layout.
de: Geben Sie eine nahegelegene Stadt zur Einrichtung von Zeitzone, Systemsprache und Tastaturlayout ein.

source: Enter name and password of a user account which is authorised to join a system into this domain.
de: Geben Sie Namen und Passwort eines Benutzerkontos an, das für den Beitritt eines Systems in diese Domäne berechtigt ist.

source: External name server
de: Externer DNS-Server

source: External name server (max. 3)
de: Externer DNS-Server (max. 3)

source: Failed join scripts can be executed via the UMC module <i>Domain join</i>.
de: Fehlgeschlagene Domänenbeitritt-Skripte können mit dem UMC-Modul <i>Domänenbeitritt</i> ausgeführt werden.

source: Failed join scripts or a new join of the system can be executed via the UMC module <i>Domain join</i>.
de: Fehlgeschlagene Domänenbeitritt-Skripte oder ein erneuter Domänenbeitritt kann mit dem UMC-Modul <i>Domänenbeitritt</i> ausgeführt werden.

source: Fast demo configuration
de: Schnelle Demo-Konfiguration

source: Fill in the password for the system administrator user <b>root</b> and the domain administrative user account <b>Administrator</b>.
de: Füllen Sie das Passwort für den Systemadministrator-Benutzer <b>root</b> und den Domänenadministrator-Benutzeraccount <b>Administrator</b> aus.

source: Finish
de: Fertigstellen

source: Following the <i>certificate settings</i>, a new root certificate will be created for the domain.
de: Nach Vergabe der <i>Zertifikatseinstellungen</i> wird ein neues Root-Zertifikat für die Domäne erstellt.

source: For a specified host name, the domain name is automatically derived from the domain name server. A fully qualified domain may be necessary for mail server setups with differing domains.<br/>Note that the domain name <b>cannot</b> be changed after the UCS setup wizard has been completed.
de: Für einen angegebenen Rechnernamen wird der Domänenname automatisch von dem Domänen-DNS-Server abgeleitet. Ein vollständiger Domänenname kann für Mail-Server-Umgebungen mit unterschiedlichen Domänen notwendig sein.<br/>Der eingerichtete Domänenname kann nach dem Durchlaufen des UCS-Einrichtungsassistenten <b>nicht</b> mehr geändert werden.

source: Forwarding delay
de: Forwarding-Verzögerung

source: Fully qualified domain name
de: Vollqualifizierter Domänenname

source: Further information can be found in the <a href="http://docs.univention.de/manual-%s.html#computers:networkcomplex" target="_blank">UCS documentation</a>.
de: Weitere Informationen können in der <a href="http://docs.univention.de/handbuch-%s.html#computers:networkcomplex" target="_blank">UCS Dokumentation</a> gefunden werden.

source: General settings
de: Allgemeine Einstellungen

source: Global network settings
de: Globale Netzwerk-Einstellungen

source: Help us improve UCS by sending the occurred errors as feedback.
de: Helfen Sie uns UCS zu verbessern, indem Sie uns die aufgetretenen Fehler als Feedback senden.

source: Host settings
de: Rechnereinstellungen

source: Hostname
de: Rechnername

source: Hostname (unchangeable. Was set while creating the container)
de: Rechnername (unveränderbar. Wurde beim Erstellen des Containers vergeben)

source: Hostname of the domain controller master
de: Rechnername des Domänencontroller Masters

source: Hostname or fully qualified domain name
de: Rechnername oder vollständiger Domänenname

source: IP address is obtained dynamically via DHCP
de: Die IP-Adresse wird dynamisch über DHCP bezogen

source: IP network interfaces
de: IP Netzwerkgeräte

source: IPv4 address
de: IPv4-Adresse

source: IPv4 net mask/IPv6 prefix {interface}
de: IPv4-Netzmaske/IPv6-Präfix {interface}

source: IPv4 network interface configuration
de: IPv4-Netzwerkgerätkonfiguration

source: IPv4/IPv6 address {interface}
de: IPv4/IPv6-Adresse {interface}

source: IPv6 address
de: IPv6-Adresse

source: IPv6 network interface configuration
de: IPv6-Netzwerkgerätkonfiguration

source: IPv6 prefix
de: IPv6-Präfix

source: Identifier
de: Bezeichner

source: If unsure, select <i>%s</i>.
de: Wenn unsicher, wählen Sie <i>%s</i>.

source: If you want to upgrade your memory first please press the power button of your server to shutdown the system.
de: Wenn Sie zuerst Ihren Arbeitsspeicher aufrüsten möchten, drücken Sie bitte den Netzschalter des Servers um das System herunterzufahren.

source: In the <i>network settings</i>, IP addresses (IPv4 and IPv6) as well as name servers, gateways, and HTTP proxies may be specified.
de: In den <i>Netzwerkeinstellungen</i> können IP-Adressen (IPv4 und IPv6) sowie DNS-Server, Gateways und HTTP-Proxy festgelegt werden.

source: Initialize the configuration process ...
de: Initialisiere den Konfigurationsvorgang ...

source: Installation of %d additional software components.
de: Installation von %d zusätzlichen Software-Komponenten.

source: Installation of one additional software component.
de: Installation einer zusätzlichen Software-Komponente.

source: Installed system locales
de: Verfügbare Systemsprache

source: Interface
de: Gerät

source: Interface "%s" already exists.
de: Netzwerkgerät "%s" existiert bereits.

source: Interface type
de: Netzwerkgerätetyp

source: Invalid IP address!<br/>Expected format is IPv4 or IPv6.
de: Ungültige IP-Adresse!<br/>Erwartetes Format ist IPv4 oder IPv6.

source: Invalid IPv4 net mask or IPv6 prefix!<br/>Expected for IPv4 is a number between 0 and 32 or a format similar to <i>255.255.255.0</i>.<br/>Expected format for IPv6 is a number between 0 and 128.
de: Ungültige IPv4-Netzmaske oder IPv6-Präfix!<br/>Erwartetes Format für IPv4 ist eine Zahl zwischen 0 und 32 oder ein Format vergleichbar zu <i>255.255.255.0</i>.<br/>Erwartetes Format für IPv6 ist eine Zahl zwischen 0 und 128.
