Repository: univention/univention-corporate-server
Catalog: */univention-system-setup/usr/share/univention-system-setup/www/*.po
Languages: de

source: Invalid LDAP base!<br/>The LDAP base may neither contain blanks nor any special characters. Its structure needs to consist of at least two relative distinguished names (RDN) with attribute tags 'dc', 'cn', 'c', 'o', or 'l' (e.g., dc=test,dc=net).
de: Ungültige LDAP-Basis!<br/>Die LDAP-Basis darf weder Leer- noch Sonderzeichen enthalten. Ihre Struktur muss aus mindestens zwei Relative Distinguished Names (RDN) bestehen, die eines der Attribut-Tags 'dc', 'cn', 'c', 'o', or 'l' verwenden (z.B. dc=test,dc=net).

source: Invalid domain name!<br/>Expected format: <i>mydomain.intranet</i>
de: Ungültiger Domänenname!<br/>Erwartetes Format: <i>meinedomaene.intranet</i>

source: Invalid e-mail address!<br/>Expected format is:<i>mail@example.com</i>
de: Ungültige E-Mail-Adresse!<br/>Erwartetes Format: <i>mail@beispiel.de</i>

source: Invalid fully qualified domain name!<br/>Expected format: <i>hostname.mydomain.intranet</i>
de: Ungültiger vollqualifizierter Domänenname!<br/>Erwartetes Format: <i>rechnername.meinedomaene.intranet</i>

source: Invalid hostname or fully qualified domain name!<br/>Expected format: <i>myhost</i> or <i>hostname.mydomain.intranet</i>
de: Ungültiger Rechnername oder vollständiger Domänenname!<br/>Erwartetes Format: <i>rechnername</i> oder <i>rechnername.meinedomaene.intranet</i>

source: It is not possible to install KVM and XEN components on one system. Please select only one of these components.
de: Es ist nicht möglich KVM- und XEN-Komponenten auf einem System zu installieren. Bitte wählen Sie nur eine dieser Komponenten aus.

source: It is not possible to install Samba 3 and Samba 4 on one system. Please select only one of these components.
de: Es ist nicht möglich Samba 3 und Samba 4 auf einem System zu installieren. Bitte wählen Sie nur eine dieser Komponenten aus.

source: It seems that a UCS DC master system has already joined into the Windows AD domain. Please choose a different option as other system roles for joining an AD domain are not available.
de: Es scheint, dass ein UCS DC Master-System bereis der Windows AD-Domäne beigetreten ist. Bitte wählen Sie eine andere Option, da weitere Systemrollen für den Joinvorgang nicht zur Verfügung stehen.

source: Join into an existing Microsoft Active Directory domain
de: Einer bestehenden Microsoft Active-Directory-Domäne beitreten

source: Join into an existing UCS domain
de: Einer bestehenden UCS-Domäne beitreten

source: Keyboard layout
de: Tastaturlayout

source: Keyboard model
de: Tastaturmodel

source: Keyboard variant
de: Tastaturvariante

source: LDAP base
de: LDAP-Basis

source: Language
de: Sprache

source: Language (english)
de: Sprache (englisch)

source: Language code
de: Sprachcode

source: Language settings
de: Spracheinstellungen

source: License agreement
de: Lizenzvereinbarung

source: Local root password
de: Lokales Root-Passwort

source: Localization settings
de: Standorteinstellungen

source: Location
de: Ort

source: Location settings
de: Standorteinstellungen

source: MII link monitoring frequency
de: MII-Trägerüberwachungsfrequenz

source: Manage users and permissions directly on this system
de: Verwalten von Benutzern und Rechten direkt auf diesem System

source: Member servers should be used for services which do not need a local authentication database, for example for file or print servers.
de: Member-Server sollten für Dienste genutzt werden, die keine lokale Datenbank für die Authentifizierung benötigen, beispielsweise Datei- oder Druckserver.

source: Mode
de: Modus

source: Modified:
de: Verändert:

source: Name of new bonding interface
de: Name des neuen Bonding-Netzwerkgerätes

source: Name of new bridge interface
de: Name des neuen Bridge-Netzwerkgerätes

source: Name of new interface
de: Name des neuen Netzwerkgerätes

source: Nameserver
de: DNS-Server

source: Netmask
de: Netzmaske

source: Network
de: Netzwerk

source: Network interface
de: Netzwerkgerät

source: Network interface configuration
de: Netzwerkgerätkonfiguration

source: Network interfaces
de: Netzwerkgeräte

source: Network settings
de: Netzwerk-Einstellungen

source: No additional software component will be installed.
de: Keine zusätzliche Software-Komponente wird installiert.

source: No additional software components will be installed.
de: Keine zusätzliche Software-Komponenten werden installiert.

source: No changes have been made.
de: Es wurden keine Änderungen durchgeführt.

source: No domain controller was found at the address of the name server. It is recommended to verify that the network settings are correct.
de: Unter der Adresse des DNS-Servers konnte kein Domänencontroller gefunden werden. Die Netzwerkeinstellungen sollten überprüft werden.

source: No domain controller was found at the address of the name server. Please adjust your network settings.
de: Unter der Adresse des DNS-Servers konnte kein Domänencontroller gefunden werden. Bitte überprüfen Sie die Netzwerkeinstellungen.

source: No domain warning
de: Warnung: Keine Domäne

source: No gateway has been specified and thus no access to the internet is possible. As UCS requires internet access for its functionality, certain services (e.g., software updates, installation of further software components) will not be able to operate as expected.
de: Es wurde kein Gateway angegeben, und daher ist ein Internetzugriff nicht möglich. Da UCS für den vollständigen Funktionsumfang Internetzugriff benötigt, kann es sein, dass bestimmte Dienste (bspw. Software-Aktualisierungen, Installation weiterer Software-Komponenten) nicht wie erwatet funtionieren werden.

source: None
de: Kein

source: Not all changes could be applied successfully:
de: Nicht alle Änderungen konnten erfolgreich übernommen werden:

source: Obtain IP address automatically (DHCP)
de: IP-Adresse automatisch beziehen (DHCP)

source: Organization
de: Organisation

source: Organization name
de: Name der Organisation

source: Organization settings
de: Einstellungen der Organisation

source: Parent interface
de: Übergeordnetes Netzwerkgerät

source: Password
de: Passwort

source: Please choose a network interface before querying a DHCP address.
de: Bitte wählen Sie ein Netzwerkgerät bevor Sie eine DHCP-Adresse anfragen.

source: Please click on the required character.
de: Bitte klicken Sie auf das gewünschte Zeichen.

source: Please confirm the chosen configuration settings which are summarized in the following.
de: Bitte bestätigen Sie die gewählten Einstellungen, die nachstehend zusammengefasst sind.

source: Please confirm to apply these changes to the system. This may take some time.
de: Bitte bestätigen Sie, dass diese Änderungen auf das System übertragen werden. Dies kann einige Zeit in Anspruch nehmen.

source: Please confirm to delete the following interfaces:
de: Bitte Löschung der folgenden Netzwerkgeräte bestätigen:

source: Please read carefully the license agreement for %s Appliance.
de: Bitte lesen Sie die nachstehende Lizenzvereinbarung für %s Appliance.

source: Please select your domain settings.
de: Bitte wählen Sie die Domäneneinstellungen.

source: Please specify the ports which will be added to the bridge.
de: Bitte geben Sie die Ports an, die zu der Bridge hinzugefügt werden.

source: Preferred DNS server
de: Bevorzugter DNS-Server

source: Primary network interface
de: Primäres Netzwerkgerät

source: Quick setup of a system for testing purposes. Several system configurations are predefined and cannot be changed at a later point.
de: Schnelle Einrichtung eines Systems zu Testzwecken. Einige Systemeinstellungen sind vorgegeben und können im Nachhinein nicht mehr geändert werden

source: Reconfigure
de: Erneut konfigurieren

source: Removed:
de: Gelöscht:

source: Restarting server components...
de: Neustart der Server-Komponenten...

source: Root password empty. Continue?
de: Root-Passwort ist leer. Möchten Sie fortfahren?

source: SSL root certificate
de: SSL-Root-Zertifikat

source: Search Domain controller master in DNS
de: Domänencontroller Master im DNS suchen

source: Send feedback
de: Feedback senden

source: Send to vendor
de: An den Hersteller senden

source: Setup - An error occurred
de: Einrichtung - Ein Fehler ist aufgetreten

source: Setup for UCS Virtual Machine Manager
de: Einrichtung für UCS Virtual Machine Manager

source: Setup successful
de: Einrichtung erfolgreich

source: Several network types can be chosen.
de: Mehrere Netzwerktypen können ausgewählt werden.

source: Should the UMC module be closed? All unsaved modification will be lost.
de: Soll das UMC-Modul geschlossen werden? Alle nicht gespeicherten Änderungen gehen verloren.

source: Should the nameserver and gateway be set: %s
de: Sollen DNS-Server und Gateway gesetzt werden: %s

source: Software component
de: Softwarekomponente

source: Software components
de: Softwarekomponenten

source: Software configuration
de: Software-Konfiguration

source: Specify the name of this system.
de: Eingabe des Namens dieses Systems.

source: Specify the network settings for this system.
de: Eingabe der Netzwerkeinstellungen dieses Systems.

source: Specify the type of this system.
de: Eingabe des Typs dieses Systems.

source: Start join at the end of the installation
de: Domänenbeitritt am Ende der Installation starten

source: State
de: Bundesland

source: Static
de: Statisch

source: Static (IPv6)
de: Statisch (IPv6)

source: System role
de: Systemrolle

source: The changes have been applied successfully.
de: Die Änderungen wurden erfolgreich übernommen.

source: The connection to the server could not be established after {time} seconds. This problem can occur due to a change of the IP address. In this case, please login to Univention Management Console again at the {linkStart}new address{linkEnd}.
de: Die Verbindung zum Server konnte nach {time} Sekunden nicht hergestellt werden. Dieses Problem kann auf eine Änderung der IP-Adresse zurück zu führen sein. Loggen Sie sich in diesem Fall erneut auf Univention Management Console unter der {linkStart}neuen Adresse{linkEnd} ein.

source: The following changes will be applied to the system:
de: Die folgenden Änderungen werden auf das System übertragen:

source: The following entries could not be validated:
de: Die folgenden Einträge konnten nicht validiert werden:

source: The following errors occurred while applying the settings.
de: Die folgenden Fehler sind beim Setzen der Konfigurationseinstellungen aufgetreten.

source: The following interfaces are already used by other interfaces and can not be deleted:
de: Die folgenden Netzwerkgeräte sind bereits von anderen Netzwerkgeräten in Verwendung und können nicht gelöscht werden:

source: The installed UCS system will not offer any web-based domain management functions and will not be able to be a domain member. Such an UCS system should only be used in some rare use cases, for example as firewall system.
de: Das installierte UCS-System wird keinerlei webbasierte Verwaltungsfunktionen anbieten und kein Mitglied einer Domäne werden. Solch ein UCS-System sollte nur in seltenen Fällen aufgesetzt werden, etwa als Firewall-System.

source: The root password is too short. For security reasons, your password must contain at least 8 characters.
de: Das Root-Passwort ist zu kurz, aus Sicherheitsgründen muss es mindestens 8 Zeichen lang sein.

source: The system configuration could not be completed. Please choose to retry the configuration process or finish the wizard.
de: Die Systemkonfiguration konnte nicht fertiggestellt werden. Bitte wählen Sie den Konfigurationsvorgang zu wiederholen oder den Einrichtungsassistenten zu beenden.

source: The system is reachable at <i>%(fqdn)s</i> or via its IP address(es) <i>%(addresses)s</i>.
de: Das System ist unter <i>%(fqdn)s</i> oder seiner/seinen IP-Adresse(n) <i>%(addresses)s</i> erreichbar.

source: There are no more physical interfaces to create.
de: Es gibt keine weiteren physikalischen Netzwerkgeräte zum Hinzufügen.

source: This may take a few seconds...
de: Dies kann einige Sekunden in Anspruch nehmen...

source: This should only be used in rare use cases, for example as firewall systems.
de: Diese Einstellung sollte nur in speziellen Szenarien, z.B. Firewall-Systemen, gewählt werden.

source: This system only has {memory_total} RAM.
de: Dieses System verfügt nur über {memory_total} Arbeitsspeicher.

source: This system will be a base system without domain integration and without the capabilities to join one in the future.
de: Dieses System wird ein Basissystem ohne jegliche Domänenintegration und ohne Möglichkeit, später einer Domäne beizutreten.

source: This system will become part of an existing non-UCS Active Directory domain.
de: Dieses System wird Teil einer existierenden nicht-UCS Active-Directory-Domäne.

source: This sytem will join an existing AD domain with the role <i>%s</i>.
de: Das System tritt einer existierenden AD-Domäne mit der Rolle <i>%s</i> bei.

source: This sytem will join an existing UCS domain with the role <i>%s</i>.
de: Das System tritt einer existierenden UCS-Domäne mit der Rolle <i>%s</i> bei.

source: Time zone
de: Zeitzone

source: Time zone and keyboard settings
de: Zeitzonen- und Tastatureinstellungen

source: Type
de: Typ

source: UCS configuration
de: UCS-Konfiguration

source: UCS has been successfully set up.
de: UCS wurde erfolgreich eingerichtet.

source: UCS setup
de: UCS-Einrichtung

source: UCS setup - An error occurred
de: UCS-Einrichtung - Ein Fehler ist aufgetreten

source: UCS setup successful
de: UCS-Einrichtung erfolgreich

source: Unconfigured
de: Unkonfiguriert

source: Update system after setup
de: System nach der Einrichtung aktualisieren

source: Use this option if you already have one or more UCS systems.
de: Wählen Sie diese Option, falls bereits mindestens ein UCS-System existiert.

source: Username
de: Benutzername

source: Validation error
de: Validierungsfehler

source: Validation failed
de: Validierungsfehler

source: Virtual LAN
de: Virtuelles LAN

source: Virtual keyboard
de: Virtuelle Tastatur

source: Waiting for restart of server components...
de: Warten auf den Neustart der Server-Komponenten ...

source: Warning
de: Warnung

source: Welcome to Univention Corporate Server (UCS).
de: Wilkommen bei Univention Corporate Server (UCS).

source: Welcome to the setup of %s Appliance.
de: Wilkommen bei der Einrichtung von %s Appliance.

source: You may restart the configuration process again with modified settings.
de: Sie können den Konfigurationsvorgang mit veränderten Einstellungen erneut starten.

source: don't set
de: nicht setzen

source: e.g., Boston...
de: bspw. Bremen...

source: http://docs.univention.de/manual-%s.html#computers:networkcomplex:uvmm
de: http://docs.univention.de/handbuch-%s.html#computers:networkcomplex:uvmm

source: more information
de: mehr Informationen

source: set
de: setzen
