Repository: univention/univention-corporate-server
Catalog: management/univention-directory-manager-modules/modules/univention/admin/handlers/shares/*.po
Languages: de

source: This specifies a UNIX group name that will be assigned as the default primary group for all users connecting to this service. This is useful for sharing files by ensuring that all access to files on the service will use the named group for their permissions checking. Thus, by assigning permissions for this group to the files and directories within this service the Samba administrator can restrict or allow sharing of these files.
de: Dies gibt den Namen einer Unix-Gruppe an, die als Standard-Primärgruppe für alle Benutzer verwendet wird, die sich mit diesem Dienst verbinden. Dies ist nützlich, für gemeinsamen Dateizugriff nützlich, da sichergestellt wird, dass jeder Zugriff auf Dateien in diesem Dienst diese Gruppe zum Prüfen der Zugriffsrechte benutzt. Also kann der Samba-Administrator durch Zuweisen von Rechten an den Dateien und Verzeichnissen dieses Dienstes für diese Gruppe, deren gemeinsame Nutzung einschränken, oder erlauben.

source: This specifies a UNIX user name that will be assigned as the default user for all users connecting to this service. This is useful for sharing files. You should also use it carefully as using it incorrectly can cause security problems.
de: Dies gibt einen Unix Benutzernamen an, der als Standard-Benutzer verwendet wird für alle Benutzer, die sich mit diesem Dienst verbinden. Die Option ist nützlich für Dateien, die von mehreren Benutzern verwendet werden sollen. Diese Option sollte vorsichtig verwendet werden, da eine unsachgemäße Handhabung Sicherheitsprobleme verursachen kann.

source: This value controls the handling of file locking in the server. If strict locking is set to Auto (the default), the server performs file lock checks only on non-oplocked files. As most Windows redirectors perform file locking checks locally on oplocked files this is a good trade-off for improved performance. If set to yes, the server will check every read and write access for file locks, and deny access if locks exist. This can be slow on some systems. If strict locking is disabled, the server performs file lock checks only if the client explicitly asks for them.
de: Dieser Schalter bestimmt die Überprüfung von Datei-Locking bei Schreibzugriffen. Wenn Strict Locking auf 'Auto' (Standardwert) gesetzt ist, führt der Server Datei-Locking überprüfungen nur für Dateien durch, die keinen Oplock besitzen. Da die meisten Windows Redirectoren für Dateizugriff Locking-Überprüfungen lokal bei Dateien mit Oplock durchführen, ist 'Auto' ein guter Kompromiss zur Verbesserung der Performance. Ist Strict Locking aktiv, werden bei allen Zugriffen die existierenden Locks überprüft, und der Zugriff unterbunden, wenn Locks existieren. Dies kann auf einigen Systemen langsam sein. Wenn Strict Locking deaktiviert ist, findet die Überprüfung nur auf Anfrage des Clients statt.

source: Use synchronous or asynchronous mode for the NFS share.
de: Verwende synchronen oder asynchronen Modus für die NFS-Freigabe.

source: Users who have write access to a file or directory are able to change the permissions
de: Benutzer, die Schreibrechte an Dateien und/oder Verzeichnissen haben, dürfen die Zugriffsrechte verändern

source: Users with write access may modify permissions
de: Benutzer mit Schreibrechten dürfen die Berechtigungen verändern

source: VFS objects
de: VFS-Objekte

source: Valid users or groups
de: Gültige Benutzer oder Gruppen

source: When a directory is created, the necessary permissions are calculated according to the mapping from DOS modes to UNIX permissions, and the resulting UNIX mode is then bit-wise 'AND'ed with this parameter. This parameter may be thought of as a bit-wise MASK for the UNIX modes of a directory. Any bit not set here will be removed from the modes set on a directory when it is created.
de: Wird ein Verzeichnis erstellt, erfolgt die Vergabe von Unix-Dateirechten anhand der gegebenen DOS-Dateirechte und anschließendem Bit-weisem UND mit den hier angegebenen Rechten. Dieser Parameter kann als Bitmaske für die Unix-Rechte eines Verzeichnisses betrachtet werden. Ein Bit, das hier nicht gesetzt ist, wird aus den Rechten entfernt, wenn das Verzeichnis angelegt wird.

source: When a file is created, the necessary permissions are calculated according to the mapping from DOS modes to UNIX permissions, and the resulting UNIX mode is then bit-wise 'AND'ed with this parameter. This parameter may be thought of as a bit-wise MASK for the UNIX modes of a file. Any bit not set here will be removed from the modes set on a file when it is created.
de: Wird eine Datei erstellt, erfolgt die Vergabe von Unix-Dateirechten anhand der gegebenen DOS-Dateirechte und anschließendem Bit-weisem UND mit den hier angegebenen Rechten. Dieser Parameter kann als Bitmaske für die Unix-Rechte einer Datei betrachtet werden. Ein Bit, das hier nicht gesetzt ist, wird aus den Rechten entfernt, wenn die Datei angelegt wird.

source: When only a subtree of a mounted filesystem is exported this option ensures that an accessed file really is in that subtree. (May cause complications with renamed files.)
de: Wird nur ein Unterverzeichnis eines eingebundenen Dateisystems exportiert, so stellt diese Option sicher, dass eine Datei auf die zugegriffen wird wirklich innerhalb dieses Unterverzeichnisses liegt. (Kann Probleme mit umbenannten Dateien verursachen.)

source: disable
de: deaktivieren

source: documents
de: Dokumente

source: https://docs.software-univention.de/manual-4.4.html#print::shares
de: https://docs.software-univention.de/handbuch-4.4.html#print::shares

source: manual
de: manuell

source: programs
de: Programme

source: use
de: nutzt

source: user
de: Benutzer

source: users
de: Benutzer

source: uses
de: benutzt
