Repository: univention/univention-corporate-server
Catalog: management/univention-directory-manager-modules/modules/univention/admin/handlers/shares/*.po
Languages: de

source: and %s more
de: und %s mehr

source: %(name)s (%(path)s on %(host)s)
de: %(name)s (%(path)s auf %(host)s)

source: %(name)s is member of the following quota printer groups %(groups)s
de: %(name)s ist Mitglied der folgenden Quota-Druckergruppen %(groups)s

source: %(name)s is not a valid printer on Spoolhost %(host)s.
de: %(name)s ist kein gültiger Drucker auf dem Server %(host)s.

source: %(name)s is the last member of the printer group %(group)s.
de: %(name)s ist das letzte Mitglied in der Druckergruppe %(group)s.

source: %s is disabled for quota support.
de: Quota an %s ist deaktiviert.

source: Access control
de: Zugriffskontrolle

source: Access control for users and groups
de: Zugriffskontrolle für Benutzer und Gruppen

source: Access list can allow or deny listed users and groups.
de: Zugriffslisten können Benutzer oder Gruppen freischalten oder zurückweisen.

source: Access rights to the exported root directory
de: Zugriffsberechtigungen für das exportierte Wurzelverzeichnis der Freigabe

source: Allow all users.
de: Zugriff für alle Benutzer/Gruppen zulassen.

source: Allow anonymous read-only access with a guest user
de: Anonymen Nur-Lese-Zugriff mit Gastbenutzer erlauben

source: Allow guest access
de: Gastzugriff erlauben

source: Allow only chosen users/groups.
de: Zugriff nur für ausgewählte Benutzer/Gruppen zulassen.

source: Allowed host/network
de: Zugelassene(r/s) Rechner/Netz

source: Allowed/denied groups
de: Zugelassene/abgewiesene Gruppen

source: Allowed/denied users
de: Zugelassene/abgewiesene Benutzer

source: Block size
de: Blockgröße

source: Client-side caching policy
de: Richtlinie für das Caching beim Client

source: Configure additional settings for this share which are added to the /etc/exports file.
de: Konfigurieren von zusätzlichen Einstellungen für diese Freigabe, die der Datei /etc/exports hinzugefügt werden.

source: Configure additional smb.conf settings for this share, which are added in the form key = value
de: Konfigurieren von zusätzlichen smb.conf Einstellungen für diese Freigabe. Diese werden in der Form Schlüssel = Wert der Freigabendefinition hinzugefügt.

source: Connection
de: Verbindung

source: Create files/directories with permissions of the parent directory
de: Neue Dateien und Verzeichnisse erhalten die Zugriffsrechte des übergeordneten Verzeichnisses

source: Create files/directories with the owner of the parent directory
de: Neue Dateien und Verzeichnisse erhalten den Besitzer des übergeordneten Verzeichnisses

source: Custom settings for NFS shares
de: Erweiterte Einstellungen für NFS-Freigaben

source: Custom settings for Samba shares
de: Erweiterte Einstellungen für Samba-Freigaben

source: Define if the share is writable when accessed via NFS.
de: Gibt an, ob die Freigabe beim Zugriff über NFS schreibbar ist.

source: Define if the share is writable when accessed via Samba.
de: Erlaubt den Schreibzugriff auf die Freigabe über Samba.

source: Denied host/network
de: Nicht zugelassene(r/s) Rechner/Netz

source: Deny chosen users/groups.
de: Zugriff für ausgewählte Benutzer/Gruppen verweigern.

source: Description
de: Beschreibung

source: Directory
de: Pfad

source: Directory mode
de: Verzeichnis-Modus

source: Directory owner group of the share's root directory
de: Besitzergruppe für das Wurzelverzeichnis der Freigabe

source: Directory owner of the share's root directory
de: Besitzer des Wurzelverzeichnis der Freigabe

source: Directory security mode
de: Verzeichnis-Sicherheitsmodus

source: Directory that is exported.
de: Verzeichnis, das freigegeben wird.

source: Enable quota support
de: Quota aktivieren

source: Export for NFS clients (NFSv3 and NFSv4)
de: Für NFS-Clients exportieren (NFSv3 und NFSv4)

source: Export for Samba clients
de: Für Samba-Clients exportieren

source: Export share as MSDFS root. Please consult the "Fileshare management" chapter in the manual for more information
de: Freigabe als MSDFS-Wurzel freigeben. Bitte beachten Sie das Kapitel "Freigaben-Verwaltung" in der Dokumenation für mehr Informationen

source: File mode
de: Dateimodus

source: Files and directories with no read access are hidden. New files and directories receive permissions of the superordinate directory.
de: Nicht lesbare Dateien und Verzeichnisse werden versteckt. Neue Dateien und Verzeichnisse erhalten die Zugriffsrechte des übergeordneten Verzeichnisses.

source: For information about how to manage Windows printer drivers and troubleshooting, see <a href="https://help.univention.com/t/overview-windows-printer-driver-distribution-known-issues-and-workarounds/13387" target="_blank" rel="noreferrer noopener">here</a>.
de: Informationen über die Verwaltung von Windows-Druckertreibern und eine Anleitung zur Fehlerbehebung finden Sie <a href="https://help.univention.com/t/overview-windows-printer-driver-distribution-known-issues-and-workarounds/13387" target="_blank" rel="noreferrer noopener">hier</a>.

source: For the given groups printing is explicitly allowed or denied.
de: Für die angegebenen Gruppen wird der Zugriff erlaubt oder abgewiesen.

source: For the given users printing is explicitly allowed or denied.
de: Für die angegebenen Benutzer wird der Zugriff erlaubt oder abgewiesen.

source: Force directory mode
de: Erzwinge Verzeichnismodus

source: Force directory security mode
de: Erzwinge Verzeichnis-Sicherheitsmodus

source: Force file mode
de: Erzwinge Dateimodus

source: Force group
de: Erzwungene Gruppe

source: Force security mode
de: Erzwinge Sicherheitsmodus

source: Force user
de: Erzwungener Benutzer

source: General
de: Allgemein

source: General NFS settings
de: NFS-Grundeinstellungen

source: General Samba settings
de: Samba-Grundeinstellungen

source: General directory share settings
de: Grundeinstellungen - Verzeichnisfreigabe

source: General printer group share settings
de: Grundeinstellungen - Druckergruppen-Freigabe

source: General printer share settings
de: Grundeinstellungen - Druckerfreigabe

source: General settings
de: Grundeinstellungen

source: Group members
de: Gruppenmitglieder

source: Hide files
de: Verstecke Dateien

source: Hide unreadable files/directories
de: Verstecke nicht lesbare Dateien und Verzeichnisse

source: Host
de: Server

source: Inherit ACLs
de: Ererbte ACLs

source: Invalid users or groups
de: Nicht erlaubte Benutzer oder Gruppen

source: It is not valid to set %s as a share.
de: Es ist nicht erlaubt, %s als Freigabe einzutragen

source: Location
de: Standort

source: MSDFS root
de: MSDFS-Wurzel

source: May contain hostnames, IP addresses or networks (e.g. 10.1.1.1/24 or 10.1.1.1/255.255.255.0
de: Kann Hostnamen, IP-Adressen oder Netze enthalten (z.B. 10.1.1.1/24 oder 10.1.1.1/255.255.255.0

source: Modify user ID for root user (root squashing)
de: User-ID für Root-Benutzer ändern (Root-Squashing)

source: NFS custom settings
de: Erweiterte NFS-Einstellungen

source: NFS write access
de: NFS-Schreibzugriff

source: Name of the share
de: Name der Freigabe

source: Need %(samba)s or %(nfs)s in options to create a share.
de: Benötige %(samba)s oder %(nfs)s in Optionen um eine Freigabe anzulegen.

source: New files and directories inherit the mode of the parent directory.
de: Neue Dateien und Verzeichnisse erhalten die Zugriffsrechte des übergeordneten Verzeichnisses.

source: Only allow access for this host, IP address or network
de: Zugriff begrenzen auf Rechner, IP-Adresse oder Netz

source: Oplocks are the way that Samba clients get permission from a server to locally cache file operations. If a server grants an oplock (opportunistic lock) then the client is free to assume that it is the only one accessing the file and it will aggressively cache file data. With some oplock types the client may even cache file open/close operations. This can give enormous performance benefits. When you activate this parameter, Samba will always grant oplock requests no matter how many clients are using the file. It is generally much better to use the real oplocks support rather than this parameter. If you enable this option on all read-only shares or shares that you know will only be accessed from one client at a time such as physically read-only media like CDROMs, you will see a big performance improvement on many operations. If you enable this option on shares where multiple clients may be accessing the files read-write at the same time you can get data corruption. Use this option carefully!
de: Mit Hilfe von Oplocks erhalten Samba-Clients die Erlaubnis vom Server Dateizugriffe lokal zwischen zu speichern. Wenn ein Server ein Oplock (opportunistic lock) genehmigt, kann der Client davon ausgehen, dass er der einzige ist, der darauf zugreift, und wird massiv Daten dieser Datei zwischenspeichern. Bei einigen Oplock-Arten kann der Client sogar das Öffnen und Schliessen von Dateien zwischenspeichern. Dies kann enorme Geschwindigkeitsvorteile bedeuten. Wird dieser Parameter aktiviert, so genehmigt Samba jede Oplock-Anfrage, egal wie viele Clients eine Datei benutzen. Es ist im Algemeinen viel besser die echte Oplock-Unterstützung zu verwenden, als diesen Parameter zu aktivieren. Wenn diese Option bei allen Nur-Lese-Freigaben aktiviert wird, oder bei Freigaben von denen sicher ist, dass nur ein Client zur selben Zeit auf sie zugreift, wie ein physikalisches Nur-Lese-Laufwerk etwa ein CDROM-Laufwerk, kann ein deutlicher Geschwindigkeitsvorteil bei vielen Operationen beobachtet werden. Wird diese Option auf Freigaben aktiviert, wo mehrere Clients Schreib-Lese-Zugriff zur selben Zeit haben, kann das zu Datenkorruption führen. Diese Option sollte vorsichtig verwendet werden!

source: Option name in exports file
de: Optionsname aus exports Datei

source: Option name in smb.conf and its value
de: Optionsname aus smb.conf und ihr Wert

source: Ownership for new files and directories is controlled by the ownership of the parent directory.
de: Neue Dateien und Verzeichnisse erhalten den Besitzer des übergeordneten Verzeichnisses.

source: Permissions for the share's root directory
de: Dateiberechtigungen für das Wurzelverzeichnis der Freigabe

source: Postexec script
de: Postexec-Skript

source: Preexec script
de: Preexec-Skript

source: Price per page
de: Preis pro Seite

source: Price per print job
de: Preis pro Druckauftrag

source: Print server
de: Druckserver

source: Printable name
de: Anzeigename

source: Printer
de: Drucker

source: Printer model
de: Drucker-Modell

source: Printer producer
de: Drucker-Hersteller

source: Printer share
de: Druckerfreigabe

source: Printer share group
de: Druckerfreigabegruppe

source: Printer share groups
de: Druckerfreigabegruppen

source: Printer share: Printer
de: Druckerfreigabe: Drucker

source: Printer share: Printer group
de: Druckerfreigabe: Druckergruppe

source: Printer shares
de: Druckerfreigaben

source: Printers
de: Drucker

source: Redirect root user access to a non-privileged uid.
de: Zugriff auf eine nicht privilegierte uid Kennung umlenken.

source: Restrict write access to these users/groups
de: Schreibberechtigung auf diese Benutzer/Gruppen beschränken

source: Samba custom settings
de: Erweiterte Samba-Einstellungen

source: Samba extended permission settings
de: Samba erweiterte Zugriffsrechte

source: Samba extended permissions
de: Erweiterte Samba-Rechte

source: Samba options
de: Samba-Optionen

source: Samba permission settings
de: Samba-Zugriffsrechte

source: Samba permissions
de: Samba-Rechte

source: Samba write access
de: Samba-Schreibzugriff

source: Security mode
de: Sicherheitsmodus

source: Share directories
de: Freigabe-Verzeichnisse

source: Share directory
de: Freigabe-Verzeichnis

source: Share is browseable, i.e. it is listed in the Windows network environment
de: Freigabe wird in der Windows-Netzwerkumgebung angezeigt

source: Share: Directory
de: Freigabe: Verzeichnis

source: Show in Windows network environment
de: Freigabe wird in der Windows-Netzwerkumgebung angezeigt

source: Specifies which VFS Objects to use.
de: Spezifiziert welche VFS-Objekte benutzt werden sollen

source: Subtree checking
de: Subtree-Überprüfung

source: The %(plural)s %(user)s%(num)s %(use)s this share as home share!
de: Die/Der %(plural)s %(user)s%(num)s %(use)s diese Freigabe als Heimatverzeichnisfreigabe

source: The computer that exports this share
de: Der Rechner, auf dem die Freigabe eingerichtet wird.

source: The owner of the exported root directory. If none is given root will be owner.
de: Besitzer des Wurzelverzeichnisses der Freigabe. Vorgabe ist root.

source: The primary group of the exported root directory, if none is given group 0 will be used.
de: Primäre Besitzergruppe für das Wurzelverzeichnis der Freigabe. Ohne Angabe wird 0 verwendet.

source: The way clients capable of offline caching will cache the files in the share.
de: Bestimmt das Verfahren, mit dem Clients Dateiinhalte lokal zwischenspeichern.

source: This boolean option tells Samba whether to issue oplocks (opportunistic locks) to file open requests on this share. The oplock code can dramatically (approx. 30% or more) improve the speed of access to files on Samba servers. It allows the clients to aggressively cache files locally and you may want to disable this option for unreliable network environments (it is turned on by default in Windows Servers).
de: Dieser Schalter sagt Samba, ob Oplocks (opportunistic locks) gegen Datei-Öffnungsanfragen für diese Freigabe ausgestellt werden sollen. Der Oplock-Code kann den Zugriff auf Dateien auf Samba-Servern dramatisch (etwa 30% oder mehr) beschleunigen. Dies erlaubt den Clients Dateien massiv lokal zwischen zu speichern und es ist ratsam diese Option in unzuverlässigen Netzen zu deaktivieren. (Sie ist auf Windows Servern standardmäßig aktiviert)

source: This boolean parameter controls whether Samba will attempt to map UNIX permissions into Windows NT access control lists.
de: Kontrolliert, ob Samba die UNIX-Dateirechte in Windows NT-Zugriffsrechte (access control lists) umsetzt.

source: This controls whether or not locking will be performed by the server in response to lock requests from the client. Be careful about disabling locking, as lack of locking may result in data corruption.
de: Kontrolliert, ob der Server Datei-Locking betreiben soll, wenn Clients Locking-Requests senden. Deaktivieren von Datei-Locking wird nicht empfohlen, da es zu Datenverlusten führen kann.

source: This is the NetBIOS name. Among other places, it appears in the Windows Network Neighborhood.
de: Der NetBIOS-Name. Er erscheint unter anderem in der Windows-Netzwerkumgebung.

source: This option specifies a command to be run whenever the service is connected to. It takes the usual substitutions.
de: Das angegebene Skript wird bei jedem Verbindungsaufbau zu dieser Freigabe ausgeführt. Die üblichen Platzhalter werden ersetzt.

source: This option specifies a command to be run whenever the service is disconnected. It takes the usual substitutions.
de: Das angegebene Skript wird nach jedem Verbindungsende zu dieser Freigabe ausgeführt. Die üblichen Platzhalter werden ersetzt.

source: This parameter can be used to ensure that if default ACLs exist on parent directories, they are always honored when creating a subdirectory. The default behavior is to use the mode specified when creating the directory. Enabling this option sets the mode to 0777, thus guaranteeing that default directory ACLs are propagated.
de: Dieser Parameter kann benutzt werden, um sicherzustellen, dass wenn Standard-ACLs auf übergeordneten Ordern bestehen, diese immer berücksichtigt werden, wenn ein Unterverzeichnis erzeugt wird. Das Standardverhalten ist, die Rechte zu verwenden, die beim Erzeugen des Verzeichnisses angegeben wurden. Das Aktivieren dieser Option setzt die Rechte auf 0777, garantiert also, dass die Standard-ACLs des Verzeichnisses weitergegeben werden.

source: This parameter controls the behavior of Samba when given a request by a client to obtain a byte range lock on a region of an open file, and the request has a time limit associated with it. If this parameter is set and the lock range requested cannot be immediately satisfied, samba will internally queue the lock request, and periodically attempt to obtain the lock until the timeout period expires.
de: Bestimmt das Verhalten des Servers bei Locking-Anfragen auf Dateibereiche, die von anderen Locks blockiert werden. Ist dieser Parameter aktiviert und die Lock-Anfrage kann nicht sofort erfüllt werden, kommt die Anfrage in eine Warteschlage, und es wird regelmäßig versucht, das Lock zu bekommen, bis ein Timeout auftritt.

source: This parameter controls what UNIX permission bits can be modified when an SMB client is manipulating the UNIX permission on a directory using the native Windows security dialog box. This parameter is applied as a mask (AND'ed with) to the changed permission bits, thus preventing any bits not in this mask from being modified. Essentially, zero bits in this mask may be treated as a set of bits the user is not allowed to change.
de: Die hier definierten Verzeichnisrechte werden bei Änderungen mit den durch Windows übermittelten Rechten durch Bit-weises UND abgeglichen. Es können von Windows-Clients daher Zugriffsrechte, die nicht in dieser Maske sind, nicht geändert werden. Im Prinzip können Nullbits in dieser Maske betrachtet werden als Bits, die der Benutzer nicht ändern darf.

source: This parameter controls what UNIX permission bits can be modified when an SMB client is manipulating the UNIX permission on a directory using the native Windows security dialog box. This parameter is applied as a mask (OR'ed with) to the changed permission bits, thus forcing any bits in this mask that the user may have modified to be on. Essentially, one bits in this mask may be treated as a set of bits that, when modifying security on a directory, the user has always set to be 'on'.
de: Dieser Parameter kontrolliert, welche Unix-Rechte-Bits geändert werden dürfen, wenn ein SMB-Client die Unix-rechte eines Verzeichnisses mittels des Windows Sicherheits Dialogs anpasst. Dieser Parameter wird als Maske ( Oder-Maske ) auf die geänderten Rechte-Bits angewendet, schaltet also alle Bits in der Maske, die der Benutzer geändert haben könnte an. Im Prinzip bedeuten eingeschaltete Bits in dieser Maske, wenn die Sicherheit eines Verzeichnisses geändert wird, dass diese Bits immer 'an' bleiben.

source: This parameter controls what UNIX permission bits can be modified when an SMB client is manipulating the UNIX permission on a file using the native Windows security dialog box. This parameter is applied as a mask (AND'ed with) to the changed permission bits, thus preventing any bits not in this mask from being modified. Essentially, zero bits in this mask may be treated as a set of bits the user is not allowed to change.
de: Die hier definierten Dateirechte werden bei Änderungen mit den durch Windows übermittelten Rechten durch Bit-weises UND abgeglichen. Es können von Windows-Clients daher Zugriffsrechte, die nicht in dieser Maske sind, nicht geändert werden. Im Prinzip können Nullbits in dieser Maske betrachtet werden als Bits, die der Benutzer nicht ändern darf.

source: This parameter controls what UNIX permission bits can be modified when an SMB client is manipulating the UNIX permission on a file using the native Windows security dialog box. This parameter is applied as a mask (OR'ed with) to the changed permission bits, thus forcing any bits in this mask that the user may have modified to be on. Essentially, one bits in this mask may be treated as a set of bits that, when modifying security on a file, the user has always set to be 'on'.
de: Dieser Parameter kontrolliert, welche Unix-Rechte-Bits geändert werden dürfen, wenn ein SMB-Client die Unix-rechte einer Datei mittels des Windows Sicherheits Dialogs anpasst. Dieser Parameter wird als Maske ( Oder-Maske ) auf die geänderten Rechte-Bits angewendet, schaltet also alle Bits in der Maske, die der Benutzer geändert haben könnte an. Im Prinzip bedeuten eingeschaltete Bits in dieser Maske, wenn die Sicherheit einer Datei geändert wird, dass diese Bits immer 'an' bleiben.

source: This parameter controls whether Samba supports level2 (read-only) oplocks on a share. Level2, or read-only oplocks allow SMB clients that have an oplock on a file to downgrade from a read-write oplock to a read-only oplock once a second client opens the file (instead of releasing all oplocks on a second open, as in traditional, exclusive oplocks). This allows all openers of the file that support level2 oplocks to cache the file for read-ahead only (ie. they may not cache writes or lock requests) and increases performance for many accesses of files that are not commonly written (such as application .EXE files). Once one of the clients which have a read-only oplock writes to the file all clients are notified (no reply is needed or waited for) and told to break their oplocks to "none" and delete any read-ahead caches. It is recommended that this parameter be turned on to speed access to shared executables.
de: Erlaubt die Verwendung von Level 2 oplocks (read-only oplocks). Level 2, oder nur-lese Opplocks erlauben SMB-Clients die ein Oplock auf eine Datei haben dieses von einem schreib-lese Oplock in ein nur-lese Oplock zu verringern, wenn ein zweiter Client diese Datei öffnet (anstatt alle Oplocks bei einem zweiten Öffnen freizugeben, wie bei den traditionellen exclusiven Oplocks). Dies erlaubt allen Clients, die eine Datei öffnen und Level 2 Oplocks unterstützen, diese Datei lokal zwischenzuspeichern für read-ahead (also nicht für Schreib-, oder Lockingzugriffe) und verbessert die Performance bei vielen Zugriffen auf Dateien auf die normalerweise kein Schreibzugriff stattfindet (wie .EXE Dateien von Anwendungen). Wenn einer der Clients, die ein nur-lese Oplock haben, in die Datei schreibt, werden alle anderen benachrichtigt (es wird keine Antwort benötigt oder erwartet) und angewiesen ihr Oplock abzugeben und alle Lese-Zwischenspeicher zu löschen. Es ist ratsam diese Option zu Aktivieren um den Zugriff auf gemeinsame Programme zu beschleunigen.

source: This parameter specifies a set of UNIX mode bit permissions that will always be set on a directory created by Samba. This is done by bitwise 'OR'ing these bits onto the mode bits of a directory that is being created or having its permissions changed. The modes in this parameter are bitwise 'OR'ed onto the directory mode after the mask set in the create mask parameter is applied.
de: Die hier definierten Verzeichnisrechte werden mit den übermittelten DOS-Rechten durch Bit-weises ODER abgeglichen, so dass Verzeichnisse immer mindestens diese Zugriffsrechte bekommen. Dies wird nach der 'Verzeichnismodus' Maske ausgewertet.

source: This parameter specifies a set of UNIX mode bit permissions that will always be set on a file created by Samba. This is done by bitwise 'OR'ing these bits onto the mode bits of a file that is being created or having its permissions changed. The modes in this parameter are bitwise 'OR'ed onto the file mode after the mask set in the create mask parameter is applied.
de: Die hier definierten Dateirechte werden mit den übermittelten DOS-Rechten durch Bit-weises ODER abgeglichen, so dass Dateien immer mindestens diese Zugriffsrechte bekommen. Dies wird nach der 'Dateimodus' Maske ausgewertet.
