Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-appcenter/umc/python/appcenter/*.po
Languages: fr

source: %d Apps: Connecting to %s
fr: %d Apps : connexion à %s

source: %d Apps: Running tests
fr: %d Apps : exécution des tests

source: %s could not be downloaded. This seems to be a problem with the App Center server. Please try again later.
fr: Impossible de télécharger %s. Il semble que le problème soit lié au serveur d'App Center. Veuillez réessayer ultérieurement.

source: %s: Connecting to %s
fr: %s : connexion à %s

source: %s: Running tests
fr: %s : exécution des tests

source: A conflict between the system network settings and the docker bridge default network has been detected.
fr: Un conflit a été détecté entre les réglages réseau du système et le réseau par défaut du pont Docker.

source: Another package operation is in progress
fr: Une autre opération sur les paquetages est en cours

source: Cannot connect to the LDAP service.
fr: Impossible de se connecter au service LDAP.

source: Could not find an application for %s
fr: Impossible de trouver l'application pour %s

source: Could not load suggestions.
fr: Impossible de charger les suggestions.

source: Installing %s
fr: Installation de %s

source: Installing LDAP packages on %s
fr: Installation des paquetages LDAP sur %s

source: Make sure docker.io is installed, try starting the service with "service docker start".
fr: Veuillez vous assurer que « docker.io » est installé, et essayez de démarrer le service à l'aide de « service docker start ».

source: Maybe the machine password changed during the session.
fr: Le mot de passe de la machine a peut-être changé au cours de la session.

source: Maybe your password changed during the session.
fr: Votre mot de passe a peut-être changé au cours de la session.

source: Package not found in repository
fr: Paquetage non trouvé dans le dépôt

source: Please check the join state of the machine.
fr: Veuillez vérifier l'état de jonction de la machine.

source: Please either configure a different network for the docker bridge by setting the UCR variable docker/daemon/default/opts/bip to a different network and restart the system,
fr: Veuillez soit configurer un réseau différent pour le pont Docker, en modifiant le réseau défini dans la variable UCR docker/daemon/default/opts/bip et en redémarrant le système,

source: Problems connecting to {0} ({1}). Please update {0}!
fr: Problèmes de connexion à {0} ({1}). Veuillez mettre à jour {0} !

source: Problems connecting to {} ({}).
fr: Problèmes de connexion à {} ({}).

source: The App Center version of the this host ({}) is not compatible with the version of {} ({})
fr: La version de l’App Center sur cet hôte ({}) n’est pas compatible avec la version de {} ({})

source: The credentials provided were not accepted.
fr: Les preuves d'identité fournies n'ont pas été acceptées.

source: The docker service is not running! The App Center will not work properly.
fr: Le service « docker » n'est pas lancé ! App Center ne fonctionnera pas convenablement.

source: The server seems to be lacking a proper password file.
fr: Le serveur ne semble pas contenir un fichier de mots de passe correct.

source: There already is a component with this name
fr: Il existe déjà un composant du même nom

source: There is no repository at this server (or at least none for the current UCS version)
fr: Il n'y a aucun dépôt de paquetages sur ce serveur (du moins aucun pour la version actuelle d'UCS)

source: This is a problem with the App Center server. Please try again later.
fr: Ce problème provient du serveur d'App Center. Veuillez réessayer ultérieurement.

source: This is probably due to the DNS settings of your server. You may find help at %s.
fr: Ceci est probablement lié aux réglages DNS de votre serveur. Vous pouvez trouver de l'aide à l'adresse %s.

source: This may be a problem with the firewall or proxy of your system. You may find help at %s.
fr: Le problème provient peut-être du pare-feu ou du serveur mandataire de votre système. Vous pouvez trouver de l'aide à l'adresse %s.

source: This may be solved by simply logging out and in again.
fr: Ce problème peut être réglé par une simple déconnexion / reconnexion.

source: Unable to start the docker service!
fr: Impossible de démarrer le service Docker !

source: Unexpected suggestions data.
fr: Données de suggestions inattendues.

source: Uninstalling %s
fr: Désinstallation de %s

source: Upgrading %s
fr: Mise à jour de %s

source: installed
fr: installé

source: not installed
fr: non installé

source: or disable the docker support in the AppCenter by setting appcenter/docker to false.
fr: ou désactiver la prise en charge de Docker dans l’App Center en réglant appcenter/docker sur « false ».

source: upgradable
fr: mise à jour possible
