Repository: univention/univention-corporate-server
Catalog: */univention-updater/umc/js/*.po
Languages: de

source: %(name)s: Version %(old)s can be updated to %(new)s
de: %(name)s: Version %(old)s kann auf %(new)s aktualisiert werden

source: ... loading data ...
de: ... Daten werden geladen ...

source: ... loading log file ...
de: ... Protokolldatei wird geladen ...

source: 1 package to be REMOVED
de: 1 Paket wird ENTFERNT

source: 1 package to be installed
de: 1 Paket wird NEU installiert

source: 1 package to be updated
de: 1 Paket wird aktualisiert

source: <b>Leave the system up and running</b> at any moment during the update!
de: <b>Lassen Sie das System eingeschaltet</b> während des gesamten Aktualisierungsvorganges!

source: <b>Warning</b>: You are currently using UCS {0}. No more regular security updates will be released for this version!<br>Update the system to a newer UCS version or, alternatively, request an extended maintenance for this version. <a target='_blank' href='https://www.univention.com/contact/'>Feel free to contact us if you want to know more</a>.
de: <b>Achtung</b>: Sie verwenden aktuell UCS {0}. Für diese Version werden keine regulären Sicherheitsupdates mehr veröffentlicht!<br>Sie können das System auf eine neuere UCS Version aktualisieren oder alternativ eine verlängerte Maintenance für diese Version anfordern. <a target='_blank' href='https://www.univention.de/kontakt/'>Nehmen Sie dazu gerne Kontakt zu uns auf</a>.

source: <b>Warning</b>: You are currently using UCS {0}. No more security updates will be released for this version. Please update the system to a newer UCS version!
de: <b>Achtung</b>: Sie verwenden aktuell UCS {0}. Für diese Version werden keine Sicherheitsupdates mehr veröffentlicht. Bitte aktualisieren Sie das System auf eine neuere UCS Version!

source: <br>Enterprise subscriptions offer extended maintenance for some UCS versions. Detailed information can be found at the <a target='_blank' href='https://www.univention.com/products/prices-and-subscriptions/'>Univention Website</a>.
de: <br>Enterprise Subskriptionen bieten für einige Versionen längere Aktualisierungszeiträume. Informationen dazu finden Sie auf der <a target='_blank' href='https://www.univention.de/produkte/preise/'>Univention Webseite</a>.

source: <p><b>Caution!</b> Currently a release update is performed!</p>
de: <p><b>Achtung!</b> Momentan wird ein System-Update ausgeführt!</p>

source: <p>Leave the system up and running until the update is completed!</p>
de: <p>Lassen Sie das System eingeschaltet bis das Update abgeschlossen ist!</p>

source: An update for UCS is available. Please visit the %s to install the updates.
de: Ein Update für UCS ist verfügbar. Es kann über das %s im System eingespielt werden.

source: An update for the app is available which may solve this issue.
de: Für die App ist eine Aktualisierung verfügbar, die das Problem beheben könnte.

source: An update of the system is being executed.
de: Eine Aktualisierung des Systems wird durchgeführt.

source: App Center updates
de: App Center-Aktualisierungen

source: Are you sure to close the updater log view?
de: Soll die Aktualisierungsansicht geschlossen werden?

source: Available system updates
de: Verfügbare System-Updates

source: Back
de: Zurück

source: Cancel
de: Abbrechen

source: Check for package updates
de: Paket-Aktualisierungen prüfen

source: Closing not possible while running a update.
de: Schließen nicht möglich solange ein Aktualisierungsvorgang läuft.

source: Component '%(component)s' is not yet available for newer release versions.
de: Komponente '%(component)s' ist noch nicht für neuere Release-Aktualisierungen bereitgestellt worden.

source: Consider <a href="https://docs.software-univention.de/" target="_blank">release notes and changelogs</a> as well as references posted in the <a href="http://forum.univention.de/viewforum.php?f=54" target="_blank">Univention Forum</a>.
de: Bitte beachten Sie auch <a href="https://docs.software-univention.de/" target="_blank">Release Notes und Changelog</a> sowie Hinweise zu dem jeweiligen Update im <a href="http://forum.univention.de/viewforum.php?f=26" target="_blank">Univention Forum</a>.

source: Consider <a href="https://docs.software-univention.de/release-notes-%s-en.html" target="_blank">release notes and changelogs</a> as well as references posted in the <a href="http://forum.univention.de/viewforum.php?f=54" target="_blank">Univention Forum</a>.
de: Bitte beachten Sie auch <a href="https://docs.software-univention.de/release-notes-%s-de.html" target="_blank">Release Notes und Changelog</a> sowie Hinweise zu dem jeweiligen Update im <a href="http://forum.univention.de/viewforum.php?f=26" target="_blank">Univention Forum</a>.

source: Depending on the system performance, network connection and the installed software the update may take from 30 minutes up to several hours.
de: Je nach Systemgeschwindigkeit, Netzwerkanbindung und installierter Software kann das Update zwischen dreißig Minuten und mehreren Stunden dauern.

source: Detailed information about the updates.
de: Detaillierte Informationen zu den Aktualisierungen.

source: Do you really want to perform the update/install/remove of the above packages?
de: Möchten Sie wirklich die genannten Pakete aktualisieren, installieren bzw. entfernen?

source: Finish updates
de: Beende Updates

source: For the changes to take effect, it is recommended to perform a restart of the UMC server components.
de: Damit die Änderungen wirksam werden, ist es empfohlen einen Neustart der UMC-Server-Komponenten durchzuführen.

source: Further release updates are available but cannot be installed because the component '{0}' is not available for newer release versions.
de: Weitere Releaseupdates sind verfügbar, können jedoch nicht installiert werden, da die Komponente '{0}' noch nicht für neuere Releaseversionen bereitgestellt wurde.

source: Further release updates are available but cannot be installed.
de: Weitere Releaseupdates sind verfügbar, können jedoch nicht installiert werden.

source: In order to complete the recently executed action, it is required to reboot the system.
de: Um die kürzlich ausgeführte Aktion abzuschließen, ist es erforderlich, das System neu zu starten.

source: Install
de: Installieren

source: Install package updates
de: Paket-Aktualisierungen installieren

source: Install release update
de: Release-Aktualisierungen installieren

source: Investigate log further
de: Protokoll weiter prüfen

source: It is expected that the system may not respond (via web browser, SSH, etc.) during a period of up to several minutes during the update as services are stopped, updated, and restarted.
de: Es wird davon ausgegangen, dass das System während der Aktualisierung bis zu mehrere Minuten lang (via Web-Browser, SSH etc.) nicht erreicht werden kann, da Dienste gestoppt, aktualisiert und neu gestartet werden.

source: It is recommended to <b>test the update</b> in a separate test environment prior to the actual update.
de: Grundsätzlich wird empfohlen das Update zunächst in einer <b>Testumgebung einzuspielen</b> und zu testen.

source: Overview of all updates that affect the system as a whole.
de: Überblick über Software-Aktualisierungen, die das Gesamtsystem betreffen.

source: Package update status not yet checked
de: Der Paket-Aktualisierungsstatus wurde noch nicht geprüft

source: Package updates
de: Paket-Aktualisierungen

source: Package updates are available. %(link)s
de: Es sind Paket-Aktualisierungen verfügbar. %(link)s

source: Please respect the following guidelines for UCS updates:
de: Bitte beachten Sie die folgenden Leitlinien für UCS-Aktualisierungen:

source: Reboot
de: Neu starten

source: Reboot required
de: Neustart erforderlich

source: Release information
de: Aktueller Status

source: Release update
de: Release-Aktualisierung

source: Release updates
de: Release-Aktualisierungen

source: Start Upgrade
de: Aktualisierung starten

source: Start Upgrade?
de: Aktualisierung starten?

source: The App Center is not available or currently unreachable
de: Das App Center ist nicht verfügbar oder momentan nicht erreichbar

source: The Univention Updater action could not be started [Error {status}]: {message}
de: Der Univention Updater konnte nicht gestartet werden [Fehler {status}]: {message}

source: The components '%(components)s' are not yet available for newer release versions.
de: Die Komponenten '%(components)s' sind noch nicht für neuere Release-Aktualisierungen bereitgestellt worden.

source: The currently installed release version is {ucs_version} errata{erratalevel}.
de: Die momentan installierte Version ist {ucs_version} errata{erratalevel}.

source: The currently installed release version is {ucs_version}.
de: Die momentan installierte Version ist {ucs_version}.

source: The currently installed version of the application %(name)s is not available for all newer UCS releases.
de: Die momentan installierte Version der Applikation %(name)s ist nicht verfügbar für alle neueren UCS Releases.

source: The currently used UCS version is out of maintenance. Please visit the %s for more information.
de: Für die aktuelle UCS Version werden keine Sicherheitsupdates mehr veröffentlicht. Bitte rufen Sie das %s auf um mehr Informationen zu erhalten.

source: The log file exceeded {max} lines by {exceeded}. Please see the full logfile.
de: Das Protokoll hat {max} Zeilen um {exceeded} überschritten. Bitte überprüfen Sie das gesamte Protokoll.

source: The update failed, please examine the log file for the exact cause. Press the "back" button to close this view.
de: Die Aktualisierung schlug fehl, bitte prüfen sie die Log-Datei für den genauen Grund. Betätigen Sie die Schaltfläche "Zurück", um diese Ansicht zu schließen.

source: The update has been successfully finished. Press the "back" button to close this view.
de: Die Aktualisierung wurde erfolgreich beendet. Betätigen Sie die Schaltfläche "Zurück", um diese Ansicht zu schließen.

source: The update is being executed.
de: Die Aktualisierung wird durchgeführt.

source: The update should occur in a <b>maintenance window</b> as some services in the domain may not be available during the update.
de: Die Aktualisierung sollte innerhalb eines Wartungsfensters erfolgen, da einige Domänendienste während der Aktualisierung nicht verfügbar sein werden.

source: The update to %s failed. Please visit the %s for more information.
de: Die Aktualisierung auf %s ist fehlgeschlagen. Bitte rufen Sie das %s auf um mehr Informationen zu erhalten.

source: The update to %s failed. The log file /var/log/univention/updater.log may contain more information about this.
de: Die Aktualisierung auf %s ist fehlgeschlagen. Die Log-Datei /var/log/univention/updater.log kann weitergehende Hinweise enthalten.

source: There are App Center updates available.
de: Es sind App Center-Aktualisierungen verfügbar.

source: There are no App Center updates available.
de: Es sind keine App Center-Aktualisierungen verfügbar.

source: There are no package updates available.
de: Es sind keine Paket-Aktualisierungen verfügbar.

source: There are no release updates available.
de: Es sind keine Release-Aktualisierungen verfügbar.

source: There are no updates available.
de: Es sind keine Aktualisierungen verfügbar.

source: There are updates available.
de: Es sind Aktualisierungen verfügbar.

source: This also holds for:
de: Gleiches gilt für:

source: UCS is being updated
de: UCS wird aktualisiert

source: UCS update failed
de: UCS Aktualisierung fehlgeschlagen

source: UCS update successful
de: UCS Aktualisierung erfolgreich

source: Update availability could not be checked.
de: Verfügbarkeit von Aktualisierungen konnte nicht geprüft werden.

source: Update failed
de: Aktualisierung fehlgeschlagen

source: Update notes
de: Hinweise zur Aktualisierung

source: Update progress
de: Updatevorgang

source: Update system up to release
de: System bis zu dieser Version aktualisieren

source: Update to {release}
de: Aktualisierung nach {release}

source: Updates
de: Aktualisierungen

source: Upgrade system
de: System aktualisieren

source: Using the %(app_center)s, you may also search for alternative apps or uninstall the application.
de: Sie können auch im %(app_center)s nach Alternativen suchen oder die Applikation deinstallieren.

source: View log file
de: Log-Datei ansehen

source: You may wait for the app to be released for the new UCS version.
de: Sie können auf die Veröffentlichung der App für die neue UCS Version warten.

source: a new UCS version
de: eine neue UCS-Version

source: no update available yet
de: noch keine Aktualisierung verfügbar

source: update available
de: Aktualisierung verfügbar

source: {count} packages to be REMOVED
de: {count} Pakete werden ENTFERNT

source: {count} packages to be installed
de: {count} Pakete werden NEU installiert

source: {count} packages to be updated
de: {count} Pakete werden aktualisiert
