Repository: univention/univention-corporate-server
Catalog: management/univention-join/umc/js/*.po
Languages: de

source: %d scripts are pending to be run.
de: Insgesamt können %d Skripte ausgeführt werden.

source: %d scripts selected
de: %d Skripte ausgewählt

source: ... loading log ...
de: ... Protokoll wird geladen ...

source: 1 script selected
de: 1 Skript ausgewählt

source: <p>Please enter credentials of a user account with administrator rights to run the selected join scripts.</p>
de: <p>Bitte Zugangsdaten eines Benutzerkontos mit Administratorrechten eingeben, um die ausgewählten Join-Skripte auszuführen.</p>

source: A DC master should be joined by the %s.
de: Ein DC master sollte über das %s der Domäne beitreten.

source: A join process is already running...
de: Ein Join-Vorgang läuft bereits...

source: A reboot of the server is recommended after joining the system.
de: Ein Neustart des Servers ist nach einem Domänenbeitritt empfohlen.

source: A restart of the UMC server components may be necessary for changes to take effect.
de: Ein Neustart der UMC-Server-Komponenten kann notwendig sein, damit Änderungen wirksam werden.

source: As %(root)s you do not have access to the App Center. For this you need to log in as %(administrator)s.
de: Als %(root)s haben Sie keinen Zugriff auf das App Center. Dafür müssen Sie sich als %(administrator)s anmelden.

source: As %(root)s you have neither access to the domain administration nor to the App Center. For this you need to log in as %(administrator)s.
de: Als %(root)s haben Sie weder Zugriff auf die Domänenadministration noch auf das App Center. Dafür müssen Sie sich als %(administrator)s anmelden.

source: Basic settings module
de: Basis-Einstellungen Modul

source: Currently, software is being installed or uninstalled. Join scripts should not be run right now.
de: Momentan wird Software installiert oder deinstalliert. Join-Skripte sollten jetzt nicht ausgeführt werden.

source: Execute
de: Ausführen

source: Execute all pending join scripts
de: Alle ausstehenden Join-Skripte ausführen

source: Executes join scripts which are not properly configured.
de: Führt join-Skripte aus, die nicht richtig konfiguriert wurden.

source: Executes this join script
de: Führt dieses Join-Skript aus

source: Force execute
de: Ausführen erzwingen

source: Forces execution of selected join scripts
de: Erzwingt Ausführung der ausgewählten join-Skripte.

source: Hostname of domain controller master
de: Rechnername des Domänencontroller Master

source: Initial system join
de: Initialer Domänenbeitritt

source: Join error
de: Join-Fehler

source: Join log
de: Join-Protokoll

source: Join status ok, nothing to do.
de: Join-Status OK, es gibt nichts zu tun.

source: Join system
de: Domänenbeitritt

source: Not all installed components have been registered. Please visit the %s to register the remaining components.
de: Nicht alle installierten Komponenten wurden registriert. Bitte rufen Sie das %s auf um alle verbliebenen Komponenten zu registrieren.

source: One script is pending to be run.
de: Ein Skript steht zur Ausführung an.

source: Only join scripts which are not successfully configured can be executed. To execute the selected scripts anyway the force execution option have to be used.
de: Nur Join-Skripte, die nicht erfolgreich ausgeführt wurden können ausgeführt werden. Um die gewählten Skripte trotzdem auszuführen muss die Ausführung erzwingen Option benutzt werden.

source: Password
de: Passwort

source: Password invalid
de: Passwort ungültig

source: Password of the domain administrator
de: Passwort des Domänen-Administrators

source: Please enter credentials of a user account with administrator rights to join the system.
de: Bitte Zugangsdaten eines Benutzerkontos mit Administratorrechten eingeben, um der Domäne beizutreten.

source: Rejoin
de: Erneut beitreten

source: Rejoin system
de: Domäne erneut beitreten

source: Rejoins the system
de: Tritt der Domäne neu bei

source: Run
de: Ausführen

source: Run join scripts
de: Join-Skripte ausführen

source: Script (package)
de: Skript (Paket)

source: Script name (the same as the package it belongs to)
de: Skriptname (benannt nach dem Paket, zu dem er gehört)

source: Show Join status
de: Join-Status zeigen

source: Shows the join log
de: Zeigt das Join-Protokoll

source: Starting the join process...
de: Join-Vorgang startet...

source: State
de: Status

source: Status of this package
de: Status dieses Paketes

source: The DNS settings can be adjusted in the %s.
de: Die DNS-Einstellungen können im %s angepasst werden.

source: The following join scripts will be executed:
de: Die folgenden Join-Skripte werden ausgeführt:

source: The hostname of the domain controller master of the domain
de: Der Computername des Master-Domaincontrollers der Domäne

source: The join process was successful.
de: Der Join-Vorgang war erfolgreich.

source: The join scripts have successfully been executed.
de: Die Join-Skripte wurden erfolgreich ausgeführt

source: The password may not be empty.
de: Es muss ein Passwort angegeben werden.

source: The system has not been joined into a domain so far. Please visit the %s to join the system.
de: Das System ist bisher noch keiner Domäne beigetreten. Bitte rufen Sie das %s auf um das System zu joinen.

source: The username may not be empty.
de: Es muss ein Benutzername angegeben werden.

source: The username of the domain administrator
de: Benutzername des Domänen-Administrators

source: This page shows the status of all available join scripts on this system, along with all join-related actions.
de: Diese Seite zeigt den Status aller verfügbaren Join-Skripte auf diesem System, zusammen mit allen zugehörigen Aktionen.

source: Username
de: Benutzername

source: Username invalid
de: Benutzername ungültig

source: View join log
de: Join-Protokoll ansehen

source: Warning:
de: Warnung:

source: pending
de: ausstehend

source: successful
de: erfolgreich
