Repository: univention/univention-corporate-server
Catalog: management/univention-management-console-module-diagnostic/umc/js/*.po
Languages: de

source: "%(module)s - %(flavor)s" Module (as Administrator)
de: Module "%(module)s - %(flavor)s" (als Administrator)

source: Analyzing for problems...
de: Analysiere auf Probleme...

source: Conflict:
de: Konflikt:

source: Critical:
de: Kritisch:

source: Diagnosis of "%s" was successful
de: Diagnose von "%s" war erfolgreich

source: Finished running diagnosis of "%s" again.
de: Erneuter Diagnosedurchlauf von "%s" beendet.

source: If the system is able to automatically repair found problems it offers the function as additional buttons.
de: Wenn das System in der Lage ist gefundene Probleme automatisch zu beheben werden die Funktionen als weitere Buttons angeboten.

source: No problems could be detected.
de: Es wurden keine Probleme entdeckt.

source: Otherwise the problems can be solved manually with help of the displayed links to articles by using the linked UMC modules.
de: Andererseits können die Probleme mithilfe der angezeigten Links zu Artikeln und verlinkten UMC Modulen von Hand gelöst werden.

source: Problem repaired:
de: Probleme repariert:

source: Run system diagnosis
de: System-Diagnose starten

source: Running full diagnosis...
de: Komplette Diagnose läuft...

source: Success:
de: Erfolg:

source: Warning:
de: Warnung:

source: Within this module the system can be analyzed for various known problems.
de: Mit diesem Modul kann das System auf verschiedene bekannte Probleme analysiert werden.
