Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/container/*.po
Languages: fr

source: Add to standard DHCP containers
fr: Ajouter aux conteneurs DHCP standard

source: Add to standard DNS containers
fr: Ajouter aux conteneurs DNS standard

source: Add to standard Directory Node computer containers
fr: Ajouter aux conteneurs d’ordinateurs Directory Node standard

source: Add to standard computer containers
fr: Ajouter aux conteneurs d'ordinateurs standard

source: Add to standard group containers
fr: Ajouter aux conteneurs de groupes standard

source: Add to standard license containers
fr: Ajouter aux conteneurs de licences standard

source: Add to standard mail containers
fr: Ajouter aux conteneurs de courriel standard

source: Add to standard network containers
fr: Ajouter aux conteneurs de réseaux standard

source: Add to standard policy containers
fr: Ajouter aux conteneurs de stratégies standard

source: Add to standard printer containers
fr: Ajouter aux conteneurs d'imprimantes standard

source: Add to standard share containers
fr: Ajouter aux conteneurs de partages standard

source: Add to standard user containers
fr: Ajouter aux conteneurs d'utilisateurs standard

source: Basic settings
fr: Réglages de base

source: Container
fr: Conteneur

source: Container description
fr: Description du conteneur

source: Container settings
fr: Réglages des conteneurs

source: Container: Container
fr: Conteneur : conteneur

source: Container: Domain
fr: Conteneur : domaine

source: Container: Organisational Unit
fr: Conteneur : Unité d'Organisation

source: Containers
fr: Conteneurs

source: DNS Zones
fr: Zones DNS

source: DNS forward lookup zone
fr: Zone de recherche DNS directe

source: DNS reverse lookup zone
fr: Zone de recherche DNS inversée

source: Default position when adding objects
fr: Position par défaut lors de l'ajout d'objets

source: Domain Container
fr: Conteneur de domaine

source: Domain Containers
fr: Conteneurs de domaine

source: Domain container description
fr: Description du conteneur de domaine

source: General
fr: Général

source: It is not allowed to create a container/ou as child object of a container/cn.
fr: Il n'est pas permis de créer un conteneur/UO en tant qu'objet enfant d'un conteneur/CN.

source: Kerberos Settings
fr: Réglages Kerberos

source: Kerberos realm
fr: Royaume Kerberos

source: Name
fr: Nom

source: Organisational Unit
fr: Unité d’Organisation

source: Organisational Units
fr: Unités d’Organisation

source: Organisational unit description
fr: Description de l'Unité d'Organisation

source: Samba Next Group RID
fr: RID groupe suivant dans Samba

source: Samba Next User RID
fr: RID utilisateur suivant dans Samba

source: Samba SID
fr: SID Samba

source: Samba Settings
fr: Réglages Samba

source: Samba domain name
fr: Nom de domaine Samba
