Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/computers/*.po
Languages: fr

source: (Re-)install on next boot
fr: (Ré-)installer au prochain démarrage

source: Account
fr: Compte

source: Alias DNS entry
fr: Enregistrement d'alias DNS

source: At least posix or kerberos is required.
fr: Au moins POSIX ou Kerberos est nécessaire.

source: Basic settings
fr: Réglages de base

source: Basic values
fr: Valeurs de base

source: Client name
fr: Nom du client

source: Computer
fr: Ordinateur

source: Computer account
fr: Compte d'ordinateur

source: Computer: Backup Directory Node
fr: Ordinateur : Backup Directory Node

source: Computer: Domain trust account
fr: Ordinateur : compte d'approbation de domaine

source: Computer: IP client
fr: Ordinateur : client géré par IP

source: Computer: Linux
fr: Ordinateur : Linux

source: Computer: Managed Node
fr: Ordinateur : serveur membre

source: Computer: Primary Directory Node
fr: Ordinateur : Primary Directory Node

source: Computer: Replica Directory Node
fr: Ordinateur : Replica Directory Node

source: Computer: Ubuntu
fr: Ordinateur : Ubuntu

source: Computer: Windows Domaincontroller
fr: Ordinateur : contrôleur de domaine Windows

source: Computer: Windows Workstation/Server
fr: Ordinateur : station de travail ou serveur Windows

source: Computer: macOS Client
fr: Ordinateur : client macOS

source: Computers
fr: Ordinateurs

source: DHCP service
fr: Service DHCP

source: DNS Forward and Reverse Lookup Zone
fr: Zone de recherche DNS directe et inversée

source: DNS alias
fr: Alias DNS

source: Deployment
fr: Déploiement

source: Directory Node name
fr: Nom du Directory Node

source: Domain
fr: Domaine

source: Domain trust account
fr: Compte d’approbation de domaine

source: Domain trust accounts
fr: Compte d’approbation de domaine

source: Forward zone for DNS entry
fr: Zone directe pour l'enregistrement DNS

source: General
fr: Général

source: Group memberships
fr: Appartenance à des groupes

source: Groups
fr: Groupes

source: Hostname
fr: Nom d'hôte

source: IP address
fr: Adresse IP

source: IP client
fr: Client IP

source: IP client name
fr: Nom du client géré par IP

source: IP clients
fr: Clients IP

source: Initialize password with hostname
fr: Initialiser le mot de passe avec le nom d'hôte

source: Inventory number
fr: Numéro d'inventaire

source: Kerberos principal
fr: Principal Kerberos

source: Linux Computer
fr: Ordinateur Linux

source: Linux Computers
fr: Ordinateurs Linux

source: Login shell
fr: Shell de connexion

source: MAC address
fr: Adresse MAC

source: Machine Password
fr: Mot de passe de la machine

source: Managed Node
fr: Nœud géré

source: Managed Node name
fr: Nom du nœud géré

source: Managed Nodes
fr: Nœuds gérés

source: Name
fr: Nom

source: Name of installation profile
fr: Nom du profil d'installation

source: Network
fr: Réseau

source: Network settings
fr: Réglages réseau

source: Open Univention Management Console on this computer
fr: Ouvrir l’Univention Management Console sur cet ordinateur

source: Operating system
fr: Système d'exploitation

source: Operating system version
fr: Version du système d'exploitation

source: Password
fr: Mot de passe

source: Posix account
fr: Compte POSIX

source: Primary group
fr: Groupe principal

source: Relative ID
fr: Id. relatif

source: Reverse zone for DNS entry
fr: Zone inverse pour l'enregistrement DNS

source: Samba account
fr: Compte Samba

source: System role
fr: Rôle système

source: Trust account
fr: Compte d'approbation

source: Ubuntu Computer
fr: Ordinateur Ubuntu

source: Ubuntu Computers
fr: Ordinateurs Ubuntu

source: Unix account
fr: Compte UNIX

source: Unix account settings
fr: Réglages des comptes UNIX

source: Unix home directory
fr: Répertoire personnel UNIX

source: Windows Domaincontroller
fr: Contrôleur de domaine Windows

source: Windows Domaincontrollers
fr: Contrôleurs de domaine Windows

source: Windows Workstation/Server
fr: Station de travail ou serveur Windows

source: Windows Workstations/Servers
fr: Stations de travail ou serveurs Windows

source: Windows domaincontroller name
fr: Nom du contrôleur de domaine Windows

source: Windows workstation/server name
fr: Nom du serveur ou de la station de travail Windows

source: Zone for DNS alias
fr: Zone pour l'alias DNS

source: additional start options
fr: options de démarrage supplémentaires

source: macOS Client
fr: Client macOS

source: macOS Clients
fr: Clients macOS
