Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/services/univention-ad-connector/umc/python/adconnector/*.po
Languages: fr

source: Active Directory Connector is already running. Nothing to do.
fr: Le connecteur Active Directory est déjà lancé. Aucune action à effectuer.

source: Active Directory Connector is already stopped. Nothing to do.
fr: Le connecteur Active Directory est déjà arrêté. Aucune action à effectuer.

source: Active Directory connection service has been started.
fr: Le service de connexion Active Directory a été démarré.

source: Active Directory connection service has been stopped.
fr: Le service de connexion Active Directory a été arrêté.

source: Active Directory connection settings have been saved and a new certificate for the Active Directory server has been created.
fr: Les réglages de la connexion Active Directory ont été enregistrés et un nouveau certificat pour le serveur Active Directory a été créé.

source: Active Directory connection settings have been saved.
fr: Les réglages de la connexion Active Directory ont été enregistrés.

source: An error occurred while installing necessary software components.
fr: Erreur lors de l'installation des composants logiciels nécessaires.

source: An unexpected error occurred: %s
fr: Une erreur inattendue est survenue : %s

source: Certificate has been uploaded successfully.
fr: Le certificat a été envoyé avec succès.

source: Certificate upload or conversion failed.
fr: Échec de l'envoi ou de la conversion du certificat.

source: Configuring Administrator account...
fr: Configuration du compte administrateur...

source: Configuring DNS entries...
fr: Configuration des enregistrements DNS...

source: Configuring DNS server...
fr: Configuration du serveur DNS...

source: Configuring Kerberos settings...
fr: Configuration des réglages Kerberos...

source: Configuring reverse DNS settings...
fr: Configuration des réglages DNS inversés...

source: Configuring software components...
fr: Configuration des composants logiciels...

source: Configuring synchronization from AD...
fr: Configuration de la synchronisation depuis AD...

source: Configuring time synchronization...
fr: Configuration de la synchronisation du temps...

source: Could not establish an encrypted connection. Either "%r" is not reachable or does not support encryption.
fr: Impossible d'établir une connexion chiffrée. Soit on ne peut pas accéder à « %r », soit il ne gère pas le chiffrement.

source: Could not establish connection. Either the certificate is wrong, the Active Directory server is unreachable or it does not support SSL.
fr: Impossible d'établir la connexion. Soit le certificat est incorrect, soit le domaine Active DIrectory est inaccessible ou ne gère pas SSL.

source: Could not synchronize the time between the UCS system and the Active Directory domain controller: %s
fr: Impossible de synchroniser le temps entre le système UCS et le contrôleur du domaine Active Directory : %s

source: Creation of certificate failed (%s)
fr: Échec de la création du certificat (%s)

source: Failed to set the password of the UCS Administrator to the Active Directory Administrator password.
fr: Échec de la définition du mot de passe de l'administrateur UCS à la valeur du mot de passe administrateur d'Active Directory.

source: Join has been finished successfully.
fr: La jonction s'est terminée correctement.

source: Join has been finished with errors.
fr: La jonction s'est terminée avec des erreurs.

source: Joining UCS into Active Directory domain
fr: UCS rejoint le domaine Active Directory

source: Registering LDAP service entry...
fr: Enregistrement d'une entrée de service LDAP...

source: Renaming well known SID objects...
fr: Renommage de tous les objets SID connus...

source: Running Samba join script...
fr: Lancement du script Samba pour rejoindre le domaine...

source: Saving bind password failed (filename=%(fn)s ; exception=%(exception)s)
fr: Échec de l'enregistrement du mot de passe de bind (nom du fichier=%(fn)s ; exception=%(exception)s)

source: Starting Active Directory connection service...
fr: Démarrage du service de connexion à Active Directory...

source: Switching running state of Active Directory Connector failed.
fr: Échec du passage du connecteur Active Directory en mode d'exécution.

source: The domain name of the AD Server (%(ad_domain)s) does not match the local UCS domain name (%(ucs_domain)s). For the AD member mode, it is necessary to setup a UCS system with the same domain name as the AD Server.
fr: Le nom de domaine du serveur AD (%(ad_domain)s) ne correspond pas au nom de domaine local d'UCS (%(ucs_domain)s). Pour le mode membre AD, il faut configurer un système UCS avec le même nom de domaine que celui du serveur AD.

source: The given user is not member of the Domain Admins group in Active Directory. This is a requirement for the Active Directory domain join.
fr: L'utilisateur donné n'est pas membre du groupe Domain Admins dans Active Directory. Ceci est un prérequis pour faire rejoindre le domaine Active Directory.
