Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/virtualization/univention-virtual-machine-manager-schema/modules/univention/admin/handlers/uvmm/*.po
Languages: fr

source: Active VNC remote access
fr: Accès distant VNC actif

source: Add the listed images to the list of selectable images
fr: Ajouter les images listées à la liste des images sélectionnables

source: Amount of disk space
fr: Espace disque

source: Amount of memory
fr: Quanrité de mémoire

source: Architecture of the virtual machine
fr: Architecture de la machine virtuelle

source: Automatic
fr: Automatique

source: Boot configuration
fr: Configuration du démarrage

source: Boot devices
fr: Périphériques de démarrage

source: Bridging interface
fr: Interface réseau pont

source: CDROM drive
fr: Lecteur de CD-ROM

source: CPUs
fr: Processeurs

source: Cloud Connection parameters
fr: Paramètres de la connexion au cloud

source: Cloud Type
fr: Type de cloud

source: Coordinated Universal Time
fr: Temps universel coordonné

source: Description of virtual machine
fr: Description de la machine virtuelle

source: Disk cache
fr: Cache disque

source: Disk cache handling on host
fr: Gestion du cache disque sur l'hôte

source: Disk space
fr: Espace disque

source: Full virtualization (KVM)
fr: Virtualisation totale (KVM)

source: General
fr: Général

source: Hypervisor default
fr: Valeur par défaut de l'hyperviseur

source: Initramfs disk
fr: Disque « initramfs »

source: Kernel
fr: Noyau

source: Kernel parameter
fr: Paramètre du noyau

source: Key-value pair storing needed parameters for the Cloud Connection
fr: Paire clé / valeur stockant les paramètres nécessaires à la connexion au cloud

source: Keyboard layout
fr: Disposition du clavier

source: Local time zone
fr: Fuseau horaire local

source: Manually specify the kernel configuration for paravirtualized machines or use pyGrub as bootloader
fr: Indiquer manuellement la configuration du noyau pour les machines paravirtualisées ou utiliser « pyGrub » comme chargeur de démarrage.

source: Memory
fr: Mémoire

source: Name
fr: Nom

source: Name of the operation system
fr: Nom du système d'exploitation

source: Name prefix
fr: Préfixe du nom

source: Network
fr: Réseau

source: Network interface
fr: Interface réseau

source: No host caching, forced sync
fr: Pas de mise en cache sur l'hôte, synchronisation forcée

source: No host caching, no forced sync
fr: Pas de cache sur l'hôte, pas de synchronisation forcée

source: Number of virtual CPUs
fr: Nombre de processeurs virtuels

source: Offset of instances Real Time Clock to host computers clock
fr: Décalage entre l'horloge temps réel des instances et l'horloge des ordinateurs hôtes

source: Operating system
fr: Système d'exploitation

source: Order of boot devices
fr: Ordre des périphériques au démarrage

source: Pattern for filtering images
fr: Motif pour filtrer les images

source: Prefix for the name of virtual machines
fr: Préfixe du nom des machines virtuelles

source: Profile
fr: Profil

source: Read caching, forced sync
fr: Cache de lecture, synchronisation forcée

source: Read/write caching, no forced sync
fr: Cache de lecture et d'écriture, pas de synchronisation forcée

source: Read/write caching, sync filtered out
fr: Cache de lecture et d'écriture, synchronisation sélective

source: Real Time Clock offset
fr: Décalage avec l'horloge temps réel

source: Reference to the profile used for defining this VM
fr: Référence au profil utilisé pour définir cette machine virtuelle

source: Reference to the type of the cloud connection
fr: Référence au type de connexion au cloud

source: Remote access
fr: Accès distant

source: Show UCS images when creating a new instance
fr: Afficher les images UCS à la création d'une nouvelle instance

source: The specified images are added to the list of selectable images in the instance wizard
fr: Les images indiquées sont ajoutées à la liste des images sélectionnables dans l'assistant d'instance

source: UVMM: Cloud Connection
fr: UVMM : connexion au cloud

source: UVMM: Cloud Type
fr: UVMM : type de cloud

source: UVMM: Cloud Types
fr: UVMM : types de clouds

source: UVMM: Machine information
fr: UVMM : informations sur la machine

source: UVMM: Profile
fr: UVMM : profil

source: Use advanced kernel configuration
fr: Utiliser la configuration avancée du noyau

source: Use para-virtual driver for CDROM drives
fr: Utiliser un pilote de paravirtualisation pour les lecteurs de CD-ROM

source: Use para-virtual driver for hard drives
fr: Utiliser un pilote de paravirtualisation pour les disques durs

source: Use para-virtual driver for network interface
fr: Utiliser un pilote de paravirtualisation pour l'interface réseau

source: Value must be an positive capacity (xx.x [kmgtp][[i]B])
fr: La valeur doit être une taille positive (xx.x [kmgtp][[i]B])

source: Virtual hardware
fr: Matériel virtuel

source: Virtual machine cloud connection
fr: Connexion au cloud de la machine virtuelle

source: Virtual machine cloud type
fr: Type de cloud associé à la machine virtuelle

source: Virtual machine information
fr: Informations sur la machine virtuelle

source: Virtual machine profile
fr: Profil de la machine virtuelle

source: Virtualisation Technology
fr: Technologie de virtualisation

source: When creating new instances, this pattern is used to further filter all available Images
fr: Lors de la création de nouvelles instances, ce motif est utilisé pour restreindre plus parmi les images disponibles

source: hard drive
fr: disque dur
