Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/*.po
Languages: fr

source: The attribute %r could not get locked.
fr: L'attribut %r n'a pas pu être verrouillé.

source: Can not modify lock time of %r.
fr: Impossible de modifier la durée de verrouillage de %r.

source: Invalid encoding for %s
fr: Codage invalide pour %s

source: Custom
fr: Personnalisé

source: Email address of Nagios contacts
fr: Adresse électronique des contacts Nagios

source: Parent hosts
fr: Hôtes parents

source: Assigned Nagios services
fr: Services Nagios assignés

source: Nagios services
fr: Services Nagios

source: Nagios Service Settings
fr: Réglages du service Nagios

source: Nagios notification
fr: Notification Nagios

source: Nagios Notification Settings
fr: Réglages des notifications Nagios

source: Nagios support
fr: Assistance Nagios

source: Object
fr: Objet

source: Required object class
fr: Classe d'objet nécessaire

source: Excluded object class
fr: Classe d'objet exclue

source: Fixed attribute
fr: Attribut fixe

source: Empty attribute
fr: Attribut vide

source: LDAP filter
fr: Filtre LDAP

source: This policy applies only to objects which matches this LDAP filter.
fr: La stratégie s'applique uniquement aux objets correspondant à ce filtre LDAP.

source: Invalid value
fr: Valeur invalide

source: An empty value is not allowed
fr: Une valeur vide n'est pas autorisée

source: not enough arguments
fr: pas assez de paramètres

source: too many arguments
fr: trop de paramètres

source: Missing argument: %s > %s
fr: Argument manquant : %s > %s

source: missing argument %s
fr: argument manquant %s

source: Not a valid LDAP DN
fr: Nom distingué LDAP invalide

source: The value must not be longer than %d characters.
fr: La valeur ne doit pas dépasser les %d caractères.

source: Invalid UCS version: %s
fr: Version UCS invalide : %s

source: Invalid character in debian package version: %s
fr: Caractère invalide dans la version du paquetage Debian : %s

source: Non-integer epoch in debian package version: %s
fr: Version du paquetage Debian avec une ère non entière : %s

source: Filename must not contain slashes: %s
fr: Le nom du fichier ne peut pas contenir de barres obliques : %s

source: Not a valid Base64 string: %s
fr: Chaîne de caractères Base64 invalide : %s

source: Value must be gzip compressed and Base64 encoded: %s
fr: La valeur doit être une archive au format Base64 compressée par gzip : %s

source: Value must be bzip2 compressed and Base64 encoded: %s
fr: La valeur doit être une archive au format Base64 compressée par bzip2 : %s

source: Failed to convert PNG file into JPEG format.
fr: Échec de la conversion du fichier PNG au format JPEG.

source: Value must be Base64 encoded jpeg.
fr: La valeur doit être un JPEG au format Base64.

source: Not Base64 encoded XML data: %s
fr: Pas des données XML au format Base64 : %s

source: Not Base64 encoded GNU message catalog (.mo) data: %s
fr: Pas des données de catalogues de messages (« .mo ») au format Base64 : %s

source: Not a valid locale subdir name: %s
fr: Nom de sous-répertoire de paramètre régional invalide : %s

source: Not a valid filename for umcmessagecatalog. It must match "$language-$moduleid.mo" (e.g. "de-udm-foo.mo")
fr: Le nom de fichier n’est pas valide pour umcmessagecatalog. Il doit correspondre au modèle « $language-$moduleid.mo » (par exemple « fr-udm-foo.mo »)

source: Locale subdir name
fr: Nom du sous-répertoire du paramètre régional

source: GNU message catalog
fr: Catalogue de messages GNU

source: Value must be a number!
fr: La valeur doit être un nombre !

source: Value must be 0 or 1
fr: La valeur doit être 0 ou 1

source: Value must be an integer followed by one of GB,MB,KB,B or nothing (equals B)!
fr: La valeur doit être un nombre entier suivi d'une des unités « GB » (pour « Go »), « MB » (pour « Mo »), « KB » (pour « Ko »), « B » (pour octet) ou de rien (équivalent à « B ») !

source: Value may not contain whitespace or exclamation mark !
fr: La valeur ne doit pas contenir d'espaces ou de points d'exclamation !

source: undefined
fr: non défini

source: mails
fr: courriels

source: events
fr: évènements

source: tasks
fr: tâches

source: notes
fr: remarques

source: journals
fr: journaux

source: Value must not contain anything other than digits, letters or dots, must be at least 2 characters long, and start and end with a digit or letter!
fr: La valeur ne doit pas contenir autre chose que des chiffres, des lettres ou des points, doit se composer d'au moins 2 caractères, et doit démarrer et finir par un chiffre ou une lettre !

source: Value must not contain anything other than digits, letters, dots or spaces, must be at least 2 characters long, and start and end with a digit or letter!
fr: La valeur ne doit pas contenir autre chose que des chiffres, des lettres, des points ou des espaces, doit se composer d'au moins 2 caractères, et doit démarrer et finir par un chiffre ou une lettre !

source: Value must not contain anything other than digits, letters, dots, brackets, slash, plus, or minus!
fr: La valeur ne doit pas contenir autre chose que des chiffres, des lettres, des points, des accolades, des barres obliques, des plus ou des moins !

source: Field must only contain ASCII characters!
fr: Le champ ne doit contenir que des caractères ASCII !

source: Value must not contain anything other than digits, letters, dots, dash or underscore, must be at least 2 characters long, must start and end with a digit or letter, and must not be admin!
fr: La valeur ne doit pas contenir autre chose que des chiffres, des lettres, des points, des tirets ou des tirets bas, doit se composer d'au moins 2 caractères, doit démarrer et finir par un chiffre ou une lettre, et ne peut pas être « admin » !

source: Spaces are not allowed in the username!
fr: Les espaces ne sont pas autorisés dans le nom d'utilisateur !

source: Username must only contain numbers, letters and dots!
fr: L’identifiant ne doit contenir que des chiffres, des lettres et des points !

source: Only the first letter of the username may be uppercase!
fr: Seule la première lettre du nom d'utilisateur peut être en majuscule !

source: A group name must start and end with a letter, number or underscore. In between additionally spaces, dashes and dots are allowed.
fr: La valeur ne doit contenir que des chiffres, des lettres et des points.

source: Value may not contain double quotes (")!
fr: La valeur ne peut contenir de guillemets (« " ») !

source: A path must begin with "/"!
fr: Un chemin doit commencer par un « / » !

source: Path may not start with "%s" !
fr: Le chemin ne peut pas commencer par « %s » !

source: The password is too short, at least %d characters needed.
fr: Le mot de passe est trop court, il doit contenir au moins %d caractères.

source: Empty password not allowed!
fr: Un mot de passe vide n'est pas autorisé !

source: This is not a valid hostname.
fr: Ce nom d'hôte est invalide.

source: Not a valid IP address!
fr: Adresse IP invalide !

source: Not a valid hostname or IP address!
fr: Nom d'hôte ou adresse IP invalide !

source: Not a valid netmask!
fr: Masque réseau invalide !

source: Not a valid network!
fr: Réseau invalide !

source: First address
fr: Première adresse

source: Last address
fr: Dernière adresse

source: Illegal range
fr: Intervalle invalide

source: Not an absolute path!
fr: N'est pas un chemin absolu !

source: Redirect all e-mails to forward addresses
fr: Rediriger tous les e-mails vers des adresses de transfert

source: Keep e-mails and forward a copy
fr: Conserver les e-mails et transférer une copie

source: Not a valid email address!
fr: Adresse électronique invalide !

source: The domain part of the following mail addresses is not in list of configured mail domains: %s
fr: La partie domaine des adresses électroniques suivantes n'est pas dans la liste configurée des domaines de courriel : %s

source: The domain part of the primary mail address is not in list of configured mail domains: %s
fr: La partie domaine de l'adresse électronique principale n'est pas dans la liste configurée des domaines de courriel : %s

source: The given date does not conform to iso8601, example: "2009-01-01".
fr: La date donnée ne suit pas le format ISO 6801, par exemple « 2009-01-01 ».

source: Not a valid Date
fr: Date invalide

source: A subnet for reverse lookup consists of the first 1-3 octets of an IPv4 address (example: "192.168.0") or of the first 1 to 31 nibbles of an expanded (with leading zeroes and without ::-substitution) IPv6 address (example: "2001:0db8:010" for "2001:db8:100::/24")
fr: Un sous-réseau, pour une recherche inversée, est constitué des 1 à 3 premiers octets d'une adresse IPv4 (par exemple « 192.168.0 ») ou des 1 à 31 premiers nibbles d'une adresse IPv6 étendue (y compris les zéros non significatifs et sans substitution du type :: , par exemple « 2001:0db8:010 » pour « 2001:db8:100::/24 »)

source: The name of a reverse zone for IPv4 consists of the reversed subnet address followed by .in-addr.arpa (example: "0.168.192.in-addr.arpa") or for IPv6 in nibble format followed by .ip6.arpa (example: "0.0.0.0.0.0.1.0.8.b.d.0.1.0.0.2.ip6.arpa")
fr: Le nom de la zone inversée pour IPv4 se compose d'une adresse de sous-réseau inversée suivie par « .in-addr.arpa » (exemple : « 0.168.192.in-addr.arpa ») ou pour IPv6 en sections suivies par « .ip6.arpa » (exemple : « 0.0.0.0.0.0.1.0.8.b.d.0.1.0.0.2.ip6.arpa »)

source: Missing value!
fr: Valeur manquante !

source: Full domain name must be between 1 and 253 characters long!
fr: Le nom de domaine complet doit comporter entre 1 et 253 caractères !

source: Labels must be between 1 and 63 characters long!
fr: Les étiquettes doivent comporter entre 1 et 63 caractères !

source: Full name must not be all numeric!
fr: Le nom complet ne peut pas être exclusivement numérique !

source: A hostname or any part of a FQDN, separated by dots, starts and ends with a letter or a digit. In between letters, digits, dashes and underscores are allowed. Only numbers are not allowed.
fr: Un nom d'hôte ou toute partie d'un FQDN, séparé par des points, commence et termine par une lettre ou un chiffre. Les lettres, chiffres, tirets et caractères de soulignement sont acceptés au milieu. Les noms contenant exclusivement des chiffres ne sont pas permis.

source: Key
fr: Clé

source: Value
fr: Valeur

source: Priority
fr: Priorité

source: Mail server
fr: Serveur de courriel

source: Protocol
fr: Protocole

source: The reversed host name for IPv4 consists of the reversed host address (example: "4.3") or for IPv6 in nibble format (example: "8.0.0.0.7.0.0.0.0.6.0.0.0.0.5.0").
fr: Le nom d'hôte inversé pour IPv4 est constitué de l'adresse inversée de l'hôte (par exemple « 4.3 ») ou, pour IPv6, de l'adresse au format nibble (par exemple « 8.0.0.0.7.0.0.0.0.6.0.0.0.0.5.0 »).

source: Street
fr: Rue

source: Postal code
fr: Code postal

source: City
fr: Ville

source: Weighting
fr: Pondération

source: Server
fr: Serveur

source: Not a valid time format
fr: Format de date et d'heure invalide

source: seconds
fr: secondes

source: hours
fr: heures

source: days
fr: jours

source: Value out of bounds (%d - %d seconds)
fr: Valeur hors des limites (%d – %d secondes)

source: This is not a valid MAC address (valid examples are 86:f5:d1:f5:6b:3e, 86-f5-d1-f5-6b-3e, 86f5d1f56b3e, 86f5.d1f5.6b3e)
fr: Adresse MAC invalide (quelques exemples valides : 86:f5:d1:f5:6b:3e, 86-f5-d1-f5-6b-3e, 86f5d1f56b3e, 86f5.d1f5.6b3e)

source: Address
fr: Adresse

source: The package "%s" can not be removed as it would uninstall necessary components.
fr: Le paquetage « %s » ne peut pas être supprimé car cela provoquerait la désinstallation de composants indispensables.

source: Command pattern
fr: Motif de la commande

source: Option Pattern
fr: Motif de l'option

source: No access
fr: Pas d'accès

source: Read
fr: Lecture

source: Post
fr: Envoyer

source: Append
fr: Ajouter

source: Write
fr: Écriture

source: All
fr: Tous

source: Anyone
fr: N'importe qui

source: Not a valid e-mail address
fr: Adresse électronique invalide

source: User
fr: Utilisateur

source: Access right
fr: Droit d'accès

source: Group
fr: Groupe

source: Not a valid LDAP search filter
fr: Filtre de recherche LDAP invalide

source: Value consists of two integer numbers separated by an "x" (e.g. "1024x768")
fr: La valeur se compose de deux nombres entiers séparés par un « x » (ex. : « 1024x768 »)

source: Value consists of two integer numbers separated by a "-" (e.g. "30-70")
fr: La valeur se compose de deux nombres entiers séparés par un « - » (ex. : « 30-70 »)

source: Left of primary display
fr: À gauche de l'affichage principal

source: Right of primary display
fr: À droite de l'affichage principal

source: Above primary display
fr: Au-dessus de l'affichage principal

source: Below primary display
fr: En-dessous de l'affichage principal

source: Not a valid FQDN
fr: Nom pleinement qualifié (FQDN) invalide

source: Primary Group
fr: Groupe principal

source: Network
fr: Réseau

source: From known-hosts pool
fr: Depuis un réservoir d'hôtes connus

source: DNS forward zone
fr: Zone de transmission DNS

source: DNS reverse zone
fr: Zone DNS inversée

source: DNS Entry
fr: Enregistrement DNS

source: IP address
fr: Adresse IP

source: DNS Entry Reverse
fr: Enregistrement DNS inverse

source: DNS Entry Alias
fr: Enregistrement DNS d'alias

source: Zone of existing host record
fr: Zone d'un enregistrement d'hôte existant

source: DHCP service
fr: Service DHCP

source: MAC address
fr: Adresse MAC

source: DHCP Entry
fr: Entrée DHCP

source: Name
fr: Nom

source: DHCP option
fr: Option DHCP

source: %(name)s (%(path)s on %(host)s)
fr: %(name)s (%(path)s sur %(host)s)

source: allow
fr: autoriser

source: deny
fr: refuser

source: ignore
fr: ignorer

source: Invalid choice.
fr: Choix invalide.

source: Yes
fr: Oui

source: No
fr: Non

source: Auto
fr: Automatique

source: True
fr: Vrai

source: False
fr: Faux

source: OK
fr: Valider

source: Not OK
fr: Incorrect

source: interim
fr: provisoire

source: none
fr: aucun

source: on
fr: oui

source: off
fr: non

source: all
fr: tous

source: January
fr: Janvier

source: February
fr: Février

source: March
fr: Mars

source: April
fr: Avril

source: May
fr: Mai

source: June
fr: Juin

source: July
fr: Juillet

source: August
fr: Août

source: September
fr: Septembre

source: October
fr: Octobre

source: November
fr: Novembre

source: December
fr: Décembre

source: Monday
fr: Lundi

source: Tuesday
fr: Mardi

source: Wednesday
fr: Mercredi

source: Thursday
fr: Jeudi

source: Friday
fr: Vendredi

source: Saturday
fr: Samedi

source: Sunday
fr: Dimanche

source: Domain Group
fr: Groupe du domaine

source: Local Group
fr: Groupe local

source: Well-Known Group
fr: Groupe connu

source: Local (Type: Security)
fr: Local (type : sécurité)

source: Global (Type: Security)
fr: Global (type : sécurité)

source: Universal (Type: Security)
fr: Universel (type : sécurité)

source: Domain local (Type: Security)
fr: Domaine local (type : sécurité)

source: Universal (Type: Distribution)
fr: Universel (type : distribution)

source: Sun
fr: Dim

source: Mon
fr: Lun

source: Tue
fr: Mar

source: Wed
fr: Mer

source: Thu
fr: Jeu

source: Fri
fr: Ven

source: Sat
fr: Sam

source: Add machines to domain
fr: Ajouter des machines au domaine

source: Manage auditing and security log
fr: Gérer les journaux de vérification et de sécurité

source: Take ownership of files or other objects
fr: Prendre le contrôle sur les fichiers ou d'autres objets

source: Back up files and directories
fr: Sauvegarder les fichiers et répertoires

source: Restore files and directories
fr: Restaurer les fichiers et répertoires

source: Force shutdown from a remote system
fr: Forcer l'arrêt d'un système distant

source: Manage printers
fr: Gérer les imprimantes

source: Add users and groups to the domain
fr: Ajouter des utilisateurs et des groupes au domaine

source: Manage disk shares
fr: Gérer les partages de disques

source: synchronous
fr: synchrone

source: asynchronous
fr: asynchrone

source: "%s" is not a Univention Admin Module.
fr: « %s » n'est pas un module d'administation Univention.

source: UDM module
fr: Module UDM

source: property
fr: propriété

source: No Reboot
fr: Pas de redémarrage

source: Immediately
fr: Immédiatement

source: Public key infrastructure account
fr: Compte d’infrastructure à clés publiques

source: NFS share
fr: Partage NFS

source: Language code must be in format "xx_XX"!
fr: Le code de langue doit suivre le format « xx_XX » !

source: Language code (e.g. en_US)
fr: Code de langue (ex. : fr_FR)

source: Text
fr: Texte

source: Translated short description
fr: Brève description traduite

source: Translated long description
fr: Description détaillée traduite

source: Translated tab name
fr: Nom de l'onglet traduit

source: Translated group name
fr: Nom du groupe traduit

source: Soft limit (pages)
fr: Limite douce (pages)

source: Hard limit (pages)
fr: Limite dure (pages)

source: Value may not contain other than numbers, letters, underscore ("_") and minus ("-")!
fr: La valeur ne doit contenir que des chiffres, des lettres, des tirets bas (« _ ») et des traits d'union (« - »)

source: Driver
fr: Pilote

source: Protocol and destination have to be specified.
fr: Le protocole et la destination doivent être précisés.

source: Invalid syntax: %s > %s
fr: Syntaxe invalide : %s > %s

source: May only contain letters (except umlauts), digits, space as well as the characters # ! $ % & | ^ . ~ _ -. Has to begin with a letter or digit and must not end with space.
fr: Ne peut contenir que des lettres (sauf lettres accentuées), des chiffres, des espaces, ainsi que les caractères « # ! $ % & | ^ . ~ _ - ». Doit commencer par une lettre ou un chiffre et ne doit pas se terminer par un espace.

source: Footer
fr: Pied de page

source: Link
fr: Lien

source: Locale
fr: Paramètres régionaux

source: Shown in category "Administration"
fr: Affiché dans la catégorie « Administration »

source: Shown in category "Installed services"
fr: Affiché dans la catégorie « Services installés »

source: Portal Entry
fr: Entrée de portail

source: Portal Category
fr: Catégorie de portail

source: Value has to be in valid json format
fr: La valeur doit être dans un format json valide

source: Portal entries can not be added to an empty category
fr: Les entrées de portail ne peuvent pas être ajoutées à une catégorie vide

source: Visible for Admins only
fr: Visible uniquement par les comptes d’administration

source: Visible for authenticated users
fr: Visible par les comptes d’utilisation authentifiés

source: Visible for everyone
fr: Visible par tout le monde

source: White
fr: Blanc

source: Black
fr: Noir

source: Same tab
fr: Même onglet

source: New tab
fr: Nouvel onglet

source: Use default of portal
fr: Utiliser le réglage par défaut du portail

source: Display Name
fr: Nom affiché

source: Message that is shown to anonymous visitors when the portal is empty
fr: Message affiché pour les visites anonymes lorsque le portail est vide

source: Error: %(text)s - %(exc)s
fr: Erreur : %(text)s - %(exc)s

source: Mark this object as hidden
fr: Marquer cet objet comme masqué

source: Mark this object as temporary
fr: Marquer cet objet comme temporaire

source: Ignore this object in standard UDM modules
fr: Ignorer cet objet dans les modules UDM standards

source: This object is related to a Docker App container
fr: Cet objet est lié à un conteneur d'App Docker

source: This object is synchronized from Active Directory
fr: Cet objet est synchronisé à partir d’Active Directory

source: other
fr: autre

source: A mailing list name must start and end with a letter, number or underscore. In between additionally spaces, dashes and dots are allowed.
fr: La valeur ne doit contenir que des chiffres, des lettres et des points.

source: Time
fr: Horaire

source: Timezone
fr: Fuseau horaire

source: Value must be of type %s not %s.
fr: La valeur doit être de type %s et non %s.

source: The LDAP DN is invalid.
fr: Le nom distingué (DN) LDAP n’est pas valide.

source: Binary data have invalid encoding (expected: %s).
fr: Les données binaires ont un codage invalide (attendu : %s).

source: Date does not match format "%Y-%m-%d".
fr: La date ne correspond pas au format « %Y-%m-%d ».

source: Time does not match format "%H:%M:%S".
fr: L’horaire ne correspond pas au format « %H:%M:%S ».

source: Datetime does not match format "%Y-%m-%dT%H:%M:%S".
fr: La date et l’heure ne correspondent pas au format « %Y-%m-%dT%H:%M:%S ».

source: Duplicated entries.
fr: Entrées dupliquées.

source: Must have at least %d values.
fr: Doit avoir au moins %d valeurs.

source: Invalid format for SambaLogonHours.
fr: Format invalide pour SambaLogonHours.

source: Object exists.
fr: L'objet existe.

source: No such object.
fr: Objet demandé non trouvé.

source: Permission denied.
fr: Droit refusé.

source: LDAP Error
fr: Erreur LDAP

source: The specified timeout for the LDAP search has been exceeded.
fr: Le délai donné pour la recherche LDAP a été dépassé.

source: The specified size limit for the LDAP search has been exceeded.
fr: La limite de taille donnée pour la recherche LDAP a été dépassée.

source: Information provided is not sufficient.
fr: Les informations fournies ne sont pas suffisantes.

source: No such property.
fr: Propriété demandée non trouvée.

source: Value may not change.
fr: La valeur ne peut être modifiée.

source: Invalid syntax.
fr: Syntaxe invalide.

source: Value is required.
fr: La valeur est requise.

source: Values do not match.
fr: Les valeurs ne correspondent pas.

source: Could not acquire lock.
fr: Impossible d'obtenir le verrou.

source: Authentication Failed.
fr: Échec de l'authentification.

source: The username is already in use as username or as groupname
fr: Le nom d'utilisateur est déjà utilisé comme nom d'utilisateur ou nom de groupe

source: The username is already in use
fr: Le nom d'utilisateur est déjà utilisé

source: The relative ID (SAMBA) is already in use.
fr: L'id. relatif (Samba) est déjà utilisé.

source: The groupname is already in use as groupname or as username
fr: Le nom de groupe est déjà utilisé comme nom de groupe ou nom d'utilisateur

source: The groupname is already in use
fr: Le nom de groupe est déjà utilisé

source: The uidNumber is already in use as a gidNumber
fr: Le « uidNumber » est déjà utilisé comme un « gidNumber »

source: The gidNumber is already in use as a uidNumber
fr: Le « gidNumber » est déjà utilisé comme un « uidNumber »

source: The AD group type can not be changed from type local to any other type.
fr: Le type de groupe AD ne peut pas être modifié d'un type local vers un autre type.

source: The AD group type can not be changed to type local.
fr: Le type de groupe AD ne peut pas être modifié vers un type local.

source: The AD group type can not be changed from global to universal, because the group is member of another global group.
fr: Le type de groupe AD ne peut pas être modifié de global vers universel, car le groupe est membre d'un autre groupe global.

source: The AD group type can not be changed from domain local to universal, because the group has another domain local group as member.
fr: Le type de groupe AD ne peut pas être modifié d'un domaine local vers un universel, car le groupe contient un autre groupe de domaine local en tant que membre.

source: The AD group type can not be changed from universal to global, because the group has another universal group as member.
fr: Le type de groupe AD ne peut pas être modifié d'universel à global, car le groupe contient en tant que membre un autre groupe universel.

source: The AD group type can not be changed from global to domain local.
fr: Le type de groupe AD ne peut pas être modifié d'un domaine global vers un local.
