Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/*.po
Languages: fr

source: The AD group type can not be changed from domain local to global.
fr: Le type de groupe AD ne peut pas être modifié d'un domaine local vers un global.

source: Prohibited username.
fr: Nom d'utilisateur interdit.

source: IP address is already in use.
fr: L'adresse IP est déjà utilisée.

source: DNS alias is already in use.
fr: L'alias DNS est déjà utilisé.

source: The DHCP entry for this host should contain the zone DN, the IP address and the MAC address.
fr: L'entrée DHCP pour cet hôte doit contenir le ND de zone, l'adresse IP et l'adresse MAC.

source: The DNS alias entry for this host should contain the zone name, the alias zone container DN and the alias.
fr: L'enregistrement d'alias DNS pour cet hôte doit contenir le nom de la zone, le ND du conteneur de la zone de l'alias et l'alias lui-même.

source: The provided DNS information are invalid.
fr: Les informations DNS fournies sont invalides.

source: Next IP address not found.
fr: Adresse IP suivante non trouvée.

source: The given IP address is not within the range of the selected network
fr: L'adresse IP donnée n'est pas dans la plage du réseau sélectionné

source: The MAC address is already in use.
fr: L'adresse MAC est déjà utilisée.

source: The mail address is already in use.
fr: L'adresse électronique est déjà utilisée.

source: DHCP server name already used:
fr: Le nom du serveur DHCP est déjà utilisé :

source: Default Kolab home server does not exist
fr: Le serveur Kolab par défaut n'existe pas

source: Default primary group does not exist
fr: Le groupe principal par défaut n'existe pas

source: This is a primary group.
fr: C’est un groupe principal.

source: The requested group not be found.
fr: Groupe demandé non trouvé.

source: The DHCP entry was not found.
fr: Entrée DHCP non trouvée.

source: The DNS entry was not found
fr: Enregistrement DNS non trouvé

source: The FQDN of this object is too long, it must have less than 64 characters.
fr: Le FQDN de cet objet est trop long, il doit se composer de moins de 64 caractères.

source: Not all needed information was entered.
fr: Certaines informations nécessaires n'ont pas été saisies.

source: Cannot overwrite a fixed attribute.
fr: Impossible d'écraser un attribut fixe.

source: Dynamic BOOTP leases are not compatible with failover.
fr: Les baux BOOTP dynamiques ne sont pas compatibles avec le basculement en cas de panne.

source: No license found.
fr: Pas de licence trouvée.

source: The license is invalid.
fr: La licence n'est pas valable.

source: The license is expired.
fr: La licence a expiré.

source: The license is invalid for the current base DN.
fr: La licence n'est pas valable pour le ND de base actuel.

source: Too many user accounts
fr: Trop de comptes d'utilisateur

source: Too many client accounts
fr: Trop de comptes clients

source: Too many desktop accounts
fr: Trop de comptes de bureau

source: Too many groupware accounts
fr: Trop de comptes de collecticiel

source: Too many users
fr: Trop d'utilisateurs

source: Too many servers
fr: Trop de serveurs

source: Too many managed clients
fr: Trop de clients gérés

source: Too many corporate clients
fr: Trop de clients d'entreprise

source: Too many DVS users
fr: Trop d'utilisateurs DVS

source: Too many DVS clients
fr: Trop de clients DVS

source: During this session add and modify are disabled
fr: L'ajout et la modification sont désactivés au cours de cette session

source: Password has been used before. Please choose a different one.
fr: Ce mot de passe a déjà été utilisé. Veuillez en choisir un autre.

source: The password is too short, at least 8 character!
fr: Le mot de passe est trop court, il doit contenir au moins 8 caractères !

source: Network and IP range are incompatible.
fr: Le réseau et la plage d'IP sont incompatibles.

source: The IP range contains its network address. That is not permitted!
fr: La plage d'IP contient son adresse réseau. C'est interdit !

source: The IP range contains its broadcast address. That is not permitted!
fr: La plage d'IP contient son adresse de diffusion. C'est interdit !

source: Overlapping IP ranges
fr: Chevauchement de plages d'IP

source: Invalid combination of options.
fr: Combinaison d'options invalide.

source: Password policy error:
fr: Erreur de stratégie de mot de passe :

source: This operation is not allowed on this object.
fr: Cette opération n'est pas autorisée sur cet objet.

source: Empty printer groups are not possible.
fr: Des groupes d'imprimantes vides sont impossibles.

source: Printer groups with quota support can only have members with quota support.
fr: Les groupes d'imprimantes gérant des quotas ne peuvent avoir que des membres gérant ces mêmes quotas.

source: Only printer objects can be members of a printer group.
fr: Seuls les objets imprimantes peuvent faire partie du groupe des imprimantes.

source: Only existing groups are allowed.
fr: Seuls les groupes existants sont autorisés.

source: Only existing users are allowed.
fr: Seuls les utilisateurs existants sont autorisés.

source: Invalid syntax in default value. Check these templates: %s.
fr: Syntaxe invalide pour la valeur par défaut. Vérifiez ces modèles : %s.

source: Timeperiod Object still in use!
fr: Objet de période de temps déjà utilisé !

source: IP address entry required to assign Nagios services!
fr: Un enregistrement d'adresse IP est nécessaire pour assigner les services Nagios !

source: DNS Forward Zone entry required to assign Nagios services!
fr: L'enregistrement DNS de zone de transmission (forward zone) est nécessaire pour assigner les services Nagios !

source: The DNS forward entry could not be created. Please remove existing alias records or comparable DNS objects with the same name as this host from the forward zone.
fr: Impossible de créer l'enregistrement de transmission DNS. Veuillez supprimer les enregistrements d'alias et autres objets DNS de même genre existants qui ont un nom identique à cet hôte dans la zone de transmission.

source: Circular group dependency detected:
fr: Dépendance de groupe circulaire détectée :

source: Need a primary group with samba option to create a user with samba option
fr: Un groupe principal avec l'option Samba est nécessaire pour créer un utilisateur avec une telle option

source: The object type of this object differs from the specified object type.
fr: Le type de cet objet diffère du type d’objet spécifié.

source: There was no valid kerberos realm found.
fr: Aucun domaine Kerberos valide n’a été trouvé.

source: An object with the name already exists in the subtree position
fr: Un objet portant le nom existe déjà dans la position de la sous-arborescence

source: There was no LDAP base specified.
fr: Aucune base LDAP précisée.

source: Authentication failed
fr: Échec de l'authentification

source: Moving children is not supported.
fr: Il n'est pas possible de déplacer les enfants.
