Repository: univention/univention-corporate-server
Catalog: */univention-system-activation/www/*.po
Languages: de

source: %(appliance_name)s Appliance is now activated. Click "Finish" to access the management interface (which may take a while).
de: %(appliance_name)s Appliance ist nun aktiviert. Klicken sie auf "Weiter", um auf die Verwaltungsoberfläche zuzugreifen. (Das kann einige Zeit benötigen.)

source: A license file has been sent to <strong class="email-address">%s</strong>. This file is necessary to activate the system. For this, please carry out the following steps: <ol><li>Open the email.</li><li>Save the attachment (ucs.license) on your computer.</li><li>Click the button 'Upload license file'.</li><li>Select the file (ucs.license) you just saved.</li><li>Confirm the selection.</li></ol>Once the activation has been finished your email address will be sent to the app provider. The app provider may contact you.
de: Eine Lizenzdatei wurde an <strong class="email-address">%s</strong> gesendet. Sie wird benötigt um das System zu aktivieren. Bitte führen Sie dazu folgende Schritte aus: <ol><li>Öffnen Sie die E-Mail.</li><li>Speichern Sie den Anhang (ucs.license) auf Ihren Computer.</li><li>Klicken Sie auf die Schaltfläche 'Lizenzdatei hochladen'.</li><li>Wählen Sie die soeben gespeicherte Datei (ucs.license) aus.</li><li>Bestätigen Sie die Auswahl.</li></ol> Sobald die Aktivierung durchgeführt ist, wird Ihre E-Mail-Adresse an den App-Anbieter weitergeleitet. Der App-Anbieter wird Sie ggf. kontaktieren.

source: Activation of %(appliance_name)s Appliance
de: Aktivierung von %(appliance_name)s Appliance

source: Activation successful!
de: Aktivierung erfolgreich!

source: An unknown error has occurred.
de: Ein unbekannter Fehler trat auf.

source: An unknown error occurred. It is possible that a browser addon blocks sending the request to "license.univention.de". More information how to avoid this error can be found <a href="https://help.univention.com/t/7698" target="_blank" rel="noreferrer noopener">in our support database</a>.
de: Ein unbekannter Fehler ist aufgetreten. Es besteht die Möglichkeit, dass ein Webbrowser Addon die Anfrage an "license.univention.de" blockiert hat. Informationen um diesen Fehler zu vermeiden stehen <a href="https://help.univention.com/t/7698" target="_blank" rel="noreferrer noopener"> in unserer Support Datenbank</a> zur Verfügung.

source: E-mail address
de: E-Mail-Adresse

source: Error
de: Fehler

source: If you already have a license file you can <a href="#upload">skip this step and upload the license</a>.
de: Wenn Sie bereits über eine Lizenzdatei verfügen, dann können Sie diesen <a href="#upload">Schritt überspringen und die Lizenz einspielen</a>.

source: If you did not receive an email, please check your SPAM directory or <a href="#register"> request the email again</a>.
de: Sollten Sie keine E-Mail erhalten haben, prüfen Sie Ihr SPAM-Verzeichnis oder <a href="#register">fordern Sie die Lizenzdatei noch einmal an</a>.

source: If you encounter problems during the activation, please send an email to: <strong><a href="mailto:feedback@univention.de" style="color:#000">feedback@univention.de</a></strong>
de: Sollten Probleme bei der Aktivierung auftreten, senden Sie bitte eine E-Mail an: <strong><a href="mailto:feedback@univention.de" style="color:#000">feedback@univention.de</a></strong>

source: License request for %(appliance_name)s Appliance
de: Anforderung einer Lizenz für %(appliance_name)s Appliance

source: More details about the activation can be found in the <a href="https://docs.software-univention.de/manual-%s.html#central:license" target="_blank">UCS manual</a>.
de: Weitere Informationen zu der Aktivierung können im <a href="https://docs.software-univention.de/handbuch-%s.html#central:license" target="_blank">UCS-Handbuch</a> gefunden werden.

source: No valid email address.
de: Keine gültige E-Mail-Adresse.

source: Please enter a valid email address in order to activate %(appliance_name)s Appliance. The activation is mandatory to deploy the system. In the next step you can upload the license file that has been sent to your email address.
de: Bitte geben Sie eine gültige E-Mail-Adresse ein, um %(appliance_name)s Appliance zu aktivieren. Die Aktivierung ist Voraussetzung, um das System in Gebrauch zu nehmen. Im nächsten Schritt können sie die Lizenzdatei hochladen, die an Ihre E-Mail-Adresse gesendet wurde.

source: Request activation
de: Aktivierung anfordern

source: Switch language
de: Sprache ändern

source: The following error occurred:
de: Der folgende Fehler trat auf:

source: The server is not responding. Please restart the system.
de: Der Webserver antwortet nicht. Bitte starten Sie das System neu.

source: Upload license file
de: Lizenzdatei hochladen

source: [%(appliance_name)s Appliance] Activation Error
de: [%(appliance_name)s Appliance] Fehler bei Aktivierung

source: your email address
de: Ihre E-Mail-Adresse
