Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/nagios/*.po
Languages: fr

source: Arguments of used Nagios plugin
fr: Arguments du plugin Nagios utilisé

source: Assigned hosts
fr: Hôtes assignés

source: Basic settings
fr: Réglages de base

source: Check interval
fr: Intervalle de contrôle

source: Check period
fr: Plage de contrôle

source: Check services on these hosts
fr: Vérifier les services sur ces hôtes

source: Check services within check period
fr: Vérifier les services pendant la plage de contrôle

source: Check settings
fr: Vérifier les réglages

source: Command name of Nagios plugin
fr: Nom de la commande associée au plugin Nagios

source: Description of time period (eg. non-workhours)
fr: Description de la plage horaire (par exemple heures non ouvrées)

source: Friday
fr: Vendredi

source: General
fr: Général

source: General Nagios service settings
fr: Réglages généraux des services Nagios

source: General Nagios time period settings
fr: Réglages généraux des plages horaires Nagios

source: Hosts
fr: Hôtes

source: Interval
fr: Intervalle

source: Interval between checks
fr: Intervalle entre deux vérifications

source: Interval between notifications
fr: Intervalle entre deux notifications

source: Interval between re-checks if service is in non-OK-state
fr: Intervalle entre deux vérifications si le service est dans un état différent de OK

source: Maximum number of check attempts
fr: Nombre maximal de tentatives de vérification

source: Maximum number of check attempts with non-OK-result until contact will be notified
fr: Nombre maximal de tentatives de vérification donnant un résultat différent de OK avant que le contact ne soit notifié

source: Monday
fr: Lundi

source: Nagios object
fr: Objet Nagios

source: Nagios object name
fr: Nom de l'objet Nagios

source: Nagios service
fr: Service Nagios

source: Nagios time period
fr: Plage horaire Nagios

source: Name
fr: Nom

source: No valid timeperiod list!
fr: La liste de plages horaires n'est pas valide !

source: Notification
fr: Notifications

source: Notification interval
fr: Intervalle de notification

source: Notification period
fr: Plage de notification

source: Notification settings
fr: Réglages des notifications

source: Notify if service state changes to CRITICAL
fr: Notifier si l'état du service passe à CRITICAL

source: Notify if service state changes to RECOVERED
fr: Notifier si l'était du service passe à RECOVERED

source: Notify if service state changes to UNREACHABLE
fr: Notifier si l'état du service passe à UNREACHABLE

source: Notify if service state changes to WARNING
fr: Notifier si l'état du service passe à WARNING

source: Plugin command
fr: Commande du module externe

source: Plugin command arguments
fr: Arguments de la commande du module externe

source: Retry check interval
fr: Intervalle entre deux essais de vérification

source: Saturday
fr: Samedi

source: Send notifications during this period
fr: Envoyer les notifications pendant cette plage horaire

source: Service description
fr: Description du service

source: Service name
fr: Nom du service

source: Sunday
fr: Dimanche

source: Thursday
fr: Jeudi

source: Time Period Settings
fr: Réglages des plages horaires

source: Tuesday
fr: Mardi

source: Use NRPE
fr: Utiliser NRPE

source: Use NRPE to check remote services
fr: Utiliser NRPE pour vérifier les services distants

source: Wednesday
fr: Mercredi

source: enter list of periods (e.g. 00:00-07:15,14:30-18:32,23:00-24:00)
fr: Saisissez une liste de plages horaires (par exemple 00:00-07:15,14:30-18:32,23:00-24:00)
