Repository: univention/univention-corporate-server
Catalog: doc/scenarios/locales/*/LC_MESSAGES/enterprise.po
Languages: de

source: Heterogeneous enterprise environment in an insurance company
de: Heterogene Großumgebung im Konzernverbund

source: *Hanseatische Marineversicherung* (HMV) is an insurance company with 1800 employees specialized in the logistics sector. HMV is a subsidiary of the Vigil Insurances parent company.
de: Die Hanseatische Marineversicherung (HMV) ist ein auf den Logistikbereich spezialisierter Versicherungsdienstleister mit 1800 Mitarbeitern. Die HMV ist ein Bestandteil der Konzernmutter Vigil Insurances.

source: The parent company operates an independent directory service based on Microsoft Active Directory, but the user data of the individual subsidiaries is managed internally.
de: Die Konzernmutter betreibt einen eigenständigen Verzeichnisdienst auf Basis von Microsoft Active Directory, die Pflege der Benutzerdaten der einzelnen Tochterfirmen erfolgt jedoch autark.

source: The employees work at a total of 36 locations across the world with the largest being the company headquarter in Bremen with approximately 250 persons. Many of the users work on the move with laptops as salespersons or estimators.
de: Die Mitarbeiter arbeiten an insgesamt 36 Standorten weltweit, der größte davon der Stammsitz in Bremen mit ca. 250 Personen. Viele der Benutzer arbeiten als Vertreter oder Gutachter mobil mit Notebooks.

source: Microsoft Windows is used on all the desktops. Software distribution and the installation of security updates are centralized.
de: Auf den Desktops kommt durchgehend Microsoft Windows zum Einsatz. Die Softwareverteilung und Installation von Sicherheitsupdates erfolgt zentralisiert.

source: Citrix XenApp needs to be employed in the headquarters because of a superordinate group policy: users connect to the terminal services with thin clients.
de: In der Zentrale soll aufgrund einer übergeordneten Konzernrichtlinie Citrix XenApp eingesetzt werden, die Benutzer greifen dann mit Thin Clients darauf zu.

source: The groupware Microsoft Exchange is provided centrally by the parent company.
de: Die Groupware wird durch Microsoft Exchange zentral von der Konzernmutter bereitgestellt.

source: All users, computers and services need to be centrally administrable. Critical system status is reported promptly per email and SMS.
de: Alle Benutzer, Rechner und Dienste sollen zentral verwaltbar sein. Kritische Systemzustände sollen zeitnah per E-Mail und SMS gemeldet werden.

source: All server systems in the headquarters need to be virtualized. The resulting considerable significance of virtualization requires the implementation of an open source solution.
de: Alle Serversysteme in der Zentrale sollen virtualisiert werden. Aufgrund der daraus erwachsenden erheblichen Bedeutung der Virtualisierung muss dafür eine Open Source Lösung zum Einsatz kommen.

source: Data backup is performed centrally in Bremen.
de: Die Datensicherung erfolgt zentral in Bremen.

source: Different international compliance requirements from the insurance sector must be satisfied.
de: Verschiedene internationale Compliance-Anforderungen aus dem Versicherungssektor müssen erfüllt werden.

source: A special application for insurance business runs on a Power7 system with IBM AIX. The users on this system don't need to be maintained twice.
de: Eine Spezialapplikation für die Versicherungswirtschaft wird auf einem Power7-System mit IBM AIX betrieben. Die Benutzer auf diesem System sollen nicht doppelt gepflegt werden.

source: Implementation
de: Umsetzung

source: The company implements an infrastructure composed of a UCS |UCSPRIMARYDN|, a UCS |UCSBACKUPDN|, several UCS |UCSREPLICADN| s and 150 thin clients.
de: Das Unternehmen implementiert eine Infrastruktur bestehend aus einem |UCSPRIMARYDN|, einem |UCSBACKUPDN|, mehreren |UCSREPLICADN| s mit Univention Corporate Server (UCS) und 150 Thin Clients.

source: The |UCSPRIMARYDN| is the centerpiece of the UCS domain. The central, writable LDAP directory is provided on this system.
de: Der |UCSPRIMARYDN| ist das Kernstück der UCS-Domäne. Auf diesem System wird der zentrale, schreibbare LDAP-Verzeichnisdienst vorgehalten.

source: General overview (excluded: storage, DNS, DHCP, print services, virtualization, backup)
de: Gesamtüberblick (nicht im Bild: Storage, DNS, DHCP, Druckdienste, Virtualisierung, Backup)

source: The |UCSBACKUPDN| also largely represents a copy of the |UCSPRIMARYDN|. In this way, the important services are available doubled on the network, the availability of the services is thus further increased and the load is distributed between the Directory Nodes.
de: Der |UCSBACKUPDN| stellt weitgehend eine Kopie des |UCSPRIMARYDN| dar. Dadurch sind alle wichtigen Dienste doppelt im Netzwerk vorhanden, die Verfügbarkeit der Dienste wird also weiter erhöht und die Last zwischen den Directory Nodes verteilt.

source: If the |UCSPRIMARYDN| fails as a result of a hardware defect, the |UCSBACKUPDN| can be converted to the |UCSPRIMARYDN| in a very short time.
de: Sollte der |UCSPRIMARYDN| durch einen Hardware-Defekt ausfallen, kann der |UCSBACKUPDN| innerhalb kürzester Zeit zum |UCSPRIMARYDN| umgewandelt werden.

source: The |UCSPRIMARYDN| and |UCSBACKUPDN| are both installed at the company headquarters. The locations also contain additional |UCSREPLICADN| systems, which provide Windows domain services, print services and software distribution.
de: Der |UCSPRIMARYDN| und der |UCSBACKUPDN| stehen in der Firmenzentrale. An den Standorten finden sich weitere |UCSREPLICADN| s, die Windows-Domänendienste, Druckdienste und eine Softwareverteilung bereitstellen.

source: Structure of a location
de: Aufbau eines Standort-Servers

source: Software distribution of UCS systems
de: Software-Verteilung der UCS-Systeme

source: Installation profiles have been created for the UCS Directory Nodes. These profiles can be used to roll out additional systems with the Univention Net Installer using PXE or, as required, to restore systems after hardware failure. The installation concludes without further user interaction.
de: Für die UCS Directory Nodes wurden Installationsprofile erstellt. Mit diesen Profilen können mit dem Univention Net Installer PXE-basiert neue Systeme ausgerollt werden oder ggf. Systeme nach einem Hardwareausfall wieder hergestellt werden. Die Installation läuft dabei ohne weitere Benutzerinteraktion ab.

source: A central package installation source - the repository - is established on a server in the headquarters for the installation of release updates and the subsequent installation of software packages. All software packages available for installation and updates are provided there.
de: Für die Installation von Release-Updates und die Nachinstallation von Software-Paketen wird auf einem Server in der Zentrale eine zentrale Paket-Installationsquelle - das Repository - eingerichtet. Alle installierbaren Software-Pakete und -Updates werden dort vorgehalten.

source: Policies in the |UCSUMC| can be used to control the software distribution centrally. The updates can be installed or software packages can be subsequently installed at a freely selectable time or when shutting down or starting up the system.
de: Durch Richtlinien in der |UCSUMC| kann die Softwareverteilung zentral gesteuert werden. Zu einem frei wählbaren Zeitpunkt oder beim Herunterfahren oder Starten des Systems werden dann Updates eingespielt oder Software-Pakete nachinstalliert.

source: All systems record the installed packages in a central SQL database automatically so that an overview of the software inventory is always available. Security updates for UCS are promptly provided to download and can also be installed automatically.
de: Alle Systeme tragen die installierten Pakete automatisch in eine zentrale SQL-Datenbank ein, sodass ein Überblick über den Softwarebestand stets gewährleistet ist. Sicherheitsupdates für UCS werden zeitnah zum Download bereitgestellt und können ebenfalls automatisiert eingespielt werden.

source: Connecting Windows clients and Windows software deployment
de: Anbindung von Windows-Clients und Software-Verteilung

source: Samba/AD is used in the HMV for the integration of Microsoft Windows clients. Samba/AD offers domain, directory and authentication services which are compatible with Microsoft Active Directory. These also allow the use of the tools provided by Microsoft for the management of group policies (GPOs).
de: In der HMV wird Samba/AD für die Anbindung der Windows-Clients eingesetzt. Samba/AD bietet Domänen-, Verzeichnis- und Authentifizierungsdienste, die kompatibel zu Microsoft Active Directory sind. Diese ermöglichen auch die Verwendung der von Microsoft bereitgestellten Werkzeuge für die Verwaltung von Gruppenrichtlinien (GPOs).

source: Windows clients can join the Active Directory-compatible domains provided by UCS directly and can be centrally configured through group policies. From the client point of view, the domain join procedure is identical to joining a Windows-based domain.
de: Windows-Clients können direkt der durch UCS bereitgestellten Active Directory-kompatiblen Domäne beitreten und über Gruppenrichtlinien zentral konfiguriert werden. Der Domänen-Join ist aus Client-Sicht identisch mit dem Beitritt zu einer Windows-basierten Domäne.

source: The open source software distribution :program:`opsi` runs on the Windows clients. It allows an extensively automated distribution of security updates and Windows updates as well as the rollout of software packages to the Windows clients.
de: Auf den Windows-Clients läuft die Open Source-Softwareverteilung :program:`opsi`. Sie ermöglicht auf den Windows-Clients eine weitgehend automatisierte Verteilung von Sicherheitsupdates und Windows-Updates sowie den Rollout von Software-Paketen.

source: opsi is also used to rollout additional Windows systems. These are automatically installed through PXE.
de: opsi wird auch für den Rollout zusätzlicher Windows-Systeme verwendet. Diese werden über PXE automatisch installiert.

source: Active Directory synchronization
de: Active Directory-Anbindung

source: The :program:`Univention Active Directory Connector` makes it possible to synchronize directory service objects between a Microsoft Windows 2012/2016/2019 server with Microsoft Active Directory (AD) and an open source LDAP directory service in |UCSUCS|.
de: Der :program:`Univention Active Directory Connector` ermöglicht eine Synchronisation von Verzeichnisdienstobjekten zwischen einem Microsoft Windows 2012/2016/2019 Server mit Microsoft Active Directory (AD) und dem OpenLDAP-Verzeichnisdienst in |UCSUCS|.

source: The synchronization settings can be specified individually. The administrator thus has the possibility of controlling the synchronization precisely and only synchronizing selected objects and attributes.
de: Die Synchronisationseinstellungen können individuell festgelegt werden. Der Administrator erhält dadurch die Möglichkeit, die Synchronisation exakt zu steuern und nur ausgewählte Objekte und Attribute abzugleichen.

source: The UCS directory service synchronizes with the Microsoft Active Directory of the parent company. The replication encompasses all the containers, organizational units, users and groups.
de: Der UCS-Verzeichnisdienst synchronisiert sich mit dem Microsoft Active Directory-Verzeichnis des Mutterkonzerns. Die Replikation umfasst alle Container, Organisationseinheiten, Benutzer und Gruppen.

source: The computer accounts are not synchronized, as Windows computers can only be joined in one domain. All Windows clients are joined in the UCS Samba/AD domain.
de: Die Rechnerkonten werden nicht synchronisiert, da Windows-Rechner nur in eine Domäne eingebunden sein können. Alle Windows-Clients sind in die UCS Samba/AD-Domäne gejoint.

source: The groupware is provided in the form of Exchange Server 2016 by the parent company Vigil Insurances, allowing the users to connect to it using Outlook and Outlook on the web.
de: Die Groupware wird in Form von Exchange Server 2016 komplett durch die Konzernmutter Vigil Insurances bereitgestellt, auf das die Benutzer mit Outlook und Outlook-on-the-web zugreifen.

source: The integration of the UCS directory service and the Active Directory of the parent company allows authentication with the same username / password.
de: Durch die Anbindung des UCS-Verzeichnisdienstes an das Active Directory der Konzernmutter erfolgt die Authentifizierung mit der gleichen Benutzernamen/Passwort-Kombination.

source: Users can connect to the services of both environments in a transparent way, as the same user settings apply in both domains. For example, a user can sign in both the UCS directory service on their laptop and the Citrix Server in the Microsoft Active Directory with the same username and password.
de: Da in beiden Domänen die gleichen Benutzereinstellungen greifen, können Benutzer transparent auf Dienste beider Umgebungen zugreifen. So kann etwa ein Benutzer sich sowohl an seinem Notebook am UCS-Verzeichnisdienst als auch am Citrix-Server im Microsoft Active Directory mit dem selben Benutzernamen und Kennwort anmelden.

source: Compliance requirements
de: Compliance-Anforderungen

source: HMV must satisfy a range of insurance industry compliance requirements.
de: Die HMV muss eine Reihe von Compliance-Anforderungen im Versicherungswesen erfüllen:

source: All LDAP write accesses must be verifiable. This is done by means of the Univention Directory Logger. This transcribes each LDAP change in a secure transaction log file, which is protocolized audit-compliantly with checksums.
de: Alle LDAP-Schreibzugriffe müssen verifizierbar sein. Hierzu wird der Univention Directory Logger eingesetzt. Dieser schreibt jede LDAP-Änderung in eine gesicherte Transaktionslogdatei, die über Prüfsummen revisionssicher protokolliert wird.

source: The user data must be available immediately for external audit purposes. To do so, Univention Directory Reports can be used to create a PDF document or a CSV file of all or some users and groups from the |UCSUMC|.
de: Die Benutzerdaten müssen zeitnah für eine Betriebsprüfung abrufbar sein. Hierfür kann über Univention Directory Reports aus der |UCSUMC| heraus ein PDF-Dokument oder eine CSV-Datei über alle oder einige Benutzer und Gruppen erstellt werden.

source: Quality standards must be established for passwords. In UCS, for example, one can set a minimum number of lowercase and uppercase characters, symbols or figures for passwords. In addition, passwords can be compared against a list of unsafe passwords, for example ``secret``.
de: Es müssen Qualitätsstandards für Passwörter etabliert werden. In UCS kann für Passwörter beispielsweise eine Mindestanzahl von Klein- und Großbuchstaben, Sonderzeichen oder Ziffern konfiguriert werden. Außerdem können Passwörter gegen Listen unsicherer Passwörter abgeglichen werden, zum Beispiel ``secret``.

source: System monitoring with Nagios NRPE
de: System-Monitoring per Nagios NRPE

source: UCS integrates the system monitoring software Nagios through NRPE, which allows the monitoring of complex IT structures from networks, computers and services. This includes a comprehensive range of monitoring modules, which can also be expanded if necessary.
de: UCS integriert die Systemüberwachungssoftware Nagios per NRPE, was die Überwachung komplexer IT-Strukturen aus Netzen, Rechnern und Diensten ermöglicht. Es bringt eine umfassende Sammlung an Überwachungsmodulen mit, die ggf. auch noch erweitert werden können.

source: Integration of the AIX system
de: Integration des AIX-Systems

source: The insurance policies are administrated with an application which can only be operated on highly available Power7 systems using IBM AIX.
de: Die Versicherungspolicen werden mit einer Applikation verwaltet, die nur auf hochverfügbaren Power7-Systemen mit IBM AIX betrieben werden kann.

source: In the past, all users working on the system were maintained twice in the local user database of the AIX system. Now only the ``secldapclntd`` service runs on the AIX system; it performs all the authentication processes against the UCS LDAP directory.
de: In der Vergangenheit wurden alle Benutzer, die auf dem System arbeiten, doppelt in der lokalen Benutzerdatenbank des AIX-Systems gepflegt. Auf dem AIX-System läuft nun der ``secldapclntd``-Dienst, der sämtliche Authentifizierungsvorgänge gegen das UCS-LDAP-Verzeichnis durchführt.

source: In the headquarters 150 users work with terminal services based on Citrix XenApp. The XenApp terminal server runs on a Windows member server, which joined the local Samba/AD domain.
de: In der Zentrale arbeiten 150 Benutzer mit Terminaldiensten auf Basis von Citrix XenApp. Der XenApp-Terminalserver läuft auf einem Microsoft Windows-Memberserver, der in die Samba/AD-Domäne gejoint ist.

source: :program:`SEP sesam backup server` from the App Center is used for file backup, which can be installed with a few clicks. It offers a distributed backup concept with different backup agents, which backup both complete systems and data. Special backup agents are available for the backup of databases. All data is copied from the standard servers in the headquarters and from there saved on tape media. The installation can be performed with a few clicks in the App Center.
de: Für die Datensicherung kommt :program:`SEP sesam Backup Server` aus dem App Center zum Einsatz, das mit wenigen Klicks installiert ist. Es bietet ein verteiltes Sicherungskonzept mit verschiedenen Backup-Agenten, die sowohl komplette Systeme als auch Daten sichern können. Für die Sicherung von Datenbanken stehen etwa gesonderte Agenten zur Verfügung. Alle Daten werden von den Standort-Servern in die Zentrale kopiert und dort auf Bandmedien gesichert. Die Installation erfolgt mit wenigen Klicks aus dem App Center.

source: Integration of SuiteCRM
de: Integration von SuiteCRM

source: :program:`SuiteCRM` is employed as the CRM solution for sales personnel. The administration of the SuiteCRM users and roles integrates directly in the |UCSUMC|. The installation can be performed with a few clicks using the Univention App Center.
de: Als CRM-Lösung für Vertriebsmitarbeiter wird :program:`SuiteCRM` eingesetzt. Die Verwaltung der SuiteCRM Benutzer- und -rollen integriert sich direkt in die |UCSUMC|. Die Installation erfolgt mit wenigen Klicks aus dem App Center.

source: The installation is operated as a |UCSREPLICADN| system on the Amazon EC2 cloud. This ensures high availability and allows flexible scaling to growing performance and storage requirements.
de: Die Installation wird als |UCSREPLICADN| in der Amazon EC2-Cloud betrieben. Dies stellt eine hohe Erreichbarkeit sicher und erlaubt eine flexible Skalierung auf wachsende Leistungs- und Speicherplatzanforderungen.

source: References
de: Referenzen

source: :ref:`UCS Manual <uv-manual:introduction>`
de: :ref:`UCS Handbuch <uv-handbuch:introduction>`

source: :ref:`uv-manual:domain-ldap-directory-logger`
de: :ref:`uv-handbuch:domain-ldap-directory-logger`

source: `opsi <https://www.univention.com/products/univention-app-center/app-catalog/opsi/>`_
de: `opsi <https://www.univention.de/produkte/univention-app-center/app-katalog/opsi/>`_

source: `SEP sesam Backup Server <https://www.univention.com/products/univention-app-center/app-catalog/sep-sesam/>`_
de: `SEP sesam Backup Server <https://www.univention.de/produkte/univention-app-center/app-katalog/sep-sesam/>`_

source: `SuiteCRM <https://www.univention.com/products/univention-app-center/app-catalog/digitec-suitecrm/>`_
de: `SuiteCRM <https://www.univention.de/produkte/univention-app-center/app-katalog/digitec-suitecrm/>`_
