Repository: univention/univention-corporate-server
Catalog: doc/scenarios/locales/*/LC_MESSAGES/mid-sized.po
Languages: de

source: Medium-sized mechanical engineering company
de: Mittelständische Maschinenbau-Firma

source: Ganupa Technologies is one of the leading manufacturers of rolled steel mills. At the company headquarters in Germany, 260 people are employed in *Production*, *Administration*, *Design* and *Sales*. In addition, there are also local offices in the USA, Argentina and India, each with 5-10 employees.
de: Ganupa Technologies ist einer der wichtigsten Hersteller für Walzstahlfräsen. Am Firmensitz in Deutschland arbeiten 260 Mitarbeiter in *Produktion*, *Verwaltung*, *Konstruktion* und *Vertrieb*. Außerdem gibt es in den USA, Argentinien und Indien lokale Standorte mit je 5 bis 10 Mitarbeitern.

source: Linux is predominantly used on the desktops. The employees from *Design* and *Development* are dependent on Linux software and require a freely configurable desktop.
de: Auf dem Desktop kommt überwiegend Linux zum Einsatz. Die Mitarbeiter aus *Konstruktion* und *Entwicklung* sind auf Linux-Software angewiesen und benötigen einen frei konfigurierbaren Desktop.

source: The employees from *Administration* and *Sales* will only be offered an office suite, an email client and a web browser.
de: Für die Mitarbeiter aus der *Verwaltung* und dem *Vertrieb* soll nur eine Office-Suite, ein E-Mail-Client und ein Browser angeboten werden.

source: An accounting software required by some users is only available for Microsoft Windows. Part of the design process is performed with a CAD software, which is only available for Oracle Solaris.
de: Eine Buchhaltungssoftware, die von einigen Benutzern benötigt wird, ist nur unter Microsoft Windows verfügbar. Ein Teil der Konstruktion muss mit einer CAD-Software erfolgen, die nur für Oracle Solaris verfügbar ist.

source: The administration of the computers needs to be as central as possible. Whilst there are two IT technicians in the headquarters, there are no technical personnel at the other three branch offices.
de: Die Administration der Rechner soll möglichst zentralisiert erfolgen. Während in der Zentrale zwei IT-Mitarbeiter arbeiten, ist an den drei externen Standorten kein technisches Personal verfügbar.

source: To avoid non-productive times caused by malfunctions, the majority of the offered services must be provided redundantly.
de: Um Arbeitsausfälle durch Störungen zu vermeiden, muss der Großteil der angebotenen Dienste redundant bereitgestellt werden.

source: A proxy server will buffer the network traffic in a cache and provide virus protection.
de: Ein Proxy-Server soll den Netzwerkverkehr in einem Cache zwischenspeichern und Virenschutz anbieten.

source: A groupware solution is required for the coordination of the globally distributed work procedures.
de: Für die Koordination der weltweit verteilten Arbeitsabläufe wird eine Groupwarelösung benötigt.

source: All user data is centrally saved on an Storage Area Network device (SAN).
de: Alle Nutzdaten werden zentral auf einem Storage Area Network (SAN) gespeichert.

source: Implementation
de: Umsetzung

source: System overview of Ganupa Technologies headquarters (virtualization is not considered)
de: Systemübersicht von Ganupa Technologies am zentralen Standort (die Virtualisierung wird in diesem Schaubild nicht berücksichtigt)

source: Global organization scheme of Ganupa Technologies
de: Globaler Systemaufbau von Ganupa Technologies

source: Directory Nodes / LDAP directory
de: Directory Nodes / LDAP-Verzeichnis

source: The company implements an infrastructure composed of a UCS |UCSPRIMARYDN|, a UCS |UCSBACKUPDN|, several UCS |UCSREPLICADN| s and desktop systems consisting of desktop computers and notebooks. Microsoft Windows and Ubuntu Linux are used on those systems.
de: Das Unternehmen implementiert eine Infrastruktur bestehend aus einem UCS |UCSPRIMARYDN|, einem UCS |UCSBACKUPDN|, mehreren UCS |UCSREPLICADN| s und Arbeitsplatzsystemen für Mitarbeiter bestehend aus Desktop-Computern und Notebooks. Zum Einsatz kommen Microsoft Windows und Ubuntu Linux.

source: The |UCSPRIMARYDN| is the centerpiece of the UCS domain. The central, writable copy of the LDAP directory service is maintained on this system.
de: Der |UCSPRIMARYDN| ist das Kernstück der UCS-Domäne. Auf diesem System wird die zentrale schreibbare Kopie des LDAP-Verzeichnisdienstes vorgehalten.

source: The |UCSBACKUPDN| largely represents a copy of the |UCSPRIMARYDN|. In this way, the important services are available doubled on the network, the availability of the services is thus further increased and the load is distributed between the UCS Directory Nodes.
de: Der |UCSBACKUPDN| stellt weitgehend eine Kopie des |UCSPRIMARYDN| dar. Dadurch sind alle wichtigen Dienste doppelt im Netzwerk vorhanden, die Verfügbarkeit der Dienste wird also weiter erhöht und die Last zwischen den UCS Directory Nodes verteilt.

source: If the |UCSPRIMARYDN| fails as a result of a hardware defect, the |UCSBACKUPDN| can be converted to the |UCSPRIMARYDN| in a very short time.
de: Sollte der |UCSPRIMARYDN| durch einen Hardwaredefekt ausfallen, kann der |UCSBACKUPDN| innerhalb kürzester Zeit zu einem |UCSPRIMARYDN| umgewandelt werden.

source: The |UCSPRIMARYDN| and |UCSBACKUPDN| are both installed at the company headquarters. The two UCS systems operate an LDAP server and provide login services for the domains. A DNS and DHCP server maintained with data from the LDAP directory runs on both systems and provides central IP management. A print server is set up on the |UCSBACKUPDN|.
de: Der |UCSPRIMARYDN| und der |UCSBACKUPDN| stehen in der Firmenzentrale. Die beiden UCS-Systeme betreiben einen LDAP-Server und bieten Anmeldedienste für die Domäne an. Für ein zentrales IP-Management läuft auf beiden Systemen ein mit Daten aus dem LDAP-Verzeichnis gepflegter und somit redundanter DNS- und DHCP-Server. Auf dem |UCSBACKUPDN| ist ein Druckserver eingerichtet.

source: Print services
de: Druckdienste

source: Print jobs are forwarded to the requested printer through a print server. The print servers are realized with CUPS, which manages the different printers in a central spooling.
de: Druckaufträge werden über einen Print-Server an den gewünschten Drucker weiterleitet. Die Print-Server werden mit CUPS realisiert, das die verschiedenen Drucker in ein zentrales Spooling einbindet.

source: In some larger offices several printers are grouped together into a printer group; the users simply print on this group, whereby the print jobs are equally distributed and the next free printer is used. This saves the users from having to check whether a particular printer is already in use.
de: In einigen Großraumbüros sind mehrere Drucker zu einer Druckergruppe zusammengefasst. Die Benutzer drucken einfach auf diese Gruppe, wobei die Druckaufträge gleichmäßig verteilt werden und der nächste freie Drucker verwendet wird. Die Benutzer müssen so nicht prüfen, ob ein Drucker gerade in Verwendung ist.

source: Integration of Oracle Solaris systems
de: Einbindung von Oracle-Solaris-Systemen

source: A specialist application for CAD design is only available for Oracle Solaris. The name services on the Solaris system have been adapted to query the UCS LDAP for authentication. Users can sign in to the Solaris system with their domain user identification and password. This negates the need for the additional maintenance of local Solaris user accounts.
de: Eine Fachanwendung für CAD-Konstruktionen ist nur für Oracle Solaris verfügbar. Die Namensdienste auf dem Solaris-System wurden auf eine Authentifizierung gegen den UCS LDAP-Verzeichnisdienst angepasst, d.h. Benutzer können sich auf dem Solaris-System mit ihrer Domänen-Benutzerkennung und -Passwort anmelden. Die zusätzliche Pflege lokaler Benutzerkonten auf dem Solaris-System entfällt so.

source: The Solaris system is assigned its IP address from the UCS DHCP servers through DHCP. The files are saved on the UCS file servers through a NFS share.
de: Das Solaris-System erhält seine IP-Adresse über DHCP von den UCS DHCP-Servern zugewiesen. Die Datenspeicherung erfolgt auf den UCS Dateiservern über eine NFS-Freigabe.

source: Data management
de: Datenhaltung

source: All user data is stored on a central Storage Area Network (SAN) system. The different shares are registered and administrated in the |UCSUMC|. The Linux and Solaris clients connect to individual shares through the network file system (NFS), the Windows clients through the CIFS protocol.
de: Die Speicherung aller Benutzerdaten erfolgt auf einem zentralen SAN-System. Die verschiedenen Freigaben werden in der |UCSUMC| angelegt und verwaltet. Die Linux- und Solaris-Clients greifen über das Network Filesystem (NFS) auf die einzelnen Freigaben zu, die Windows-Clients über das CIFS-Protokoll.

source: Ganupa Technologies uses the groupware solution :program:`Open-Xchange App Suite` for arranging meetings and organizing contacts and tasks.
de: Ganupa Technologies verwendet die Groupwarelösung :program:`Open-Xchange App Suite` zur Abstimmung von Terminen, Kontakten und Aufgaben.

source: The groupware server is operated as a |UCSREPLICADN| system on the Amazon EC2 cloud. This allows flexible scaling of the groupware system to growing performance and storage requirements. The installation can be performed with a few clicks using the App Center.
de: Der Groupware-Server wird als |UCSREPLICADN| in der Amazon EC2-Cloud betrieben. Dies erlaubt eine flexible Skalierung des Groupwaresystems auf wachsende Leistungs- und Speicherplatzanforderungen. Die Installation erfolgt mit wenigen Klicks aus dem App Center.

source: The administration of the groupware-related attributes integrates seamlessly in the |UCSUMC|. The employees connect to the groupware through the OX App Suite web client and Mozilla Thunderbird.
de: Die Verwaltung der Groupware relevanten Attribute integriert sich nahtlos in die |UCSUMC|. Die Mitarbeiter greifen auf die Groupware über den Open-Xchange App Suite Web-Client und Mozilla Thunderbird zu.

source: Mobile devices like smartphones and tablets are integrated through the Microsoft ActiveSync protocol.
de: Mobile Endgeräte wie Smartphones und Tablets werden über das ActiveSync-Protokoll von Microsoft integriert.

source: Virus detection including signature updates and spam filters are integrated at no additional cost.
de: Virenerkennung inklusive Signaturen-Updates und Spamfilterung sind ohne weitere Folgekosten integriert.

source: Outlook
de: Ausblick

source: At a later point in time, the plan is to monitor the internet traffic centrally through a web proxy. For this purpose, UCS provides the app :program:`Proxy server/ web cache (Squid)`.
de: Zu einem späteren Zeitpunkt soll der Internet-Zugriff zentral über einen Web-Proxy kanalisiert und auf Viren und Malware geprüft werden. UCS bietet hierfür eine Integration über die App :program:`Proxyserver / Webcache (Squid)`.

source: Alternatively, it is also possible to procure a specialized appliance, which can authenticate the users against the UCS LDAP server.
de: Alternativ kann auch die Anschaffung einer spezialisierten Appliance erwogen werden, die die Benutzer dann gegen den UCS LDAP-Server authentifizieren kann.

source: References
de: Referenzen

source: :ref:`UCS Manual <uv-manual:introduction>`
de: :ref:`UCS Handbuch <uv-handbuch:introduction>`

source: `OX App Suite <https://www.univention.com/products/univention-app-center/app-catalog/oxseforucs/>`_
de: `OX App Suite <https://www.univention.de/produkte/univention-app-center/app-katalog/oxseforucs/>`_

source: `Proxy server/ web cache (Squid) <https://www.univention.com/products/univention-app-center/app-catalog/squid/>`_
de: `Proxy server/ web cache (Squid) <https://www.univention.de/produkte/univention-app-center/app-katalog/squid/>`_
