Repository: univention/univention-corporate-server
Catalog: management/univention-directory-manager-modules/modules/univention/admin/handlers/nagios/*.po
Languages: de

source: Arguments of used Nagios plugin
de: Parameter für das verwendete Plugin-Kommando

source: Assigned hosts
de: Zugeordnete Rechner

source: Basic settings
de: Allgemein

source: Check interval
de: Prüfintervall

source: Check period
de: Prüfzeitraum

source: Check services on these hosts
de: Rechner, auf denen der Dienst überprüft werden soll

source: Check services within check period
de: Dienste werden in diesem Zeitraum überwacht

source: Check settings
de: Intervalle

source: Command name of Nagios plugin
de: Zu verwendendes Nagios-Plugin

source: Description
de: Beschreibung

source: Description of time period (eg. non-workhours)
de: Beschreibung des Zeitraums (z.B. Wochenende)

source: Friday
de: Freitag

source: General
de: Allgemein

source: General Nagios service settings
de: Grundeinstellungen - Nagios-Dienst

source: General Nagios time period settings
de: Grundeinstellungen - Nagios-Zeitraum

source: Hosts
de: Rechner

source: Interval
de: Intervall

source: Interval between checks
de: Zeit zwischen zwei Überprüfungen

source: Interval between notifications
de: Zeit zwischen zwei Benachrichtigungen für das gleiche Problem

source: Interval between re-checks if service is in non-OK-state
de: Zeit zwischen zwei Überprüfungen, wenn Dienst im Nicht-OK-Zustand ist

source: Maximum number of check attempts
de: Maximale Anzahl der Überprüfungen

source: Maximum number of check attempts with non-OK-result until contact will be notified
de: Maximale Anzahl an Prüfungswiederholungen, bis ein Nicht-OK-Zustand gemeldet wird

source: Monday
de: Montag

source: Nagios object
de: Nagios-Objekt

source: Nagios object name
de: Nagios-Objekt Name

source: Nagios objects
de: Nagios-Objekte

source: Nagios service
de: Nagios-Dienst

source: Nagios services
de: Nagios-Dienste

source: Nagios time period
de: Nagios-Zeitraum

source: Nagios time periods
de: Nagios-Zeiträume

source: No valid timeperiod list!
de: Keine gültige Zeitraum-Liste!

source: Notification
de: Benachrichtigungen

source: Notification interval
de: Benachrichtigungsintervall

source: Notification period
de: Benachrichtigungszeitraum

source: Notification settings
de: Benachrichtigungseinstellungen

source: Notify if service state changes to CRITICAL
de: Benachrichtigen, wenn Zustand CRITICAL erreicht wird

source: Notify if service state changes to RECOVERED
de: Benachrichtigen, wenn Zustand RECOVERED erreicht wird

source: Notify if service state changes to UNREACHABLE
de: Benachrichtigen, wenn Zustand UNREACHABLE erreicht wird

source: Notify if service state changes to WARNING
de: Benachrichtigen, wenn Zustand WARNING erreicht wird

source: Plugin command
de: Plugin-Kommando

source: Plugin command arguments
de: Plugin-Kommando-Parameter

source: Retry check interval
de: Prüfintervall im Fehlerfall

source: Saturday
de: Samstag

source: Send notifications during this period
de: Benachrichtigungen werden in diesem Zeitraum versendet

source: Service description
de: Dienst-Beschreibung

source: Service name
de: Name des Dienstes

source: Sunday
de: Sonntag

source: The host "%s" does not exists.
de: Der Rechner "%s" existiert nicht.

source: The host "%s" is invalid, it has no "cn" attribute.
de: Der Rechner "%s" ist ungültig, der er kein "cn"-Attribut besitzt.

source: Thursday
de: Donnerstag

source: Time Period Settings
de: Zeitraum-Einstellungen

source: Tuesday
de: Dienstag

source: Use NRPE
de: NRPE benutzen

source: Use NRPE to check remote services
de: NRPE benutzen, um entfernte Dienste zu überprüfen

source: Wednesday
de: Mittwoch

source: enter list of periods (e.g. 00:00-07:15,14:30-18:32,23:00-24:00)
de: Angabe von Zeiträumen (z.B. 00:00-07.15,23:12-24:00)

source: https://docs.software-univention.de/manual-5.0.html#nagios:Configuration_of_the_Nagios_monitoring
de: https://docs.software-univention.de/handbuch-5.0.html#nagios:Konfiguration_der_Nagios-Überwachung
