Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/*/univention-system-setup/umc/python/setup/*.po
Languages: fr

source: A domain name server needs to be specified.
fr: Vous devez indiquer un serveur de nom de domaine.

source: A valid NetBIOS name can not be longer than 13 characters. If Samba is installed, the hostname should be shortened.
fr: Un nom NetBIOS valide ne peut pas comporter plus de 13 caractères. Si Samba est installé, le nom d'hôte doit être raccourci.

source: Bond-primary must exist in bond-slaves
fr: Un lien maître doit être présent parmi les liens agrégés

source: Business unit
fr: Division opérationnelle (BU)

source: Cannot automatically determine the domain. Please specify the server's fully qualified domain name.
fr: Impossible de déterminer automatiquement le domaine. Veuillez indiquer le nom de domaine pleinement qualifié.

source: Cannot use bridge %r as bridge-port
fr: Impossible d'utiliser le pont %r comme port de pont

source: Cannot use device %s: Device must be unconfigured
fr: Impossible d’utiliser l’appareil %s : l’appareil doit être déconfiguré

source: Common name for the root SSL certificate
fr: Nom courant pour le certificat SSL racine

source: Country
fr: Pays

source: Country must be a country code consisting of 2 characters.
fr: Le pays doit être un code pays constitué de 2 caractères.

source: Device %(device)r is already in use by %(name)r
fr: L’appareil %(device)r est déjà utilisé par %(name)r

source: Devices used in a bonding must be physical: %s is not
fr: Les appareils utilisés dans un agrégat doivent être physiques : ce n’est pas le cas de %s

source: Domain name server
fr: Serveur de noms de domaine

source: Duplicated IP address: %r
fr: Adresse IP en doublon : %r

source: During the check of the license status the following error occurred: {error}
fr: Lors de la vérification de l’état de la licence, l’erreur suivante s’est produite : {error}

source: Email address
fr: Adresse électronique

source: Encountered unexpected error during setup process: %s
fr: Erreur inattendue rencontrée lors du processus de configuration : %s

source: External name server
fr: Serveur de noms externe

source: Failed to get package for Role %s
fr: Échec de la récupération du paquetage pour le rôle %s

source: Hostname is equal to domain name.
fr: Le nom d'hôte est identique au nom de domaine.

source: Invalid IPv4 address: %r
fr: Adresse IPv4 non valide : %r

source: Invalid IPv4 netmask: %r
fr: Masque de réseau IPv4 non valide : %r

source: Invalid IPv6 address: %r
fr: Adresse IPv6 non valide : %r

source: Invalid IPv6 identifier: %r
fr: Identifiant IPv6 non valide : %r

source: Invalid IPv6 netmask: %r
fr: Masque de réseau IPv6 non valide : %r

source: Invalid VLAN ID. Must be between 1 and 4095.
fr: Identifiant de VLAN non valide. Il doit être compris entre 1 et 4095.

source: Invalid bond-mode: %r
fr: Mode d'agrégation de liens non valide : %r

source: Invalid device name: %r
fr: Nom d’appareil non valide : %r

source: It is not possible to install Samba 3 and Samba 4 on one system. Please select only one of these components.
fr: Il n'est pas possible d'installer Samba 3 et Samba 4 sur un même système. veuillez ne choisir qu'un seul de ces deux composants.

source: Location
fr: Emplacement

source: Missing IPv6 default identifier
fr: Identifiant IPv6 par défaut manquant

source: Missing device for bond-slaves
fr: Appareil manquant pour les liens agrégés

source: Missing device: %r
fr: Appareil manquant: %r

source: Multiple IPv4 addresses are not supported on this device.
fr: Cet appareil ne prend pas en charge des adresses IPv4 multiples.

source: No UCS Primary Directory Node could be found at the address.
fr: Aucun Primary Directory Node d’UCS n’a pu être trouvé à cette adresse.

source: No fully qualified domain name has been specified for the system.
fr: Aucun nom de domaine pleinement qualifié n'a été défini pour le système.

source: No hostname has been specified for the system.
fr: Aucun nom d'hôte n'a été défini pour le système.

source: Organization
fr: Organisation

source: Please enter a valid email address
fr: Veuillez saisir une adresse électronique valide

source: Please enter a valid fully qualified domain name (e.g. host.example.com).
fr: Veuillez saisir un nom de domaine pleinement qualifié valide (par exemple hote.exemple.fr).

source: Request Timeout
fr: Expiration de la requête

source: State
fr: État

source: The LDAP base may neither contain blanks nor any special characters. Its structure needs to consist of at least two relative distinguished names (RDN) which may only use the attribute tags 'dc', 'cn', 'c', 'o', or 'l' (e.g., dc=test,dc=net).
fr: La base LDAP ne peut contenir ni espaces, ni caractères spéciaux. Sa structure doit être constituée d'au moins deux noms distingués relatifs (Relative Distinguished Names, RDN) qui ne peuvent utiliser que les étiquettes d'attributs 'dc', 'cn', 'c', 'o', ou 'l' (par exemple dc=test,dc=net).

source: The UCS version of the domain you are trying to join ({}) is lower than the local one ({}). This constellation is not supported.
fr: La version d’UCS du domaine que vous essayez de rejoindre ({}) est inférieure à la version locale ({}). Cette constellation n’est pas prise en charge.

source: The connection to the Active Directory server failed. Please recheck the address.
fr: La connexion au serveur Active Directory a échoué. Veuillez revérifier l’adresse.

source: The connection to the Active Directory server was refused. Please recheck the password.
fr: La connexion au serveur Active Directory a été refusée. Veuillez revérifier le mot de passe.

source: The connection to the UCS Primary Directory Node was refused. Please recheck the password.
fr: La connexion au Primary Directory Node d’UCS a été refusée. Veuillez revérifier le mot de passe.

source: The following value is too long, only %(max)s characters allowed: %(name)s
fr: La valeur suivante est trop longue. Seuls %(max)s caractères sont autorisés : %(name)s

source: The given user is not member of the Domain Admins group in Active Directory. This is a requirement for the Active Directory domain join.
fr: Le compte d’utilisation indiqué n’est pas membre du groupe Domain Admins dans Active Directory. Ceci est indispensable pour rejoindre le domaine Active Directory.

source: The hostname %s is longer than 13 characters. It will not be possible to install an Active Directory compatible Domaincontroller (Samba 4) or UCS@school. The hostname cannot be changed after the installation of %s. It is recommended to shorten the hostname to maximal 13 characters.
fr: Le nom d’hôte %s contient plus de 13 caractères. Il sera impossible d’installer un contrôleur de domaine compatible avec Active Directory (Samba 4) ou UCS@school. Le nom d’hôte ne peut pas être modifié après l’installation de %s. Il est recommandé de raccourcir le nom d’hôte à un maximum de 13 caractères.

source: The hostname or the hostname part of the fully qualified domain name is invalid. Please go back to the host setting and make sure, that the hostname only contains letter (a-zA-Z) and digits (0-9).
fr: Le nom d'hôte ou la partie correspondant au nom d'hôte dans le nom de domaine pleinement qualifié n'est pas valide. Veuillez reprendre la configuration de l'hôte et vérifier que le nom d'hôte ne contient que des lettres (a-zA-z) et des chiffres (0-9).

source: The length of fully qualified domain name is greater than 63 characters.
fr: La longueur du nom de domaine pleinement qualifié dépasse 63 caractères.

source: The license %s is not valid.
fr: La licence %s n’est pas valide.

source: The primary network device must exist.
fr: L’appareil réseau principal doit exister.

source: The root password is too short. For security reasons, your password must contain at least 8 characters.
fr: Le mot de passe root est trop court. Pour des raisons de sécurité, votre mot de passe doit contenir au moins 8 caractères.

source: The root password may only contain ascii characters.
fr: Le mot de passe root ne peut contenir que des caractères ASCII.

source: The specified IP address (%(name)s) is not valid: %(value)s
fr: L'adresse IP indiquée (%(name)s) n'est pas valide : %(value)s

source: The specified domain name is different to the %s domain name found via the configured DNS server: %s
fr: Le nom de domaine spécifié est différent du nom de domaine %s trouvé via le serveur DNS configuré : %s

source: The specified gateway IPv4 address is not valid: %s
fr: L'adresse IPv4 indiquée pour la passerelle n'est pas valide : %s

source: The specified gateway IPv6 address is not valid: %s
fr: L'adresse IPv6 indiquée pour la passerelle n'est pas valide : %s

source: The specified nameserver %s is not part of a valid UCS domain.
fr: Le serveur de noms indiqué %s ne fait pas partie d'un domaine UCS valide.

source: The specified proxy address is not valid (e.g., http://10.201.1.1:8080): %s
fr: L'adresse indiquée pour le serveur mandataire n'est pas valide (par exemple http://10.201.1.1:8080) : %s

source: The value for %s contains invalid characters.
fr: La valeur indiquée pour %s contient des caractères non valides.

source: The windows domain name can only consist of upper case characters.
fr: Le nom de domaine Windows ne peut être constitué que de caractères majuscules.

source: The windows domain name cannot be longer than 15 characters.
fr: Le nom de domaine Windows ne peut pas excéder 15 caractères.

source: The windows domain name is not valid.
fr: Le nom de domaine Windows n'est pas valide.

source: There is no device configured. At least one IPv4 or IPv6 address or DHCP or SLAAC has to be specified.
fr: Aucun appareil n’est configuré. Il faut au moins indiquer une adresse IPv4 ou IPv6 ou un DHCP ou un SLAAC.

source: To install the {appliance_name} appliance it is necessary to have an activated UCS license on the Primary Directory Node.
fr: Pour installer l’Appliance {appliance_name}, il faut avoir une licence d’UCS activée sur le Primary Directory Node.

source: the %s appliance
fr: l’Appliance %s

source: the UCS system
fr: le système UCS

source: univention-join -checkPrerequisites reported a problem. Output of check:
fr: univention-join -checkPrerequisites a signalé un problème. Résultat de la vérification :
