Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/mail/*.po
Languages: fr

source: Access Rights
fr: Droits d'accès

source: Access rights for shared folder
fr: Droits d'accès pour le dossier partagé

source: Authorized groups
fr: Groupes autorisés

source: Authorized users
fr: Utilisateurs autorisés

source: Basic settings
fr: Réglages de base

source: E-Mail address
fr: Adresse électronique

source: General
fr: Général

source: General IMAP mail folder settings
fr: Réglages généraux du dossier de courriel IMAP

source: General mailing list settings
fr: Réglages généraux de la liste de diffusion

source: Group ACL
fr: ACL de groupe

source: Groups that are allowed to send e-mails to the list
fr: Groupes qui peuvent envoyer des messages à la liste

source: How many MB of emails can be stored in the shared folder (independent of the users that stored them).
fr: Combien de mégaoctets d’e-mails peuvent être stockés dans le dossier partagé (indépendamment des utilisatrices et utilisateurs qui les ont stockés).

source: IMAP mail folder
fr: Dossier de courriel IMAP

source: IMAP mail folders
fr: Dossiers de courriel IMAP

source: Mail
fr: Courriel

source: Mail address
fr: Adresse électronique

source: Mail domain
fr: Domaine de courrier électronique

source: Mail domain description
fr: Description du domaine de courriel

source: Mail domain name
fr: Nom de domaine de courriel

source: Mail domains
fr: Domaines de courrier électronique

source: Mail folder (IMAP)
fr: Dossier de courrier électronique (IMAP)

source: Mail home server
fr: Serveur hébergeant le courriel

source: Mail object
fr: Objet courriel

source: Mail objects
fr: Objets courriels

source: Mailing list
fr: Liste de diffusion

source: Mailing lists
fr: Listes de diffusion

source: Members
fr: Membres

source: Name
fr: Nom

source: Quota in MB
fr: Quota en Mo

source: User ACL
fr: ACL utilisateur

source: Users that are allowed to send e-mails to the list
fr: Utilisateurs qui peuvent envoyer des messages à la liste
