Repository: univention/univention-corporate-server
Catalog: management/univention-management-console-module-adtakeover/umc/python/adtakeover/*.po
Languages: de

source: failed
de: schlug fehl

source: AD Server did not return proper time string: %s.
de: Der Active Directory-Server lieferte eine unerwartete Zeitangabe zurück: %s.

source: Active Directory services not detected at %s.
de: Active Directory-Dienste sind nicht erreichbar über %s.

source: Active Directory takeover finished already.
de: Active Directory Takeover ist schon abgeschlossen.

source: Adjusting settings in Samba directory service
de: Anpassung von Einstellungen im Samba-Verzeichnisdienst

source: At least one GPO in SYSVOL is newer than the Group Policy Container version.
de: Mindestens eine GPO im SYSVOL ist neuer als die Group Policy Container Version.

source: At least one GPO in SYSVOL is not up to date yet.
de: Mindestens eine GPO im SYSVOL ist noch nicht aktuell.

source: At least one GPO is still missing in SYSVOL.
de: Mindestens eine GPO fehlt noch im SYSVOL.

source: Authenticating
de: Authentifizierung

source: Authentication failed.
de: Authentifizierung fehlgeschlagen.

source: Checking GPOs in SYSVOL
de: Prüfung der GPO-Daten im SYSVOL

source: Checking group policies
de: Prüfung der Gruppenrichtlinien

source: Claiming FSMO roles
de: Übernahme der FSMO-Rollen

source: Connecting to %s
de: Verbindung zu %s

source: Connection to Active Directory server %s failed.
de: Die Verbindung zum Active Directory-Server %s schlug fehl.

source: Copying %s
de: Kopiere %s

source: Could not read local machine password: %s
de: Interner Fehler beim Lesen des Maschinenpassworts: %s

source: Domain join failed.
de: Der Domänenbeitritt schlug fehl.

source: Execution of command '%(command)s' has failed: %(text)s
de: Die Ausführung des Kommandos '%(command)s' ist fehlgeschlagen: %(text)s

source: Failed to detect the Active Directory site of the server.
de: Die Erkennung des Active Directory-Standorts (site) des Servers schlug fehl.

source: Failed to determine AD domain SID.
de: Die SID der AD-Domäne konnte nicht festgestellt werden.

source: Failed to determine new domain SID.
de: Die neue Domänen-SID konnte nicht festgestellt werden.

source: Finalizing
de: Abschluss

source: Initializing the S4 Connector listener
de: Initialisierung des S4 Connector Listeners

source: Insufficient License.
de: Die Lizenz reicht nicht aus.

source: Internal Error: License check failed.
de: Interner Fehler bei der Prüfung der Lizenz.

source: Internal Error: rdate -s -p failed (%d).
de: Internal Error: rdate -s -p schlug fehl (%d).

source: Internal module error: Cannot go from state '%(current)s' to state '%(new)s'.
de: Interner Modulfehler: Übergang von Status '%(current)s' zu Status '%(new)s' ist nicht möglich.

source: Internal module error: Expected to be in state 'sysvol', but found '%s'.
de: Interner Modulfehler: Zustand 'sysvol' erwartet, aber '%s' gefunden.

source: Internal module error: Expected to be in state 'takeover', but found '%s'.
de: Interner Modulfehler: Zustand 'takeover' erwartet, aber '%s' gefunden.

source: Internal module error: Refusing to set invalid state '%s'.
de: Interner Modulfehler: Setzen des ungültigen Status '%s' abgelehnt.

source: Internal module error: Takeover running, aborting attempt to restart.
de: Interner Modulfehler: Takeover läuft, Neustartversuch abgebrochen.

source: Invalid UNC string: %s
de: Ungültiger UNC-Pfad: %s

source: Invalid state in file %s
de: Ungültige Zustands-Datei %s

source: Joining the domain
de: Domänenbeitritt

source: Network connection to %s failed.
de: Netzwerkverbindung zu %s schlug fehl.

source: Number of %(object_name)s after takeover would be %(sum)s. This would exceed the number of licensed objects (%(max)s).
de: Anzahl der %(object_name)s nach dem Takeover wäre %(sum)s. Das übersteigt die Anzahl an lizenzierten Objekten (%(max)s).

source: Rebuilding IDMAP
de: Erstellung der IDMAP-Tabelle

source: Reconfiguring nameserver
de: Rekonfigurierung des Nameservers

source: Registering IP in DNS
de: Registrierung der IP im DNS

source: Remote clock is behind local clock by more than %s seconds, refusing to turn back time. Please advance the clock of the Active Directory DC.
de: Die Uhr des Active Directory-Servers liegt hinter der lokalen Zeit um mehr als %s Sekunden zurück. Die lokale Zeit kann nicht zurückgestellt werden. Bitte stellen Sie die Zeit am Active Directory-DC vor.

source: Removing the previous AD server account
de: Entfernen des alten AD Server-Kontos

source: Reset SYSVOL ACLs
de: Initialisierung der SYSVOL-ACLs

source: Retrieving information from AD DC
de: Abfrage von Informationen vom AD-DC

source: Rewriting SIDs in the UCS directory service
de: Umschreibung der SIDs im UCS Verzeichnisdienst

source: Search for %s in network
de: Netzwerksuche nach %s

source: Something is wrong with the SYSVOL.
de: Etwas stimmt nicht mit dem SYSVOL.

source: Starting Samba
de: Start von Samba

source: Starting the S4 Connector
de: Start des S4 Connectors

source: Synchronizing system clock
de: Synchronisation der Systemzeit

source: Taking over Active Directory domain controller roles
de: Übernahme der Active Directory Domänencontroller-Rollen

source: Taking over DNS address
de: Übernahme der DNS-Adresse

source: Taking over IP address
de: Übernahme der IP-Adresse

source: Taking over NETBIOS address
de: Übernahme der NETBIOS-Adresse

source: The Active Directory domain has a function level of Windows Server 2012 or newer, Samba currently only supports up to Windows 2008R2: %s
de: Die Active Directory Domäne hat einen Funktionslevel von Windows Server 2012 oder neuer, Samba unterstützt momentan nur bis Windows 2008R2: %s

source: The Active Directory domain join was not completed successfully yet.
de: Der Beitritt zur Active Directory Domäne wurde noch nicht erfolgreich abgeschlossen.

source: The Active Directory server seems to be running. It must be shut off.
de: Es scheint, als ob der Active Directory Server noch liefe. Er muss ausgeschaltet werden.

source: The LDAP base of this UCS domain differs from the LDAP base of the selected Active Directory domain.
de: Die LDAP-Basis dieser UCS Domäne unterscheidet sich von der LDAP-Basis der ausgewählten Active Directory-Domäne.

source: The Server IP %s is still online, please shut down the machine.
de: Die Server IP %s ist noch online, die Maschine sollte ausgeschaltet werden.

source: The automatic search for an Active Directory server for realm %s did not yield any results.
de: Die automatische Suche eines Active Directory Servers für den Kerberos-Realm %s lieferte keine Ergebnisse.

source: The computer is not reachable.
de: Der Rechner ist nicht erreichbar.

source: The domain join failed. See %s for details.
de: Der Domänenbeitritt schlug fehl, die Logdatei %s enthält genauere Details.

source: The selected Active Directory server has the same NTDS GUID as this UCS server.
de: Der angegebene Active Directory-Server hat die gleiche NTDS GUID wie dieser UCS Server.

source: Time difference critical for Kerberos but synchronization aborted.
de: Die Zeitdifferenz ist zu groß für Kerberos, aber die Synchronisierung schlug fehl.

source: Time synchronization failed.
de: Die Zeitsynchronisierung schlug fehl.

source: UNC doesn't start with \\ or //
de: UNC-Pfad startet nicht mit \\ oder //

source: You may proceed with the takeover, but the domain management may be limited afterwards until a new license is installed.
de: Der Takeover kann fortgeführt werden, aber die Domäne kann danach womöglich nur eingeschränkt verwaltet werden, bis eine neue Lizenz installiert wird.

source: users
de: Benutzer
