Repository: univention/univention-corporate-server
Catalog: management/univention-management-console/www/login/*.po
Languages: fr

source: Authentication required
fr: Authentification requise

source: Cancel
fr: Annuler

source: Changing password failed. The passwords do not match, please retype again.
fr: Le changement du mot de passe a échoué. Les mots de passe saisis sont différents, veuillez les saisir à nouveau.

source: Do you really want to logout?
fr: Voulez-vous vraiment vous déconnecter ?

source: How do I login?
fr: Comment s'authentifier?

source: Login
fr: Connexion

source: Login at %(domainname)s
fr: Authentification à %(domainname)s

source: Logout
fr: Se déconnecter

source: New Password
fr: Nouveau mot de passe

source: New Password (retype)
fr: Nouveau mot de passe (saisir à nouveau)

source: New password
fr: Nouveau mot de passe

source: One time password
fr: Mot de passe temporaire

source: Password
fr: Mot de passe

source: Please enable your browser cookies which are necessary for using Univention Services.
fr: Veuillez activer les cookies de votre navigateurs. Ceux-ci sont nécessaires lorsque vous utiliser les services Univention.

source: Please login with a valid username and password.
fr: Veuillez vous connecter avec un identifiant et un mot de passe valides.

source: Set password
fr: Définir le mot de passe

source: So far the authentication failed. Continuing nevertheless.
fr: Pour le moment, l'authentification a échoué. Néanmoins, le processus continue.

source: The <i>root</i> user neither has access to the domain administration nor to the App Center.
fr: Le compte <i>root</i> n’a pas accès à l’administration du domaine ni à l’App Center.

source: The current session timed out. Please login again.
fr: La session actuelle a expiré. Veuillez vous authentifier à nouveau.

source: The default user to manage the domain is %s which has the same initial password as the <i>root</i> account.
fr: Le compte par défaut pour gérer le domaine est %s, qui a le même mot de passe initial que le compte <i>root</i>.

source: This action requires you to supply your password.
fr: Cette action suppose de saisir votre mot de passe.

source: This network connection is not encrypted. All personal or sensitive data such as passwords will be transmitted in plain text. Please follow this link to use a secure SSL connection.
fr: Cette connexion réseau n'est pas chiffrée. Toutes les données sensibles ou personnelles seront transmises en clair. Veuillez suivre ce lien pour utiliser une connexion SSL sécurisée.

source: This network connection is not encrypted.<br/>Click here for an HTTPS connection.
fr: Cette connexion réseau n'est pas chiffrée.<br/>Veuillez suivre ce lien pour une connexion HTTPS.

source: Use the %s user for the initial system configuration.
fr: Utiliser l’identifiant %s pour la configuration initiale du système.

source: Username
fr: Identifiant
