Repository: univention/univention-corporate-server
Catalog: management/univention-directory-manager-modules/modules/univention/admin/handlers/*.po
Languages: de

source: DNS alias is already in use.
de: DNS-Alias ist bereits verwendet.

source: Destination object can't have sub objects.
de: Zielobjekt kann keine Unterobjekte haben.

source: Moving into one's own sub container not allowed.
de: Verschieben in einen Container innerhalb des zu verschiebenden Objektes nicht erlaubt.

source: Moving not possible: old and new DN are identical.
de: Verschieben ist nicht möglich: Alter und neuer DN sind identisch.

source: Neither DN nor position given.
de: Weder ein DN noch eine Position wurde angegeben.

source: No superordinate object given
de: Kein übergeordnetes Objekt angegeben.

source: Objects from Active Directory can not be moved.
de: Objekte aus Active-Directory-Domänen können nicht verschoben werden.

source: Objects from Active Directory can not be removed.
de: Objekte aus Active-Directory-Domänen können nicht gelöscht werden.

source: Objects of the "%s" object type can not be created.
de: Objekte des Objekttyps "%s" können nicht erstellt werden.

source: Objects of the "%s" object type can not be modified.
de: Objekte des Objekttyps "%s" können nicht bearbeitet werden.

source: Objects of the "%s" object type can not be moved.
de: Objekte des Objekttyps "%s" können nicht verschoben werden.

source: Objects of the "%s" object type can not be removed.
de: Objekte des Objekttyps "%s" können nicht gelöscht werden.

source: Reverse zone and IP address are incompatible.
de: Reverse Zone und IP-Adresse sind inkompatibel.

source: The DHCP entry for this host should contain the zone LDAP-DN, the IP address and the MAC address.
de: Der DHCP-Eintrag für diesen Rechner sollte die Zonen LDAP-DN, die IP- und MAC-Adresse enthalten.

source: The DNS alias entry for this host should contain the zone name, the alias zone container LDAP-DN and the alias.
de: Der DNS-Alias Eintrag für diesen Rechner sollte den Zonennamen, die LDAP-DN des Alias-Zonencontainers und den Alias-Namen enthalten.

source: The following properties are missing: %s
de: Die folgenden Eigenschaften fehlen: %s

source: The given %r superordinate is expected to be of type %s.
de: Das angegebene %r übergeordnete Objekt ist muss vom Typ %s sein.

source: The own object cannot be moved.
de: Das eigene Objekt kann nicht verschoben werden.

source: The own object cannot be removed.
de: Das eigene Objekt kann nicht gelöscht werden.

source: The property %s is required
de: Die Eigenschaft %s wird benötigt.

source: The property %s must be a list
de: Die Eigenschaft %s wird benötigt.

source: Unable to move object %(name)s (%(type)s) in subtree, trying to revert changes.
de: Das Objekt %(name)s (%(type)s) im Teilbaum kann nicht verschoben werden, versuche den Ausgangzustand wiederherzustellen.

source: delete
de: Löschen

source: key=%(key)s old=%(old)s new=%(new)s
de: Attribut=%(key)s alter Wert=%(old)s neuer Wert=%(new)s
