Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-management-console-module-diagnostic/umc/python/diagnostic/*.po
Languages: fr

source: "univention-check-join-status" returned a problem with the domain join.
fr: « univention-check-join-status » a renvoyé un problème avec la jonction au domaine.

source: %d objects should be "%s"
fr: %d objets devraient être « %s »

source: %d of the configured nameservers are not responding to DNS queries.
fr: %d des serveurs de noms configurés ne répondent pas aux requêtes DNS.

source: - Disk for mountpoint %(mp)s is %(pc)s%% full.
fr: - Le disque pour le point de montage %(mp)s est à %(pc)s%% plein.

source: A timeout occurred while reaching the nameserver (is it online?).
fr: Délai dépassé lors de l'accès au serveur de noms (est-il connecté ?).

source: ACL right for group {id!r} is {udm!r} in UDM, but {imap!r} in IMAP.
fr: Le droit ACL pour le groupe {id!r} est {udm!r} dans UDM, mais {imap!r} dans IMAP.

source: ACL right for user {id!r} is {udm!r} in UDM, but {imap!r} in IMAP.
fr: Le droit ACL pour le compte {id!r} est {udm!r} dans UDM, mais {imap!r} dans IMAP.

source: Activate the memberOf LDAP overlay
fr: Activer l’overlay memberOf de LDAP

source: Add lo to samba/interfaces
fr: Ajouter lo à samba/interfaces

source: Adjust to suggested limits
fr: Ajuster aux limites suggérées

source: All SIDs exist and names are consistent.
fr: Tous les SID existent et les noms sont cohérents.

source: All SSL certificates valid.
fr: Tous les certificats SSL sont valides.

source: All files ok.
fr: Tous les fichiers sont corrects.

source: All shared folder ACLs are in sync with UDM.
fr: Toutes les listes de contrôle d’accès (ACL) de dossiers partagés sont synchronisées avec UDM.

source: Authentication against the Primary LDAP failed with the machine password.
fr: L’authentification sur le serveur LDAP principal avec le mot de passe de la machine a échoué.

source: Authentication against the local LDAP failed with the machine password.
fr: L’authentification sur le serveur LDAP local avec le mot de passe de la machine a échoué.

source: Authentication with machine password against LDAP successful.
fr: L’authentification sur le serveur LDAP avec le mot de passe de la machine a réussi.

source: Calling /usr/lib/univention-server/server_password_change failed.
fr: L’appel de /usr/lib/univention-server/server_password_change a échoué.

source: Certificate {path!r} will expire in {days} days.
fr: Le certificat {path!r} expirera dans {days} jours.

source: Check Heimdal KDC on Samba 4 DC
fr: Vérification de Heimdal KDC sur Samba 4 DC

source: Check IMAP shared folder ACLs
fr: Vérification des listes de contrôle d’accès (ACL) des dossiers partagés IMAP

source: Check LDAP attribute memberOf
fr: Vérification de l’attribut LDAP memberOf

source: Check Samba replication status for errors
fr: Recherche d’erreurs dans l’état de réplication Samba

source: Check errors in sources.list files
fr: Recherche d’erreurs dans les fichiers sources.list

source: Check file permissions
fr: Vérification des permissions de fichiers

source: Check for modified UCR templates
fr: Recherche de modèles UCR modifiés

source: Check for problems with UDN replication
fr: Recherche de problèmes dans la réplication UDN

source: Check free disk space
fr: Vérification de l’espace disque disponible

source: Check hostname RFC compliance
fr: Vérification de la conformité RFC du nom d’hôte

source: Check join status
fr: Vérification de l’état de jonction

source: Check kerberos authenticated DNS updates
fr: Vérification des mises à jour DNS authentifiées kerberos

source: Check local AD database for errors
fr: Recherche d’erreurs dans la base de données AD locale

source: Check machine password
fr: Vérification du mot de passe de la machine

source: Check nameserver entries on DNS zones
fr: Vérification des entrées du serveur de noms dans les zones DNS

source: Check primary LDAP server
fr: Vérification du serveur LDAP principal

source: Check resolving repository servers
fr: Vérification de la résolution des serveurs de dépôts

source: Check validity of SSL certificates
fr: Vérification de la validité des certificats SSL

source: Check well known SIDs
fr: Vérification des SID connus

source: Check whether the LDAP overlay memberOf is locally activated.
fr: Vérification de l’activation locale de l’overlay memberOf de LDAP.

source: Deactivate test
fr: Désactiver le test

source: Enough free disk space available.
fr: Suffisamment d’espace disque disponible.

source: Error retrieving notifier ID from the UDN.
fr: Erreur lors de la récupération de l’ID de notificateur à partir de l’UDN.

source: Errors found by `univention-check-templates`.
fr: Erreurs détectées par `univention-check-templates`.

source: Errors occurred while running `kinit` or `nsupdate`.
fr: Des erreurs se sont produites lors de l’exécution de `kinit` ou `nsupdate`.

source: File {path!r} does not exist.
fr: Le fichier {path!r} n’existe pas.

source: File {path!r} has mode {actual:o}, {expected:o} was expected.
fr: Le fichier {path!r} a le mode {actual:o}, {expected:o} était attendu.

source: File {path!r} has owner {actual!r} while {expected!r} was expected.
fr: Le fichier {path!r} a pour propriétaire {actual:o} alors que {expected:o} était attendu.

source: Fix machine password
fr: Corriger le mot de passe de la machine

source: Found differences in the ACLs for IMAP shared folders between UDM and IMAP.
fr: Différences trouvées dans les ACL pour les dossiers partagés IMAP entre UDM et IMAP.

source: Found errors in the nameserver entries of the following zones.
fr: Erreurs détectées dans les entrées du serveur de noms pour les zones suivantes.

source: Found exception in {path!r}: {exception}
fr: Exception trouvée dans {path!r} : {exception}

source: Found expired certificate {path!r}.
fr: Certificat {path!r} expiré.

source: Found illegal alias record (CNAME record) for nameserver {ns}.
fr: Enregistrement d’alias (CNAME) illicite pour le serveur de noms {ns}.

source: Found invalid certificate {path!r}.
fr: Certificat {path!r} non valide.

source: Found invalid certificate {path!r}: {message}
fr: Certificat {path!r} non valide : {message}

source: Found malformed certificate {path!r}.
fr: Certificat {path!r} malformé.

source: Found no host record (A/AAAA record) for nameserver {ns}.
fr: Aucun enregistrement d’hôte (A/AAAA) n’a été trouvé pour le serveur de noms {ns}.

source: Found not yet valid certificate {path!r}.
fr: Certificat {path!r} pas encore valide.

source: Found {ucs} UCS rejects and {s4} S4 rejects. See {{sdb}} for more information.
fr: Détection de {ucs} rejets d’UCS et {s4} rejets de S4. Voir {{sdb}} pour plus d’informations.

source: Gateway is not reachable
fr: La passerelle n'est pas accessible

source: Host key for server does not match
fr: La clé d'hôte pour ce serveur ne correspond pas

source: If the problem persists make sure the nameserver is connected to the network and the forwarders are able to reach the internet (www.univention.de).
fr: Si le problème persiste, veuillez vous assurer que le serveur de noms est connecté au réseau et que les transmetteurs (forwarders) peuvent accéder à Internet (www.univention.de).

source: If these settings are correct the problem relies in the gateway itself:
fr: Si ces réglages sont corrects, le problème provient de la passerelle elle-même :

source: In forward zone {name} (see {{{link}}}):
fr: Dans la zone DNS directe {name} (voir {{{link}}}) :

source: In mail folder {name} (see {{udm:mail/mail}}):
fr: Dans le dossier de courrier {name} (voir {{udm:mail/mail}}) :

source: In reverse zone {name} (see {{{link}}}):
fr: Dans la zone DNS inverse {name} (voir {{{link}}}) :

source: Inbound {nc!r}: error during DRS replication from {source} ({estring})
fr: {nc!r} entrant : erreur lors de la réplication DRS depuis {source} ({estring})

source: It is suggested to increase the security limits either manually by using {ucr} or to automatically adjust them to the suggested limits:
fr: Il est conseillé d'augmenter les limites de sécurité manuellement en utilisant {ucr} ou de les ajuster automatiquement aux limites proposées :

source: KDC service check
fr: Vérification du service KDC

source: LDAP objects
fr: Objets LDAP

source: LDAP schema files are not properly registered
fr: Les fichiers de schéma LDAP ne sont pas correctement enregistrés

source: Login to the remote server with the uid %(uid)s and the password from /etc/machine.secret failed.
fr: Échec de la connexion au serveur distant avec l'UID %(uid)s et le mot de passe issu de « /etc/machine.secret ».

source: Machine authentication failed
fr: Échec de l'authentification à la machine

source: Mail folder {folder!r} does not exist in IMAP.
fr: Le dossier de messagerie {folder!r} n’existe pas dans IMAP.

source: Make sure the hardware of the gateway device is working properly.
fr: Veuillez vous assurer que l'équipement de passerelle fonctionne convenablement.

source: Manual: Analysis of listener/notifier problems
fr: Manuel : Analyse des problèmes d’écouteurs/notificateurs

source: Migrate %d LDAP objects
fr: Migrer %d objets LDAP

source: Migrate user objects
fr: Migrer les objets utilisatrices ou utilisateurs

source: More information about the cause can be gained by executing "dpkg --audit".
fr: Des informations complémentaires sur l'origine du problème peuvent être obtenues en exécutant « dpkg --audit ».

source: Multiple ACL entries for {id!r} in UDM.
fr: Plusieurs entrées d’ACL pour {id!r} dans UDM.

source: Nameserver(s) are not responsive
fr: Le ou les serveurs de noms ne sont pas réactifs

source: No S4 Connector rejects were found.
fr: Aucun rejet de connecteur S4 n’a été trouvé.

source: No errors found.
fr: Aucune erreur détectée.

source: No errors occurred.
fr: Aucune erreur ne s’est produite.

source: No non-compliant hostnames found.
fr: Aucun nom d’hôte non conforme n’a été trouvé.

source: No problems found with UDN replication.
fr: Aucun problème détecté dans la réplication UDN.

source: No problems found with modified UCR templates
fr: Aucun problème détecté dans les modèles UCR modifiés

source: No problems were found while resolving update repositories.
fr: Aucun problème n’a été détecté lors de la résolution des dépôts de mise à jour.

source: No reachable KDCs were found.
fr: Aucun KDC accessible n’a été trouvé.

source: No user or group with SID {sid} found, expected {expected!r}.
fr: Aucun compte ou groupe avec le SID {sid} n’a été trouvé, {expected!r} attendu.

source: Note that password rotation is disabled via the UCR variable server/password/change.
fr: Notez que la rotation du mot de passe est désactivée via la variable UCR server/password/change.

source: Note that server/password/interval is set to {}.
fr: Notez que server/password/interval est réglé sur {}.

source: Number of objects that should be marked as "%s": %d
fr: Nombre d’objets qui devraient être marqués comme « %s » : %d

source: Number of unspecific Windows computer objects with inconsistent univentionObjectType: %d (Can't fix this automatically)
fr: Nombre d’objets ordinateurs Windows non spécifiques ayant une valeur univentionObjectType incohérente : %d (ceci ne peut être corrigé automatiquement)

source: Objects that implicitly satisfy the criteria of a Univention Object but lack this attribute should be migrated.
fr: Les objets qui répondent implicitement aux critères d’un Objet Univention mais qui ne disposent pas de cet attribut doivent être migrés.

source: Objects that implicitly satisfy the standards of a Univention Object but lack this attribute should be migrated.
fr: Les objets qui satisfont implicitement aux normes d’un Objet Univention mais qui ne disposent pas de cet attribut doivent être migrés.

source: Old packages and Apps registered schema files by copying the files locally into a certain directory.
fr: Les Apps et paquetages anciens enregistraient des fichiers de schéma en copiant les fichiers localement dans un répertoire particulier.

source: Outbound {nc!r}: error during DRS replication to {source} ({estring})
fr: {nc!r} sortant : erreur lors de la réplication DRS vers {source} ({estring})

source: Output of `{cmd}`:
fr: Résultat de `{cmd}` :

source: Package status corrupt
fr: Corruption de l'état du paquetage

source: Please check /var/log/auth.log on the remote server for further information.
fr: Veuillez vérifier « /var/log/auth.log » sur le serveur distant pour plus d'informations.

source: Please check the files for more details.
fr: Veuillez consulter les fichiers pour plus de détails.

source: Please make sure the DNS settings in the {setup:network} are correctly set up.
fr: Veuillez vous assurer que les réglages DNS dans {setup:network} sont correctement définis.

source: Please refer to {rfc1123} for the syntax of host names.
fr: Veuillez vous référer à {rfc1123} pour la syntaxe des noms d’hôte.

source: Please refer to {sdb} for further information.
fr: Veuillez vous référer à {sdb} pour plus d’informations.

source: Please repair the host key of the remote server in /root/.ssh/known_hosts on %(fqdn)s.
fr: Veuillez réparer la clé d'hôte du serveur distant dans « /root/.ssh/known_hosts » pour %(fqdn)s.

source: Please see {sdb} for more information.
fr: Veuillez consulter {sdb} pour plus d’informations.

source: Please see {sdb} for troubleshooting DNS problems.
fr: Veuillez consulter {sdb} pour résoudre les problèmes de DNS.

source: Please see {sdb} on how to renew certificates.
fr: Veuillez consulter {sdb} sur la façon de renouveler les certificats.

source: Proxy server failure
fr: Échec du serveur mandataire

source: RFC 1123 - 2.1 Host Names and Numbers
fr: RFC 1123 - 2.1 Noms et numéros d’hôte

source: Regenerate sources.list
fr: Régénérer sources.list

source: Register Schema files
fr: Enregistrer les fichiers de schéma

source: Reset kerberos/kdc to 127.0.0.1
fr: Réinitialiser kerberos/kdc à 127.0.0.1

source: Run `samba-tool dbcheck --fix --cross-ncs --yes`
fr: Exécuter `samba-tool dbcheck --fix --cross-ncs --yes`

source: S4 Connector rejects
fr: Rejets de connecteur S4

source: S4 rejected:
fr: S4 rejeté :

source: SAML certificate verification failed!
fr: La vérification du certificat SAML a échoué !

source: SSH connection to UCS server failed!
fr: Échec de la connexion SSH au serveur UCS !

source: Samba 4 KDC running.
fr: KDC de Samba 4 en cours d’exécution.

source: Samba4 max open files - Univention Help
fr: Nombre maximal de fichiers ouverts dans Samba 4 – Aide Univention

source: Security limits exceeded
fr: Limites de sécurité atteintes

source: See {erroranalysis} or run the join-scripts via {join}.
fr: Consultez {erroranalysis} ou exécutez les scripts de jonction via {join}.

source: See {sdb} for information on manual server password change.
fr: Voir {sdb} pour plus d’informations sur la modification manuelle du mot de passe du serveur.

source: Server Role Windows
fr: Rôle serveur Windows

source: Set server/password/change=True
fr: Définir server/password/change=True

source: Set server/password/interval=21
fr: Définir server/password/interval=21

source: Several services rely on the attribute "univentionObjectType" to search and identify objects in LDAP.
fr: Plusieurs services s’appuient sur l’attribut « univentionObjectType » pour chercher et identifier des objets dans LDAP.

source: Several services rely on the attribute "univentionServerRole" to search and identify objects in OpenLDAP.
fr: Plusieurs services s’appuient sur l’attribut « univentionServerRole » pour chercher et identifier des objets dans OpenLDAP.

source: Some disks are nearly full:
fr: Certains disques sont presque pleins :

source: Test again
fr: Tester à nouveau

source: The "memberOf" group membership attribute is not available in the LDAP server on this host. This feature is activated by default in new installations since UCS version 4.3-0, and serveral services depend on it. This feature will be a prerequisite in future UCS releases. You may want to consider activating the memberOf feature for the LDAP server according to:
fr: L’attribut d’appartenance au groupe « memberOf » n’est pas disponible sur le serveur LDAP sur cet hôte. Cette fonctionnalité est activée par défaut dans les nouvelles installations depuis la version UCS 4.3-0, et plusieurs services en dépendent. Cette fonctionnalité sera une condition prérequise dans les futures versions d’UCS. Si vous envisagez d’activer la fonctionnalité memberOf pour le serveur LDAP, vous pouvez consulter le lien :

source: The UCR variable {variable!r} is unset, but necessary for the S4 Connector.
fr: La variable UCR {variable!r} n’est pas définie, mais nécessaire pour le connecteur S4.

source: The certificate of the SAML identity provider does not match.
fr: Le certificat du fournisseur d’identité SAML ne correspond pas.

source: The certificate of the SAML service provider does not match.
fr: Le certificat du fournisseur de service SAML ne correspond pas.

source: The check for the join status was succsesful.
fr: La vérification de l’état de jonction a réussi.

source: The error might be fixable by regenerating the sources.list.
fr: L’erreur peut éventuellement être corrigée en régénérant le fichier sources.list.

source: The files should be checked for differences.
fr: Les fichiers devraient être comparés.

source: The following FQDNs were not resolvable:
fr: Les noms de domaine complets (FQDN) suivants n’ont pas pu être résolus :

source: The following KDCs were unreachable: {}
fr: Les KDC suivants sont inaccessibles : {}

source: The following UCR files are modified locally.
fr: Les fichiers UCR suivants sont modifiés localement.

source: The following files seem to be registered in the old way:
fr: Les fichiers suivants semblent être enregistrés à l’ancienne :

source: The following list shows the affected remote servers and the reason for the failed ssh connection:
fr: La liste suivante affiche les serveurs distants affectés et la raison de l'échec de la connexion SSH :

source: The following non-compliant hostnames have been found: {hostnames}.
fr: Les noms d’hôte non conformes suivants ont été trouvés : {hostnames}.

source: The gateway %r could not be reached. Please make sure the gateway and related network settings are correctly configured by using the {setup:network}.
fr: Impossible d'atteindre la passerelle %r. Veuillez vous assurer que la passerelle et les réglages réseaux associés soient configurés correctement en utilisant {setup:network}.

source: The hostname of the proxy could not be resolved. May check your DNS configuration.
fr: Impossible de résoudre le nom d'hôte du serveur mandataire. Veuillez vérifier votre configuration DNS.

source: The limits have been adjusted to the suggested value.
fr: Les limites ont été adaptées à la valeur suggérée.

source: The migration failed: %s
fr: Échec de la migration : %s

source: The nameserver %(nameserver)s (UCR variable %(var)r) is not responsive:
fr: Le serveur de noms %(nameserver)s (variable UCR %(var)r) n'est pas réactif :

source: The package status of %s packages is corrupt.
fr: Les états des paquetages %s sont corrompus.

source: The preferred way now is to register them in LDAP; this is less error prone in situations like backup2master.
fr: Le moyen privilégié consiste désormais à les enregistrer dans LDAP ; ceci est moins sujet aux erreurs dans des situations telles que backup2master.

source: The primary LDAP Server of this System (UCR ldap/server/name) is set to the Primary Directory Node of this UCS domain (%s). Since this environment provides further LDAP Servers, we recommend a different configuration to reduce the load on the Primary Directory Node. Please see {sdb} for further information.
fr: Le serveur LDAP principal de ce système (UCR ldap/server/name) est défini comme Primary Directory Node de ce domaine UCS (%s). Étant donné que cet environnement fournit d’autres serveurs LDAP, nous recommandons une configuration différente pour réduire la charge sur le Primary Directory Node. Veuillez consulter {sdb} pour plus d’informations.

source: The proxy host could not be reached. Make sure that hostname (%(hostname)r) and port (%(port)r) are correctly set up.
fr: Impossible d'atteindre le serveur mandataire. Veuillez vous assurer que le nom d'hôte (%(hostname)r) et le port (%(port)r) sont correctement définis.

source: The proxy server is reachable but the HTTP response status code (%d) does not indicate success.
fr: Le serveur mandataire est accessible, mais le code d'état de la réponse HTTP (%d) n'indique pas une réussite.

source: The registration failed: %s
fr: Échec de l’enregistrement : %s

source: The security limits (e.g. for max_open_files) are currently not configured properly.
fr: Les limites de sécurité (par ex. pour « max_open_files ») ne sont pas pas configurées correctement.

source: The server did not respond within %d seconds. Please check your network configuration.
fr: Le serveur n'a pas répondu dans les %d secondes. Veuillez vérifier votre configuration réseau.

source: The ssh connection to at least one other UCS server failed.
fr: Échec de la connexion SSH à au moins un autre serveur UCS.

source: The ssh host key of the remote server has changed (maybe the host was reinstalled).
fr: La clé d'hôte SSH du serveur distant a été modifiée (l'hôte a peut-être été réinstallé).

source: There is no gateway configured.
fr: Aucune passerelle n’est configurée.

source: There was an error using the proxy server. The {setup:network} can be used to change the proxy configuration.
fr: Erreur lors de l'utilisation du serveur mandataire. {setup:network} peut être utilisé pour modifier la configuration du serveur mandataire.

source: These objects were found:
fr: Ces objets ont été trouvés :

source: This can cause several different serious problems (e.g. the login at samba servers may be impossible, file operations (copy, move) on shares can fail, etc.)
fr: Cela peut causer un certain nombre de problèmes importants (ex. : la connexion aux serveurs Samba peut être impossible, les opérations sur les fichiers (copie, déplacement) sur les partages peuvent échouer, etc.)

source: This is a Samba 4 DC, but `samba-tool processes` reports no `kdc_server`.
fr: Il s’agit d’un DC Samba 4, mais `samba-tool processes` ne signale aucun `kdc_server`.

source: This is not necessarily a problem, if the the ACL got changed via IMAP.
fr: Ce n’est pas nécessairement un problème, si la liste de contrôle d’accès (ACL) a été modifiée via IMAP.

source: This may be, because Heimdal KDC seems to be running.
fr: C’est peut-être dû au fait que Heimdal KDC semble fonctionner.

source: This may be, because `kerberos/autostart` is not disabled.
fr: C’est peut-être dû au fait que `kerberos/autostart` n’est pas désactivé.

source: This may lead to DNS problems.
fr: Ceci peut entraîner des problèmes de DNS.

source: This might indicate an error or still processing transactions.
fr: Ceci peut indiquer une erreur ou l’existence de transactions encore en cours de traitement.

source: This warning might be harmless. Nevertheless make sure the authentication credentials (if any) are correct and the proxy server ACLs do not forbid requests to %s.
fr: Cet avertissement est peut-être sans danger. Veuillez cependant vous assurer que les preuves d'identité (s'il y en a) sont correctes et que les ACL du serveur mandataire n'interdisent pas les requêtes vers %s.

source: UCS DN: {ucs}, S4 DN: {s4}, Filename: {fn}
fr: UCS DN : {ucs}, S4 DN : {s4}, Nom de fichier : {fn}

source: UCS rejected:
fr: Objets UCS non synchronisés :

source: Unable to fix machine password on {}
fr: Impossible de corriger le mot de passe de la machine sur {}

source: Univention Directory Notifier ID and the locally stored version differ.
fr: L’ID du Univention Directory Notifier et la version stockée localement diffèrent.
