Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-management-console-module-diagnostic/umc/python/diagnostic/*.po
Languages: fr

source: Univention S4 Connector is not installed.
fr: Le Connecteur S4 d’Univention n’est pas installé.

source: Univention Support Database - Bind: zone transfer failed
fr: Base de données d’assistance d’Univention – Bind : échec du transfert de zone

source: Univention Support Database - Change the primary LDAP Server to redistribute the server load
fr: Base de données d’assistance d’Univention – Modifiez le serveur LDAP principal pour redistribuer la charge du serveur

source: Univention Support Database - DNS Server on Directory Node does not resolve external names
fr: Base de données d’assistance d’Univention – Le serveur DNS sur le Directory Node ne résout pas les noms externes

source: Univention Support Database - How to deal with s4-connector rejects
fr: Base de données d’assistance d’Univention – Comment gérer les rejets de connecteur S4

source: Univention Support Database - Manually trigger server password change
fr: Base de données d’assistance d’Univention – Lancer manuellement la modification du mot de passe du serveur

source: Univention Support Database - Renewing the TLS/SSL certificates
fr: Base de données d’assistance d’Univention – Renouveler les certificats TLS/SSL

source: Univention Support Database - Troubleshooting: Listener-/Notifier
fr: Base de données d’assistance d’Univention – Dépannage : écouteur/notificateur

source: Updated versions will be named FILENAME.dpkg-*.
fr: Les versions mises à jour seront nommées NOMDEFICHIER.dpkg-*.

source: User objects which are not migrated
fr: Objets utilisateurs qui ne sont pas migrés

source: User or group with SID {sid} has name {actual!r}, but should be {expected!r}.
fr: L’utilisateur, l’utilisatrice ou le groupe avec le SID {sid} a pour nom {actual!r} alors que celui-ci devrait être {expected!r}.

source: User or group with name {name!r} has sid {actual_sid}, but should be {sid}.
fr: L’utilisateur, l’utilisatrice ou le groupe avec le nom {actual!r} a pour SID {sid} alors que celui-ci devrait être {expected!r}.

source: When a user object is created by a system which is not yet on UCS 4.3 it will have the old format. These user objects need to migrated again.
fr: Lorsqu’un objet utilisateur est créé par un système qui n’est pas encore sur UCS 4.3, il a l’ancien format. Ces objets utilisateur doivent être migrés à nouveau.

source: With UCS 4.3 the LDAP format of user objects changed. After upgrading the Primary Directory Node all user objects are migrated into the new format.
fr: Avec UCS 4.3, le format LDAP des objets utilisateur a changé. Après la mise à niveau du Primary Directory Node, tous les objets utilisateur sont migrés dans le nouveau format.

source: You can run `samba-tool dbcheck --fix` to fix the issue.
fr: Vous pouvez exécuter `samba-tool dbcheck --fix` pour résoudre le problème.

source: You have configured some high log levels.
fr: Vous avez configuré des niveaux de journaux élevés.

source: You may log in to the system as root via ssh and run the command "dpkg --configure -a" as an attempt to correct the packages status.
fr: Connectez-vous au système via SSH en tant que root et exécutez la commande « dpkg --configure -a » pour tenter de corriger l’état des paquetages.

source: You may want to move /var/log to another disk or storage.
fr: Vous souhaiterez peut-être déplacer /var/log vers un autre disque ou lieu de stockage.

source: You may want to move the local repository to another server.
fr: Vous souhaiterez peut-être déplacer le dépôt local vers un autre serveur.

source: You may want to reset them via {ucr}.
fr: Vous voudrez peut-être les réinitialiser via {ucr}.

source: You may want to stop Heimdal KDC and restart Samba via {services}
fr: Vous pouvez arrêter Heimdal KDC et redémarrer Samba via {services}

source: You may want to uninstall software via {appcenter:appcenter}.
fr: Vous pouvez désinstaller des logiciels via {appcenter:appcenter}.

source: `kinit` for principal {princ} with keytab {tab} failed.
fr: La commande `kinit` pour le principal {princ} avec la table de mots de passe {tab} a échoué.

source: `kinit` for principal {princ} with password file {file} failed.
fr: La commande `kinit` pour le principal {princ} avec le fichier de mot de passe {file} a échoué.

source: `nsupdate` check for domain {domain} failed ({details}).
fr: La vérification `nsupdate` pour le domaine {domain} a échoué ({details}).

source: `samba-tool dbcheck` found an error in the local AD database.
fr: La commande `samba-tool dbcheck` a trouvé une erreur dans la base de données AD locale.

source: `samba-tool dbcheck` found no errors in the local AD database.
fr: La commande `samba-tool dbcheck` n’a trouvé aucune erreur dans la base de données AD locale.

source: `samba-tool drs showrepl` returned a problem with the replication.
fr: La commande `samba-tool drs showrepl` a renvoyé un problème avec la réplication.

source: not found
fr: introuvable

source: samba/interfaces does not contain lo, 127.0.0.1 or 0.0.0.0.
fr: samba/interfaces ne contient pas lo, 127.0.0.1 ou 0.0.0.0.

source: some
fr: certains
