{
	"de-DE": "<div class=\"privacyStatementOverlayTextWrapper\"><p>Die Univention GmbH, Mary-Somerville-Straße 1, 28359 Bremen („wir“), betreibt  Internetangebote auf den Seiten univention.de und univention.com sowie auf verschiedenen Subdomänen wie beispielsweise help.univention.de, errata.univention.com u.a.. Diese Angebote sind zum Teil für den direkten Zugriff mit einem Internetbrowser und zum Teil zur Nutzung mit Univention Corporate Server (UCS) und darauf aufbauenden Softwareprodukte von uns bestimmt.</p><p>Mit dieser Datenschutzerklärung möchten wir Ihnen erläutern, welche Ihrer Daten wir bei der Verwendung unserer Internetangebote durch Sie als Nutzer erheben und wie wir mit Ihren Daten umgehen. Dabei nehmen wir den Schutz Ihrer personenbezogenen Daten sehr ernst und beachten die anwendbaren datenschutzrechtlichen Bedingungen. Das bedeutet insbesondere, dass wir personenbezogene Daten nur dann erheben, verarbeiten oder nutzen, wenn Sie Ihre Zustimmung zur Nutzung der Daten gegeben haben oder sofern das Gesetz die Datenverarbeitung erlaubt. Sollten Sie Fragen oder Anmerkungen zu dieser Datenschutzerklärung haben, nehmen Sie bitte über info@univention.de Kontakt mit uns auf.</p><p>Grundsätzlich benutzen Sie unsere Internetangebote anonym. Bestimmte Teile unseres Angebotes, wie z. B. das Herunterladen bestimmter Apps aus dem App Center, erfordern eine Registrierung als Benutzer, an anderen Stellen bieten wir Ihnen eine freiwillige Registrierung an. Diese Registrierung geschieht durch Übermittlung Ihres Namens, Ihrer E-Mail-Adresse und ggf. weiterer Daten durch Sie an uns. Melden Sie sich in dieser Form an, erheben und verarbeiten wir die dort angegebenen Daten zur Optimierung unseres Angebots, um mit Ihnen beispielsweise per E-Mail oder Newsletter Kontakt aufzunehmen sowie für die Zwecke der Vertragsdurchführung und geben diese insbesondere an den jeweiligen Vertragspartner, dessen Angebot Sie beispielsweise über das App Center nutzen, weiter. Wenn Sie die Daten in die entsprechenden Formulare eingeben, willigen Sie hierin ein.</p><p>Über die bei der Registrierung erhobenen Daten hinaus können Daten genutzt und verarbeitet werden (zum Beispiel mit Hilfe von Cookies), die zwar nicht Ihren Namen und Angaben zu Ihnen persönlich enthalten, rechtlich aber als sogenannte pseudonyme Daten zu bewerten sein können. Das gilt auch für die Analyse unserer Seiten durch technische Mittel.</p><h3>1. Logfiles</h3><p>Wenn Sie unsere Angebote abrufen, kommunizieren Sie über das Internet mit unseren Servern. Dabei entstehen bei uns sogenannte Logfiles, in denen die IP-Adresse, das Datum und die Uhrzeit Ihres Besuchs gespeichert werden. Sie werden von uns lediglich verwendet, um Störungsfälle bei der Erreichbarkeit unserer Server besser analysieren und beheben zu können und um unser Angebot für Sie zu verbessern.</p><h3>2. Cookies</h3><p>Wir verwenden sogenannte Session-Cookies. Session-Cookies sind kleine Informationseinheiten, die wir im Arbeitsspeicher Ihres Computers speichern. In einem Session-Cookie wird eine zufällig erzeugte, eindeutige Identifikationsnummer abgelegt, die sogenannte Session-ID. Außerdem enthält ein solches Cookie Angaben über seine Herkunft und die Speicherfrist. Diese Cookies können keine anderen Daten speichern. Die Session-Cookies werden gelöscht, sobald Sie Ihre Sitzung beenden.</p><p>Cookies lassen sich in der Regel mit allen Internetbrowsern steuern. Die meisten Browser sind so eingestellt, dass alle Cookies akzeptiert werden, ohne die Benutzer zu fragen. Falls Sie die Verwendung von Cookies unterbinden wollen, besteht dazu bei Ihrem Browser die Möglichkeit, die Annahme und Speicherung neuer Cookies zu verhindern. Wie dies bei Ihrem Browser funktioniert, können Sie zum Beispiel im Rahmen der Hilfefunktion des Browsers erläutert finden. Wenn Sie Cookies durch die vorgenommenen Einstellungen im Browser automatisch unterschiedslos ablehnen, können Sie ggf. bestimmte Funktionen des Internetauftritts nicht nutzen. Wenn Sie die gespeicherten Cookies nach jeder Session automatisch löschen, sind die Funktionen, die Cookies voraussetzen, danach nicht mehr verfügbar. Wenn Sie unsere Seiten vollumfänglich nutzen möchten, sollten Sie Ihren Browser so einstellen, dass Session-Cookies akzeptiert werden.</p><h3>3. Analysetools</h3><p>Unsere Webservices verwenden Matomo (früher: Piwik), dabei handelt es sich um einen sogenannten Webanalysedienst. Matomo verwendet Cookies im Sinne der Ziffer 2. Zu diesem Zweck werden die durch die Cookies erzeugten Nutzungsinformationen (einschließlich Ihrer gekürzten IP-Adresse) an unseren Server übertragen und zu Nutzungsanalysezwecken gespeichert, was der Webseitenoptimierung unsererseits dient. Ihre IP-Adresse wird bei diesem Vorgang umgehend anonymisiert, sodass Sie als Nutzer für uns anonym bleiben. Die durch die Cookies erzeugten Informationen über Ihre Benutzung dieser Webseite werden nicht an Dritte weitergegeben. Sie können die Verwendung der Cookies durch eine entsprechende Einstellung Ihrer Browser-Software verhindern. Es kann jedoch sein, dass Sie in diesem Fall gegebenenfalls nicht sämtliche Funktionen unserer Seiten vollumfänglich nutzen können.</p><p>Wenn Sie mit der Speicherung und Auswertung dieser Daten aus Ihrem Besuch nicht einverstanden sind, dann können Sie der Speicherung und Nutzung nachfolgend per Mausklick jederzeit widersprechen. In diesem Fall wird in Ihrem Browser ein sog. Opt-Out-Cookie abgelegt, was zur Folge hat, dass  Matomo keinerlei Sitzungsdaten erhebt. Diese Einstellung können Sie auf dieser Seite vornehmen:</p><p>https://www.univention.de/datenschutzerklaerung/</p><p>Achtung: Wenn Sie Ihre Cookies löschen, so hat dies zur Folge, dass auch das Opt-Out-Cookie gelöscht wird und ggf. von Ihnen erneut aktiviert werden muss.</p><h3>4. Datensicherheit</h3><p>Wir setzen technische und organisatorische Sicherheitsmaßnahmen ein, um zu gewährleisten, dass Ihre personenbezogenen Daten vor Verlust, unrichtigen Veränderungen oder unberechtigten Zugriffen Dritter geschützt sind. In jedem Fall haben von unserer Seite überdies nur berechtigte Personen Zugang zu Ihren personenbezogenen Daten und dies auch nur insoweit, als es im Rahmen der Vertragszwecke erforderlich ist.</p><h3>5. Auskunftsrecht</h3><p>Auf schriftliche Anforderung geben wir Ihnen jederzeit darüber Auskunft, welche personenbezogenen Daten über Sie bei uns im Zusammenhang mit der Nutzung unserer Seiten bei uns gespeichert sind. Sie haben weiterhin jederzeit die Möglichkeit, Ihre personenbezogenen Daten durch uns berichtigen oder löschen zu lassen. Bitte schreiben Sie in diesem Fall an:</p><p>Univention GmbH<br>Mary-Somerville-Straße 1<br>28359 Bremen.</p><h3>6. Newsletter und MailChimp</h3><p>Wir nutzen zum Versand unseres Newsletters den Newsletter-Provider MailChimp. MailChimp ist ein Angebot der The Rocket Science Group, LLC, 512 Means Street, Suite 404 Atlanta, GA 30318.</p><p>Wenn Sie sich für unseren Newsletter registrieren, werden die Daten, die Sie bei der Newsletter-Registrierung angeben, an MailChimp übertragen und dort gespeichert. MailChimp bietet umfangreiche Analysemöglichkeiten zur Nutzung der Newsletter. Diese Analysen sind gruppenbezogen und werden von uns nicht zur individuellen Auswertung verwendet. MailChimp verwendet darüber hinaus das Analysetool Google Analytics und bindet es ggf. in die Newsletter ein.</p><p>Weitere Informationen zu MailChimp und dem Datenschutz bei MailChimp finden Sie hier: http://mailchimp.com/legal/privacy/<br>Wenn Sie in den Erhalt unseres Newsletters einwilligen, erklären Sie gleichzeitig Ihre Einwilligung in die Zusendung dieses Newsletters per E-Mail. Sie können der Zusendung jederzeit durch Anklicken des „unsubscribe“-Links in jedem Newsletter widersprechen. Widersprechen Sie, werden wir Ihre E-Mail-Adresse nicht mehr verwenden, um Ihnen Informationen zu unseren Produkten zukommen zu lassen.</p><h3>7. Widerrufsrecht</h3><p>Sie können jederzeit Ihre Einwilligung zur Erhebung und Speicherung Ihrer personenbezogenen Daten durch Univention widerrufen. Bei Bedarf schreiben Sie bitte an:</p><p>Univention GmbH<br>Mary-Somerville-Straße 1<br>28359 Bremen</p><p>oder senden Sie eine E-Mail an info@univention.de. Bitte haben Sie Verständnis dafür, dass wir im Falle Ihres Widerrufs bestimmte Dienste nicht mehr erbringen können.</p><h3>8. Löschung der Daten nach Beendigung der Nutzung</h3><p>Widerrufen Sie Ihre Einwilligung, werden Ihre Daten unverzüglich gelöscht, soweit nicht gesetzliche oder behördliche Aufbewahrungspflichten entgegenstehen.</p><h3>9. Änderung der Datenschutzerklärung</h3><p>Wir behalten uns vor, diese Datenschutzerklärung zu aktualisieren. Im Falle von Änderungen werden wir Sie mit angemessener Frist hierüber informieren und Sie um die Erteilung etwaig erforderlicher Einwilligungen bitten.</p></div>",
	"en-US": "<div class=\"privacyStatementOverlayTextWrapper\"><p>Univention GmbH, Mary-Somerville-Straße 1, 28359 Bremen (“we”), operates internet services at the domains www.univention.com and www.univention.de and different subdomains as www.help.univention.com, wiki.univention.de, sdb.univention.de etc.. These services are partly for direct access via an internetbrowser and partly for the use with Univention Corporate Server (UCS) and other software products of us which build on UCS.</p><p>This data privacy statement intends to explain which data we collect from you as user of our webservices and how we handle your information. We take the protection of your personal details very seriously and follow the applicable data protection terms. Specifically, this means that we only collect, process or use personal details if you have given us your permission to use the data or if the law permits data processing. If you have any questions or comments about this data privacy statements, please contact us at info@univention.de.</p><p>Basically, you use our webservices anonymously. Certain parts of our offering, such as downloading specific apps from the App Center, require the registration as a user. In other places, we offer voluntary registration, which is done by sending us your name, e-mail address and possibly further data. If you register in this form, we collect and process the provided data to optimize our offering, for example, in order to contact you by e-mail or newsletter but also for the purpose of performing the contract. This data will be passed on, in particular, to the respective contractual partner whose offer you use, for example, via the App Center. By entering the data in the appropriate forms, you consent to this.</p><h3>1. Logfiles</h3><p>If you access our webservices, you will be communicating with our servers via the internet. This creates logfiles on our system, in which the IP address and the date and time of your visit are saved. These are only used by us to better analyse and rectify breakdowns in the availability of our servers and to improve our services to you.</p><h3>2. Cookies</h3><p>We use so-called session cookies. Session cookies are small units of information, which we save on the main memory of your computer. A randomly-generated, unique identification number is stored in a session cookie; this is known as the session ID. This type of cookie also contains information about its origin and retention period. These cookies cannot save any other data. The session cookies are deleted as soon as you finish your session.</p><p>Cookies can normally be controlled using any internet browser. Most browsers are set up so that all cookies are accepted without asking the user. If you want to disable the use of cookies, your browser has the option of preventing the acceptance and storage of new cookies. You can find out how this works on your browser using the browser help function. If you automatically and indiscriminately reject cookies with these browser settings, you will be unable to use certain functions on our website. If you automatically delete the saved cookies after every session, the functions which require cookies are then no longer available. If you want to use all the functions of our website, you should ensure your browser settings accept session cookies.</p><h3>3. Analysis tools</h3><p>Our websites use Matomo (former: Piwik), a web analysis service. Matomo uses cookies in the sense of Number 2. For this purpose, the usage information generated by the cookies (including your abbreviated IP address) is transmitted to our server and saved for usage analysis purposes, which we use to optimise the website. Your IP address is immediately anonymised during this procedure so that you as a user remain anonymous to us. The information generated by the cookies about your use of the website will not be forwarded to any third parties. You may refuse the use of cookies by selecting the appropriate settings on your browser; however, please note that if you do this, you may not be able to use the full functionality of this website.</p><p>If you do not agree with the storage and evaluation of this data from your visit, you can subsequently object to the storage and usage at any time by clicking your mouse button. In this, case, a so-called opt-out cookie is stored on your browser, which prevents Matomo from collecting any session data. You can activate this option for the use of our website at:</p><p>https://www.univention.com/privacy-statement/</p><p>Attention: If you delete your cookies, this means that the opt-out cookie will also be deleted and will need to be reactivated by you when necessary.</p><h3>4. Data Security</h3><p>We use technical and organisational security measures to guarantee that your personal details are protected from loss, incorrect modifications and unauthorised access by third parties. Moreover, we only allow authorised people to gain access to your personal details and only to the degree necessary as part of the contractual purposes.</p><h3>5. Right to Information</h3><p>On written request, we will provide you with information about what personal details we have stored about you in relation to the use of our website. You have the right to have your personal details amended or deleted by us at any time. In this case, please write to:</p><p>Univention GmbH<br>Mary-Somerville-Straße 1<br>28359 Bremen.</p><h3>6. Newsletter and MailChimp</h3><p>We use the newsletter provider, MailChimp to send our newsletter. MailChimp is provided by The Rocket Science Group, LLC, 512 Means Street, Ste 404 Atlanta, GA 30318.</p><p>If you register for our newsletter, the data that you provide during the newsletter registration process will be transmitted to MailChimp and saved there. MailChimp offers extensive analysis options to use the newsletter. These analyses are group-related and not used by us for individual evaluation. MailChimp also uses the analysis tool, Google Analytics and incorporates this into the newsletter when necessary.</p><p>You can find more information about MailChimp and data protection at MailChimp here: http://mailchimp.com/legal/privacy/<br>If you agree to receive our newsletter, you are also agreeing to us sending the newsletter by email. You can opt out of the newsletter at any time by clicking the “unsubscribe” link provided in each newsletter. If you opt out, we will no longer use your email address to send you information about our products.</p><h3>7. Right of Withdrawal</h3><p>You can revoke your agreement to the collection and storage of your personal details by Univention at any time. If you wish to do this, please write to:</p><p>Univention GmbH<br>Mary-Somerville-Straße 1<br>28359 Bremen</p><p>or send an email to info@univention.de. Please understand that we will be unable to provide certain services to you if you revoke your agreement.</p><h3>8. Deletion of Data at End of Use</h3><p>If you revoke your agreement, your data will immediately be deleted if there is no legal or official duty to preserve records.</p><h3>9. Changing the Data Privacy Statement</h3><p>We reserve the right to update this data privacy statement. We will inform you of any changes with adequate notice and ask you to provide any necessary consent.</p></div>"
}
