Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-appcenter/umc/js/*.po
Languages: fr

source: %(name)s only supports %(supported)s as architecture. %(msg)s
fr: %(name)s ne gère que l'architecture %(supported)s. %(msg)s

source: %(name)s uses a container technology for enhanced security and compatibility.
fr: %(name)s utilise une technologie de conteneurs qui permet d'améliorer la sécurité et la compatibilité.

source: %s conflicts with the following packages.
fr: %s entre en conflit avec les paquetages suivants.

source: %s installed
fr: %s installé

source: %s is already installed.
fr: %s est déjà installé.

source: %s was discontinued and may not be installed anymore.
fr: %s n'est plus maintenu et ne peut plus être installé.

source: --- all ---
fr: --- tous ---

source: ...<br>[%d more chars]
fr: ...<br>[%d caractères supplémentaires]

source: 1 package is erroneous
fr: 1 paquetage est erroné

source: 1 package will be installed / upgraded
fr: 1 paquetage sera installé / mis à jour

source: 1 package will be removed
fr: 1 paquetage sera supprimé

source: <p><b>Note:</b> This information has been updated. Please read it again.</p>
fr: <p><b>Remarque :</b> cette information a été mise à jour. Veuillez la lire à nouveau.</p>

source: <p>Univention App Center is designed for easy and comfortable administration of Apps. It uses online services provided by Univention, for example, for downloading Apps, descriptions or graphics, or for the search function.</p><p>By using Univention App Center, you agree that originating user data may be stored and evaluated by Univention for product improvements as well as market research purposes. Usage data consists of information such as installing / uninstalling Apps or search queries. These will be transmitted to Univention together with a unique identification of the UCS system.</p><p>When installing and uninstalling some Apps, the App provider will be notified of the operation. The e-mail address used to activate the system is transferred to the provider. Other than that, no transfer of personal or individually assignable data is made to third parties.</p><p>
fr: <p>L'App Center Univention a été conçu pour rendre la gestion des apps facile et confortable. Il utilise des services en ligne fournis par Univention, par exemple pour le téléchargement d'apps, de descriptions ou d'images, ou pour la fonction de recherche.</p><p>Lorsque vous utilisez l'App Center Univention, vous acceptez que les données provenant des utilisateurs puissent être stockées et analysées par Univention pour améliorer les produits ainsi que pour des études de marché. Des données d'utilisation consistent en des informations du type installation / désinstallation d'apps ou requêtes de recherche. Ces données sont transmises à Univention conjointement à un identifiant unique du système UCS.</p><p>Lorsque vous installez ou désinstallez des apps, le fournisseur d'apps sera notifié de cette opération. L'adresse électronique utilisée pour activer le système est transmise au fournisseur. En dehors de cela, aucune information personnelle ou identifiable individuellement n'est transmise à des tiers.</p><p>

source: A module for the administration of the app is available: %s.
fr: Un module pour l'administration de l'app est disponible : %s

source: A version without a container technology is or was installed.
fr: Une version sans technologie de conteneur est ou a été installée.

source: Accept license
fr: Accepter la licence

source: Activate UCS now
fr: Activer UCS maintenant

source: Activation is not possible. Please login as Administrator on the Primary Directory Node.
fr: L'activation n'est pas possible. Veuillez vous connecter en tant qu'administrateur sur le Primary Directory Node.

source: Add
fr: Ajouter

source: Add a new component
fr: Ajouter un nouveau composant

source: Add a new component definition
fr: Ajouter une nouvelle définition de composant

source: Additional repositories
fr: Dépôts supplémentaires

source: Advanced settings
fr: Réglages avancés

source: An unknown error with code %d occurred.
fr: Une erreur inconnue de code %d est survenue.

source: Another package operation is in progress.
fr: Une autre opération sur les paquetages est en cours.

source: App management
fr: Gestion de l'app

source: App settings
fr: Réglages de l'app

source: Apply changes
fr: Appliquer les changements

source: Are you sure you want to delete the following components: [{ids}]
fr: Voulez-vous vraiment supprimer les composants suivants : [{ids}]

source: Autostart
fr: Démarrage automatique

source: Available
fr: Disponible

source: Available support options
fr: Options de gestion disponibles

source: Back to overview
fr: Retour vers la vue globale

source: Basic settings
fr: Réglages de base

source: Buy
fr: Acheter

source: Cancel
fr: Annuler

source: Cancel configuration
fr: Annuler la configuration

source: Cancel installation
fr: Annuler l'installation

source: Candidate version
fr: Version candidate

source: Close
fr: Fermer

source: Component name
fr: Nom du composant

source: Components
fr: Composants

source: Configure %s
fr: Configurer %s

source: Continue
fr: Continuer

source: Continue using
fr: Continuer à utiliser

source: Delete
fr: Supprimer

source: Delete the selected component definition
fr: Supprimer la définition de composant sélectionnée

source: Details
fr: Détails

source: Details for package '%(package)s'
fr: Détails du paquetage « %(package)s »

source: Different UCS Version. Limited manageability
fr: Version d'UCS différente. Possibilités de gestion limitées

source: Disable
fr: Désactiver

source: Disable this component
fr: Désactiver ce composant

source: Disabled
fr: Désactivé

source: Do not show this message again
fr: Ne plus afficher ce message

source: Do you really want to %(verb)s %(ids)s?
fr: Voulez-vous vraiment %(verb)s %(ids)s ?

source: Domain administration
fr: Administration du domaine

source: Edit
fr: Modifier

source: Edit component details [{component}]
fr: Modifier les détails du composant [{component}]

source: Edit the detail information about this component
fr: Modifier les informations détaillées à propos de ce composant

source: Enable
fr: Activer

source: Enable this component
fr: Activer ce composant

source: First steps
fr: Premiers pas

source: General repository settings
fr: Réglages généraux des dépôts de paquetages

source: Install
fr: Installer

source: Install the component's default package(s)
fr: Installer les paquetages par défaut du composant

source: Install them first.
fr: Les installer en premier.

source: Installation of %s
fr: Installation de %s

source: Installation status
fr: État d'installation

source: Installed
fr: Installé

source: Installed version
fr: Version installée

source: Installing
fr: Installation

source: Is installed
fr: Est installé

source: Is upgradable
fr: Peut être mis à jour

source: It can only be configured while it is running.
fr: Il ne peut être configuré qu'une fois lancé.

source: It is currently impossible to remove a plugin once it is installed. Remove %s instead.
fr: Il n'est actuellement pas possible de supprimer un plug-in une fois que celui-ci est installé. Supprimez plutôt %s.

source: It is not possible to continue
fr: Il n'est pas possible de continuer

source: It is not recommended to continue
fr: Il n'est pas recommandé de continuer

source: License
fr: Licence

source: License agreement
fr: Accord de licence

source: More information
fr: Plus d'informations

source: More information...
fr: Plus d'informations...

source: Next app
fr: App suivante

source: No
fr: Non

source: No software changes necessary.
fr: Aucune modification de logiciel nécessaire.

source: No software changes on %s necessary.
fr: Aucune modification de logiciel nécessaire pour %s.

source: No support option provided
fr: Aucune option de gestion fournie

source: Not all hosts are listed above
fr: Tous les hôtes ne sont pas énumérés ci-dessus

source: Not found
fr: Non trouvé

source: On this page, you see all software packages available on your system, and you can install, uninstall or update them.
fr: Vous voyez sur cette page tous les paquetages logiciels disponibles sur votre système, et pouvez les installer, désinstaller ou les mettre à jour.

source: Open
fr: Ouvrir

source: Open "Domain join" module
fr: Ouvrir le module « Rejoindre le domaine »

source: Open "Software update" module
fr: Ouvrir le module « Mise à jour des logiciels »

source: Open %s
fr: Ouvrir %s

source: Open the documentation
fr: Ouvrir la documentation

source: Open the migration guide
fr: Ouvrir le guide de migration

source: Package categories
fr: Catégories du paquetage

source: Package description
fr: Description du paquetage

source: Package details
fr: Détails du paquetage

source: Package name
fr: Nom du paquetage

source: Package size
fr: Taille du paquetage

source: Packages not found:
fr: Paquetages non trouvés :

source: Password
fr: Mot de passe

source: Permission denied
fr: Droit refusé

source: Please correct the corresponding input fields.
fr: Veuillez corriger les champs de saisie correspondants.

source: Please enter the details for the new component.
fr: Veuillez saisir les détails du nouveau composant.

source: Previous app
fr: App précédente

source: Priority
fr: Priorité

source: Read license agreement
fr: Lire l'accord de licence

source: Reboot now
fr: Redémarrer maintenant

source: Refresh
fr: Actualiser

source: Refresh display to see current values
fr: Actualiser pour afficher les valeurs actuelles

source: Removal of %s
fr: Suppression de %s

source: Repository Settings
fr: Réglages des dépôts de paquetages

source: Repository prefix
fr: Préfixe du dépôt

source: Repository server
fr: Serveur de dépôt

source: Search key
fr: Chercher la clé

source: Search term
fr: Chercher un terme

source: Search...
fr: Chercher...

source: Server
fr: Serveur

source: Settings
fr: Réglages

source: Show details
fr: Afficher les détails

source: Started automatically
fr: Démarrée automatiquement

source: Started manually
fr: Démarrée manuellement

source: Starting is prevented
fr: Le démarrage est empêché

source: Status
fr: État

source: Suggest new app
fr: Suggérer une nouvelle app

source: Summary
fr: Résumé

source: Support
fr: Assistance

source: Support Docker Apps
fr: Assistance des apps Docker

source: The App does not provide any information about the license. Please contact the App provider for further details.
fr: Cette app ne fournit aucune information sur sa licence. Veuillez contacter le fournisseur de l'app pour plus d'informations.

source: The app provides a web interface: %s.
fr: L'app propose une interface Web : %s.

source: The data you entered could not be saved correctly.
fr: Impossible d'enregistrer correctement les données saisies.

source: The following hosts cannot be reached or do not have access to the App Center server:
fr: Impossible d'accéder aux hôtes suivants, ou alors ils n'ont pas accès au serveur de l'App Center :

source: The following packages will be installed or upgraded:
fr: Les paquetages suivants seront installés ou mis à jour :

source: The following packages will be removed:
fr: Les paquetages suivants seront supprimés :

source: The following software changes on %s will be applied:
fr: Les modifications suivantes des logiciels sur %s seront appliquées :

source: The server tried to connect to the involved systems.
fr: Le serveur a essayé de se connecter aux systèmes concernés.

source: The steps how to install the service on that machine are described in the online documentation.
fr: Les étapes sur l'installation du service sur cette machine sont décrites dans la documentation en ligne.

source: The system has to be updated.
fr: Le système doit être mis à jour.

source: The version of the remote App Center is <strong>incompatible</strong> with the local one. Please update your hosts.
fr: La version distante de l'App Center n'est <strong>pas compatible</strong> avec la version locale. Veuillez mettre à jour vos hôtes.

source: These changes contain <strong>all package upgrades available</strong> and thus may <strong>include errata updates</strong>. If this is not intended, the corresponding components have to be temporarily deactivated first using the tab "%s" in the App Center.
fr: Ces modifications contiennent <strong>toutes les mises à jour de paquetages disponibles</strong> et peuvent par conséquent <strong>inclure des errata de mise à jour</strong>. Si cette action n'est pas intentionnelle, les composants associés devront être au préalable désactivés en utilisant l'onglet « %s » de l'App Center.

source: This is probably due to a missing reboot after an UCS upgrade. After a reboot, a newer kernel may be used.
fr: Ceci est probablement dû à un redémarrage oublié après une mise à jour UCS. Après le redémarrage, un noyau plus récent sera probablement employé.

source: This module shows all repositories settings defined for this system.
fr: Ce module affiche tous les réglages des dépôts définis pour ce système.

source: This operation causes problems in the following packages that cannot be resolved:
fr: Cette opération provoque des problèmes impossibles à corriger avec les paquetages suivants :

source: Uninstall
fr: Désinstaller

source: Uninstall them first.
fr: Désinstallez-les en premier.

source: Uninstalling
fr: Désinstallation

source: Uninstalling %s will also remove the following plugins:
fr: La désinstallation de %s supprimera également les plugins suivants :

source: Unknown
fr: Inconnu

source: Updating session and module data...
fr: Actualisation de la session et des données du module...

source: Upgrade
fr: Mettre à jour

source: Upgrade of %s
fr: Mise à jour de %s

source: Upgrade to %s available
fr: Mise à jour de %s disponible

source: Upgrading
fr: Mise à jour

source: Use unmaintained repositories
fr: Utiliser des dépôts non maintenus

source: Username
fr: Nom d'utilisateur

source: Users need to be modified in the %s in order to use this service.
fr: Les utilisateurs doivent être modifiés dans %s afin d'utiliser ce service.

source: Using the data you entered, no valid repository could be found.<br/>Since this may be a temporary server problem as well, your data was saved though.<br/>The problem was:
fr: En utilisant les données que vous avez saisies, aucun dépôt n'a été trouvé.<br/>Comme il peut s'agir d'un problème temporaire du serveur, vos données ont tout de même été enregistrées.<br/>Le problème était :

source: Vendor
fr: Vendeur

source: With the current (already changed) settings, the following problem was encountered:
fr: Avec les réglages actuels (et déjà modifiés), le problème suivant a été rencontré :

source: Yes
fr: Oui

source: You can configure the App Center to support it now. The service "docker" will be started.
fr: Vous pouvez configurer l'App Center pour le gérer dès maintenant. Le service « docker » sera installé.

source: You cannot continue
fr: Vous ne pouvez pas continuer

source: You receive such a license key within a couple of minutes via email after a free activation.
fr: Vous recevez cette clé de licence dans les prochaines minutes dans un courriel, après une activation gratuite.

source: You're editing the details of the component definition.
fr: Vous modifiez les détails de la définition du composant.

source: an unknown amount of
fr: un nombre inconnu de

source: install
fr: installer

source: this computer
fr: cet ordinateur

source: this host
fr: cet hôte

source: uninstall
fr: désinstaller

source: upgrade
fr: mettre à jour

source: {0} packages are erroneous
fr: {0} paquetages sont erronés

source: {0} packages will be installed / upgraded
fr: {0} paquetages seront installés / mis à jour

source: {0} packages will be removed
fr: {0} paquetages seront supprimés
