Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/saml/univention-saml/modules/univention/admin/handlers/saml/*.po
Languages: fr

source: A description of this service provider that can be shown to users
fr: Une description de ce fournisseur de service pouvant être montrée aux utilisateurs

source: A list of ldap attributes that are transmitted to the service provider
fr: Une liste d'attributs LDAP qui sont transmis au fournisseur de service

source: Additional configuration options
fr: Options de configuration supplémentaires

source: Allow transmission of ldap attributes to the service provider
fr: Autoriser la transmission d'attributs LDAP au fournisseur de service

source: An absolute URL for the service provider's privacy policy, which will be shown on the consent page
fr: Une URL absolue vers la stratégie de confidentialité du fournisseur de service, qui sera affichée sur la page d'accord

source: Basic Settings
fr: Réglages de base

source: Defines if this service provider is activated, i.e., its configuration is loaded
fr: Définit si le fournisseur de service est activé, c'est-à-dire si sa configuration est chargée

source: Description of this service provider
fr: Description de ce fournisseur de service

source: Extended Settings
fr: Réglages étendus

source: Format of NameID attribute
fr: Format de l'attribut NameID

source: General
fr: Général

source: List of ldap attributes to transmit
fr: Liste des attributs LDAP à transmettre

source: Management of service provider configurations for the SAML identity provider.
fr: Gestion des configurations de fournisseur de service pour le fournisseur d'identité SAML.

source: Name of the attribute that is used as NameID
fr: Nom de l'attribut utilisé en tant que NameID

source: Name of the organization for this service provider
fr: Nom de l'organisation pour ce fournisseur de service

source: Raw XML metadata of the service provider to extend the simplesamlphp configuration.
fr: Métadonnées XML brutes du fournisseur de service pour étendre la configuration simplesamlphp.

source: Respond to this service provider URL after login
fr: Répondre à cette URL de fournisseur de service après connexion

source: SAML service provider
fr: Fournisseur de service SAML

source: SAML service provider basic settings
fr: Réglages de base du fournisseur de service SAML

source: Service provider activation status
fr: État d'activation du fournisseur de service

source: Service provider identifier
fr: Identifiant du fournisseur de service

source: Single logout URL for this service provider
fr: URL de déconnexion unique pour ce fournisseur de service

source: The NameIDFormat the service provider receives. The service provider documentation should mention expected formats. Example: urn:oasis:names:tc:SAML:2.0:nameid-format:transient
fr: Le NameIDFormat que reçoit le fournisseur de service. La documentation du fournisseur de service doit mentionner les formats attendus. Exemple : urn:oasis:names:tc:SAML:2.0:nameid-format:transient

source: The URL of the SingleLogoutService endpoint for this service provider
fr: L'URL du point d'accès SingleLogoutService pour ce fournisseur de service

source: The URL(s) of the AssertionConsumerService endpoints for this SP. Users will be redirected to the URL upon successful authentication. Example: https://sp.example.com/login
fr: URL(s) des points d'accès AssertionConsumerService pour ce fournisseur de service (SP). Les utilisateurs seront redirigés vers l'URL après une authentification réussie. Exemple : https://sp.exemple.com/login

source: The name of the attribute which should be used as the value of the NameID, e.g. uid
fr: Le nom de l'attribut qui doit être utilisé comme valeur pour le NameID, par exemple uid.

source: The name of the organization responsible for the service provider that can be shown to users
fr: Le nom de l'organisation responsable du fournisseur de service, pouvant être montré aux utilisateurs

source: URL to the service provider's privacy policy
fr: URL de la stratégie de confidentialité du fournisseur de service

source: Unique identifier for the service provider definition. With this string the service provider identifies itself at the identity provider
fr: Identifiant unique pour la définition du fournisseur de service. Le fournisseur de service s'identifie au moyen de cette chaîne de caractères auprès du fournisseur d'identité

source: Value for attribute format field
fr: Valeur pour le champ format des attributs

source: Whether the service provider should receive any ldap attributes from the IdP
fr: Indique si le fournisseur de service doit recevoir des attributs LDAP de la part de du fournisseur d'identité (IdP)

source: Which value will be set in the format field of attribute statements. Default: urn:oasis:names:tc:SAML:2.0:attrname-format:basic
fr: La valeur qui sera définie dans le champ format des déclarations d'attributs. Par défaut : urn:oasis:names:tc:SAML:2.0:attrname-format:basic

source: XML metadata
fr: Métadonnées XML

source: You can download the public certificate for this identity provider at %s.
fr: Vous pouvez télécharger le certificat public de ce fournisseur d'identité à l'adresse %s.
