Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/shares/*.po
Languages: fr

source: and %s more
fr: et %s de plus

source: %(name)s (%(path)s on %(host)s)
fr: %(name)s (%(path)s sur %(host)s)

source: %(name)s is not a valid printer on Spoolhost %(host)s.
fr: %(name)s n'est pas une imprimante valide sur le serveur d'impression %(host)s.

source: %(name)s is the last member of the printer group %(group)s.
fr: %(name)s est le dernier membre du groupe d'imprimantes %(group)s.

source: Access control
fr: Contrôle d'accès

source: Access control for users and groups
fr: Contrôle d'accès pour les utilisateurs et groupes

source: Access list can allow or deny listed users and groups.
fr: Les listes d'accès peuvent autoriser ou interdire l'accès aux utilisateurs et groupes figurant dans la liste.

source: Access rights to the exported root directory
fr: Droits d'accès au répertoire racine exporté

source: Allow all users.
fr: Autoriser tous les utilisateurs.

source: Allow anonymous read-only access with a guest user
fr: Autoriser l'accès anonyme en lecture seule avec un utilisateur invité

source: Allow guest access
fr: Autoriser l'accès invité

source: Allow only chosen users/groups.
fr: N'autoriser l'accès qu'à des utilisateurs / groupes sélectionnés.

source: Allowed host/network
fr: Hôte / réseau autorisé

source: Allowed/denied groups
fr: Groupes autorisés / interdits

source: Allowed/denied users
fr: Utilisateurs autorisés / interdits

source: Block size
fr: Taille de bloc

source: Blocking locks
fr: Verrous bloquants

source: Client-side caching policy
fr: Stratégie de mise en cache au niveau du client

source: Configure additional settings for this share which are added to the /etc/exports file.
fr: Configurer pour ce partage des réglages supplémentaires, qui sont ajoutés au fichier /etc/exports.

source: Configure additional smb.conf settings for this share, which are added in the form key = value
fr: Configurer pour ce partage des réglages smb.conf supplémentaires, qui sont ajoutés sous la forme clé = valeur

source: Connection
fr: Connexion

source: Create files/directories with permissions of the parent directory
fr: Créer des fichiers / répertoires héritant des droits d'accès du répertoire parent

source: Create files/directories with the owner of the parent directory
fr: Créer des fichiers / répertoires héritant du propriétaire du répertoire parent

source: Custom settings for NFS shares
fr: Réglages personnalisés pour les partages NFS

source: Custom settings for Samba shares
fr: Réglages personnalisés pour les partages Samba

source: Define if the share is writable when accessed via NFS.
fr: Définit si le partage peut être accédé en écriture lorsque l'accès se fait par NFS.

source: Define if the share is writable when accessed via Samba.
fr: Définit si le partage peut être accédé en écriture lorsque l'accès se fait par Samba.

source: Denied host/network
fr: Hôte / réseau interdit

source: Deny chosen users/groups.
fr: Refuser les utilisateurs / groupes sélectionnés.

source: Directory
fr: Répertoire

source: Directory mode
fr: Mode du répertoire

source: Directory owner group of the share's root directory
fr: Groupe du propriétaire du répertoire racine du partage

source: Directory owner of the share's root directory
fr: Propriétaire du répertoire racine du partage

source: Directory security mode
fr: Mode de sécurité du répertoire

source: Directory that is exported.
fr: Répertoire qui est exporté.

source: Export for NFS clients (NFSv3 and NFSv4)
fr: Exporter pour les clients NFS (NFSv3 et NFSv4)

source: Export for Samba clients
fr: Exporter pour les clients Samba

source: Export share as MSDFS root. Please consult the "Fileshare management" chapter in the manual for more information
fr: Exporter le partage en tant que racine MSDFS. Veuillez consulter le chapitre « Gestion des partages de fichiers » du manuel pour plus d'informations.

source: Fake oplocks
fr: Oplocks simulés

source: File mode
fr: Mode du fichier

source: Files and directories with no read access are hidden. New files and directories receive permissions of the superordinate directory.
fr: Les fichiers et répertoires sans accès en lecture sont cachés. Les nouveaux fichiers et répertoires héritent des droits du répertoire de niveau supérieur.

source: For the given groups printing is explicitly allowed or denied.
fr: Pour les groupes en question, l'impression est explicitement autorisée ou interdite.

source: For the given users printing is explicitly allowed or denied.
fr: Pour les utilisateurs en question, l'impression est explicitement autorisée ou interdite.

source: Force directory mode
fr: Forcer le mode du répertoire

source: Force directory security mode
fr: Forcer le mode de sécurité du répertoire

source: Force file mode
fr: Forcer le mode du fichier

source: Force group
fr: Forcer le groupe

source: Force security mode
fr: Forcer le mode de sécurité

source: Force user
fr: Forcer l'utilisateur

source: General
fr: Général

source: General NFS settings
fr: Réglages NFS généraux

source: General Samba settings
fr: Réglages Samba généraux

source: General directory share settings
fr: Réglages généraux des partages de répertoires

source: General printer group share settings
fr: Réglages généraux des partages de groupes d'imprimantes

source: General printer share settings
fr: Réglages généraux des partages d'imprimantes

source: General settings
fr: Réglages généraux

source: Group members
fr: Membres du groupe

source: Hide files
fr: Cacher les fichiers

source: Hide unreadable files/directories
fr: Cacher les fichiers / répertoires sans accès en lecture

source: Host
fr: Hôte

source: Inherit ACLs
fr: ACLs héritées

source: Invalid users or groups
fr: Utilisateurs ou groupes non valides

source: It is not valid to set %s as a share.
fr: Il n'est pas autorisé de définir %s en tant que partage.

source: Level 2 oplocks
fr: Oplocks de niveau 2

source: Location
fr: Emplacement

source: Locking
fr: Verrouillage

source: MSDFS root
fr: Racine MSDFS

source: May contain hostnames, IP addresses or networks (e.g. 10.1.1.1/24 or 10.1.1.1/255.255.255.0
fr: Peut contenir des noms d'hôtes, des adresses IP ou des réseaux (par exemple 10.1.1.1/24 ou 10.1.1.1/255.255.255.0)

source: Modify user ID for root user (root squashing)
fr: Modifier l'identifiant utilisateur pour l'utilisateur root (root squashing)

source: NFS custom settings
fr: Réglages NFS personnalisés

source: NFS synchronisation
fr: Synchronisation NFS

source: NFS write access
fr: Accès NFS en écriture

source: NT ACL support
fr: Prise en charge des ACL NT

source: Name
fr: Nom

source: Name of the share
fr: Nom du partage

source: Need %(samba)s or %(nfs)s in options to create a share.
fr: Nécessite %(samba)s ou %(nfs)s dans les options pour créer un partage.

source: New files and directories inherit the mode of the parent directory.
fr: Les nouveaux fichiers et répertoires héritent du mode du répertoire parent.

source: Only allow access for this host, IP address or network
fr: Autoriser l'accès uniquement pour cet hôte, cette adresse IP ou ce réseau

source: Oplocks are the way that Samba clients get permission from a server to locally cache file operations. If a server grants an oplock (opportunistic lock) then the client is free to assume that it is the only one accessing the file and it will aggressively cache file data. With some oplock types the client may even cache file open/close operations. This can give enormous performance benefits. When you activate this parameter, Samba will always grant oplock requests no matter how many clients are using the file. It is generally much better to use the real oplocks support rather than this parameter. If you enable this option on all read-only shares or shares that you know will only be accessed from one client at a time such as physically read-only media like CDROMs, you will see a big performance improvement on many operations. If you enable this option on shares where multiple clients may be accessing the files read-write at the same time you can get data corruption. Use this option carefully!
fr: Les oplocks sont le système par lequel les clients Samba obtiennent d'un serveur la permission de mettre en cache local les opérations sur les fichiers. Si un serveur accorde un oplock (opportunistic lock ou verrouillage opportuniste), le client peut alors considérer qu'il est le seul à accéder au fichier et aggressivement mettre en cache les données du fichier. Avec certains types d'oplocks, le client peut même mettre en cache des opérations d'ouverture et de fermeture de fichier. Cela peut générer d'énormes bénéfices en termes de performances. Si vous activez ce paramètre, Samba approuvera systématiquement les demandes d'oplocks, quel que soit le nombre de clients utilisant le fichier. Il est généralement bien plus judicieux d'utiliser l'implémentation réelle des oplocks plutôt que ce paramètre. Si vous activez cette option sur tous les partages en lecture seule, ou sur des partages connus pour ne faire l'objet que d'accès isolés (par exemple des médias physiquement accessibles en lecture seule tels que les CDROMs), vous observerez une amélioration significative des performances sur de nombreuses opérations. Si vous activez cette option sur des partages auxquels plusieurs clients peuvent accéder simultanément en lecture-écriture, cela peut conduire à des données corrompues. Faites preuve de prudence avec cette option !

source: Option name in exports file
fr: Nom de l'option dans le fichier d'exportation

source: Option name in smb.conf and its value
fr: Nom de l'option dans smb.conf et valeur associée

source: Ownership for new files and directories is controlled by the ownership of the parent directory.
fr: Le propriétaire des nouveaux fichiers et répertoires est déterminé par le propriétaire du répertoire parent.

source: Permissions for the share's root directory
fr: Droits sur le répertoire racine du partage

source: Postexec script
fr: Script postexec

source: Preexec script
fr: Script preexec

source: Printable name
fr: Nom imprimable

source: Printer model
fr: Modèle d'imprimante

source: Printer producer
fr: Fabricant de l'imprimante

source: Printer share
fr: Partage d'imprimante

source: Printer share: Printer
fr: Partage d'imprimante : imprimante

source: Printer share: Printer group
fr: Partage d'imprimante : groupe d'imprimantes

source: Redirect root user access to a non-privileged uid.
fr: Rediriger l'accès utilisateur root vers un uid sans privilèges.

source: Restrict write access to these users/groups
fr: Restreindre l'accès en écriture à ces utilisateurs / groupes

source: Samba custom settings
fr: Réglages Samba personnalisés

source: Samba extended permission settings
fr: Réglages des droits Samba étendus

source: Samba extended permissions
fr: Droits Samba étendus

source: Samba options
fr: Options Samba

source: Samba permission settings
fr: Réglages des droits Samba

source: Samba permissions
fr: Droits Samba

source: Samba write access
fr: Accès en écriture Samba

source: Security mode
fr: Mode de sécurité

source: Share is browseable, i.e. it is listed in the Windows network environment
fr: Le partage peut être parcouru, c'est-à-dire qu'il figure dans le voisinage réseau Windows

source: Share: Directory
fr: Partage : répertoire

source: Show in Windows network environment
fr: Afficher dans le voisinage réseau Windows

source: Specifies which VFS Objects to use.
fr: Indique quels objets VFS utiliser.

source: Strict locking
fr: Verrouillage strict

source: Subtree checking
fr: Vérification du sous-arbre

source: The %(plural)s %(user)s%(num)s %(use)s this share as home share!
fr: Le %(plural)s %(user)s%(num)s %(use)s ce partage en tant que répertoire personnel partagé !

source: The computer that exports this share
fr: L'ordinateur qui exporte ce partage

source: The owner of the exported root directory. If none is given root will be owner.
fr: Le propriétaire du répertoire racine exporté. Si aucun n'est précisé, root en sera le propriétaire.

source: The primary group of the exported root directory, if none is given group 0 will be used.
fr: Groupe principal du répertoire racine exporté. Si aucun n'est précisé, le groupe 0 est utilisé.

source: The way clients capable of offline caching will cache the files in the share.
fr: Définit la manière dont les clients capables de faire de la mise en cache hors ligne mettront en cache les fichiers de ce partage.

source: This boolean parameter controls whether Samba will attempt to map UNIX permissions into Windows NT access control lists.
fr: Ce paramètre booléen détermine si Samba tentera de transformer les droits UNIX en listes de contrôle d'accès Windows NT.

source: This controls whether or not locking will be performed by the server in response to lock requests from the client. Be careful about disabling locking, as lack of locking may result in data corruption.
fr: Ceci détermine si le serveur pratiquera le verrouillage en réponse aux demandes de verrouillage de la part d'un client. Faites attention si vous désactivez le verrouillage, car l'absence de verrouillage peut conduire à des données corrompues.

source: This is the NetBIOS name. Among other places, it appears in the Windows Network Neighborhood.
fr: C'est le nom NetBIOS. Il apparaît, entre autres, dans le voisinage réseau Windows.

source: This option specifies a command to be run whenever the service is connected to. It takes the usual substitutions.
fr: Cette option indique une commande à exécuter dès qu'il y a une connexion à ce service. Elle accepte les caractères de remplacement habituels.

source: This option specifies a command to be run whenever the service is disconnected. It takes the usual substitutions.
fr: Cette option indique une commande à exécuter dès qu'il y a une déconnexion de ce service. Elle accepte les caractères de remplacement habituels.

source: This parameter can be used to ensure that if default ACLs exist on parent directories, they are always honored when creating a subdirectory. The default behavior is to use the mode specified when creating the directory. Enabling this option sets the mode to 0777, thus guaranteeing that default directory ACLs are propagated.
fr: Ce paramètre peut être utilisé pour garantir que si des ACLs par défaut existent sur les répertoires parents, elles sont toujours respectées lorsqu'un sous-répertoire est créé. Le comportement par défaut consiste à utiliser le mode précisé lors de la création du répertoire. Activer cette option fixe le mode à la valeur 0777, ce qui garantit la propagation des ACLs par défaut du répertoire.

source: This parameter controls the behavior of Samba when given a request by a client to obtain a byte range lock on a region of an open file, and the request has a time limit associated with it. If this parameter is set and the lock range requested cannot be immediately satisfied, samba will internally queue the lock request, and periodically attempt to obtain the lock until the timeout period expires.
fr: Ce paramètre détermine le comportement de Samba lorsqu'un client demande à verrouiller une plage d'octets sur une région d'un fichier ouvert et que la requête est associée à une limite de temps. Si ce paramètre est défini et que le verrouillage demandé ne peut pas être satisfait immédiatement, Samba mettra la demande de verrouillage dans une file d'attente interne et tentera périodiquement d'obtenir le verrouillage jusqu'à expiration du délai d'attente.

source: This parameter specifies a set of UNIX mode bit permissions that will always be set on a directory created by Samba. This is done by bitwise 'OR'ing these bits onto the mode bits of a directory that is being created or having its permissions changed. The modes in this parameter are bitwise 'OR'ed onto the directory mode after the mask set in the create mask parameter is applied.
fr: Ce paramètre indique un jeu binaire de droits de mode UNIX qui seront toujours appliquées à un répertoire créé par Samba. Ceci est réalisé au moyen d'une opération OU binaire appliquée bit par bit entre ces droits et les bits de mode d'un répertoire en cours de création ou dont les droits sont en cours de modification. Les modes de ce paramètre sont comparés bit par bit, au moyen d'un OU binaire, avec le mode du répertoire après application du masque défini dans le paramètre masque de création.

source: This parameter specifies a set of UNIX mode bit permissions that will always be set on a file created by Samba. This is done by bitwise 'OR'ing these bits onto the mode bits of a file that is being created or having its permissions changed. The modes in this parameter are bitwise 'OR'ed onto the file mode after the mask set in the create mask parameter is applied.
fr: Ce paramètre indique un jeu binaire de droits de mode UNIX qui seront toujours appliquées à un fichier créé par Samba. Ceci est réalisé au moyen d'une opération OU binaire appliquée bit par bit entre ces droits et les bits de mode d'un fichier en cours de création ou dont les droits sont en cours de modification. Les modes de ce paramètre sont comparées bit par bit, au moyen d'un OU binaire, avec le mode du fichier après application du masque défini dans le paramètre masque de création.

source: This specifies a UNIX group name that will be assigned as the default primary group for all users connecting to this service. This is useful for sharing files by ensuring that all access to files on the service will use the named group for their permissions checking. Thus, by assigning permissions for this group to the files and directories within this service the Samba administrator can restrict or allow sharing of these files.
fr: Ceci précise un nom de groupe UNIX qui sera assigné en tant que groupe principal par défaut pour tous les utilisateurs se connectant à ce service. Cette option est utile pour le partage de fichiers car elle garantit que tout accès aux fichiers du service utilisera le nom du groupe pour les vérifications des droits d'accès. Ainsi, en assignant les droits sur les fichiers et répertoires de ce service pour ce groupe, l'administrateur Samba peut autoriser ou restreindre le partage de ces fichiers.

source: This specifies a UNIX user name that will be assigned as the default user for all users connecting to this service. This is useful for sharing files. You should also use it carefully as using it incorrectly can cause security problems.
fr: Ceci indique un nom d'utilisateur UNIX qui sera assigné en tant qu'utilisateur par défaut pour tous les utilisateurs se connectant à ce service. Ceci est utile pour le partage de fichiers. Cette option doit aussi être utilisée avec prudence car une utilisation incorrecte peut conduire à des problèmes de sécurité.

source: This value controls the handling of file locking in the server. If strict locking is set to Auto (the default), the server performs file lock checks only on non-oplocked files. As most Windows redirectors perform file locking checks locally on oplocked files this is a good trade-off for improved performance. If set to yes, the server will check every read and write access for file locks, and deny access if locks exist. This can be slow on some systems. If strict locking is disabled, the server performs file lock checks only if the client explicitly asks for them.
fr: Cette valeur contrôle la gestion du verrouillage de fichiers sur le serveur. Si le verrouillage strict est défini à Auto (valeur par défaut), le serveur ne vérifie le verrouillage des fichiers que sur les fichiers sans oplock. Du fait que la plupart des redirecteurs Windows vérifient localement le verrouillage des fichiers avec oplock, c'est un bon compromis en matière d'amélioration des performances. Si la valeur est définie à yes, le serveur vérifiera l'existence d'un verrouillage pour chaque accès en lecture et en écriture, et refusera l'accès si un verrou existe. Cela peut être lent sur certains systèmes. Si le verrouillage strict est désactivé, le serveur ne vérifie le verrouillage des fichiers que si le client le demande explicitement.

source: Use synchronous or asynchronous mode for the NFS share.
fr: Utiliser le mode synchrone ou asynchrone pour le partage NFS.

source: Users who have write access to a file or directory are able to change the permissions
fr: Les utilisateurs qui ont accès en écriture à un fichier ou un répertoire peuvent en changer les droits.

source: Users with write access may modify permissions
fr: Les utilisateurs qui ont accès en écriture peuvent modifier les droits

source: VFS objects
fr: Objets VFS

source: Valid users or groups
fr: Utilisateurs ou groupes valides

source: When a directory is created, the necessary permissions are calculated according to the mapping from DOS modes to UNIX permissions, and the resulting UNIX mode is then bit-wise 'AND'ed with this parameter. This parameter may be thought of as a bit-wise MASK for the UNIX modes of a directory. Any bit not set here will be removed from the modes set on a directory when it is created.
fr: Lorsqu'un répertoire est créé, les droits nécessaires sont calculés à partir de la correspondance entre les modes DOS et les droits UNIX, et le mode UNIX résultant est ensuite combiné logiquement (AND) bit par bit à ce paramètre. Ce paramètre peut être vu comme un masque binaire pour les modes UNIX d'un répertoire. Tout bit non défini ici sera supprimé des modes appliqués à un répertoire lors de sa création.

source: When a file is created, the necessary permissions are calculated according to the mapping from DOS modes to UNIX permissions, and the resulting UNIX mode is then bit-wise 'AND'ed with this parameter. This parameter may be thought of as a bit-wise MASK for the UNIX modes of a file. Any bit not set here will be removed from the modes set on a file when it is created.
fr: Lorsqu'un fichier est créé, les droits requis sont calculés à partir de la correspondance entre les modes DOS et les droits UNIX, et le mode UNIX résultant est ensuite ajouté logiquement (AND) bit par bit à ce paramètre. Ce paramètre peut être vu comme un masque binaire pour les modes UNIX d'un fichier. Tout bit non défini ici sera supprimé des modes appliqués à un fichier lors de sa création.

source: When only a subtree of a mounted filesystem is exported this option ensures that an accessed file really is in that subtree. (May cause complications with renamed files.)
fr: Cette option garantit que, lorsque seul un sous-arbre d'un système de fichiers monté est exporté, un fichier faisant l'objet d'un accès appartient bien à ce sous-arbre (cela peut occasionner des problèmes avec les fichiers renommés).

source: Windows name
fr: Nom Windows

source: disable
fr: désactiver

source: manual
fr: manuel

source: programs
fr: programmes

source: use
fr: utilisent

source: user
fr: utilisateur

source: users
fr: utilisateurs

source: uses
fr: utilise
