Repository: univention/univention-corporate-server
Catalog: kolab2/univention-kolab2-framework/files/var/lib/univention-kolab2-framework/fbview/turba/po/*.po
Languages: fi_fi

source: %s added.
fi_fi: %s lis‰tty.

source: %s file successfully imported
fi_fi: %s tiedoston tuonti onnistui

source: A browser that supports iFrames is required
fi_fi: Tarvitaan selain, jossa on tuki iFrames toiminnolle

source: Add Object
fi_fi: Lis‰‰ objekti

source: Add a new contact
fi_fi: Lis‰‰ uudet yhteystiedot

source: Add column
fi_fi: Lis‰‰ sarake

source: Add to
fi_fi: Lis‰‰ kohteeseen

source: Add
fi_fi: Lis‰‰

source: Added a %s link to %s.
fi_fi: Lis‰ttiin %s linkki %s:‰‰n.

source: Address Book Listing
fi_fi: Osoitekirjan selaus

source: Address book entry
fi_fi: Osoitekirjan merkint‰

source: Address book is read-only.
fi_fi: Osoitekirjaa voi vain lukea.

source: Addresses in list: %s
fi_fi: Osoitteet listassa: %s

source: Advanced Search
fi_fi: Tarkempi haku

source: All
fi_fi: Kaikki

source: Ascending
fi_fi: Nouseva

source: Available Columns:
fi_fi: K‰ytett‰viss‰olevat sarakkeet:

source: Back to %s
fi_fi: Palaa takaisin hakemistoon %s

source: Browse
fi_fi: Selaa

source: Cancel
fi_fi: Peru

source: Checkbox
fi_fi: Valintaruutu

source: Choose a default directory for your personal addressbook, contact lists, and searches.
fi_fi: Voit valita oletushakemiston osoitekirjaksi, osoitelistaksi ja k‰ytett‰v‰ksi hakutoiminnoissa.

source: Choose the order of the columns to display in the address list.
fi_fi: Valitse sarakkeiden j‰rjestys osoitelistassa.

source: Clear Search
fi_fi: Poista hakuehdot

source: Column Options
fi_fi: Sarakkeiden asetukset

source: Comma separated values
fi_fi: Pilkuilla erotetut arvot

source: Company
fi_fi: Yritys

source: Contact List
fi_fi: Yhteystietolista

source: Contact not found.
fi_fi: Yhtyestietoja ei lˆytynyt.

source: Contact removed from list.
fi_fi: Yhteystiedot poistettiin listalta.

source: Contents of %s
fi_fi: %s:n sis‰ltˆ

source: Default Display
fi_fi: Oletusn‰kym‰

source: Default directory for your personal addressbook, contact lists, and searches.
fi_fi: Oletushakemisto osoitekirjaksi, osoitelistaksi ja haku toimintoihin.

source: Default sorting direction:
fi_fi: Oletusj‰rjestyksen suunta:

source: Delete '%s'
fi_fi: Poista '%s'

source: Delete
fi_fi: Poista

source: Deletion failed
fi_fi: Poistaminen ep‰onnistui

source: Descending
fi_fi: Laskeva

source: Directory
fi_fi: Hakemisto

source: Display Options
fi_fi: N‰kym‰n asetukset

source: Edit %s
fi_fi: Muokkaa %s

source: Edit '%s'
fi_fi: Muokkaa '%s'

source: Edit entry for %s
fi_fi: Muokkaa %s:n merkint‰‰

source: Edit
fi_fi: Muokkaa

source: Email
fi_fi: S‰hkˆposti

source: Empty key
fi_fi: Tyhj‰ avain

source: Empty source
fi_fi: Tyhj‰ l‰hde

source: Entry for %s updated.
fi_fi: Merkint‰ %s:st‰ on p‰ivitetty.

source: Error while searching directory.
fi_fi: Tapahtui virhe kun hakemistosta suoritettiin hakua.

source: Exit Address Book
fi_fi: Poistu osoitekirjasta

source: Export Address Book
fi_fi: Vie osoitekirja

source: Export
fi_fi: Vie

source: Failed to access the specified address book.
fi_fi: Valittuun osoitekirjaan ei saatu yhteytt‰.

source: Failed to browse list
fi_fi: Listan selaus ep‰onnistui.

source: Failed to browse the directory
fi_fi: Hakemiston selaus ep‰onnistui

source: Failed to connect to the specified directory.
fi_fi: Yhteys valittuun hakemistoon ep‰onnistui.

source: Failed to search the directory: %s
fi_fi: Haku ep‰onnistui hakemistosta: %s

source: Failed to search the specified directory.
fi_fi: Haku ep‰onnistui valitusta hakemistosta.

source: Fax
fi_fi: Faksi

source: Find
fi_fi: Haku

source: From
fi_fi: L‰hde

source: Group
fi_fi: Ryhm‰

source: Help
fi_fi: Ohje

source: Home Address
fi_fi: Kotiosoite

source: Home Phone
fi_fi: Puhelin(koti)

source: Import Address Book, Step %d
fi_fi: Osoitekirjan tuonti, askel %d

source: Import/Export Address books
fi_fi: Tuo/Vie osoitekirja

source: Import/Export
fi_fi: Tuo/Vie

source: Invalid address book.
fi_fi: Ep‰kelpo osoitekirja.

source: Invalid e-mail address.
fi_fi: Virheellinen s‰hkˆpostiosoite.

source: Invalid email.
fi_fi: Virheellinen s‰hkˆpostiosoite.

source: Invalid entry.
fi_fi: Virheellinen tieto.

source: Invalid name.
fi_fi: Virheellinen nimi.

source: Language
fi_fi: Kieli

source: Link added.
fi_fi: Lis‰ttiin linkki.

source: Link canceled.
fi_fi: Poistettiin linkki.

source: Matching
fi_fi: On

source: Mini Search
fi_fi: Pieni haku

source: Missing information
fi_fi: Puuttuu tietoja

source: Mobile Phone
fi_fi: Matkapuhelin

source: More than 1 entry returned.
fi_fi: Vaihtoehtoja oli enemm‰n kuin 1.

source: Move left
fi_fi: Siirr‰ vasemmalle

source: Move right
fi_fi: Siirr‰ oikealle

source: Mulberry Address Book
fi_fi: Mulberry-osoitekirja

source: Multiple persons with address [%s], but none with name [%s] in address book.
fi_fi: Osoitekirjassa oli monta henkilˆ‰ osoitteella [%s], mutta ei ket‰‰n nimell‰ [%s].

source: My Addressbook
fi_fi: Osoitekirjani

source: Name Format
fi_fi: Nimen muoto

source: Name
fi_fi: Nimi

source: Netcenter Member Directory
fi_fi: Netcenter j‰senhakemisto

source: New Contact
fi_fi: Uusi yhteystieto

source: New List
fi_fi: Uusi lista

source: Next
fi_fi: Seuraava

source: No %s entry found for %s.
fi_fi: %s:lle ei lˆytynyt tietoa %s.

source: No contacts found
fi_fi: Ei lˆytynyt yhteystietoja

source: None
fi_fi: Ei ainuttakaan

source: Notes
fi_fi: Muistiinpanot

source: Options
fi_fi: Asetukset

source: PGP Public Key
fi_fi: Julkinen PGP-avain

source: Pine Address Book
fi_fi: Pine-osoitekirja

source: Please choose an address book to add a contact to.
fi_fi: Valitse osoitekirja, johon yhteystiedot lis‰t‰‰n.

source: Please enter the name of the new list:
fi_fi: Anna nimi uudelle listalle:

source: Please select a directory:
fi_fi: Valitse hakemisto:

source: Please select contact
fi_fi: Valitse yhteystieto

source: Private Address Book
fi_fi: Yksityinen osoitekirja

source: Quick Search
fi_fi: Pikahaku

source: Remove column
fi_fi: Poista sarake

source: Remove from this list
fi_fi: Poista t‰lt‰ listalta

source: Requested object not found.
fi_fi: Pyydetty‰ objektia ei lˆytynyt.

source: Reset
fi_fi: Tyhjenn‰

source: S/MIME Public Certificate
fi_fi: S/MIME julkinen varmenne

source: Save
fi_fi: Talleta

source: Search Results
fi_fi: Haun tulokset

source: Search
fi_fi: Haku

source: Searching Options
fi_fi: Haun asetukset

source: Searching...
fi_fi: Haetaan...

source: Select Address Book
fi_fi: Valitse osoitekirja

source: Select List
fi_fi: Valitse lista

source: Select Source
fi_fi: Valitse l‰hde

source: Select the destination to import to:
fi_fi: Valitse kohde, johon tuot tietoa:

source: Select the file to import:
fi_fi: Valitse tiedosto, josta tuot tietoa:

source: Select the format to export to:
fi_fi: Valitse vienniss‰ k‰ytett‰v‰ muoto:

source: Select the format to import from:
fi_fi: Valitse tuonnissa k‰ytett‰v‰ muoto:

source: Select the format used to display names:
fi_fi: Valitse nimien esitysmuoto:

source: Select the source to export from:
fi_fi: Valitse l‰hde, josta vied‰‰n tietoa:

source: Select view to display by default.
fi_fi: Voit valita oletusn‰kym‰n.

source: Select which fields to display in the address lists.
fi_fi: Valitse osoitelistassa n‰ytett‰v‰t kent‰t.

source: Select which format to display names.
fi_fi: Voit valita nimien esitysmuodon.

source: Select your preferred language:
fi_fi: Valitse k‰ytett‰v‰ kieli:

source: Select
fi_fi: Valitse

source: Selected Columns:
fi_fi: Valitut sarakkeet:

source: Set your preferred display language.
fi_fi: Voit asettaa ohjelmassa k‰ytett‰v‰n kielen.

source: Shared Directory
fi_fi: Jaettu hakemisto

source: Show All
fi_fi: N‰yt‰ kaikki

source: Show Contacts
fi_fi: N‰yt‰ yhteystiedot

source: Show Lists
fi_fi: N‰yt‰ listat

source: Show
fi_fi: N‰yt‰

source: Some of Turba's configuration files are missing:
fi_fi: Joitakin Turban asetustiedostoja puuttuu:

source: Sort Direction
fi_fi: J‰rjestyksen suunta.

source: Source
fi_fi: L‰hde

source: Tab separated values
fi_fi: Tabulaattorein(TAB) erotetut arvot

source: The object you requested does not exist.
fi_fi: Pyyt‰m‰‰si ohjektia ei ole olemassa.

source: There are no browseable address books.
fi_fi: Osoitekirjoja ei voi selata.

source: There are no writeable address books. None of the available address books are configured to allow you to add new entries to them. If you believe this is an error, please contact your system administrator.
fi_fi: Osoitekirjoihin ei voi kirjoittaa. K‰ytett‰viss‰olevat osoitekirjat eiv‰t salli sinun lis‰t‰ niihin uusia osoitteita. Jos ep‰ilet virhetilannetta, niin ota yhteys j‰rjestelm‰n yll‰pit‰j‰‰n.

source: There was an error adding this object. Contact your system administrator for further help.
fi_fi: Tietueen lis‰‰minen ep‰onnistui. Ota yhteytt‰ j‰rjestelm‰n yll‰pit‰j‰‰n.

source: There was an error creating a new list.
fi_fi: Uuden listan tekeminen ep‰onnistui.

source: There was an error deleting this object. Contact your system administrator for further help.
fi_fi: Tietueen poistaminen ep‰onnistui. Ota yhteytt‰ j‰rjestelm‰n yll‰pit‰j‰‰n.

source: There was an error deleting this object.
fi_fi: T‰m‰n objektin poistaminen ep‰onnistui.

source: There was an error displaying the select List
fi_fi: Listan n‰ytt‰minen ep‰onnistui

source: There was an error importing the data: %s
fi_fi: Tiedon tuonnissa tapahtui virhe: %s

source: There was an error importing the vCard data.
fi_fi: Tapahtui virhe tuotaessa vCard-tietoja.

source: There was an error removing this object.
fi_fi: T‰m‰n objektin poistaminen ep‰onnistui.

source: There was an error updating this entry: %s.
fi_fi: T‰m‰n merkinn‰n p‰ivityksess‰ tapahtui virhe: %s.

source: There were no addresses to export.
fi_fi: Ei ole yht‰‰n viet‰v‰‰ osoitetta.

source: This file controls the default preferences for Turba, and also controls which preferences users can alter.
fi_fi: T‰ss‰ tiedostossa m‰‰ritell‰‰n Turba-ohjelmiston k‰ytt‰j‰n oletusasetukset ja myˆs asetukset, joita k‰ytt‰j‰t itse voivat asettaa ja muuttaa.

source: This file controls the stylesheet that is used to set colors and fonts in addition to or overriding Horde defaults.
fi_fi: T‰ss‰ tiedostossa asetetaan tyylitiedot, jotka m‰‰rittelev‰t k‰ytett‰v‰t v‰rit ja kirjasimet. N‰m‰ m‰‰rityksen menev‰t Horde:n m‰‰ritysten ylitse.

source: This file defines the Turba global attribute names and types - names, email addresses, etc.
fi_fi: T‰ss‰ tiedostossa m‰‰ritell‰‰n Turban yleiset tietuem‰‰ritteet ja tyypit - nimet, s‰hkˆposti jne.

source: This file defines the list of available sources for Turba.
fi_fi: T‰ss‰ tiedostoss‰ m‰‰ritell‰‰n Turba:ss‰ k‰ytett‰v‰t hakemistot.

source: This file format is not supported.
fi_fi: T‰m‰ tiedostomuoto ei ole tuettu.

source: This is the main Turba configuration file. It contains paths and options for the Turba scripts.
fi_fi: T‰m‰ on Turban p‰‰asetustiedosto. Se sis‰lt‰‰ esimerkiksi polut ja asetukset muihin Turban k‰ytt‰miin skripteihin.

source: This person already has a %s entry in the address book.
fi_fi: T‰ll‰ henkilˆll‰ on jo %s tieto osoitekirjassa.

source: This person is already in your address book.
fi_fi: T‰m‰ henkilˆn tiedot ovat jo osoitekirjassa.

source: Title
fi_fi: Titteli

source: Turba is not properly configured
fi_fi: Turba-ohjelmisto ei ole asennettu oikein

source: Unable to load the definition of %s.
fi_fi: M‰‰rityksen %s lukeminen ep‰onnistui.

source: Unknown source
fi_fi: Tuntematon l‰hde

source: Unnamed Contact
fi_fi: Nimetˆn yhteystieto

source: User Options
fi_fi: K‰ytt‰j‰n asetukset

source: Verisign Directory
fi_fi: Verisign hakemisto

source: View '%s'
fi_fi: N‰yt‰ '%s'

source: View Contact
fi_fi: N‰yt‰ yhteystiedot

source: View to display by default:
fi_fi: Oletuksena k‰ytett‰v‰ n‰kym‰:

source: Work Address
fi_fi: Tyˆosoite

source: Work Phone
fi_fi: Puhelin(tyˆ)

source: You are creating a distribution list.
fi_fi: Olet tekem‰ss‰ jakelulistaa.

source: You do not have permission to view this object.
fi_fi: Sinulla ei ole oikeuksia n‰hd‰ t‰m‰n objektin tietoja.

source: You must select an address first.
fi_fi: Sinun pit‰‰ ensin valita osoite.

source: You must select at least one contact first.
fi_fi: Sinun pit‰‰ valita ainakin yksi yhteystieto.

source: You only have permission to view this object.
fi_fi: Sinulla on oikeudet vain katsoa t‰m‰n objektin tietoja.

source: Your Information
fi_fi: Omat tietosi

source: "Firstname Lastname" (ie. John Doe)
fi_fi: "Etunimi Sukunimi" (esim. Matti Meik‰l‰inen)

source: "Lastname, Firstname" (ie. Doe, John)
fi_fi: "Sukunimi, Etunimi" (esim. Meik‰l‰inen, Matti)

source: contacts.tsv
fi_fi: contacts.csv

source: from
fi_fi: l‰hde

source: vCard
fi_fi: vCard-k‰yntikortti
