Repository: univention/univention-corporate-server
Catalog: */univention-installer/installer/locale/*/LC_MESSAGES/installer.po
Languages: de

source: The installation has been finished successfully!
de: Die Installation wurde erfolgreich abgeschlossen!

source: This system has been configured to IP address %s and
de: Dieses System wurde auf die IP-Adresse %s konfiguriert

source: This system has been configured for DHCP usage and
de: Dieses System bezieht seine IP-Adresse über DHCP

source: has not been joined to UCS domain yet.
de: und ist noch nicht der UCS-Domäne beigetreten.

source: has been joined to UCS domain.
de: und ist der UCS-Domäne beigetreten.

source: Please remove installation media from drive and
de: Bitte entnehmen Sie das Installationsmedium und

source: press ok to reboot this system.
de: drücken OK, um das System neu zu starten.

source: Administrative frontends:
de: Administrationsoberflächen:

source: Administrative account name: Administrator
de: Administratives Konto: Administrator

source: Additional information: http://www.univention.de/dokumentation.html
de: Zusätzliche Informationen: http://www.univention.de/dokumentation.html

source: Some problems occurred during installation!
de: Es sind Probleme während der Installation aufgetreten!

source: Please read the following error messages carefully.
de: Bitte lesen Sie die folgenden Fehlermeldungen sorgfältig.

source: In case of doubt a reinstallation might be reasonable.
de: Im Zweifelsfall kann eine Neuinstallation notwendig sein.

source: Press Ctrl+c to exit or any key to continue. After exiting the installer please reboot the system or press Ctrl+Alt+F2 to get an shell prompt.
de: Drücken Sie Strg-C um den Installer zu verlassen oder eine beliebige Taste um fortzufahren. Nachdem Sie das Installationsprogramm beendet haben, können Sie das System neu starten oder mittels Strg-Alt-F2 zu einer Shell gelangen.

source: This error message is shown when an unexpected error occures during the installation process. The best way is to reboot the computer and retry the installation. Confirming this message will restart the installation process without rebooting.
de: Diese Fehlermeldung wird angezeigt, wenn während der Installation ein unerwarteter Fehler aufgetreten ist. Es wäre sicherer an dieser Stelle den Rechner neuzustarten und die Installation erneut durchzuführen. Wenn Sie die Fehlermeldung allerdings bestätigen, wird die Installation ohne Neustart des Rechner neu initialisiert.

source: A Python Exception has occured!
de: Ein Python-Ausnahmefehler ist aufgetreten!

source: F1-Help | F12-Start Recover Shell | Ctrl+c-Exit
de: F1-Hilfe | F12-Starte Recover Shell | Strg+c-Abbruch

source: F1-Help | F12-Start Installation | Ctrl+c-Exit
de: F1-Hilfe | F12-Starte Installation | Strg+c-Abbruch

source: F1-Help | F12-Next | Ctrl+c-Exit
de: F1-Hilfe | F12-Weiter | Strg+c-Abbruch

source: F1-Help | F11-Back | F12-Start Recover Shell | Ctrl+c-Exit
de: F1-Hilfe | F11-Zurück | F12-Starte Recover Shell | Strg+c-Abbruch

source: F1-Help | F11-Back | F12-Start Installation | Ctrl+c-Exit
de: F1-Hilfe | F11-Zurück | F12-Starte Installation | Strg+c-Abbruch

source: F1-Help | F11-Back | F12-Next | Ctrl+c-Exit
de: F1-Hilfe | F11-Zurück | F12-Weiter | Strg+c-Abbruch

source: Help
de: Hilfe

source: Esc-Quit Dialog
de: Esc-Dialog beenden

source: Warning
de: Warnung

source: End
de: Ende

source: F12-Next
de: F12-Weiter

source: F12-Accept changes
de: F12-Änderungen akzeptieren

source: F12-Start Recover Shell
de: F12-Recover Shell starten

source: F12-Start installation
de: F12-Installation starten

source: F11-Back
de: F11-Zurück

source: Sorry, no help for this module.
de: Es existiert keine Hilfe für dieses Modul

source: Yes
de: Ja

source: No
de: Nein

source: Desktop Environment
de: Desktop-Umgebung

source: Desktop Environment packages
de: Pakete der Desktop-Umgebung

source: Desktop environment
de: Desktop-Umgebung

source: Core Packages for a Graphical Desktop Environment
de: Basispakete für die grafische Desktop-Umgebung

source: Services for Windows
de: Services für Windows

source: Several Windows related services
de: Verschiedene Windows bezogene Dienste

source: Active Directory-compatible domaincontroller (Samba 4)
de: Active Directory-kompatibler Domänencontroller (Samba 4)

source: Samba 4 Services
de: Samba 4 Dienste

source: NT-compatible domaincontroller (Samba 3)
de: NT-kompatibler Domänencontroller (Samba 3)

source: Samba Services
de: Samba-Dienste

source: Sync users and groups with Active Directory
de: Benutzer und Gruppen mit Active Directory synchronisieren

source: Virtualization
de: Virtualisierung

source: Univention virtualization
de: Univention Virtualisierung

source: Management server for KVM or Xen
de: Management-Server für KVM oder Xen

source: UMC module for managing virtualization servers and virtual instances
de: UMC Modul für die Verwaltung von Virtualisierungsservern und virtuellen Instanzen

source: KVM virtualization server
de: KVM Virtualisierungsserver

source: Sets up a virtualization server based on KVM
de: Richtet einen auf KVM basierenden Virtualisierungsserver ein

source: Xen virtualization server
de: Xen Virtualisierungsserver

source: Sets up a virtualization server based on Xen
de: Richtet einen auf Xen basierenden Virtualisierungsserver ein

source: System services
de: Systemdienste

source: Additional Services
de: Weitere Dienste

source: Standard mail services with postfix and cyrus (SMTP/POP/IMAP)
de: Standard Mail-Dienste mit Postfix und Cyrus (SMTP/POP/IMAP)

source: Print server (CUPS)
de: Druckserver (CUPS)

source: Print server based on CUPS
de: Druckserver basierend auf CUPS

source: Web Proxy Services
de: Web-Proxy-Dienste

source: Network based Backup Software
de: Netzwerk basierte Backup Software

source: Monitoring
de: Überwachung

source: Monitoring services
de: Überwachungsdienste

source: Network monitoring (Nagios)
de: Netzwerküberwachung (Nagios)

source: Host, service and network monitoring program (server software)
de: Rechner-, Dienste- und Netzwerk-Überwachungsdienst (Server Software)

source: Software installation monitor
de: Paketstatus-Überwachung

source: Univention packagestatus database
de: Univention Paketstatus Datenbank

source: Master domain controller
de: Domain Controller Master

source: Backup domain controller
de: Domain Controller Backup

source: Slave domain controller
de: Domain Controller Slave

source: Base system
de: Basissystem

source: Retrieving %(pkg)s
de: Hole %(pkg)s

source: Validating %(pkg)s
de: Überprüfe %(pkg)s

source: Extracting %(pkg)s
de: Entpacke %(pkg)s

source: Unpacking %(pkg)s
de: Entpacke %(pkg)s

source: Configuring %(pkg)s
de: Konfiguriere %(pkg)s

source: Retrieving file %(current)s of %(total)s
de: Hole Datei %(current)s von %(total)s

source: Installing %(pkg)s
de: Installiere %(pkg)s

source: Preparing to configure %(pkg)s
de: Bereite %(pkg)s zur Konfiguration vor

source: Preparing %(pkg)s
de: Bereite %(pkg)s vor

source: Installed %(pkg)s
de: %(pkg)s wurde installiert

source: Running post-installation trigger %(pkg)s
de: Starte Post-Installation-Trigger %(pkg)s

source: Running %(pkg)s
de: Starte %(pkg)s

source: Preparing installation
de: Installation wird vorbereitet

source: This system has been configured to IP address %s
de: Dieses System wurde auf die IP-Adresse %s konfiguriert

source: This system has been configured for DHCP usage
de: Dieses System bezieht seine IP-Adresse über DHCP

source: and has not been joined to UCS domain yet.
de: und ist noch nicht der UCS-Domäne beigetreten.

source: and has been joined to UCS domain.
de: und ist der UCS-Domäne beigetreten.

source: press ENTER to reboot this system.
de: drücken Sie ENTER, um das System neu zu starten.

source: Administrative frontend:
de: Administrationsoberfläche:

source: Administrative account name: Administrator
de: Administratives Konto: Administrator

source: Additional information: http://www.univention.de/en/download/documentation/
de: Zusätzliche Informationen: http://www.univention.de/download/documentation/

source: Congratulations! The installation of %(name)s is currently running. Base information of local system: Hostname: %(hostname)s System role: %(systemrole)s IP address: %(address)s Please visit the following websites to learn more about %(name)s: - Quickstart Guide: http://wiki.univention.de/index.php?title=UCS_Quickstart/en - Manuals and further information: http://www.univention.de/en/download/documentation/ - Forum: http://forum.univention.de - Support & Knowledge Base: http://sdb.univention.de
de: Herzlichen Glückwunsch! Die Installation von %(name)s wurde gestartet. Basisinformationen des lokalen Systems: Rechnername: %(hostname)s Systemrolle: %(systemrole)s IP-Adresse: %(address)s Bitte besuchen Sie folgende Webseiten, um mehr über %(name)s zu erfahren: - Quickstart Guide: http://wiki.univention.de/index.php?title=UCS_Quickstart - Handbücher und weitere Informationen: http://www.univention.de/download/documentation/ - Forum: http://forum.univention.de - Support & Knowledge Base: http://sdb.univention.de

source: dynamic
de: dynamisch

source: Current joinscript:
de: Aktuelles Joinskript:

source: Installation complete
de: Installation abgeschlossen

source: Preparing reboot
de: Neustart wird vorbereitet

source: Select system language
de: Bitte wählen Sie die System-Sprache aus

source: (also applies to the installation process for supported languages):
de: (gilt auch für den Installer, sofern unterstützt):

source: Language Select the language for your system.
de: Sprache Wählen Sie eine Sprache für das System.

source: Language
de: Sprache

source: Searching CD-ROM Drive
de: Suche CD-ROM-Laufwerk

source: Please wait ...
de: Bitte warten ...

source: Testing CD-ROM Drive
de: Teste CD-ROM-Laufwerk

source: Mounting CD-ROM Drive
de: Binde CD-ROM-Laufwerk ein

source: No valid source found
de: Keine gültige Quelle gefunden

source: Check devices for UCS CD:
de: Suche nach UCS-Medium

source: F2-Add
de: F2-Neu

source: F3-Add
de: F3-Neu

source: F4-Rescan
de: F4-Suchen

source: CD-ROM Device
de: CD-ROM-Laufwerk

source: Network Device
de: Neue Netzquelle

source: Mounting Network Device %s
de: Binde Netzlaufwerk %s ein

source: Mounting CD-ROM Drive %s
de: Binde CD-ROM-Laufwerk %s ein

source: Detects the source device. Please select "Add CD-ROM device" or "Add network device" if the needed device is missing. Please use "Rescan" if you want to autodetect devices again.
de: Erkennt das Laufwerk mit dem Installationsmedium. Bitte wählen Sie "CD-ROM-Laufwerk" hinzufügen oder "Netzquelle hinzufügen" wenn die richtige Quelle nicht erkannt wurde. Bitte benutzen Sie "Suchen" wenn der Installer nochmal die Laufwerke durchsuchen soll.

source: Source device
de: Quellmedium

source: Cancel
de: Abbrechen

source: Add CD-ROM device
de: CD-ROM-Laufwerk

source: Path
de: Pfad

source: Adding network device
de: Netzwerklaufwerk hinzufügen

source: Please enter the password:
de: Bitte geben Sie das Passwort ein:

source: Wrong password
de: Falsches Passwort

source: Filename
de: Dateiname

source: Size
de: Größe

source: You have to select a Profile.
de: Sie müssen ein Profil auswählen.

source: Profile Select a predefined installation profile or enter the position of your own profile. Please mark the device with the preconfigured profile. Press F2 to add a missing device or F3 to browse for the correct path.
de: Profil Wählen Sie eines der vorkonfigurierten Installationsprofile oder geben Sie den Pfad Ihres eigenen Profils an. Bitte markieren Sie das Laufwerk mit dem vorkonfigurierten Profil. Drücken Sie F2, um einen fehlendes Laufwerk, oder F3, um den richtigen Pfad zu ergänzen.

source: Profile
de: Profil

source: Loading Modules
de: Lade Module

source: Initialize USB Devices
de: USB-Geräte initialisieren

source: Please wait...
de: Bitte warten...

source: Select a time zone:
de: Wählen Sie eine Zeitzone:

source: Show all available timezones
de: Alle verfügbaren Zeitzonen anzeigen

source: Time zone Select the time zone your system is located in.
de: Zeitzone Bitte wählen Sie die passende Zeitzone für Ihr System aus.

source: Time zone
de: Zeitzone

source: Select your keyboard layout:
de: Bitte wählen Sie die Tastaturbelegung:

source: Show all available keyboard layouts
de: Alle verfügbaren Tastaturlayouts anzeigen

source: Keyboard layout Select your keyboard layout.
de: Tastaturbelegung Wählen Sie die passende Tastaturbelegung für Ihre Tastatur.

source: Keyboard
de: Tastatur

source: Select the system role:
de: Auswahl der zu installierenden Systemrolle:

source: Further information for selected system role:
de: Weitere Informationen über die ausgewählte Systemrolle:

source: Join scripts will be called during installation.
de: Die Joinskripte werden während der Installation ausgeführt.

source: Join scripts will not be called during installation.
de: Die Joinskripte werden während der Installation nicht ausgeführt.

source: The domain controller master (DC master for short) contains the original dataset for the entire LDAP directory. Changes to the LDAP directory are only performed on this server. For this reason, this must be the first system to be commissioned and there can only be one of them within a domain. In addition, the Root Certification Authority (root CA) is also on the DC master. All SSL certificates created are archived on the DC master.
de: Auf dem Domänencontroller Master (kurz DC Master) befindet sich der Originaldatenbestand des gesamten LDAP-Verzeichnisses. Änderungen im LDAP-Verzeichnis werden nur auf diesem Server vorgenommen. Deswegen muss dieser als erstes System in Betrieb genommen werden und kann innerhalb einer Domäne nur einmal existieren. Außerdem befindet sich die Root Certification Authority (Root-CA) auf dem DC Master. Alle ausgestellten SSL-Zertifikate werden auf dem DC Master archiviert.

source: Servers with the role of domain controller backup (DC backup for short) contain a replicated copy of the entire LDAP directory, which cannot be changed as all write accesses occur exclusively on the DC master. A copy of all SSL certificates including the private key of the root CA is kept on the DC backup. The DC backup is as such a backup copy of the DC master. If the DC master should collapse completely, running a special command allows the DC backup to take over the role of the DC master permanently in a very short time.
de: Auf Servern mit der Rolle Domänencontroller Backup (kurz DC Backup) befindet sich eine replizierte Kopie des gesamten LDAP-Verzeichnisses, die nicht verändert werden kann, da alle Schreibzugriffe grundsätzlich am DC Master durchgeführt werden. Ausserdem wird eine Kopie aller SSL-Zertifikate einschließlich des privaten Schlüssels der Root-CA auf dem DC Backup vorgehalten. Der DC Backup dient somit als Sicherheitskopie des DC Master. Sollte der DC Master dauerhaft ausfallen, kann ein DC Backup innerhalb kürzester Zeit durch Aufruf eines Befehls die Rolle des DC Master dauerhaft übernehmen. Dies ist nur notwendig, wenn Änderungen am LDAP-Verzeichnis vorgenommen oder neue Zertifikate ausgestellt werden sollen, weil diese Aufgaben nur von einem DC Master durchgeführt werden können.

source: Each domain controller slave (DC slave for short) contains a replicated copy of the entire LDAP directory, which cannot be changed as all write accesses occur on the DC master. The copy can either contain the entire directory or be limited to the files required by a location through selective replication. The DC slave only stores a copy of its own and the public SSL certificate of the root CA. A DC slave system cannot be promoted to a DC master.
de: Auf einem Domänencontroller Slave (kurz DC Slave) befindet sich eine replizierte Kopie des LDAP-Verzeichnisses, die nicht verändert werden kann, da alle Schreibzugriffe am DC Master durchgeführt werden. Die Kopie kann das gesamte Verzeichnis umfassen oder durch selektive Replikation auf an einem Standort benötigte Daten eingeschränkt werden. Auf einem DC Slave wird nur das eigene und das öffentliche SSL-Zertifikat der Root-CA vorgehalten. Ein DC Slave-System kann nicht zum DC Master hochgestuft werden.

source: Member servers are members of a LDAP domain and offer services such as file storage for the domain. Member servers do not contain a copy of the LDAP directory. It only stores a copy of its own and the public SSL certificate of the root CA.
de: Member-Server sind Mitglieder einer LDAP-Domäne und bieten Dienste wie z.B. Datenspeicherung für die Domäne an. Auf einem Member-Server befindet sich keine Kopie des LDAP-Verzeichnisses. Auf ihm wird nur das eigene und das öffentliche SSL-Zertifikat der Root-CA vorgehalten.

source: A base system is an independent system. It is not a member of a domain and does not offer any web based management functions. A base system is thus suitable for services which are operated outside of the trust context of the domain, such as a web server or a firewall. It is possible to configure DNS and DHCP settings for base systems via the Univention management system as long as the base system is entered as an IP managed client in the directory service.
de: Ein Basissystem ist ein eigenständiges System. Es ist nicht Mitglied einer Domäne und bietet keine Web-basierten Managementfunktionen. Ein Basissystem bietet sich somit für Dienste an, die außerhalb des Vertrauenskontextes der Domäne betrieben werden, etwa als Web-Server oder Firewall. Es können DNS- und DHCP-Einstellungen für Basissysteme über das Univention Management System vorgenommen werden, sofern das betreffende Basissystem als IP-Managed-Client im Verzeichnisdienst eingetragen wurde.

source: A base system does not offer any web-based domain management functions and will not be able to be a domain member. A base system should only be used in some rare use cases, for example as firewall system. This warning is shown only once, the installation can be continued as base system.
de: Ein Basissystem bietet keine Web-basierten Managementfunktionen an und kann auch nicht Mitglied einer Domäne werden. Für ein Basissystem existieren nur wenige Anwendungsfälle, beispielsweise als Firewall-System. Diese Warnung wird nur einmal angezeigt. Die Installation kann als Basissystem fortgesetzt werden.

source: System role Select a system role. Depending on the system role different components will be installed. Master domain controller: This system keeps the whole LDAP tree and is the core of your UCS domain. Backup domain controller: This system keeps a copy of the complete LDAP structure, which cannot be changed manually. Slave domain controller: This system includes required LDAP data for a special purpose (i.e. location based). Member server: Member of a domain offering specified domainwide services like printing or backup. No LDAP data is stored on such a system. Base system: A stand-alone server solution for web-server or firewall for example. This system is not a member of any domain.
de: Systemrolle Wählen Sie eine Systemrolle für Ihr System. Verschiedene Komponenten werden installiert. Domain Controller Master: Dieses System verwaltet alle LDAP Verzeichnisse. Sollten Änderungen daran vorgenommen werden, werden diese nur auf dem Master geschrieben. Alle Zertifikate werden hier gespeichert. Domain Controller Backup: Dieses System verwaltet eine Kopie aller LDAP Verzeichnisse und Zertifikate. Diese Kopie kann nicht manuell geändert werden. Domain Controller Slave: Dieses System verwaltet nur einen bestimmten Teil der LDAP Struktur die für seine Umgebung nützlich ist (Zweigstellen). Memberserver: Dieses System bietet bestimmte Dienste z.B. Datensicherung für die Domäne an. Es werden keine LDAP Daten auf einem Memberserver gespeichert. Basissystem: Eine Stand-alone Server Lösung für Web Server oder Firewalls. Dieses System ist nicht Mitglied der Domäne und kann nicht über das UCS Managementsystem verwaltet werden.

source: System role
de: Systemrolle

source: The graphical configuration frontend could not be started! To continue the reconfiguration of this system, a web browser is required. You can access the configuration frontend by opening the following URL: http://<ip address of this system>/umc/ After logging in as user "root", select the module "System Setup". The network settings (IP address) can be configured on next screen (press F12). To log in, the root password is required. If the password is unknown or should be changed, enter a new one below. Hint: The network settings have to be confirmed before the system boot process will continue/the configuration frontend will be available.
de: Die graphische Oberfläche konnte nicht gestartet werden. Um die Konfiguration des Systems abzuschließen, wird ein Webbrowser benötigt. Die Konfigurationsoberfläche kann im Webbrowser über folgende URL erreicht werden: http://<IP-Adresse dieses Systems>/umc/ Nach dem Login als Benutzer "root", ist das Modul "System Setup" auszuwählen. Die Netzwerkeinstellungen (IP-Adresse) können auf dem nächsten Bildschirm angepasst werden (weiter mit F12). Um sich in der Konfigurationsoberfläche einzuloggen, wird das root-Passwort benötigt. Ist dieses unbekannt oder soll geändert werden, kann unten ein neues angegeben werden. Hinweis: Die Netzwerkeinstellungen müssen bestätigt werden, bevor der Bootvorgang fortgeführt und die Konfigurationsoberfläche erreichbar wird.

source: Currently no graphical frontend has been installed! To continue the reconfiguration of this system, a web browser is required. You can access the configuration frontend by opening the following URL: http://<ip address of this system>/umc/ After logging in as user "root", select the module "System Setup". The network settings (IP address) can be configured on next screen (press F12). To log in, the root password is required. If the password is unknown or should be changed, enter a new one below. Hint: The network settings have to be confirmed before the system boot process will continue/the configuration frontend will be available.
de: Es wurde keine graphische Oberfläche installiert! Um die Konfiguration des Systems abzuschließen, wird ein Webbrowser benötigt. Die Konfigurationsoberfläche kann im Webbrowser über folgende URL erreicht werden: http://<IP-Adresse dieses Systems>/umc/ Nach dem Login als Benutzer "root", ist das Modul "System Setup" auszuwählen. Die Netzwerkeinstellungen (IP-Adresse) können auf dem nächsten Bildschirm angepasst werden (weiter mit F12). Um sich im Konfigurationsoberfläche einzuloggen, wird das root-Passwort benötigt. Ist dieses unbekannt oder soll geändert werden, kann unten ein neues angegeben werden. Hinweis: Die Netzwerkeinstellungen müssen bestätigt werden, bevor der Bootvorgang fortgeführt und die Konfigurationsoberfläche erreichbar wird.

source: Root password:
de: Root-Passwort:

source: Root password (retype):
de: Passwort (zur Bestätigung bitte nochmal eingeben):

source: Please enter a Password.
de: Bitte geben Sie ein Passwort an.

source: Please retype the Password.
de: Bitte geben Sie das Passwort nochmal an.

source: Passwords do not match.
de: Passwörter stimmen nicht überein.

source: Your password is too short. For security reasons, your password must contain at least 8 characters.
de: Ihr Passwort ist zu kurz. Aus Sicherheitsgründen sollte Ihr Passwort mindestens 8 Zeichen lang sein.

source: Illegal password: A password may only contain ascii characters.
de: Ungültiges Passwort: Nur ASCII Zeichen sind erlaubt.

source: Illegal password: A password may not contain blanks.
de: Ungültiges Passwort: Leerzeichen nicht möglich

source: Illegal password: A password may not contain back slashes.
de: Ungültiges Passwort: Leerzeichen nicht möglich

source: Illegal password: A password may not contain quotation marks.
de: Ungültiges Passwort: Anführungszeichen nicht möglich
