Repository: univention/univention-corporate-server
Catalog: */univention-installer/installer/locale/*/LC_MESSAGES/installer.po
Languages: de

source: Boot loader Select where you want the GRUB boot loader to be installed.
de: Bootloader Wählen Sie wo der GRUB-Bootloader installiert werden soll.

source: Following value is invalid:
de: Die folgende Eingabe ist ungültig:

source: Domain DNS Server
de: Domänen-DNS-Server

source: External DNS Server
de: Externer DNS-Server

source: Proxy, example http://10.201.1.1:8080
de: Proxy, z.B. http://10.201.1.1:8080

source: You have to configure one or more network interfaces.
de: Es muss mindestens ein Netzwerk-Interface konfiguriert werden.

source: Settings for interface "%s"
de: Einstellungen für Interface "%s"

source: MAC address: %s
de: MAC-Adresse: %s

source: Enable IPv4
de: IPv4 aktivieren

source: Dynamic (DHCP)
de: Dynamisch (DHCP)

source: IPv4 address
de: IPv4-Adresse

source: Netmask
de: Netzmaske

source: Enable IPv6
de: IPv6 aktivieren

source: Dynamic (Stateless address autoconfiguration (SLAAC))
de: Dynamisch (zustandslose Adressenautokonfiguration (SLAAC))

source: IPv6 address
de: IPv6-Adresse

source: F2-Previous Interface
de: F2-Vorheriges Interface

source: F3-Next Interface
de: F3-Nächstes Interface

source: Global Network Settings
de: Globale Netzwerk-Einstellungen

source: More
de: Mehr

source: Currently no network card could be detected. Depending on the selected services and system role an operative network card is required to successfully complete the installation. Please check the network card of the computer. If a network card is installed, try to load additional kernel modules manually. If the installation will be continued without operative network card, a virtual dummy network card will be loaded automatically to complete installation.
de: Es konnte zum aktuellen Zeitpunkt keine Netzwerkkarte gefunden werden. Abhängig von den ausgewählten Diensten und der Systemrolle kann es zu Fehlern bei der Installation kommen. Prüfen Sie die Netzwerkkarte dieses Systems. Falls eine Netzwerkkarte installiert ist, sollte versucht werden, manuell Kerneltreiber nachzuladen. Wird die Installation ohne funktionierende Netzwerkkarte fortgesetzt, wird automatisch eine virtuelle Netzwerkkarte geladen, um die Installation erfolgreich beenden zu können.

source: DHCP Query
de: DHCP Anfrage

source: No DHCP answer, please check DHCP server and network connectivity.
de: Keine DHCP-Antwort, bitte DHCP-Server und Netzwerkverbindung überprüfen.

source: An invalid value has been entered for interface %(interface)s: %(elemname)s
de: Ein ungültiger Wert wurde für Interface %(interface)s angegeben: %(elemname)s

source: At least one interface must be configured.
de: Es muss mindestens ein Interface konfiguriert werden.

source: IPv4 Address
de: IPv4-Adresse

source: IPv4 Netmask
de: IPv4-Netzmaske

source: Neither DHCP is activated nor an IPv4 address with netmask has been entered for interface "%s".
de: Es wurde weder DHCP aktiviert noch wurde eine gültige IPv4-Adresse inkl. Netzmaske für Interface "%s" angegeben.

source: IPv6 Address
de: IPv6-Adresse

source: Neither SLAAC is activated nor an IPv6 address with prefix has been entered for interface "%s".
de: Es wurde weder SLAAC aktiviert noch wurde eine gültige IPv6-Adresse inkl. Prefix für Interface "%s" angegeben.

source: The given IPv6 address "%(addr)s" of interface "%(interface)s" is not a global unicast address (2000::/3) and not a unique local unicast address (fc00::/7). This warning is shown only once for each address. The installation can be continued but might fail.
de: Die angegebene IPv6-Adresse "%(addr)s" für Interface "%(interface)s" ist keine globale Unicast-Adresse (2000::/3) und keine Unique-Local-Unicast-Adresse (fc00::/7). Diese Warnung wird nur einmal für jede IP-Adresse angezeigt. Die Installation kann fortgesetzt werden, kann aber fehlschlagen.

source: In IPv6-only environments at least one static IPv6 address has to be defined!
de: In Nur-IPv6-Umgebungen muss mindestens eine statische IPv6-Adresse vergeben werden!

source: Setting up network
de: Richte Netzwerk ein

source: Network In this module the network configuration is done. In the upper part, all detected interfaces are show. By pressing F2 or F3 the next/previous interface can be selected. For each interface an IPv4 address with netmask and/or IPv6 address with prefix can be entered. The configuration of interfaces can also be done automatically: Dynamic (DHCP): Mark this field if you want this interface to retrieve its IPv4 configuration via DHCP (Dynamic Host Configuration Protocol). Dynamic (Stateless address autoconfiguration (SLAAC)): Mark this field if you want this interface to retrieve its IPv6 configuration via ND (IPv6 neighbour discovery) IPv4 Gateway: Default gateway to be used for IPv4 traffic. IPv6 Gateway: Default gateway to be used for IPv6 traffic. Domain DNS server: Enter the IP address of the primary name server, if you are adding a system to an existing UCS domain. More: Enter additional name servers External DNS server: Enter the IP address of a DNS server to forward queries to. More: Enter additional DNS forwarders HTTP-Proxy: Enter IP address and port number of HTTP-Proxy to be used (example: http://192.168.1.123:5858)
de: Netzwerk In diesem Modul wird die Netzwerk-Interfaces konfiguriert. Im oberen teil werden alle erkannten Interfaces angezeigt. Mit den Tasten F2 und F3 kann zum nächsten/vorherigen Interface gewechselt werden. Für jedes Interface kann eine IPv4-Adresse inkl. Netzmaske und/oder eine IPv6-Adresse inkl. Prefix angegeben werden. Die Konfiguration der Interfaces kann auch automatisch durchgeführt werden: Dynamisch (DHCP): Bitte markieren Sie dieses Feld, wenn die IPv4-Konfiguration via DHCP (Dynamic Host Configuration Protocol) zugeteilt werden soll. Dynamisch (zustandslose Adressenautokonfiguration (SLAAC)): Bitte markieren Sie dieses Feld, wenn die IPv6-Konfiguration via ND (IPv6 Neighbour Discovery) zugeteilt werden soll. Bitte geben Sie IP-Adresse, Netzmaske, Broadcast und das Netzwerk an, wenn Sie sich für die statische IP-Adresse entschieden haben. IPv4-Gateway: Das Defaultgateway, welches für IPv4-Traffic verwendet werden soll. IPv6-Gateway: Das Defaultgateway, welches für IPv6-Traffic verwendet werden soll. Domänen-DNS-Server: Geben Sie die IP-Adresse für den primären Nameserver an, falls Sie ein neues System in eine bestehende UCS-Domäne installieren möchten. Mehr: Geben Sie weitere IP-Adressen an, wenn Ihr System mehrere Nameserver nutzen soll. Externer DNS-Server: Geben Sie die IP-Adresse für einen DNS-Forwarder an. Mehr: Wenn das System mehrere DNS-Forwarder nutzen soll, geben Sie weitere IP-Adressen an. HTTP-Proxy: Geben Sie die Transportadresse (IP-Adresse:Port) an, um einen HTTP-Proxy zu nutzen. z.B: http://192.168.1.123:3128

source: Network
de: Netzwerk

source: More Domain DNS Servers
de: Weitere Domänen-DNS-Server

source: More External DNS Servers
de: Weitere externe DNS-Server

source: The following value is missing:
de: Der folgende Wert fehlt:

source: The following value is invalid:
de: Die folgende Eingabe ist ungültig:

source: Start join at the end of installation.
de: Starte den Join-Vorgang am Ende der Installation

source: Search Domain controller Master in DNS
de: DNS nach Domain Controller Master durchsuchen

source: Hostname of Domain controller Master
de: Systemname des Domain Controller Master

source: Password for Join
de: Join-Passwort

source: Testing join settings
de: Teste Join-Einstellungen

source: The name/ip of the UCS DC master can not be resolved! Please check dns settings.
de: Der Name bzw. die IP-Adresse des UCS DC Master konnte nicht ermittelt werden! Bitte prüfen Sie die DNS Einstellungen

source: The UCS DC master is not reachable! Please check network settings.
de: Der UCS DC Master ist nicht erreichbar! Bitte prüfen Sie die Netzwerk-Einstellungen

source: The login with the specified join account and password on the UCS DC master failed! Please check join settings.
de: Die Anmeldung mit dem angegebenen Join-Account und dem Passwort auf dem UCS DC Master ist fehlgeschlagen! Bitte prüfen Sie die Join-Einstellungen.

source: Connection to the UCS DC master failed! Please check network and join settings.
de: Verbindung zum UCS DC Master konnte nicht aufgebaut werden! Bitte prüfen Sie die Netzwerk- und Join-Einstellungen!

source: Join settings All settings to join this system into given domain.
de: Join-Einstellungen Alle Optionen die zum Joinen in eine vorkonfigurierte Domäne benötigt werden.

source: Join settings
de: Join-Einstellungen

source: Preparing package list
de: Bereite Paketliste vor

source: Please select the software components you want to install:
de: Bitte wählen Sie die zu installierenden Softwarekomponenten aus:

source: Software conflict! It is not allowed to install the software packages %s and %s on one system. Please select only one of these two component.
de: Software Konflikt! Es ist nicht erlaubt die Software-Pakete %s und %s auf einem System zu installieren. Bitte wählen Sie nur eine der beiden Komponenten aus.

source: The software package %s was selected. It is not possible to mix NT and Active Directory compatible domaincontroller. Make sure the existing UCS domain is NT-compatible (Samba 3). This warning is shown only once. The installation can be continued with this selection.
de: Das Software-Paket %s wurde ausgewählt. Es ist nicht möglich NT- und Active Directory kompatible Domänencontroller zu mischen. Bitte stellen Sie sicher, dass die UCS-Domäne NT-kompatibel ist (Samba 3). Diese Warnung wird nur einmal angezeigt. Die Installation kann mit dieser Auswahl fortgesetzt werden.

source: The software package %s was selected. It is not possible to mix NT and Active Directory compatible domaincontroller. Make sure the existing UCS domain is Active Directory-compatible (Samba 4). This warning is shown only once. The installation can be continued with this selection.
de: Das Software-Paket %s wurde ausgewählt. Es ist nicht möglich NT- und Active Directory kompatible Domänencontroller zu mischen. Bitte stellen Sie sicher, dass die UCS-Domäne Active Directory-kompatibel ist (Samba 4). Diese Warnung wird nur einmal angezeigt. Die Installation kann mit dieser Auswahl fortgesetzt werden.

source: Software Select the software components you want to install. You can change details for some modules in the following steps.
de: Software Bitte wählen Sie die Softwarekomponenten die Sie installieren möchten. Sie können in den folgenden Schritten die Details für manche Module ändern.

source: This is the last step of the interactive installation. Please check all settings carefully. During the next phase software packages will be installed and (pre-)configured.
de: Dies ist der letzte Schritt der interaktiven Installation. Alle Einstellungen sollten nochmals geprüft werden. Im nächsten Schritt werden die Software-Pakete installiert und konfiguriert.

source: Hostname
de: Systemname

source: Domain name
de: Domänenname

source: Settings of interface eth0:
de: Einstellungen für Interface eth0:

source: configuration via DHCP
de: Konfiguration über DHCP

source: IPv4 netmask
de: IPv4-Netzmaske

source: configuration via SLAAC
de: Konfiguration über SLAAC

source: Update system after installation
de: System nach der Installation aktualisieren

source: Overview Installation settings
de: Überblick Installationseinstellungen

source: Overview
de: Überblick

source: Preparing target device
de: Zielgerät wird vorbereitet

source: Mounting source device
de: Einbinden des Quelllaufwerks

source: Mounting target devices
de: Einbinden des Ziellaufwerks

source: Installing basesystem
de: Installation des Basissystems

source: Configuring basesystem
de: Konfiguration des Basissystems

source: Installing Univention base packages
de: Installiere Univention-Basis-Pakete

source: Configuring Univention base packages
de: Konfiguriere Univention-Basis-Pakete

source: Calling preinstallation hooks
de: Ausführen der Pre-Installation-Hooks

source: Installing kernel and bootloader
de: Installiere Kernel und Bootloader

source: Installing selected software components
de: Installiere ausgewählte Softwarekomponenten

source: Configuring XEN
de: Konfiguriere XEN

source: Joining system into domain
de: Beitritt des Systems in die Domäne

source: Configuring online repository
de: Einbinden des Online-Repositorys

source: Updating udev rules
de: Aktualisierung der udev-Regeln

source: Calling postinstallation hooks
de: Ausführen der Post-Installations-Hooks

source: Generating locales
de: Generierung der Sprachdateien

source: Setting hardware clock
de: Setzen der Systemuhr

source: Performing system test
de: Teste installiertes System

source: Updating system
de: Aktualisiere das System

source: This might take a while depending on the number of pending updates.
de: Abhängig von der Anzahl der austehenden Updates, kann dies einige Zeit dauern.

source: Performing cleanup
de: Ausführen von Aufräumarbeiten
