Repository: univention/univention-corporate-server
Catalog: */univention-installer/installer/locale/*/LC_MESSAGES/installer.po
Languages: de

source: Password Changing default root password into a custom one.
de: Passwort In diesem Modul kann das root-Passwort geändert werden.

source: Password
de: Passwort

source: Fully qualified domain name (e.g. host.example.com):
de: Vollständiger Rechnername (z.B. host.example.com):

source: LDAP base:
de: LDAP-Basis

source: Windows domain name:
de: Windows-Domäne:

source: The hostname may not start with digits.
de: Der Rechnername darf nicht mit Ziffern beginnen.

source: A valid netbios name can not be longer than 13 characters. If samba is installed, the hostname should be shortened.
de: Ein gültiger NetBIOS Name darf nicht länger als 13 Zeichen sein. Wenn Samba installiert wird, sollte der Rechnername gekürzt werden

source: The length of fully qualified domain name is greater than 63 characters.
de: Die Länge von System und Domänennamen ist größer als 63 Zeichen.

source: Please enter a valid fully qualified domain name in lowercase (e.g. host.example.com).
de: Bitte geben Sie einen klein-geschriebenen und vollständigen Rechnernamen an (z.B. host.example.com).

source: For Active Directory domains the fully qualified domain name must have at least two dots (e.g. host.example.com). This warning is shown only once, the installation can be continued with the name currently given.
de: Für Active Directory Domänen muss der vollständige Domänenname mindestens zwei Punkte enthalten (z.B. host.example.com). Dies ist eine einmalige Warnung, die Installation kann mit dem aktuell gewählten Namen fortgesetzt werden.

source: Hostname is equal to domain name.
de: Systemname ist gleich Domänennamen.

source: Please enter the LDAP base.
de: Bitte geben Sie die LDAP-Basis an.

source: Syntax-Error. Please enter a LDAP base according to this format: dc=test,dc=net
de: Syntax-Fehler. Bitte geben Sie die LDAP-Basis wie folgt an: dc=test,dc=net

source: The length of the windows domain name is greater than 14 characters.
de: Die Länge des Windows-Domänennamens ist größer als 14 Zeichen.

source: Periods are not allowed in windows domain names.
de: Punkte sind im Namen der Windows-Domäne nicht erlaubt.

source: The windows domain and the domain name may not be the same.
de: Der Windows-Domänenname und der DNS-Domänennamen dürfen nicht gleich sein.

source: Please enter a valid windows domain name.
de: Bitte geben Sie einen gültigen Windows-Domänennamen an.

source: For Active Directory domains the hostname and the windows domain name may not be the same. This warning is shown only once, the installation can be continued with the name currently given.
de: In Active Directory Domänen dürfen der Rechnername und der Name der Windows-Domäne nicht gleich sein. Dies ist eine einmalige Warnung, die Installation kann mit dem aktuell gewählten Namen fortgesetzt werden.

source: Settings Configuration of basic system settings like hostname, domain name and LDAP base and root password.
de: Optionen Konfiguration grundlegender Einstellungen wie Hostname, Domänenname, LDAP-Basis und Root-Passwort.

source: Settings
de: Optionen

source: Univention Installer has been started with the
de: Der Univention Installer wurde mit der expert

source: expert partitioning option. The hard disk has to be
de: partitioning Option gestartet. Die Festplatte muss manuell

source: partitioned and formatted manually.
de: partitioniert und formatiert werden.

source: By pressing
de: Durch das Drücken von

source: an interactive shell will be started, which allows you
de: wird eine interaktive Shell gestartet. Hier kann unter

source: to partition your hard disks using the standard
de: Verwendung von Standardprogrammen wie cfdisk, mdadm,

source: tools like cfdisk, mkfs.ext3, mdadm or lvcreate.
de: mkfs.ext3 usw. die Festplatte eingerichtet werden.

source: the installation will be continued.
de: kann die Installation fortgesetzt werden.

source: Partitioning (expert mode): CTRL+ALT+F2 interactive shell CTRL+ALT+F1 installation screen
de: Partitionierung (Expertenmodus): CTRL+ALT+F2 interaktive Shell CTRL+ALT+F1 Installationsbildschirm

source: Partitioning
de: Partitionierung

source: Reading LVM config
de: Suche LVM-Geräte

source: Not enough space for autopartitioning: sum of disk sizes=%(disksizeall)s required=%(required)s
de: Nicht genügend Platz für Autopartitionierung: vorhanden=%(disksizeall)s benötigt=%(required)s

source: cannot autopart disk: /boot or swap does not fit on harddisk (required=%s)
de: Autopart. nicht möglich: /boot oder swap passen nicht auf Festplatte (benötigt=%s)

source: Double mount point '%s'
de: Doppelter Mount-Point '%s'

source: One partition must be flagged as bootable. This should usually be /boot.
de: Eine Partition muss als bootbar markiert sein. Dies sollte üblicherweise bei /boot der Fall sein.

source: Missing '/' as mount point
de: Fehlender '/' als Mount-Point

source: Wrong file system type '%s' for mount point '/'
de: Falsches Dateisystem '%s' für '/'

source: Wrong file system type '%s' for mount point '/boot'
de: Falsches Dateisystem '%s' für '/boot'

source: Unable to create bootable config!
de: Erstellung bootbarer Konfiguration fehlgeschlagen!

source: /-partition is located on LVM and
de: /-Partition liegt auf einem LVM und

source: /boot-partition is missing or located
de: die /boot-Partition fehlt oder ist auch

source: on LVM too.
de: auf einem LVM.

source: Unbootable config! /boot needs non LVM partition
de: Erstellung bootbarer Konfiguration fehlgeschlagen! /boot darf nicht auf einer LVM Partition liegen.

source: Unbootable config! / on btrfs needs /boot-partition with other than btrfs!
de: Erstellung bootbarer Konfiguration fehlgeschlagen! /boot darf nicht auf einer btrfs Partition liegen.

source: Deleting LVM volumes
de: Lösche LVM-Geräte

source: Deleting partitions
de: Lösche Partitionen

source: Creating partitions
de: Lösche Partitionen

source: Creating LVM volumes
de: Erstelle LVM-Geräte

source: Formatting partitions
de: Formatiere Partitionen

source: Include USB storage devices while auto partitioning?
de: USB-Geräte während der Auto-Partitionierung verwenden?

source: WARNING: Choosing "yes" prepares for deletion of all
de: WARNUNG: "Ja" bereitet das Löschen aller Partitionen auf

source: partitions on all disks! This includes USB harddisks
de: allen Festplatten vor! Das beinhaltet auch USB-Festplatten

source: and USB sticks. In any case *ALL* LVM LV and LVM VG
de: und USB-Sticks. Es werden alle LVM LV und LVM VG

source: will be deleted!
de: gelöscht!

source: Not enough disk space found for /boot!
de: Nicht genug Speicherplatz für /boot!

source: Auto partitioning aborted.
de: Automatische Partitionierung abgebrochen.

source: Not enough disk space found!
de: Nicht genügend Speicherplatz vorhanden!

source: WARNING: No devices or valid partitions found!
de: WARNUNG: Es konnten keine Festplatten oder validen Partitionen

source: Please check your harddrive or partitioning.
de: gefunden werden! Bitte überprüfen Sie die Festplatte oder

source: Further information can be found in the
de: Partitionierung. Weitere Informationen finden Sie in der

source: No valid partition table found on device %s.
de: Keine gültige Partitionstabelle auf Gerät %s vorhanden.

source: Install empty MBR to device %s ?
de: Einen leeren MBR auf das Gerät %s schreiben?

source: WARNING: By choosing "Write MBR" existing data
de: WARNUNG: Durch Auswahl von "MBR schreiben" gehen vorhandene

source: on device %s will be lost.
de: Daten auf dem Gerät %s verloren.

source: Write MBR
de: MBR schreiben

source: Ignore Device
de: Gerät ignorieren

source: A GUID partition table (GPT) has been found on device %s.
de: Eine GUID Partition Table (GPT) wurde auf Gerät %s gefunden.

source: GPT devices are not supported by the interactive installation.
de: Geräte mit GPT werden von der interaktiven Installation nicht

source: You can proceed by ignoring this device or by removing
de: unterstützt. Es kann fortgefahren werden, indem das Gerät ignoriert

source: the existing GPT and writing an empty MBR.
de: wird oder durch das Entfernen der GPT und Schreiben eines MBR.

source: HINT: Further information for an installation
de: HINWEIS: Weitere Informationen zur Installation

source: on a device with GPT can be found in the
de: auf Geräten mit GPT finden Sie in der

source: Write an empty MBR to device %s ?
de: Leeren MBR auf Gerät %s schreiben?

source: Detecting LVM devices
de: Suche LVM-Geräte

source: WARNING: not enough free space for auto partitioning!
de: WARNUNG: Nicht genug Platz für Autopartitionierung!

source: Auto partitioning has been disabled!
de: Automatische Partitionierung wurde deaktiviert!

source: Do you want to use auto-partitioning?
de: Soll die automatische Partitionierung verwendet werden?

source: partitions on all disks! If auto-partition result is
de: allen Festplatten vor! Wenn der Vorschlag der Auto-Partitionierung

source: unsuitable press F5 to restart partitioning.
de: unpassend ist, drücken Sie F5, um alle Änderungen zu verwerfen.

source: LVM1 volumes detected. To use LVM1 volumes all
de: LVM1-Medium gefunden. Um LVM1-Medien zu nutzen

source: existing LVM1 snapshots have to be removed!
de: müssen alle LVM1-Snapshots gelöscht werden!

source: Otherwise kernel is unable to mount them!
de: Anderenfalls kann der Kernel sie nicht einbinden!

source: No LVM volume group found on current system.
de: Keine LVM-Gruppe gefunden.

source: Do you want to use LVM2?
de: Möchten Sie LVM2 verwenden?

source: Partitioning dialog
de: Partitionierung

source: Device
de: Gerät

source: Area(MB)
de: Bereich(MB)

source: Type
de: Typ

source: Size(MB)
de: Größe(MB)

source: diskdrive
de: Festplatte

source: (unassigned)
de: (nicht zugewiesen)

source: unusable
de: unbenutzbar

source: free
de: frei

source: unknown
de: unbekannt

source: LVM volume group
de: LVM-Medien-Gruppe

source: This module is used for partitioning the existing hard drives. It is recommended to use at least two partitions - one for the root file system, and one for the swap area. Please note: If automatic partitioning has been selected, all the data stored on these hard drives will be lost during this process! Should the proposed partitioning be undesirable, it can be rejected by pressing the F5 function key.
de: In dieser Einstellungsmaske wird die Partitionierung der vorhandenen Festplatten vorgenommen. Es wird empfohlen, mindestens zwei Partitionen zu verwenden - eine für das Root-Dateisystem, eine für den Swap-Bereich. Achtung: Wurde die automatische Partitionierung gewählt, gehen auf diesen Festplatten alle Daten verloren! Sollte der Partitionierungsvorschlag unpassend sein, kann er durch die Funktionstaste F5 verworfen werden.

source: F2-Create
de: F2-Erstellen

source: F3-Edit
de: F3-Editieren

source: F4-Delete
de: F4-Löschen

source: F5-Reset changes
de: F5-Änderungen verwerfen

source: F6-Write partitions
de: F6-Änderungen schreiben

source: UCS-Partition-Tool This tool is designed for creating, editing and deleting partitions during the installation. Use "F2-Create" to add a new partition. Use "F3-Edit" to configure an already existing partition. Use "F4-Delete" to remove a partition. Use the "Reset changes" button to discard changes to the partition table. Use the "Write Partitions" button to create and/or format your partitions.
de: UCS-Partitionierung Dieses Tool ist für das Erstellen, Editieren und Löschen von Partitionen vor der UCS-Installation zuständig. Bitte wählen Sie "F2-Erstellen", um eine neue Partition hinzuzufügen. Bitte wählen Sie "F3-Editieren", um eine bestehende Partition zu verändern. Bitte wählen Sie "F4-Löschen", um eine Partition zu entfernen. Bitte benutzen Sie "Änderungen verwerfen", um alle Ihre bisherigen Einstellungen in diesem Fenster zurückzusetzen. Bitte benutzen Sie "Änderungen schreiben", um Ihre Einstellungen nun auf die Festplatte zu schreiben.

source: LVM physical volumes cannot be modified!
de: LVM Physikalische Medien können nicht verändert werden!

source: If necessary delete this partition.
de: Wenn es notwendig ist, sollte die Partition gelöscht werden.

source: Unable to remove physical volume from
de: Das Löschen des physikalischen Mediums der

source: volume group "%s"!
de: Medien-Gruppe "%s" ist fehlgeschlagen!

source: Physical volume contains physical extents in use!
de: Physikalisches Medium enthält verwendete Systemdaten!

source: Please use "pvmove" to move data to other
de: Bitte verschieben Sie die Daten mit "pvmove"

source: physical volumes.
de: auf ein anderes phys. Medium.

source: Writing partitions
de: Schreibe Partitionen

source: Error while writing partitions:
de: Fehler beim Anlegen der Partitionen:

source: Creating LVM Volumes
de: Erstelle LVM-Geräte

source: Error while creating LVM volumes:
de: Fehler beim Anlegen der LVM Volumes:

source: Creating file systems
de: Erstelle Dateisysteme

source: Error while creating file systems:
de: Fehler beim Anlegen der Dateisysteme:

source: Filesystem %s:
de: Dateisystem %s:

source: This is a highly experimental filesystem
de: Dies ist ein experimentelles Dateisystem

source: and should not be used in productive
de: und sollte nicht in produktiven

source: environments.
de: Umgebungen eingesetzt werden.

source: The selected file system takes no
de: Das gewählte Dateisystem ist nicht nutzbar,

source: effect, if format is not selected.
de: wenn formatieren nicht gewählt wurde.

source: Do you want to format this partition?
de: Wollen Sie diese Partition formatieren?

source: This partition is designated as root file system,
de: Diese Partition ist als Root-Dateisystem gekennzeichnet,

source: but "format" is not selected. This can cause
de: aber "Formatieren" wurde nicht ausgewählt. Dies

source: problems with preexisting data on disk!
de: kann zu Problemen mit existierende Daten führen!

source: effect, if "format" is not selected.
de: wenn "formatieren" nicht gewählt wurde.

source: Physical Diskdrive
de: Physikalisches Laufwerk

source: Device: %s
de: Gerät: %s

source: Size: %s
de: Größe: %s

source: Primary Partitions: %s
de: Primäre Partitionen: %s

source: primary
de: primär

source: Logical Partitions: %s
de: Logische Partitionen: %s

source: logical
de: logisch

source: Next
de: Weiter

source: New Partition:
de: Neue Partition

source: Size (MB):
de: Größe (MB)

source: File system
de: Dateisystem

source: bootable
de: bootbar

source: format
de: formatieren

source: Save
de: Speichern

source: Typ: primary
de: Typ: primär

source: Typ: logical
de: Typ: logisch

source: Size: %s MB
de: Größe: %s MB

source: Please enter volume name!
de: Geben Sie den Namen des Medium ein!

source: Logical volume name contains illegal characters!
de: Name des Logischen Mediums enthält nicht erlaubte Zeichen!

source: Logical volume name is already in use!
de: Der Name des logischen Mediums wird bereits verwendet!

source: Size contains non-digit characters!
de: Die Größenangabe enthält nicht nur Ziffern

source: Not enough free space on volume group!
de: Nicht ausreichend Platz in der Medien-Gruppe!

source: This volume is designated as root filesystem,
de: Dieses Medium ist als Root-Dateisystem gekennzeichnet,

source: New logical volume:
de: Neues Logisches Medium:

source: LVM Logical Volume: %s
de: LVM Logisches Medium: %s

source: The selected partition is the extended partition of this disc.
de: Diese Partition ist die erweiterte Partition dieser Festplatte.

source: The extended partition contains all logical partitions.
de: Diese Partition verwaltet alle logischen Partitionen.

source: Do you really want to delete all logical partitions?
de: Möchten Sie alle logischen Partitionen löschen?

source: Found over-sized extended partition.
de: Zu große erweiterte Partition gefunden

source: This program will resize them to free unused space
de: Die Größe wird angepasst um die Partitionstabelle zu korrigieren.

source: UCS Installer supports only one LVM volume group.
de: UCS Installer unterstützt nur eine LVM-Medien-Gruppe.

source: Please select volume group to use for installation.
de: Bitte wählen Sie die Medien-Gruppe für die Installation.

source: Volume Group:
de: Medien-Gruppe:

source: Do you really want to write all changes?
de: Wollen Sie wirklich alle Änderungen schreiben?

source: This may destroy all data on modified discs!
de: Dadurch können Daten vernichtet werden!

source: No disk detected!
de: Keine Festplatte erkannt!

source: Please try to load the suitable module and rescan!
de: Bitte versuchen Sie das passende Modul zu laden und es erneut vom Installer erkennen zu lassen!

source: Wrong file system type for mount point "/" !
de: Falsches Dateisystem für '/'

source: Please select another file system.
de: Bitte wählen Sie ein anderes Dateisystem.

source: Not enough space for autopartitioning: sum of disk sizes=%(first_disk_size)d MiB required=%(required)d MiB
de: Nicht genügend Platz für Autopartitionierung: vorhanden=%(first_disk_size)s MiB benötigt=%(required)s MiB

source: The extensible firmware interface (EFI) has been detected
de: Das Extensible Firmware Interface (EFI) wurde auf dem

source: on your system but no EFI system partition has been
de: System erkannt, aber es wurde keine EFI-System-Partition

source: defined. You may continue, but your installation may not
de: definiert. Fortfahren ist möglich, aber das installierte

source: be bootable.
de: System ist ggf. nicht bootbar.

source: This message is shown only once.
de: Dieser Hinweis wird nur einmalig angezeigt.

source: Create small EFI partition automatically?
de: EFI-Partition automatisch erstellen?

source: Create EFI partition
de: EFI-Partition erstellen

source: Ignore
de: Ignorieren

source: defined (min. 32MiB). You may continue, but your installation
de: definiert (mind. 32MiB). Ein Fortfahren ist möglich, aber das

source: may not be bootable.
de: installierte System ist ggf. nicht bootbar.

source: A BIOS boot partition is missing in your selected
de: Die gewünschte Parititionierung enthält keine

source: partition setup. Your installation may not be bootable
de: BIOS-Boot-Partition. Ein Fortfahren ist möglich, aber

source: without further modifications.
de: das installierte System ist ggf. nicht bootbar.

source: Create BIOS boot partition automatically?
de: BIOS-Boot-Partition automatisch erstellen?

source: Create partition
de: Partition erstellen

source: partition setup (min. 4MiB). Your installation may
de: BIOS-Boot-Partition (mind. 4MiB). Ein Fortfahren ist möglich,

source: not be bootable without further modifications.
de: aber das installierte System ist ggf. nicht bootbar.

source: At least one LVM volume group has been found. To use the
de: Es wurde mind. eine LVM-Gruppe gefunden. Um die automatische

source: auto partitioning, all attached disks have to be erased!
de: Partitionierung zu nutzen, müssen alle Festplatten gelöscht werden.

source: Continue with auto partitioning?
de: Mit der automatischen Partitionierung fortfahren?

source: unsuitable, press F5 afterwards to restart partitioning.
de: unpassend ist, drücken Sie F5, um alle Änderungen zu verwerfen.

source: Not enough disk space found for EFI system partition!
de: Nicht genug Speicherplatz für die EFI-System-Partition!

source: Not enough disk space found for BIOS boot partition!
de: Nicht genug Speicherplatz für die BIOS-Boot-Partition!

source: An error occurred while reading device %s:
de: Fehler beim Lesen des Geräts %s:

source: Install now an empty GPT to device %s ?
de: Jetzt eine leere GPT auf das Gerät %s schreiben?

source: WARNING: By choosing "Write GPT" existing data
de: WARNUNG: Durch Auswahl von "GPT schreiben" gehen vorhandene

source: Write GPT
de: GPT schreiben

source: A MBR has been found on device %s.
de: Ein MBR wurde auf Gerät %s gefunden.

source: Devices with MBR are not supported by the interactive installation.
de: Geräte mit MBR werden vom interaktiven Installer nicht unterstützt.

source: An automatic conversion of the existing MBR to a GPT is not possible.
de: Eine automatische Umwandlung des MBR in eine GPT ist nicht möglich.

source: At least one partition occupies sectors that shall be used by GPT.
de: Mindestens eine Partition belegt von der GPT benötigte Sektoren.

source: Until this conflict is resolved manually, this device will be ignored.
de: Das Gerät wird ignoriert, bis das Problem manuell behoben wurde.

source: on a device with problematic MBR can be found in the
de: auf Geräten mit problematischem MBR finden Sie in der

source: Devices with MBR are unsupported in interactive installation.
de: Geräte mit MBR werden vom interaktiven Installer nicht unterstützt.

source: You can proceed by ignoring this device or by converting
de: Es kann fortgefahren werden, indem das Gerät ignoriert wird

source: the existing MBR to GPT immediately.
de: oder der MBR in eine GUID-Partitionstabelle (GPT) umgewandelt wird.

source: WARNING: By choosing "Convert to GPT" existing partition
de: WARNUNG: Durch Auswahl von "In GPT umwandeln" ändert sich ggf. die

source: order may change and affect other operationg systems!
de: Partitionsreihenfolge und beeinflusst andere Betriebssysteme.

source: on a device with MBR can be found in the
de: auf Geräten mit MBR finden Sie in der

source: Convert MBR of device %s to GPT now?
de: Jetzt den MBR auf Gerät %s in eine GPT umwandeln?

source: Convert to GPT
de: In GPT umwandeln

source: Size(MiB)
de: Größe(MiB)

source: This module is used for partitioning the existing hard drives. It is recommended to use at least three partitions - one BIOS boot or EFI partition, one for the root file system, and one for the swap area. Please note: If automatic partitioning has been selected, all the data stored on these hard drives will be lost during this process! Should the proposed partitioning be undesirable, it can be rejected by pressing the F5 function key.
de: In dieser Einstellungsmaske wird die Partitionierung der vorhandenen Festplatten vorgenommen. Es wird empfohlen, mindestens drei Partitionen zu verwenden - eine BIOS-Boot- oder EFI-Partition, eine für das Root-Dateisystem, eine für den Swap-Bereich. Achtung: Wurde die automatische Partitionierung gewählt, gehen auf diesen Festplatten alle Daten verloren! Sollte der Partitionierungsvorschlag unpassend sein, kann er durch die Funktionstaste F5 verworfen werden.

source: Data
de: Daten

source: The selected file system and partition type
de: Das gewählte Dateisystem bzw. Partitionstyp ist nicht nutzbar,

source: take no effect, if "format" is not selected.
de: wenn "formatieren" nicht angewählt wurde.

source: Create new partition
de: Neue Partition erstellen

source: Size (MiB):
de: Größe (MiB)

source: Partition type:
de: Partitionstyp:

source: File system:
de: Dateisystem:

source: Edit partition
de: Partition bearbeiten

source: Size: %d MiB
de: Größe: %s MiB

source: Create new LVM logical volume
de: Neues logisches Medium erstellen

source: Volume name:
de: Name des Mediums:

source: Edit LVM logical volume
de: Logisches Medium bearbeiten

source: Volume name: %s
de: Name des Mediums: %s

source: This module is used to specifiy the device where to install the boot loader. The correct device depends on current BIOS settings and partitioning. If an incorrect device has been selected, the installed system may not boot. If unsure, continue without change.
de: In diesem Modul kann das Gerät festgelegt werden, auf dem der Bootloader installiert werden soll. Das auszuwählende Gerät ist abhängig von den aktuellen BIOS-Einstellungen und der Partitionierung. Sollte das falsche Gerät ausgewählt werden, bootet das installierte System ggf. nicht. Falls Sie sich unsicher sind, fahren Sie ohne Änderung fort.

source: Select where to install the GRUB boot loader:
de: Wählen Sie aus, wo der GRUB-Bootloader installiert werden soll:
