Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/virtualization/univention-virtual-machine-manager-daemon/umc/python/uvmm/*.po
Languages: fr

source: Cloud connection
fr: Connexion au cloud

source: Could not determine architecture for domain
fr: Impossible de déterminer l'architecture du domaine

source: Could not determine the keyboard layout for the VNC access
fr: Impossible de déterminer la disposition du clavier pour l'accès VNC

source: Could not determine the list of boot devices for domain
fr: Impossible de déterminer la liste des périphériques de démarrage pour le domaine

source: Could not retrieve details for domain %s
fr: Impossible d'obtenir les détails du domaine %s

source: Failed to check if the drive is used by any other virtual instance
fr: Impossible de vérifier si le disque est utilisé par une autre instance virtuelle

source: Failed to retrieve details for the server %(nodeURI)s
fr: Impossible d'obtenir les détails du serveur %(nodeURI)s

source: Full virtualization (KVM)
fr: Virtualisation totale (KVM)

source: Invalid domain state: %s
fr: État du domaine invalide : %s

source: More detailed information can be found in the following logfiles:
fr: Des informations plus détaillées se trouvent dans les fichiers de journal suivants :

source: Physical servers
fr: Serveurs physiques

source: The connection to the univention-virtual-machine-manager-daemon service failed.
fr: Échec de la connexion au service « univention-virtual-machine-manager-daemon ».

source: The connection to the univention-virtual-machine-manager-daemon service failed: %s
fr: Échec de la connexion au service « univention-virtual-machine-manager-daemon » : %s

source: The given UVMM command is not known
fr: La commande UVMM donnée est inconnue

source: This might be a temporary problem. Please wait some minutes for the connection to reestablish or restart the UVMM service.
fr: Il s'agit peut-être d'un problème temporaire. Veuillez patienter quelques minutes le temps que la connexion soit réétablie ou redémarrez le service UVMM.

source: Unknown physical server %(nodeURI)s
fr: Serveur physique inconnu %(nodeURI)s

source: Unknown profile
fr: Profil inconnu

source: Unknown profile given
fr: Profil donné inconnu

source: vcpus must be a number
fr: « vcpus » doit être un nombre
