Repository: univention/univention-corporate-server
Catalog: */univention-system-setup/umc/python/setup/*.po
Languages: de

source: A domain name server needs to be specified.
de: Ein Domänen-DNS-Server muss angegeben werden.

source: A valid NetBIOS name can not be longer than 13 characters. If Samba is installed, the hostname should be shortened.
de: Ein gültiger NetBIOS Name darf nicht länger als 13 Zeichen sein. Wenn Samba installiert wird, sollte der Rechnername gekürzt werden.

source: Bond-primary must exist in bond-slaves
de: Bond-primary muss in bond-slaves enthalten sein

source: Business unit
de: Abteilung

source: Cannot automatically determine the domain. Please specify the server's fully qualified domain name.
de: Die Domäne kann nicht automatisch bestimmt werden. Bitte geben Sie den vollständigen Domänennamen des Systems an.

source: Cannot use bridge %r as bridge-port
de: Kann Bridge %r nicht als bridge-port verwenden

source: Cannot use device %s: Device must be unconfigured
de: Kann Gerät %s nicht verwenden: Gerät muss unkonfiguriert sein

source: Common name for the root SSL certificate
de: Allgemeiner Name (common name) für das Root-SSL-Zertifikat

source: Country
de: Land

source: Country must be a country code consisting of 2 characters.
de: Land muss ein Ländercode bestehend aus 2 Zeichen sein.

source: Device %(device)r is already in use by %(name)r
de: Device %(device)r ist bereits von %(name)r in Benutzung

source: Devices used in a bonding must be physical: %s is not
de: Geräte, die in einem Bond-Gerät verwendet werden, müssen physikalisch sein: %s ist nicht

source: Domain name server
de: Domänen-DNS-Server

source: Duplicated IP address: %r
de: Duplizierte IP-Addresse: %r

source: During the check of the license status the following error occurred: {error}
de: Während der Überprüfung des Lizenzstatus trat der folgende Fehler auf: {error}

source: Email address
de: E-Mail-Adresse

source: Encountered unexpected error during setup process: %s
de: Ein unerwarteter Fehler trat während des Einrichtungsprozesses auf: %s

source: External name server
de: Externer DNS-Server

source: Failed to get package for Role %s
de: Es konnte kein Paket für die Rolle %s gefunden werden

source: Hostname is equal to domain name.
de: Systemname ist gleich dem Domänennamen.

source: Invalid IPv4 address: %r
de: Ungültige IPv4 Adresse: %r

source: Invalid IPv4 netmask: %r
de: Ungültige IPv4 Netzmaske: %r

source: Invalid IPv6 address: %r
de: Ungültige IPv6 Addresse: %r

source: Invalid IPv6 identifier: %r
de: Ungültiger IPv6 Bezeichner: %r

source: Invalid IPv6 netmask: %r
de: Ungültige IPv6 Netzmaske: %r

source: Invalid VLAN ID. Must be between 1 and 4095.
de: Ungültige VLAN ID. Muss zwischen 1 und 4095 sein.

source: Invalid bond-mode: %r
de: Ungültiger bond-mode: %r

source: Invalid device name: %r
de: Ungültiger Gerätename: %r

source: It is not possible to install KVM and XEN components on one system. Please select only one of these components.
de: Es ist nicht möglich KVM- und XEN-Komponenten auf einem System zu installieren. Bitte wählen Sie nur eine dieser Komponenten aus.

source: It is not possible to install Samba 3 and Samba 4 on one system. Please select only one of these components.
de: Es ist nicht möglich Samba 3 und Samba 4 auf einem System zu installieren. Bitte wählen Sie nur eine dieser Komponenten aus.

source: Location
de: Ort

source: Missing IPv6 default identifier
de: Fehlender IPv6 default Bezeichner

source: Missing device for bond-slaves
de: Fehlendes Gerät für bond-slaves

source: Missing device: %r
de: Fehlendes Gerät: %r

source: Multiple IPv4 addresses are not supported on this device.
de: Mehrere IPv4 Adressen sind an diesem Gerät nicht unterstützt.

source: No UCS DC Master could be found at the address.
de: Es wurde kein UCS DC Master unter der angegebenen Adresse gefunden.

source: No fully qualified domain name has been specified for the system.
de: Es wurde kein vollständiger Domänenname für das System angegeben.

source: No hostname has been specified for the system.
de: Es wurde kein Rechnername für das System angegeben.

source: Organization
de: Organisation

source: Please enter a valid email address
de: Bitte geben Sie eine gültige E-Mail-Adresse ein

source: Please enter a valid fully qualified domain name (e.g. host.example.com).
de: Bitte geben Sie einen vollqualifizierten Domänennamen an (z.B. host.example.com).

source: State
de: Land

source: The LDAP base may neither contain blanks nor any special characters. Its structure needs to consist of at least two relative distinguished names (RDN) which may only use the attribute tags 'dc', 'cn', 'c', 'o', or 'l' (e.g., dc=test,dc=net).
de: Die LDAP-Basis darf weder Leer- noch Sonderzeichen enthalten. Ihre Struktur muss aus mindestens zwei Relative Distinguished Names (RDN) bestehen, die eines der Attribut-Tags 'dc', 'cn', 'c', 'o', or 'l' verwenden (z.B. dc=test,dc=net).

source: The UCS version of the domain you are trying to join ({}) is lower than the local one ({}). This constellation is not supported.
de: Die UCS Version der Domäne, der Sie beitreten wollen ({}), ist niedriger als als die lokale UCS Version ({}). Diese Konstellation ist nicht unterstützt.

source: The connection to the Active Directory server failed. Please recheck the address.
de: Die Verbindung zum Active Directory Server ist fehlgeschlagen. Bitte überprüfen Sie die Adresse.

source: The connection to the Active Directory server was refused. Please recheck the password.
de: Die Verbindung zum Active Directory Server wurde abgelehnt. Bitte überprüfen Sie das Passwort.

source: The connection to the UCS DC Master was refused. Please recheck the password.
de: Die Verbindung zum UCS DC Master wurde abgelehnt. Bitte überprüfen Sie das Passwort.

source: The following value is too long, only %(max)s characters allowed: %(name)s
de: Der folgende Wert ist zu lang, es sind nur %(max)s Zeichen erlaubt: %(name)s

source: The given user is not member of the Domain Admins group in Active Directory. This is a requirement for the Active Directory domain join.
de: Der angegebene Benutzer ist kein Mitglied der Gruppe Domain Admins im Active Directory. Dies ist eine Voraussetzung für den Active Directory Domänenbeitritt.

source: The hostname %s is longer than 13 characters. It will not be possible to install an Active Directory compatible Domaincontroller (Samba 4) or UCS@school. The hostname cannot be changed after the installation of %s. It is recommended to shorten the hostname to maximal 13 characters.
de: Der Rechnername %s ist länger als 13 Zeichen. Es wird nicht möglich sein, diese Domäne als Active Directory-kompatiblen Domänencontroller oder UCS@school zu betreiben. Der Rechnername kann nach der Installation %s nicht mehr geändert werden. Es wird empfohlen, den Rechnernamen auf maximal 13 Zeichen zu kürzen.

source: The hostname or the hostname part of the fully qualified domain name is invalid. Please go back to the host setting and make sure, that the hostname only contains letter (a-zA-Z) and digits (0-9).
de: Der Rechnername (im vollqualifizierten Domänennamen) ist ungültig. Bitte kehren Sie zu den Rechnereinstellungen zurück und überprüfen Sie, ob der Name ausschließlich Buchstaben (a-zA-Z) und Ziffern (0-9) enthält.

source: The length of fully qualified domain name is greater than 63 characters.
de: Die Länge von System- und Domänennamen ist größer als 63 Zeichen.

source: The license %s is not valid.
de: Die Lizenz %s ist nicht gültig.

source: The primary network device must exist.
de: Das primäre Netzwerkgerät muss existieren.

source: The root password is too short. For security reasons, your password must contain at least 8 characters.
de: Das Root-Passwort ist zu kurz, aus Sicherheitsgründen sollte es mindestens 8 Zeichen lang sein.

source: The root password may only contain ascii characters.
de: Für das Root-Passwort sind nur ASCII-Zeichen erlaubt.

source: The specified IP address (%(name)s) is not valid: %(value)s
de: Die angegebenen IP-Adresse (%(name)s) ist nicht gültig: %(value)s

source: The specified domain name is different to the %s domain name found via the configured DNS server: %s
de: Der angegebene Domänenname unterscheidet sich zu dem im DNS konfigurierten %s Domänenname: %s

source: The specified gateway IPv4 address is not valid: %s
de: Die angegebene Gateway-IPv4-Adresse ist nicht gültig: %s

source: The specified gateway IPv6 address is not valid: %s
de: Die angegebene Gateway-IPv6-Adresse is nicht gültig: %s

source: The specified nameserver %s is not part of a valid UCS domain.
de: Der angegebene DNS-Server %s ist nicht Teil einer gültigen UCS-Domäne.

source: The specified proxy address is not valid (e.g., http://10.201.1.1:8080): %s
de: Die Proxy-Adresse ist nicht gültig (z.B. http://10.201.1.1:8080): %s

source: The value for %s contains invalid characters.
de: Der Wert für %s enthält ungültige Zeichen.

source: The windows domain name can only consist of upper case characters.
de: Die Windows-Domäne kann nur aus Großbuchstaben bestehen.

source: The windows domain name cannot be longer than 15 characters.
de: Der Windows-Domänenname darf nicht länger als 15 Zeichen sein.

source: The windows domain name is not valid.
de: Die Windows-Domäne ist nicht gültig.

source: There is no device configured. At least one IPv4 or IPv6 address or DHCP or SLAAC has to be specified.
de: Es ist kein Gerät konfiguriert. Mindestens eine IPv4 oder IPv6-Adresse oder DHCP oder SLAAC muss angegeben werden.

source: To install the {appliance_name} appliance it is necessary to have an activated UCS license on the master domain controller.
de: Um die {appliance_name} Appliance zu installieren, wird eine aktivierte UCS Lizenz auf dem Domänencontroller Master benötigt.

source: the %s appliance
de: der %s Appliance

source: the UCS system
de: des UCS-Systems

source: univention-join -checkPrerequisites reported a problem. Output of check:
de: univention-join -checkPrerequisites hat ein Problem gefunden. Fehlerausgabe:
