Repository: univention/univention-corporate-server
Catalog: virtualization/univention-virtual-machine-manager-daemon/src/*.po
Languages: de

source: Cache options
de: Zwischenspeicher-Optionen

source: Command "%(command)s" is restricted
de: Kommando "%(command)s" ist verboten

source: Connection options
de: Verbindungsoptionen

source: Could not open LDAP-Admin connection
de: Keine LDAP-Verbindung als Administrator

source: Could not open LDAP-Machine connection
de: Keine LDAP-Verbindung als Host

source: Could not open socket "%(path)s": %(errno)d
de: Konnte Socket "%(path)s" nicht öffnen: %(errno)d

source: Could not query "%(uri)s"
de: Keine Antwort für "%(uri)s"

source: Could not send request: %(errno)d
de: Konnte Socket nicht öffnen: %(errno)d

source: Daemon options
de: Dämonoptionen

source: Do not load cached state
de: Zwischengespeicherten Zustand nicht laden

source: Domain "%(domain)s" already exists: %(uuid)s
de: Domain-Name "%(domain)s" wird bereits von "%(uuid)s" verwendet

source: Domain "%(domain)s" in state "%(state)s" can not be migrated
de: Domain "%(domain)s" im Zustand "%(state)s" kann nicht migriert werden

source: Domain "%(domain)s" is not shut off: %(state)d
de: Domain "%(domain)s" ist nicht ausgeschaltet: "%(state)d"

source: Domain name "%(domain)s" already used by "%(uuid)s"
de: Domain-Name "%(domain)s" wird bereits von "%(uuid)s" verwendet

source: EOS while waiting for answer.
de: Ende des Datenstroms beim Warten auf eine Antwort

source: Error cloning "%(domain)s": %(error)s
de: Fehler beim Klonen der Domäne "%(domain)s": %(error)s

source: Error creating "%(domain)s" snapshot: %(error)s
de: Fehler beim Sichern der Domäne "%(domain)s": %(error)s

source: Error creating storage pool "%(pool)s": %(error)s
de: Fehler beim Erzeugen des Speicherbereichs "%(pool)s": %(error)s

source: Error creating storage volume "%(name)s" for "%(domain)s": %(error)s
de: Fehler beim Erzeugen des Speichermediums "%(name)s" für "%(domain)s": %(error)s

source: Error defining domain "%(domain)s": %(error)s
de: Fehler beim Definieren der Domäne "%(domain)s": %(error)s

source: Error deleting "%(domain)s" snapshot: %(error)s
de: Fehler beim Löschen des Sicherungspunktes von "%(domain)s": %(error)s

source: Error listing pools at "%(uri)s": %(error)s
de: Fehler beim Anzeigen der Speicherbereiche bei "%(uri)s": %(error)s

source: Error listing volumes at "%(uri)s": %(error)s
de: Fehler beim Anzeigen der Speichermedien bei "%(uri)s": %(error)s

source: Error locating storage volume "%(volume)s" for "%(domain)s": %(error)s
de: Fehler beim Finden der Speichermediums "%(volume)s" von "%(domain)s": %(error)s

source: Error managing domain "%(domain)s"
de: Fehler beim Verwalten der Domäne "%(domain)s"

source: Error managing domain "%(domain)s": %(error)s
de: Fehler beim Verwalten der Domäne "%(domain)s": %(error)s

source: Error migrating domain "%(domain)s": %(error)s
de: Fehler beim Migrieren der Domäne "%(domain)s": %(error)s

source: Error modifying migrationtargethost "%(domain)s": %(error)s
de: Fehler beim Ändern von migrationtargethost "%(domain)s": %(error)s

source: Error reading %(file)s: %(msg)s
de: Fehler beim Lesen der Datei %(file)s: %(msg)s

source: Error reading incomplete %(file)s.
de: Fehler beim Lesen der unvollständigen Datei %(file)s

source: Error removing %(file)s.old: %(msg)s
de: Fehler beim Entfernen der Datei %(file)s.old: %(msg)s

source: Error removing domain "%(domain)s": %(error)s
de: Fehler beim Löschen der Domäne "%(domain)s": %(error)s

source: Error renaming %(file)s.new: %(msg)s
de: Fehler beim Umbenennen der Datei %(file)s.new: %(msg)s

source: Error renaming %(file)s: %(msg)s
de: Fehler beim Umbenennen der Datei %(file)s: %(msg)s

source: Error restoring domain "%(domain)s": %(error)s
de: Fehler beim Wiederherstellen der Domäne "%(domain)s": %(error)s

source: Error retrieving list of active networks: %(error)s
de: Fehler beim Auslesen der aktiven Netzwerke: %(error)s

source: Error retrieving list of networks: %(error)s
de: Fehler beim Auslesen der Netzwerke: %(error)s

source: Error retrieving old domain "%(domain)s": %(error)s
de: Fehler beim Auslesen der alten Domäne "%(domain)s": %(error)s

source: Error reverting "%(domain)s" to snapshot: %(error)s
de: Fehler beim Wiederherstellen der Domäne "%(domain)s": %(error)s

source: Error saving domain "%(domain)s": %(error)s
de: Fehler beim Speichern der Domäne "%(domain)s": %(error)s

source: Error starting network %(name)s: %(error)s
de: Fehler beim Starten des Netzwerks %(name)s: %(error)s

source: Error undefining domain "%(domain)s": %(error)s
de: Fehler beim Löschen der Domäne "%(domain)s": %(error)s

source: Error updating domain "%(domain)s"
de: Fehler beim Aktualisieren der Domäne "%(domain)s"

source: Error updating domain "%(domain)s": %(error)s
de: Fehler beim Aktualisieren der Domäne "%(domain)s": %(error)s

source: Error while closing socket: %(errno)d
de: Fehler beim Löschen des Sockets: %(errno)d

source: Error while waiting for answer: %(errno)d
de: Fehler beim Warten auf eine Antwort: %(errno)d

source: Exception: %(exception)s
de: Fehler: %(exception)s

source: Failed to backup domain %(domain)s: %(xml)s
de: Sicherung der Domäne "%(domain)s" fehlgeschlagen: %(xml)s

source: Failed to clone volume "%(volume)s": %(error)s
de: Fehler beim Klonen des Speichermedium "%(volume)s": %(error)s

source: Failed to fork daemon.
de: Dämon konnte sich nicht abspalten.

source: Failed to generate new name for disk "%(disk)s"
de: Fehler beim Generieren eines neuen Namen für das Speichermedium "%(disk)s"

source: Failed to restore snapshot after failed migration of domain "%(domain)s": %(error)s
de: Fehler beim Wiederherstellen der Sicherungspunkte nach einer fehlgeschlagenen Migration der Domäne "%(domain)s": %(error)s

source: Failed to update device.
de: Dämon Gerät nicht aktualisieren.

source: Failed to update domain "%(domain)s"
de: Aktualisieren der Domäne "%(domain)s" fehlgeschlagen

source: Failed to update the additionally information in the LDAP directory.
de: Die Aktualisierung zusätzlicher Informationen im LDAP-Verzeichnis ist fehlgeschlagen.

source: Fork into background
de: Abspalten in den Hintergrund

source: Hypervisor "%(uri)s" is already connected.
de: Verbindung zum Hypervisor "%(uri)s" besteht bereits.

source: Hypervisor "%(uri)s" is not connected.
de: Noch keine Verbindung zum Hypervisor "%(uri)s".

source: IO error "%(reason)s" on device "%(device)s[%(srcpath)s]"
de: EA Fehler "%(reason)s" für Gerät "%(device)s[%(srcpath)s]"

source: Incompatible version: %(major)d.%(minor)d
de: Inkompatible Version: %(major)d.%(minor)d

source: Migration aborted
de: Migration abgebrochen

source: Migration completed after %(time)s in %(iteration)d iterations
de: Migration nach %(time)s in %(iteration)d Iterationen abgeschlossen

source: Migration in progress since %(time)s, iteration %(iteration)d
de: Migration läuft seit %(time)s, Iteration %(iteration)d

source: Migration started
de: Migration gestartet

source: No SERVICES defined.
de: Keine Dienste(SERVICES) definiert.

source: No nodes found.
de: Keine Knoten gefunden.

source: Not a Packet: %(type)s
de: Kein Paket: %(type)s

source: Not a UVMM_Response.
de: Keine UVMM-Antwort.

source: Not a valid Packet: %(msg)s
de: Kein gültiges Paket: %(msg)s

source: Packet is no UVMM Request: %(type)s
de: Paket ist keine UVMM-Anfrage: %(type)s

source: Path to the UNIX socket
de: Pfad zum UNIX-Socket

source: Path to the UNIX socket [%(default)s]
de: Pfad zum UNIX-Socket [%(default)s]

source: Path to the ini-file [%(default)s]
de: Pfad zur ini-Datei [%(default)s]

source: Path to the log-file
de: Pfad zur Log-Datei

source: Path to the pid-file [%(default)s]
de: Pfad zur pid-Datei [%(default)s]

source: Post-Copy migration forced
de: Post-Copy Migration erzwungen

source: Print additional information
de: Ausführliche Informationen ausgeben

source: RAM overcommitment: VM RAM %(vm)s exceeds available host RAM %(host)s
de: RAM Überbuchung: VM RAM %(vm)s überschreitet verfügbaren Host RAM %(host)s

source: Skip reading ini-file
de: Lesen der ini-Datei überspringen

source: Snapshot not supported "%(node)s"
de: "%(node)s" unterstützt keine Sicherungspunkte.

source: The EC2 region returned an error for connection "%(connection)s": AuthFailure: The provided AWS access credentials could not be validated. Please ensure that you are using the correct access keys. Consult the AWS service documentation for details.
de: Die EC2 Region hat einen Fehler für die Verbindung "%(connection)s" zurückgegeben: AuthFailure: Die eingegebenen AWS Anmeldedaten konnten nicht bestätigt werden. Bitte stellen Sie sicher, dass die richtigen Zugriffsschlüssel eingetragen sind. Details sind der AWS-Service-Dokumentation zu entnehmen.

source: The EC2 region returned an error for connection "%(connection)s": RequestExpired: Please check your system time to interact with AWS.
de: Die EC2 Region hat einen Fehler für die Verbindung "%(connection)s" zurückgegeben: RequestExpired: Bitte die Systemzeit überprüfen um mit AWS interagieren zu können.

source: The EC2 region returned an error for connection "%(connection)s": UnauthorizedOperation: The provided AWS access credentials are not authorized to perform this operation. Check your IAM policies, and ensure that you are using the correct access keys. Also, the IAM user must have appropriate access rights to interact with EC2, e.g. AmazonEC2FullAccess.
de: Die EC2 Region hat einen Fehler für die Verbindung "%(connection)s" zurückgegeben: UnauthorizedOperation: Die eingegebenen AWS Anmeldedaten sind nicht berechtigt diese Operation durchzuführen. Prüfen Sie die IAM-Richtlinien und stellen Sie sicher, dass die richtigen Zugriffsschlüssel eingetragen sind. Zudem muss der IAM-Benutzer entsprechende Zugriffsrechte haben, um mit EC2 interagieren zu können, z.B. AmazonEC2FullAccess.

source: The EC2 region returned an error for connection "%(connection)s": Your AWS account is currently blocked. If you have questions, please contact AWS Support.
de: Die EC2 Region hat einen Fehler für die Verbindung "%(connection)s" zurückgegeben: Ihr AWS Konto ist derzeit blockiert. Wenn Sie Fragen haben, wenden Sie sich an den AWS Support.

source: The target host has an incompatible CPU; select a different host or try an offline migration. (%(details)s)
de: Der Zielrechner hat eine inkompatible CPU; wählen Sie einen anderen Rechner oder versuchen Sie eine Migration im ausgeschalteten Zustand. (%(details)s)

source: Timed out while closing socket.
de: Zeitüberschreitung beim Schließen des Sockets.

source: Timed out while opening local socket "%(path)s".
de: Timeout beim Öffnen des lokalen Socket "%(path)s".

source: Timed out while receiving data.
de: Timeout beim Empfangen von Daten.

source: Timed out while sending data.
de: Timeout beim Senden von Daten.

source: Timeout in seconds for UVMM commands
de: Timeout in Sekunden für UVMM Kommandos

source: Unknown command "%(command)s"
de: Unbekannter Befehl "%(command)s"

source: Unknown disk type: %(type)d
de: Unbekannter Laufwerkstyp: %(type)d

source: Unknown disk/type='%(type)s'
de: Unbekannter Laufwerkstyp: %(type)s

source: Unknown domain "%s"
de: Unbekannte Domäne "%s"

source: Unknown interface/type='%(type)s'
de: Unbekannter Interface-Typ: %(type)s

source: Unknown os/type='%(type)s'
de: Unbekannter Betriebssystem-Typ: %(type)s

source: Unsupported state transition %(cur_state)s to %(next_state)s
de: Ungültiger Zustandsübergang von %(cur_state)s zu %(next_state)s

source: Unsupported storage-pool-type "%(pool_type)s" for "%(domain)s"
de: Speicherbereichstyp "%(pool_type)s" wird nicht unterstützt für "%(domain)s"

source: Volume "%(volume)s" not found: %(error)s
de: Speichermedium "%(volume)s" nicht gefunden: %(error)s

source: args != dict: %(args)s
de: args != Dictionary: %(args)s

source: cache directory [%(default)s]
de: Verzeichnis für Zwischenspeicher [%(default)s]

source: conn_name != string: %(conn_name)s
de: conn_name != Zeichenkette: %(conn_name)s

source: domain != string: %(domain)s
de: domain != Zeichenkette: %(domain)s

source: freq != int: %(freq)s
de: freq != Ganzzahl: %(freq)s

source: group != string: %(group)s
de: group != Zeichenkette: %(group)s

source: hz != int: %(hz)s
de: hz != Ganzzahl: %(hz)s

source: instance_id != string: %(instance_id)s
de: instance_id != Zeichenkette: %(instance_id)s

source: mode != int: %(mode)s
de: mode != Ganzzahl: %(mode)s

source: name != string: %(name)s
de: Name != Zeichenkette: %(name)s

source: pattern != string: %(pattern)s
de: Muster != Zeichenkette: %(pattern)s

source: snapshot != string: %(snapshot)s
de: snapshot != Zeichenkette: %(snapshot)s

source: statefile != string: %(file)s
de: statefile != Zeichenkette: %(file)s

source: subst != dict: %(subst)s
de: subst != Dictionary: %(subst)s

source: subst[] != string: %(subst)s
de: subst[] != Zeichenkette: %(subst)s

source: target_uri != string: %(uri)s
de: target_uri != Zeichenkette: %(uri)s

source: targethost != string: %(targethost)s
de: targethost != Zeichenkette: %(targethost)s

source: testconnection is not a bool %(testconnection)s
de: testconnection ist kein bool %(testconnection)s

source: unknown node %(uri)s
de: Unbekannter Knoten %(uri)s

source: unsupported state: %(state)s
de: Unbekannter Zustand: %(state)s

source: uri != string: %(uri)s
de: uri != Zeichenkette: %(uri)s

source: usage: %prog [options] [uri...]
de: Aufruf: %prog [Optionen] [uri...]

source: volume != string: %(volume)s
de: volume != Zeichenkette: %(volume)s

source: volumes != list or None: %(volumes)s
de: volumes != Liste oder None: %(volumes)s

source: volumes[] != string: %(volume)s
de: volumes[] != Zeichenkette: %(volume)s
