Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/*/univention-system-setup/usr/share/univention-system-setup/www/*.po
Languages: fr

source: %s Appliance
fr: Appareil %s

source: %s Appliance has been successfully set up.
fr: L'appareil %s a été configuré avec succès.

source: %s GiB
fr: %s Gio

source: %s MiB
fr: %s Mio

source: (Request address again)
fr: (Redemander l'adresse)

source: (configure proxy settings)
fr: (configurer les réglages du serveur mandataire)

source: <b>Unknown</b>
fr: <b>Inconnu</b>

source: <p>Click on <i>Finish</i> for putting UCS into operation.</p>
fr: <p>Cliquez sur <i>Terminer</i> pour mettre UCS en fonctionnement.</p>

source: <p>Click on <i>Finish</i> for putting this system into operation.</p>
fr: <p>Cliquez sur <i>Terminer</i> pour mettre le système en fonctionnement.</p>

source: <p>Click on <i>Finish</i> to conclude the installation. The system will be prepared for the first boot procedure and will be rebooted afterwards.</p>
fr: <p>Cliquez sur <i>Terminer</i> pour conclure l'installation. Le system va être préparé pour le premier amorçage et il va être redémarré après.</p>

source: <p>Enter the name of your organization and an e-mail address to activate UCS.</p>
fr: <p>Saisissez le nom de votre organisation ainsi qu'une adresse électronique pour activer UCS.</p>

source: <p>Enter the name of your organization, an e-mail address to activate %s Appliance and a password for your <i>Administrator</i> account.</p><p>The password is mandatory, it will be used for the domain Administrator as well as for the local superuser <i>root</i>.</p>
fr: <p>Saisissez le nom de votre organisation, une adresse électronique pour activer l'appareil %s et un mot de passe pour votre compte <i>Administrateur</i>.</p><p>Le mot de passe est obligatoire, il sera utilisé pour l'administrateur du domaine ainsi que pour le super-utilisateur local <i>root</i>.</p>

source: <p>Enter the name of your organization, an e-mail address to activate UCS and a password for your <i>Administrator</i> account.</p><p>The password is mandatory, it will be used for the domain Administrator as well as for the local superuser <i>root</i>.</p>
fr: <p>Saisissez le nom de votre organisation, une adresse électronique pour activer UCS et un mot de passe pour votre compte <i>Administrateur</i>. </p><p>Le mot de passe est obligatoire, il sera utilisé pour l'administrateur du domaine ainsi que pour le super-utilisateur local <i>root</i>.</p>

source: <p>One or more network interfaces could not obtain an IP address via DHCP. These interfaces will use automatic generated private addresses instead (APIPA).</p> <ul> %s </ul> <p>Please adjust your DHCP settings or confirm use of private address(es).</p>
fr: <p>Une ou plusieurs interfaces réseau n'ont pas pu obtenir d'adresse IP par DHCP. Ces interfaces utiliseront à la place des adresses privées générées automatiquement (APIPA).</p> <ul> %s </ul> <p>Veuillez ajuster vos réglages DHCP ou confirmer l'utilisation d'adresses privées.</p>

source: <p>Select UCS software components for installation on this system. This step can be skipped; the components are also available in the Univention App Center in the category <i>UCS components</i>.</p><p>Third-party software (e.g., groupware) is also available through the Univention App Center.</p>
fr: <p>Choisissez les composants logiciels UCS à installer sur ce système. Vous pouvez sauter cette étape : les composants sont également disponibles dans l'App Center Univention, dans la catégorie <i>Composants UCS</i>.</p><p>Des logiciels tiers (par exemple des collecticiels) sont également disponibles dans l'App Center d'Univention.</p>

source: <p>When accessing the system for the first time, you will be asked to request and upload a new license.</p>
fr: <p>Lorsque vous accédez au système pour la première fois, il vous sera demandé d'indiquer une nouvelle licence et de la transférer sur le serveur.</p>

source: <p>When accessing the system for the first time, you will be asked to upload a new license that has been sent to your email account.</p>
fr: <p>Lorsque vous accédez au système pour la première fois, il vous sera demandé de transférer sur le serveur la nouvelle licence envoyée à votre adresse de courrier électronique.</p>

source: <p>With the current settings <b> no </b> internet access is available.</p><p>Because of this some functions like the App Center or software-updates will not be accessible</p>
fr: <p>Avec les réglages actuels, <b> aucun </b> accès Internet n'est disponible. </p><p>De ce fait, certaines fonctions telles que l'App Center ou les mises à jour logicielles ne seront pas accessibles.</p>

source: <tr><td>City:</td><td>%s</td></tr>
fr: <tr><td>Ville :</td><td>%s</td></tr>

source: <tr><td>Default locale:</td><td>%s</td></tr>
fr: <tr><td>Paramètres locaux par défaut :</td><td>%s</td></tr>

source: <tr><td>Keyboard layout:</td><td>%s</td></tr>
fr: <tr><td>Disposition du clavier :</td><td>%s</td></tr>

source: <tr><td>Timezone:</td><td>%s</td></tr>
fr: <tr><td>Fuseau horaire :</td><td>%s</td></tr>

source: A Backup Directory Node is the fallback system for the UCS Primary Directory Node and can take over the role of the Primary Directory Node permanently. It is recommended to use at least one Backup Directory Node in the domain.
fr: Un Backup Directory Node est le système palliatif pour le UCS Primary Directory Node, capable de prendre en charge le rôle de Primary Directory Node de façon permanente. Il est recommandé d'utiliser au moins un Backup Directory Node dans le domaine.

source: A few questions are needed to complete the configuration process.
fr: Vous devez répondre à quelques questions pour terminer le processus de configuration.

source: A new UCS domain will be created.
fr: Un nouveau domaine UCS va être créé.

source: A new domain directory is created on this system. User and management data are stored locally.
fr: Un nouvel annuaire de domaine a été créé sur ce système. Les données des utilisateurs et de gestion sont enregistrées localement.

source: A preconfigured test domain will be instantiated.
fr: Un nouveau domaine UCS préconfiguré va être créé.

source: A proxy address needs to be specified in the format: <i>http://proxy.mydomain.intranet:3128</i><br/>Proxy access with username and password may be specified via the format: <i>http://username:password@proxy.mydomain.intranet:3128</i>
fr: Une adresse de serveur mandataire doit être saisie au format : <i>http://proxy.mondomaine.intranet:3128</i><br/>L'accès au serveur mandataire avec nom d'utilisateur et mot de passe peut être indiqué au format : <i>http://nomdutilisateur:motdepasse@proxy. mondomaine.intranet:3128</i>

source: A valid e-mail address allows to activate the UCS system for using the Univention App Center. The address can be specified now or also at a later point in time. An e-mail with a personalized license key will then be sent to your e-mail address. This license can be uploaded via the license dialog in Univention Management Console.
fr: Une adresse électronique valide permet d'activer le système UCS pour utiliser l'App Center Univention. Vous pouvez indiquer cette adresse maintenant ou plus tard. Un courriel contenant une clé de licence personnalisée vous sera alors envoyé à cette adresse. Vous pouvez transférer cette licence par le biais du formulaire de licence dans la console Univention Management Console.

source: A valid e-mail address is required to activate %s Appliance. The address can be specified now or also at a later point in time. An e-mail with a personalized license key will then be sent to your e-mail address. This license can be uploaded after the setup process.
fr: Une adresse électronique valide est nécessaire pour activer l'appareil %s. Vous pouvez indiquer cette adresse maintenant ou ultérieurement. Un courriel contenant une clé de licence personnalisée vous sera alors envoyé à cette adresse. Vous pouvez transférer cette licence après le processus de configuration.

source: Account information
fr: Informations du compte

source: Active Directory join information
fr: Informations sur la jonction Active Directory

source: Adapt settings
fr: Adapter les réglages

source: Address configuration
fr: Configuration de l'adresse

source: Address for %s
fr: Adresse pour %s

source: Address of Active Directory domain controller or name of Active Directory domain
fr: Adresse du contrôleur de domaine Active directory ou nom du domaine Active Directory

source: Adjust settings
fr: Ajuster les réglages

source: Alternate DNS server
fr: Serveur DNS alternatif

source: Alternatively, you may click on the button <i>Finish</i> to exit the wizard and resolve the described problems via Univention Management Console.
fr: Vous pouvez aussi cliquer sur le bouton <i>Terminer</i> pour quitter l'assistant et résoudre les problèmes décrits dans la console Univention Management Console.

source: At least one network device needs to be properly configured.
fr: Au moins un périphérique réseau doit être correctement configuré.

source: Cancel
fr: Annuler

source: Choose your language
fr: Choisissez votre langue

source: Choose your system's localization settings.
fr: Choisissez les paramètres de localisation de votre système.

source: Configure system
fr: Configurer le système

source: Configure this system as first system for the new domain. Additional systems can join the domain later.
fr: Configurer ce système comme premier système du nouveau domaine. Des systèmes supplémentaires pourront rejoindre ultérieurement le domaine.

source: Confirm configuration settings
fr: Confirmer les réglages de configuration

source: Connect to Univention Management Console on this system either as user <b>Administrator</b> or as user <b>root</b> in case the system has not yet created a new UCS domain:
fr: Se connecter à la console Univention Management Console sur ce système, soit en tant qu'<b>Administrateur</b>, soit en tant qu'utilisateur <b>root</b> si le système n'a pas encore créé un nouveau domaine UCS :

source: Connect to Univention Management Console on this system either as user <b>Administrator</b> or as user <b>root</b> in case the system has not yet joined the domain:
fr: Se connecter à la console Univention Management Console sur ce système, soit en tant qu'<b>Administrateur</b>, soit en tant qu'utilisateur <b>root</b> si le système n'a pas encore rejoint le domaine :

source: Continue
fr: Continuer

source: Continue with 169.254.*.* addresse(s)
fr: Continuer avec une ou des adresse(s) 169.254.*.*

source: Continue with incomplete settings
fr: Continuer avec des réglages incomplets

source: Continue without internet access
fr: Continuer sans accès à Internet

source: Create a new UCS domain
fr: Créer un nouveau domaine UCS

source: DHCP query failed.
fr: La requête DHCP a échoué.

source: DNS server
fr: Serveur DNS

source: Default system locale
fr: Paramètres locaux par défaut

source: Domain and host configuration
fr: Configuration de l'hôte et du domaine

source: Domain and network configuration
fr: Configuration du réseau et du domaine

source: Domain join information
fr: Informations de jonction au domaine

source: Domain name
fr: Nom du domaine

source: Domain setup
fr: Installation du domaine

source: E-mail address to activate %s Appliance
fr: Adresse électronique pour activer l'appareil %s

source: E-mail address to activate UCS
fr: Adresse électronique pour activer UCS

source: Enter a city nearby to preconfigure settings such as timezone, system language, keyboard layout.
fr: Saisissez une ville à proximité afin de pré-configurer les réglages tels que fuseau horaire, langue du système et disposition du clavier.

source: Enter name and password of a user account which is authorised to join a system into this domain.
fr: Saisissez le nom et le mot de passe d'un compte utilisateur autorisé à faire rejoindre un système dans le domaine.

source: Failed join scripts can be executed via the UMC module <i>Domain join</i>.
fr: Les scripts de jonction au domaine qui ont échoué peuvent être exécutés à travers le module UMC <i>Rejoindre le domaine</i>.

source: Failed join scripts or a new join of the system can be executed via the UMC module <i>Domain join</i>.
fr: Les scripts de jonction au domaine qui ont échoué ou une nouvelle tentative de jonction peuvent être exécutés à travers le module UMC <i>Rejoindre le domaine</i>.

source: Fast demo configuration
fr: Configuration rapide de démonstration

source: Fill in the password for the system administrator user <b>root</b> and the domain administrative user account <b>Administrator</b>.
fr: Indiquez le mot de passe de l'administrateur du système <b>root</b> et du compte utilisateur de l'administrateur du domaine <b>Administrateur</b>.

source: Finish
fr: Terminer

source: For a specified host name, the domain name is automatically derived from the domain name server. A fully qualified domain may be necessary for mail server setups with differing domains.<br/>Note that the domain name <b>cannot</b> be changed after the UCS setup wizard has been completed.
fr: Pour un nom d'hôte donné, le nom du domaine est dérivé automatiquement à partir du serveur de noms du domaine. Un nom de domaine pleinement qualifié peut être nécessaire pour configurer des serveurs de courrier avec des domaines différents. <br/>Notez que le nom de domaine <b>ne peut pas</b> être modifié une fois que l'assistant de configuration UCS a été mené à son terme.

source: Fully qualified domain name
fr: Nom de domaine pleinement qualifié

source: Gateway
fr: Passerelle

source: HTTP proxy
fr: Serveur mandataire HTTP

source: Help us improve UCS by sending the occurred errors as feedback.
fr: Aidez-nous à améliorer UCS en envoyant les erreurs apparues en retour d'information.

source: Host settings
fr: Réglages de l'hôte

source: Hostname
fr: Nom d'hôte

source: Hostname (unchangeable. Was set while creating the container)
fr: Nom d'hôte (ne peut pas être modifié. Défini lors de la création du conteneur)

source: Hostname of the Primary Directory Node
fr: Nom d'hôte du Primary Directory Node

source: Hostname or fully qualified domain name
fr: Nom d'hôte ou nom de domaine pleinement qualifié

source: IP address is obtained dynamically via DHCP
fr: L'adresse IP est obtenue de façon dynamique via DHCP

source: IPv4 net mask/IPv6 prefix {interface}
fr: Masque de réseau IPv4 / préfixe IPv6 {interface}

source: IPv4/IPv6 address {interface}
fr: Adresse IPv4/IPv6 {interface}

source: Initialize the configuration process ...
fr: Initialiser le processus de configuration...

source: Installation of %d additional software components.
fr: Installation de %d composants logiciels supplémentaires.

source: Installation of one additional software component.
fr: Installation d'un composant logiciel supplémentaire.

source: Invalid IP address!<br/>Expected format is IPv4 or IPv6.
fr: Adresse IP non valide !<br/>Le format attendu est IPv4 ou IPv6.

source: Invalid IPv4 net mask or IPv6 prefix!<br/>Expected for IPv4 is a number between 0 and 32 or a format similar to <i>255.255.255.0</i>.<br/>Expected format for IPv6 is a number between 0 and 128.
fr: Masque réseau IPv4 ou préfixe IPv6 non valide !<br/>Pour IPv4, l'information attendue est un nombre compris entre 0 et 32 ou un masque du type<i>255.255.255.0</i>.<br/>Pour IPv6, l'information attendue est un nombre compris entre 0 et 128.

source: Invalid LDAP base!<br/>The LDAP base may neither contain blanks nor any special characters. Its structure needs to consist of at least two relative distinguished names (RDN) with attribute tags 'dc', 'cn', 'c', 'o', or 'l' (e.g., dc=test,dc=net).
fr: Base LDAP non valide !<br/>La base LDAP ne peut contenir ni espaces, ni caractères spéciaux. Sa structure doit être constituée d'au moins deux noms distincts relatifs (Relative Distinguished Names, RDN) comportant les étiquettes d'attributs 'dc', 'cn', 'c', 'o', ou 'l' (par exemple dc=test,dc=net).

source: Invalid domain name!<br/>Expected format: <i>mydomain.intranet</i>
fr: Nom de domaine non valide !<br/>Format attendu : <i>mondomaine.intranet</i>

source: Invalid e-mail address!<br/>Expected format is:<i>mail@example.com</i>
fr: Adresse électronique non valide !<br/>Le format attendu est : <i>courriel@exemple.com</i>

source: Invalid fully qualified domain name!<br/>Expected format: <i>hostname.mydomain.intranet</i>
fr: Nom de domaine pleinement qualifié non valide !<br/>Format attendu : <i>nomdhote.mondomaine.intranet</i>

source: Invalid hostname or fully qualified domain name!<br/>Expected format: <i>myhost</i> or <i>hostname.mydomain.intranet</i>
fr: Nom d'hôte ou nom de domaine pleinement qualifié non valide !<br/> Format attendu : <i>monhote</i>ou <i>nomdhote.mondomaine.intranet</i>

source: It is not possible to install Samba 3 and Samba 4 on one system. Please select only one of these components.
fr: Il n'est pas possible d'installer Samba 3 et Samba 4 sur un même système. Veuillez ne choisir qu'un seul de ces deux composants.

source: It seems that a UCS Primary Directory Node system has already joined into the Windows AD domain. Please choose a different option as other system roles for joining an AD domain are not available.
fr: Il semble qu'un système UCS Primary Directory Node a déjà rejoint le domaine Windows AD. Veuillez choisir une autre option, car les autres rôles système permettant de rejoindre un domaine AD ne sont pas disponibles.

source: Join into an existing UCS domain
fr: Rejoindre un domaine UCS existant

source: Keyboard layout
fr: Disposition du clavier

source: LDAP base
fr: Base LDAP

source: License agreement
fr: Licence d'utilisation

source: Local root password
fr: Mot de passe root local

source: Localization settings
fr: Réglages de localisation

source: Manage users and permissions directly on this system
fr: Gérer les utilisateurs et les droits directement sur ce système

source: Managed Node
fr: Serveur membre

source: Managed Nodes should be used for services which do not need a local authentication database, for example for file or print servers.
fr: Les serveurs membres devraient être utilisés pour des services qui ne nécessitent pas de base de données d'authentification locale, par exemple des serveurs de fichiers ou d'impression.

source: Network interfaces
fr: Interfaces réseau

source: No additional software component will be installed.
fr: Aucun composant logiciel supplémentaire ne sera installé.

source: No domain controller was found at the address of the name server. It is recommended to verify that the network settings are correct.
fr: Aucun contrôleur de domaine n'a été trouvé à l'adresse du serveur de noms. Il est recommandé de vérifier que les paramètres réseau sont corrects.

source: No domain controller was found at the address of the name server. Please adjust your network settings.
fr: Aucun contrôleur de domaine n'a été trouvé à l'adresse du serveur de noms. Veuillez ajuster vos paramètres réseau.

source: No gateway has been specified and thus no access to the internet is possible. As UCS requires internet access for its functionality, certain services (e.g., software updates, installation of further software components) will not be able to operate as expected.
fr: Aucune passerelle n'a été indiquée et, par conséquent, il n'est pas possible d'accéder à Internet. Du fait qu'UCS requiert un accès Internet pour son fonctionnement, certains services (par exemple les mises à jour logicielles, l'installation de composants logiciels supplémentaires) ne pourront pas fonctionner comme attendu.

source: Obtain IP address automatically (DHCP)
fr: Obtenir l'adresse IP automatiquement (DHCP)

source: Organization name
fr: Nom de l'organisation

source: Password
fr: Mot de passe

source: Please click on the required character.
fr: Veuillez cliquer sur le caractère requis.

source: Please confirm the chosen configuration settings which are summarized in the following.
fr: Veuillez confirmer les réglages de configuration choisis, résumés dans ce qui suit.

source: Please read carefully the license agreement for %s Appliance.
fr: Veuillez lire attentivement la licence d'utilisation de l'appareil %s.

source: Please select your domain settings.
fr: Veuillez sélectionner les réglages de votre domaine.

source: Preferred DNS server
fr: Serveur DNS préféré

source: Primary network interface
fr: Interface réseau primaire

source: Quick setup of a system for testing purposes. Several system configurations are predefined and cannot be changed at a later point.
fr: Mise en place rapide d'un système en vue de tests. Plusieurs réglages de système sont prédéfinis et ne sont pas modifiables plus tard.

source: Reconfigure
fr: Reconfigurer

source: Replica Directory Node systems are ideal for site servers, they provide authentication services for the domain. Local services running on a Replica Directory Node can access the local LDAP database.
fr: Les Replica Directory Nodes sont idéaux pour des serveurs de sites, ils fournissent des services d'authentification pour le domaine. Les services locaux tournant sur un Replica Directory Node peuvent accéder à la base de données LDAP locale.

source: Restarting server components...
fr: Redémarrage des composants du serveur...

source: Root password empty. Continue?
fr: Le mot de passe root est vide. Continuer ?

source: Search Primary Directory Node in DNS
fr: Rechercher le Primary Directory Node dans le DNS

source: Send feedback
fr: Envoyer feedback

source: Send to vendor
fr: Envoyer au vendeur

source: Setup - An error occurred
fr: Installation - Une erreur est survenue

source: Setup successful
fr: Installation réussie

source: Software component
fr: Composant logiciel

source: Software configuration
fr: Configuration logicielle

source: Specify the name of this system.
fr: Indiquez le nom de ce système.

source: Specify the network settings for this system.
fr: Indiquez les paramètres réseau pour ce système.

source: Specify the type of this system.
fr: Indiquez le type de ce système.

source: Start join at the end of the installation
fr: Commencer à rejoindre le domaine à la fin de l'installation

source: System role
fr: Rôle système

source: The following entries could not be validated:
fr: Les entrées suivantes n'ont pas pu être validées :

source: The following errors occurred while applying the settings.
fr: Les erreurs suivantes se sont produites lors de l'application des réglages.

source: The root password is too short. For security reasons, your password must contain at least 8 characters.
fr: Le mot de passe root est trop court. Pour des raisons de sécurité, votre mot de passe doit contenir au moins 8 caractères.

source: The system configuration could not be completed. Please choose to retry the configuration process or finish the wizard.
fr: La configuration du système n'a pas pu être menée à bien. Veuillez choisir entre retenter le processus de configuration ou fermer l'assistant.

source: This may take a few seconds...
fr: Cela peut prendre quelques secondes...

source: This system only has {memory_total} RAM.
fr: Ce système ne dispose que de {memory_total} de RAM.

source: This system will join an existing AD domain with the role <i>%s</i>.
fr: Ce système rejoindra un domaine AD existant avec le rôle <i>%s</i>.

source: This system will join an existing UCS domain with the role <i>%s</i>.
fr: Ce système rejoindra un domaine UCS existant avec le rôle <i>%s</i>.

source: Time zone
fr: Fuseau horaire

source: UCS configuration
fr: Configuration UCS

source: UCS has been successfully set up.
fr: UCS a été installé avec succès.

source: UCS setup
fr: Installation d'UCS

source: UCS setup - An error occurred
fr: Installation d'UCS - une erreur s'est produite

source: UCS setup successful
fr: Installation d'UCS réussie

source: Update system after setup
fr: Mettre à jour le système après l'installation
