Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/*/univention-system-setup/usr/share/univention-system-setup/www/*.po
Languages: fr

source: Use this option if you already have one or more UCS systems.
fr: Utilisez cette option si vous avez déjà un ou plusieurs systèmes UCS.

source: Username
fr: Nom d'utilisateur

source: Validation error
fr: Erreur de validation

source: Validation failed
fr: Échec de la validation

source: Virtual keyboard
fr: Clavier virtuel

source: Waiting for restart of server components...
fr: Redémarrage des composants du serveur...

source: Warning
fr: Avertissement

source: Welcome to Univention Corporate Server (UCS).
fr: Bienvenue dans Univention Corporate Server (UCS)

source: Welcome to the setup of %s Appliance.
fr: Bienvenue dans l'installation de l'appareil %s.

source: You may restart the configuration process again with modified settings.
fr: Vous pouvez redémarrer le processus de configuration avec les réglages modifiés.

source: e.g., Boston...
fr: par exemple Boston...

source: more information
fr: plus d'informations
