Repository: univention/univention-corporate-server
Catalog: management/univention-management-console-module-reboot/umc/js/*.po
Languages: de

source: Action
de: Aktion

source: Actions
de: Aktionen

source: Cancel
de: Abbrechen

source: Execute
de: Ausführen

source: Please confirm to reboot the computer
de: Bitte bestätigen Sie den Neustart dieses Computers

source: Please confirm to shutdown the computer
de: Bitte bestätigen Sie, dass dieser Computer heruntergefahren wird

source: Reason for this reboot/shutdown
de: Grund für dieses Neustarten/Herunterfahren

source: Reboot
de: Neustarten

source: Reboot/shutdown the system
de: System neustarten/herunterfahren

source: Stop
de: Herunterfahren

source: This module can be used to restart or shut down the system remotely. The optionally given message will be displayed on the console and written to the syslog.
de: Mit diesem Modul lässt sich das System aus der Ferne Neustarten oder Herunterfahren. Der optional angegebene Grund wird beim Ausführen des Befehls auf der Konsole ausgegeben sowie in die Syslog geschrieben.
