Repository: univention/univention-corporate-server
Catalog: management/univention-system-info/umc/js/*.po
Languages: de

source: <p>Additionally to the information listed above some more details about the system has been collected. The whole set of collected data that will be transmitted to Univention can be downloaded at the following URL:</p>
de: <p>Zusätzlich zu den oben angezeigten Informationen wurden weitere Details über das System ermittelt. Die gesamten Informationen, die an Univention übertragen werden sollen, können unter der folgenden URL heruntergeladen werden:</p>

source: <p>If a Univention Support Engineer has asked you to provide this information, then please insert the ticket number of the related support ticket into the following text field. The ticket number can be found in the subject of a support mail of the ticket. This information will speed up the processing of the ticket.</p>
de: <p>Wenn Sie durch den Univention-Support gebeten worden sind, diese Informationen zu ermitteln, dann geben Sie bitte im folgenden Feld die Ticketnummer an, welche sich dem Betreff der Support-Mails entnehmen lässt. Die Ticketnummer hilft bei der Zuordnung zu dem Supportfall und beschleunigt die Bearbeitung.</p>

source: <p>In the next step the information about the hardware of your system will be collected and a summary will be shown. During this step, no information will be sent to Univention.</p>
de: <p>Im nächsten Schritt werden die Informationen des Systems ermittelt sowie eine Zusammenfassung darüber angezeigt. Während dieses Vorganges werden keine Informationen an Univention übertragen.</p>

source: <p>The collected information can be transferred to Univention by uploading the data or by sending it via mail. Please select the corresponding option.</p>
de: <p>Die ermittelten Informationen können entweder hochgeladen oder per Mail an Univention geschickt werden. Bitte wählen Sie die gewünschte Variante.</p>

source: <p>The following information has been collected and will be transferred to Univention with your acceptance.</p>
de: <p>Die folgenden Informationen wurden ermittelt und werden mit Ihrer Zustimmung an Univention übertragen:</p>

source: <p>The information could not be transferred to Univention.</p><p>You can send them as email!</p>
de: <p>Die Informationen konnten nicht an Univention übertragen werden.</p><p>Sie können die Information per E-Mail senden!</p>

source: <p>The information were transferred to Univention successfully.</p><p>Thank you very much for your support!</p>
de: <p>Die Informationen wurden erfolgreich an Univention übertragen.</p><p>Vielen Dank für Ihre Unterstützung!</p>

source: <p>This module collects information about the hardware of your system. This might be helpful in connection with a support case. By transmitting the data to Univention you provide the information on which platforms UCS is currently used and therefore should be supported by newer versions. In the following procedure you will be informed in detail about the each step.</p><p>No information is transmitted without your acceptance</p>
de: <p>Dieses Modul stellt Informationen zu der Hardware Ihres Systems zusammen. Diese können im Zusammenhang mit einem Supportfall hilfreich sein. Durch die Übersendung dieser Informationen teilen Sie Univention außerdem mit, welche Hardware mit UCS eingesetzt wird und deswegen auch zukünftig unterstützt werden sollte. Im weiteren Verlauf werden Sie über die einzelnen Schritte genau informiert.</p><p>Es werden keine Informationen ohne Ihre Einwilligung an Univention übermittelt</p>

source: Archive with system information
de: Archiv mit den Systeminformationen

source: Collected data
de: Ermittelte Daten

source: Comment
de: Kommentar

source: General information
de: Allgemeine Informationen

source: Graphics card
de: Grafikkarte

source: If this is related to a support case the next step will be to enter the ticket number. Otherwise the information about your system will be collected and a summary is shown.
de: Wenn sich dies auf einen Supportfall bezieht, wird im nächsten Schritt die Ticketnummer abgefragt. Anderenfalls werden die Informationen zu Ihrem System ermittelt und eine Zusammenfassung angezeigt.

source: In the following step two possibilities to transmit the information to Univention will be described.
de: Im folgenden Schritt werden Ihnen zwei Möglichkeiten geboten, die Informationen an Univention zu übermitteln.

source: Manufacturer
de: Hersteller

source: Memory
de: Arbeitsspeicher

source: Method
de: Methode

source: Model
de: Modell

source: Network adapter
de: Netzwerkkarte

source: Number of CPUs
de: Anzahl der CPUs

source: Send mail
de: Mail senden

source: Support information
de: Support Informationen

source: This is related to a support case
de: Dies bezieht sich auf einen Supportfall

source: To transfer the information via mail please follow these steps:<ol><li>Download the archive with the collected information and save it on your local system</li><li>Click on link <i>Send mail</i> to open your mail program</li><li>Attach the downloaded archive to the mail and send it to Univention</li><li>End this assistant by clicking on the button <i>Finish</i></li></ol>
de: Für das Versenden der Informationen per Mail gehen Sie bitte wie folgt vor:<ol><li>Laden Sie die Datei mit den Informationen herunter und speichern diese auf Ihrem System.</li><li>Klicken Sie auf den Link <i>Mail senden</i>, um Ihr Mailprogramm zu öffnen und eine Mail an Univention zu schicken</li><li>Hängen Sie die heruntergeladene Datei an die Mail an und verschicken diese.</li><li>Beenden Sie diesen Assistenten durch Klicken auf die Schaltfläche <i>Fertigstellen</i></li></ol>

source: Transfer the information
de: Übertragung der Informationen

source: Transfer via mail
de: Übertragung via Mail

source: Transferred successfully
de: Übertragung erfolgreich

source: Upload
de: Hochladen

source: Uploading failed
de: Hochladen fehlgeschlagen
