Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-management-console/www/management/*.po
Languages: fr

source: <p><b>You have got mail!</b></p><p>A license file should have been sent to your email address. Upload the license file from the email to activate your UCS instance.</p>
fr: <p><b>Vous avez reçu un message !</b></p><p>Un fichier de licence vous a été envoyé à votre adresse électronique. Envoyez ce fichier de licence par courrier électronique pour activer votre instance UCS.</p>

source: <p>Detailed usage information on Univention Management Console can be found in the UCS manual. The manual as well as further important information are available via the following links:</p>
fr: <p>Les informations détaillées sur l'utilisation de Univention Management Console se trouvent dans le manuel d'UCS. Le manuel ainsi que d'autres informations importantes sont disponibles au travers des liens suivants :</p>

source: <p>Details about the activation of a UCS license can be found in the <a href="https://docs.software-univention.de/manual-%(version)s.html#central:license" target="_blank">UCS manual</a>.</p>
fr: <p>Les détails sur l'activation d'une licence UCS se trouvent dans le <a href="https://docs.software-univention.de/manual-%(version)s.html#central:license" target="_blank">manuel d'UCS</a>.</p>

source: <p>Leave the field empty to perform the activation at a later point in time via the user menu in top right corner.</p>
fr: <p>Laissez ce champ vide pour activer ultérieurement par le biais du menu utilisateur dans le coin en haut à droite.</p>

source: <p>On UCS evaluation systems, anonymous usage statistics are created by default and sent to Univention. This allows to continuously adapt UCS to suit the practical needs of its users.</p><p>The information consists of UMC usage statistics and a one-time statistic on the hardware configuration. Details about the usage statistics and about its deactivation can be found in the <a href="https://docs.software-univention.de/manual-%(version)s.html#central-management-umc:piwik" target="_blank">UCS manual</a>.</p><p>Usage statistics are automatically deactivated when importing a commercial license.</p>
fr: <p>Sur les systèmes d'évaluation d'UCS, des statistiques d'utilisation anonymes sont créées par défaut et envoyées à Univention. Ceci permet d'adapter de manière continue UCS aux besoins de ses utilisateurs.</p><p>Ces informations comportent des statistiques d'utilisation d'UMC et une statistique unique sur la configuration du matériel. Les détails des statistiques d'utilisation et leur possible désactivation sont décrits dans le <a href="https://docs.software-univention.de/manual-%(version)s.html#central-management-umc:piwik" target="_blank">manuel d'UCS</a>.</p><p>Les statistiques d'utilisation sont désactivées automatiquement lorsque vous importez une licence commerciale.</p>

source: <p>The license has been updated successfully.</p><p>You can now continue to use UMC, all applications in the Univention App Center are now available for installation on this system.</p>
fr: <p>La licence a été correctement mise à jour.</p><p>Vous pouvez maintenant continuer à utiliser UMC, toutes les applications de Univention App Center peuvent être installées sur ce système.</p>

source: <p>You may now enter a valid e-mail address in order to activate the UCS system to use the App Center. In the next step you can upload the license file that has been sent to your email address.</p>
fr: <p>Vous pouvez maintenant saisir une adresse électronique valide afin d'activer le système UCS et d'utiliser App Center. Vous pourrez envoyer le fichier de licence qui vous a été transmis au cours de l'étape suivante.</p>

source: About UMC
fr: À propos de UMC

source: Activation of Univention Corporate Server
fr: Activation de Univention Corporate Server

source: Add to favorites
fr: Ajouter aux favoris

source: Close
fr: Fermer

source: Could not load module "%s".
fr: Impossible de charger le module « %s ».

source: Date of expiry of the SSL certificate for this system
fr: Date d'expiration du certificat SSL de ce système

source: Date of expiry of the SSL root certificate
fr: Date d'expiration du certificat SSL racine

source: E-mail address
fr: Adresse électronique

source: Enable one-time statistic on hardware configuration.
fr: Activer les statistiques collectées une seule fois sur la configuration du matériel.

source: Feedback via usage statistics
fr: Retour par le biais des statistiques d'utilisation

source: Further Information
fr: Informations supplémentaires

source: Importing license data...
fr: Importation des données de la licence...

source: License import
fr: Importation de licence

source: No valid e-mail address.
fr: Pas d'adresse électronique valide.

source: Open module
fr: Ouvrir le module

source: Remove from favorites
fr: Supprimer des favoris

source: SSL host certificate
fr: Certificat SSL de l'hôte

source: SSL root certificate
fr: Certificat SSL racine

source: Search query ›%s‹
fr: Requête de recherche ›%s‹

source: Send license
fr: Envoyer la licence

source: Sending activation email...
fr: Envoi du message d'activation...

source: Server
fr: Serveur

source: Server error message:
fr: Message d'erreur du serveur :

source: The %(certificate)s will expire in %(days)d days and should be renewed!
fr: Le %(certificate)s expirera dans %(days)d jours et doit être renouvelé !

source: The import of the license failed. Check the integrity of the original file given to you.
fr: Échec d'importation de la licence. Veuillez vérifier l'intégrité du fichier original qui vous a été transmis.

source: There is no module available for the authenticated user %s.
fr: Aucun module disponible pour l'utilisateur authentifié %s.

source: UCS Version
fr: Version d'UCS

source: UMC Version
fr: Version d'UMC

source: Updating session data...
fr: Actualisation des données de session...

source: Upload license file...
fr: Envoyer un fichier de licence...

source: Usage statistics
fr: Statistiques d'utilisation

source: You may as well import the license file at a later point in time via the user menu in the top right.
fr: Vous pouvez importer ultérieurement le fichier de licence par le biais du menu utilisateur en haut à droite.
