Repository: univention/univention-corporate-server
Catalog: management/univention-directory-manager-modules/modules/univention/admin/handlers/settings/*.po
Languages: de

source: A bitfield to indicate complexity and storage restrictions.
de: Ein Bitfeld um Komplexität und Speicherbeschränkungen anzuzeigen.

source: A longer descriptive text, which is shown as a bubble-help in the UMC
de: Ein längerer Beschreibungstext, der in der UMC als Popup-Hilfe angezeigt wird.

source: A short descriptive text which is used as label in the UMC
de: Kurze Beschreibung, die in der UMC als Label verwendet wird.

source: A value for this extended attribute is required and must be given
de: Wert ist erforderlich und muss eingegeben werden

source: ACL data
de: ACL-Daten

source: ACL file name
de: Dateiname der ACL

source: ACL name
de: Name der ACL

source: Account
de: Konto

source: Account deactivation
de: Kontodeaktivierung

source: Account settings
de: Kontoeinstellungen

source: Activated
de: Aktiviert

source: Active
de: Aktiv

source: Add an empty value to choice list
de: Einen leeren Wert zur Auswahlliste hinzufügen

source: Additional e-mail addresses for which e-mails will be delivered to the "Primary e-mail address". The domain must be one of the UCS hosted e-mail domains.
de: Zusätzliche E-Mail Adresse, für die E-Mails zur "Primären E-Mail-Addresse (Mailbox)" gesendet werden. Die Domäne muss eine der von UCS gehosteten E-Mail Domänen sein.

source: Advanced
de: Erweitert

source: An LDAP attribute is required of which the information will be stored.
de: Ein LDAP-Attribut wird benötigt, dessen Information gespeichert werden soll.

source: App identifier
de: App-Kennung

source: Appearance
de: Erscheinung

source: Application
de: Anwendung

source: Attribute layout
de: Attributdarstellung

source: Authorization
de: Authorisation

source: Background
de: Hintergrund

source: Background image of the Portal
de: Hintergrundbild des Portals

source: Bad Lockout Attempts
de: Fehlgeschlagene Anmeldeversuche vor Aussperrung

source: Bad lockout attempts
de: Fehlgeschlagene Anmeldeversuche vor Aussperrung

source: Base DN
de: Basis-DN

source: Base DN the license is valid for
de: Für diesen Basis-DN ist die Lizenz gültig.

source: Basic settings
de: Grundeinstellungen

source: Basic values
de: Grundeinstellungen

source: Browser tab when opening link
de: Browser-Tab beim Öffnen des Links

source: Business
de: Geschäftlich

source: CSS background
de: CSS Hintergrund

source: Category
de: Kategorie

source: Category options
de: Optionen für Kategorie

source: Change password on next login
de: Passwort bei der nächsten Anmeldung ändern

source: City
de: Stadt

source: Computer Link
de: Rechnerverweis

source: Computer Links
de: Rechnerverweise

source: Configuration Name
de: Konfigurationsname

source: Configuration of LDAP object class and LDAP attribute
de: Konfiguration der LDAP-Objektklasse und des LDAP-Attributs

source: Configuration of the modules to be extended
de: Konfiguration der zu erweiternden Module

source: Connection
de: Verbindung

source: Contact
de: Kontakt

source: Contact Information
de: Kontaktinformationen

source: Copyable
de: Kopierbar

source: Country
de: Land

source: DHCP Link
de: DHCP-Verweis

source: DHCP Links
de: DHCP-Verweise

source: DNS Link
de: DNS-Verweis

source: DNS Links
de: DNS-Verweise

source: DVS users
de: DVS-Benutzerkonten

source: Data Type
de: Datentyp

source: Data type
de: Datentyp

source: Data type definition
de: Datentyp-Definition

source: Default
de: Vorgabewert

source: Default Group for Client Computers
de: Standardgruppe für Clients

source: Default Group for Computers
de: Standard Rechnergruppe

source: Default Group for Managed Nodes
de: Standardgruppe für Managed Nodes

source: Default Group for Primary and Backup Directory Nodes
de: Standardgruppe für Primary and Backup Directory Nodes

source: Default Group for Replica Directory Nodes
de: Standardgruppe für Replica Directory Nodes

source: Default KDE Profiles
de: Standard KDE-Profile

source: Default Primary Group
de: Standard Primärgruppe

source: Default browser tab for portal entries
de: Standard Browser-Tab für Portaleinträge

source: Default container
de: Standard-Container

source: Default container description
de: Bezeichnung - Standard-Container

source: Default containers
de: Standard-Container

source: Default long description
de: Ausführliche Beschreibung

source: Default preference
de: Standard Einstellung

source: Default preferences
de: Standard Einstellungen

source: Default settings description
de: Bezeichnung - Vorgabe-Einstellungen

source: Default short description
de: Kurzbeschreibung

source: Default value
de: Vorgabewert

source: Default value which is set for this extended attribute when a new object is created
de: Standardwert, der für dieses erweiterte Attribut gesetzt wird, wenn ein neues Objekt erstellt wird.

source: Defines a specific flavor of the UMC module. If given the operations are permitted only if the flavor matches.
de: Definiert eine spezielle Variante des UMC-Moduls. Wenn diese angegeben ist, müssen Operationen diese setzen, ansonsten werden sie zurückgewiesen.

source: Defines on which hosts this operations are permitted on. The value can be either a host name (as filename pattern e.g. server1*), a server role (e.g. serverrole:domaincontroller_slave) or a service, which must run on the host, (e.g. service:LDAP). Leaving this empty causes all hosts to be allowed.
de: Definiert, auf welchen Rechnern diese Befehle erlaubt sind. Der Wert kann entweder ein Rechnername (als Dateinamenmuster z.B. server1*), eine Serverrolle (z.B. serverrole:domaincontroller_slave) oder ein Dienst, der auf dem Rechner laufen muss, sein (z.B. service:LDAP). Wenn das Feld leer gelassen wird, sind alle Rechner erlaubt.

source: Delivery office name
de: Name der Poststelle

source: Department number
de: Abteilungsnummer

source: Description
de: Beschreibung

source: Description of the entry. At least one entry; strongly encouraged to have one for en_US
de: Beschreibung des Eintrags. Mindestens ein Wert; insbesondere en_US ist empfohlen

source: Directory Node Computer Link
de: Directory Node-Rechnerverweis

source: Directory Node Computer Links
de: Directory Node-Rechnerverweise

source: Disconnect Time
de: Verbindung trennen nach

source: Disconnect time
de: Verbindung trennen nach

source: Display
de: Anzeige

source: Display Name
de: Anzeigename

source: Display name
de: Anzeigename

source: Display name of the category. At least one entry; strongly encouraged to have one for en_US
de: Anzeigename der Kategorie. Mindestens ein Wert; insbesondere en_US ist empfohlen

source: Displayed Attributes
de: Anzuzeigende Attribute

source: Displayed LDAP Attributes
de: Anzuzeigende LDAP-Attribute

source: Do not show this extended attribute in the UMC
de: Dieses erweiterte Attribut nicht in der UMC anzeigen

source: E-mail address
de: E-Mail-Adresse

source: E-mail address that will be used to create the IMAP/POP3 mailbox and that can be used as login for SMTP/IMAP/POP3 connections. The domain must be one of the UCS hosted e-mail domains.
de: E-Mail Adresse, die verwendet wird um IMAP/POP3 Mailboxen zu erstellen und als Login für SMTP/IMAP/POP3 Verbindungen verwendet werden kann. Die Domäne muss eine der von UCS gehosteten E-Mail Domänen sein

source: E-mail alias address
de: Alternative E-Mail-Adresse

source: Editable
de: Editierbar

source: Editable after creation
de: Nachträglich modifizierbar

source: Employee number
de: Mitarbeiternummer

source: Employee type
de: Mitarbeiterkategorie

source: Enable option by default.
de: Setzt die Option standardmäßig.

source: Entry options
de: Optionen für Eintrag

source: Exclude from UMC search
de: Von der UMC-Suche ausschließen

source: Expiry date
de: Ablaufdatum

source: Extended attribute
de: Erweitertes Attribut

source: Extended attribute description
de: Bezeichnung des erweiterten Attributs

source: Extended attributes
de: Erweiterte Attribute

source: Extended option
de: Erweiterte Option

source: Extended options
de: Erweiterte Optionen

source: Extending the users module is only possible if a default value for a required value is given.
de: Um das Benutzer-Modul zu erweitern, muss für benötigte Werte ein Vorgabewert gesetzt werden.

source: Favorite
de: Favorit

source: Flavor
de: Variante

source: Font color
de: Schriftfarbe

source: GNU message catalog for UMC translations
de: GNU Message Catalog für Übersetzungen

source: GNU message catalog for translations
de: GNU Message Catalog für Übersetzungen

source: General
de: Allgemein

source: General Content
de: Allgemeiner Inhalt

source: General LDAP ACL extension settings
de: Grundeinstellungen - LDAP ACL-Erweiterung

source: General LDAP schema extension settings
de: Grundeinstellungen - LDAP-Schemaerweiterung

source: General Samba configuration settings
de: Grundeinstellungen - Samba-Konfiguration

source: General Samba domain settings
de: Grundeinstellungen - Samba-Domäne

source: General UDM hook settings
de: Grundeinstellungen - UDM-Hook

source: General UDM module settings
de: Grundeinstellungen - UDM-Modul

source: General UDM syntax settings
de: Grundeinstellungen - UDM-Syntax

source: General UMC operation set settings
de: Grundeinstellungen - UMC-Operationen

source: General extended attribute settings
de: Grundeinstellungen - Erweiterte Optionen

source: General extended options settings
de: Grundeinstellungen - Erweiterte Optionen

source: General license settings
de: Grundeinstellungen - Lizenz

source: General lock settings
de: Grundeinstellungen - Sperrung

source: General package list settings
de: Grundeinstellungen - Paketliste

source: General printer URI list settings
de: Grundeinstellungen - Drucker-URI-Liste

source: General printer driver list settings
de: Grundeinstellungen - Druckertreiberliste

source: General prohibited user names settings
de: Grundeinstellungen - Verbotene Benutzernamen

source: General service settings
de: Grundeinstellungen - Dienst

source: General settings
de: Allgemeine Einstellungen

source: General syntax definition settings
de: Grundeinstellungen - Syntax-Definition

source: General user template settings
de: Grundeinstellungen - Benutzervorlage

source: Group Link
de: Gruppenverweis

source: Group Links
de: Gruppenverweise

source: Group Memberships
de: Gruppenmitgliedschaften

source: Group layout
de: Gruppendarstellung

source: Group name
de: Gruppenname

source: Group ordering number
de: Gruppen-Ordnungsnummer

source: Groups
de: Gruppen

source: Headline of the entry. At least one entry; strongly encouraged to have one for en_US
de: Überschrift des Eintrags. Mindestens ein Wert; insbesondere en_US ist empfohlen

source: Headline of the portal. At least one entry; strongly encouraged to have one for en_US
de: Überschrift des Portals. Mindestens ein Wert; insbesondere en_US ist empfohlen

source: Home share
de: Benutzerverzeichnis-Freigabe

source: Home share path
de: Pfad der Benutzerverzeichnis-Freigabe

source: Hook class
de: Hook-Klasse

source: If a tab with the given name already exists, it is replaced by a new tab only containing extended attributes
de: Wenn bereits eine Karteikarte mit diesem Namen existiert, wird sie durch eine Karteikarte ersetzt, die nur erweiterte Attribute enthält.

source: If possible, the LDAP object class is removed when this extended attribute gets unset
de: Entferne die LDAP-Klasse (wenn möglich), wenn dieses erweitere Attribut leer gesetzt wird.

source: In some cases it is useful to overwrite predefined input fields with extended attributes. If the internal UDM name of an attribute is configured here, its input field is overwritten by this extended attribute. The UDM attribute name can only be determined by searching within /usr/lib/python3/dist-packages/univention/admin/handlers directory. It is the name which comes before the colon in the declarations of univention.admin.property objects, e.g., roomNumber for a user's room number
de: In einigen Fällen ist es sinnvoll, vorgegebene Eingabefelder mit erweiterten Attributen zu überschreiben. Wird hier der interne UDM-Name eines Attributs konfiguriert, wird dessen Eingabefeld von diesem erweiterten Attribut überschrieben. Der UDM-Attributname kann nur durch eine Suche unterhalb des Verzeichnisses /usr/lib/python3/dist-packages/univention/admin/handlers ermittelt werden. Es handelt sich dabei um den Namen, der in den Deklarationen von univention.admin.property-Objekten vor dem Doppelpunkt steht, z.B. roomNumber für die Raumnummer eines Benutzers.

source: Initials
de: Initialen

source: Internal name
de: Interner Name

source: Is not based on the user's account name. Contains at least six characters. Contains characters from three of the following four categories: Uppercase alphabet characters (A-Z), Lowercase alphabet characters (a-z), Arabic numerals (0-9), Nonalphanumeric characters (for example, !$#,%)
de: Es darf weder wesentliche Teile des Kontonamens des Benutzers noch den vollständigen Kontonamen enthalten. Es muss mindestens sechs Zeichen lang sein. Es muss Zeichen aus drei der vier folgenden Kategorien enthalten: Großbuchstaben von A bis Z, Kleinbuchstaben von A bis Z, Ziffern der Basis 10 (0 bis 9), Andere als alphabetische Zeichen (z. B. !, $, #, %)

source: KDE Profiles
de: KDE-Profile

source: Key ID of this license.
de: Key ID der Lizenz

source: LDAP ACL Extension
de: LDAP ACL Erweiterung

source: LDAP ACL Extensions
de: LDAP ACL Erweiterungen

source: LDAP Base
de: LDAP Basis

source: LDAP Schema Extension
de: LDAP-Schemaerweiterung

source: LDAP Schema Extensions
de: LDAP-Schemaerweiterungen

source: LDAP Search Filter
de: LDAP Suchfilter

source: LDAP attribute
de: LDAP-Attribut

source: LDAP mapping
de: LDAP-Abbildung

source: LDAP object class
de: LDAP-Objektklasse

source: License
de: Lizenz

source: License Expiration Date
de: Lizenz-Ablaufdatum

source: License Link
de: Lizenzverweis

source: License Links
de: Lizenzverweise

source: Licenses
de: Lizenzen

source: Licensing Information
de: Lizenz-Informationen

source: List of Operations for UMC
de: Liste von UMC-Operationen

source: List of Packages for UCS Systems
de: Paketliste für UCS-Systeme

source: List of UMC command names or patterns
de: Liste von UMC-Kommando- und Optionenmuster

source: List of URIs for printers
de: Liste von Drucker-URIs

source: List of drivers for printers
de: Druckertreiberliste

source: List of modules this option applies to.
de: Liste der Module, auf die diese Option angewandt wird.

source: Lock
de: Sperrobjekt

source: Lock Information
de: Informationen über die Sperrung

source: Lock Time
de: Sperrzeit

source: Lock objects
de: Sperrobjekte

source: Locked until
de: Gesperrt bis

source: Locking and deactivation
de: Konto-Deaktivierung

source: Lockout Duration Minutes
de: Dauer der Aussperrung

source: Lockout duration minutes
de: Dauer der Aussperrung

source: Locks
de: Sperrobjekte

source: Logo image for the portal.
de: Logo Bild für das Portal.

source: Long Description
de: Ausführliche Beschreibung

source: Long description
de: Ausführliche Beschreibung

source: Long description for the option as shown on the Option tab.
de: Lange Beschreibung für die Option, wie sie im Optionen-Reiter angezeigt wird.

source: Mail Link
de: Mailverweis

source: Mail Links
de: Mailverweise

source: Manage anonymous visitors
de: Anonyme Besucher verwalten

source: Mapping to LDAP objectClasses
de: Abbildung auf LDAP-Objektklassen

source: Max. groupware accounts
de: Max. Groupware-Konten

source: Max. user accounts
de: Max. Benutzerkonten

source: Maximal UCS version
de: Maximale UCS-Version

source: Maximum Password Age
de: Maximales Passwortalter

source: Maximum number of DVS clients this license allows.
de: Maximale Anzahl von DVS-Clients, die mit dieser Lizenz erlaubt sind.

source: Maximum number of DVS users this license allows.
de: Maximale Anzahl von DVS-Benutzerkonten, die mit dieser Lizenz erlaubt sind.

source: Maximum number of Univention desktop accounts managed with the UCS infrastructure
de: Maximale Anzahl von Desktop-Rechnern, die mit der UCS Infrastruktur verwaltet werden.

source: Maximum number of client hosts managed with the UCS infrastructure
de: Maximale Anzahl von Client-Rechnern, die mit der UCS Infrastruktur verwaltet werden.

source: Maximum number of corporate clients this license allows.
de: Maximale Anzahl von Corporate Clients, die mit dieser Lizenz erlaubt sind.

source: Maximum number of groupware accounts managed with the UCS infrastructure
de: Maximale Anzahl von Groupware-Konten, die mit der UCS Infrastruktur verwaltet werden.

source: Maximum number of managed clients this license allows.
de: Maximale Anzahl von Managed Clients, die mit dieser Lizenz erlaubt sind.

source: Maximum number of servers this license allows.
de: Maximale Anzahl von Servern, die mit dieser Lizenz erlaubt sind.

source: Maximum number of user accounts managed with the UCS infrastructure
de: Maximale Anzahl von Benutzerkonten, die mit der UCS Infrastruktur verwaltet werden.

source: Maximum number of users this license allows.
de: Maximale Anzahl von Benutzerkonten, die mit dieser Lizenz erlaubt sind.

source: Maximum password age
de: Maximales Passwortalter

source: Message when the portal is empty
de: Nachricht, wenn das portal leer ist

source: Metadata
de: Metadaten

source: Minimal UCS version
de: Minimale UCS-Version

source: Minimum Password Age
de: Minimales Passwortalter

source: Minimum password age
de: Minimales Passwortalter

source: Module
de: Modul

source: Module the license is valid for
de: Für dieses Modul ist die Lizenz gültig.

source: Modules this extended attribute is added to, e.g. "users/user" or "computers/windows"
de: Module, zu denen dieses erweiterte Attribute hinzugefügt wird, z.B "users/user" oder "computers/windows"

source: Modules to be extended
de: Zu erweiternde Module

source: Multi value
de: Mehrfachwert

source: Name of a Python class implementing the univention.admin.hook interface, which can be used to execute additional actions when an object is created, modified or deleted
de: Name einer Python-Klasse, die das univention.admin.hook interface implementiert und dazu benutzt werden kann, zusätzliche Aktionen auszuführen, wenn ein Objekt erstellt, modifiziert oder gelöscht wird.

source: Name of the tab in the UMC on which this extended attribute is be placed. A new tab is created automatically if no tab with the name exists
de: Name der Karteikarte in der UMC, auf der dieses erweiterte Attribut platziert wird. Eine neue Karteikarte wird erstellt, wenn noch keine Karteikarte mit diesem Namen existiert.

source: Name which by default is used by UDM CLI and internally to identify the extended attribute
de: Name, der standardmäßig vom UDM-CLI und intern zur Identifizierung des erweiterten Attributs verwendet wird.

source: Needed module
de: Benötigtes Modul

source: Network Link
de: Netzverweis

source: Network Links
de: Netzverweise

source: Next RID
de: Nächste RID

source: Next group RID
de: Nächste Gruppen-RID

source: Next user RID
de: Nächste Benutzer-RID

source: Not a valid filename for umcmessagecatalog. It must match "$language-$moduleid.mo" (e.g. "de-udm-foo.mo")
de: Kein gültiger Dateiname für umcmessagecatalog. Es muss "$language-$moduleid.mo" (z.B. "de-udm-foo.mo") entsprechen.

source: OEM Product types this license allows.
de: OEM-Produkttypen, für die die vorliegenden Lizenz gültig ist.

source: Object that feeds everything in https://fqdn/univention/portal
de: Objekt für die Anzeige in https://fqdn/univention/portal

source: Object under which settings/portal_entry objects can be displayed
de: Objekt, unter dem settings/portal_entry Objekte angezeigt werden können.

source: One link in https://fqdn/univention/portal. Belongs to one (or more) settings/portal
de: Ein Eintrag in https://fqdn/univention/portal. Gehört zu einem (oder mehreren) settings/portal

source: Option may be repeatedly turned on and off.
de: Die Option kann wiederholt gesetzt und entfernt werden.

source: Options
de: Optionen

source: Options for extended attributes
de: Optionen für erweiterte Attribute

source: Ordering number
de: Ordnungsnummer

source: Overwrite existing tab
de: Existierende Karteikarte überschreiben

source: Overwrite existing widget
de: Existierendes Eingabefeld überschreiben

source: Package List
de: Paketliste

source: Package Lists
de: Paketlisten

source: Password
de: Passwort

source: Password History
de: Passwort-History

source: Password Length
de: Passwort-Länge

source: Password history
de: Passwort-History

source: Password length
de: Passwort-Länge

source: Password properties
de: Passwort-Eigenschaften

source: Passwords must meet complexity requirements
de: Kennwort muss Komplexitätsvoraussetzungen entsprechen

source: Path to the home directory on the home share
de: Relativer Pfad der Benutzerverzeichnis-Freigabe

source: Personal information
de: Persönliche Informationen

source: Policy Link
de: Richtlinienverweis

source: Policy Links
de: Richtlinienverweise

source: Portal categories
de: Portal-Kategorien

source: Portal categories and entries
de: Portal-Kategorien und -Einträge

source: Portal category
de: Portal-Kategorie

source: Portal content
de: Portal-Kontent

source: Portal entries
de: Portaleinträge

source: Portal entries order
de: Reihenfolge Portaleinträge

source: Portal entry
de: Portal-Eintrag

source: Portal options
de: Optionen für Portal

source: Portal: Category
de: Portal: Kategorie

source: Portal: Entry
de: Portal: Eintrag

source: Portal: Settings
de: Portal: Einstellungen

source: Portals
de: Portale

source: Post office box
de: Postfach

source: Postal code
de: Postleitzahl

source: Preference
de: Einstellung

source: Preferences
de: Einstellungen

source: Preferences: Default
de: Einstellungen: Vorgabe

source: Preferences: Default Container
de: Einstellungen: Standard-Container

source: Preferred delivery method
de: Bevorzugte Liefermethode

source: Preferred language
de: Bevorzugte Sprache

source: Primary Groups
de: Primäre Gruppen

source: Primary e-mail address (mailbox)
de: Primäre E-Mail-Adresse (Mailbox)

source: Primary group
de: Primäre Gruppe

source: Printer Driver List
de: Druckertreiberliste

source: Printer Driver Lists
de: Druckertreiberlisten

source: Printer Link
de: Druckerverweis

source: Printer List
de: Druckerliste

source: Printer Model
de: Druckermodell

source: Printer URI
de: Drucker-URI

source: Printer URI List
de: Drucker-URI-Liste

source: Printer URI Lists
de: Drucker-URI-Listen

source: Printers Links
de: Druckerverweise

source: Product type
de: Gültige Produkttypen

source: Product type this license allows.
de: Produkttypen, für die die vorliegenden Lizenz gültig ist.

source: Product types this license allows.
de: Produkttypen, für die die vorliegenden Lizenz gültig ist.

source: Prohibited user name
de: Verbotener Benutzername

source: Prohibited user names
de: Verbotene Benutzernamen

source: Put this extended attribute under "Advanced settings". No autonomous tab will be created
de: Das erweiterte Attribut wird unter "Erweiterte Einstellungen" untergebracht. Es wird keine eigenständige Karteikarte für das erweiterte Attribut angelegt.

source: Redirect anonymous visitors to the login
de: Anonyme Besucher zum Login umleiten

source: Refuse Machine Password Change
de: Änderung des Rechnerpasswortes ablehnen

source: Refuse machine password change
de: Änderung des Rechnerpasswortes ablehnen

source: Related properties can be grouped. This field specifies the name of the group in which this extended attribute is put in. If no name is given, no group is used
de: Zusammenhängende Attribute können gruppiert werden. Dieses Feld gibt den Name der Gruppe an, in welcher dieses erweiterte Attribut platziert wird. Wenn kein Name gegeben wird, wird keine Gruppe verwendet.
