Repository: univention/univention-corporate-server
Catalog: management/univention-directory-manager-modules/modules/univention/admin/handlers/settings/*.po
Languages: de

source: Remove object class if the attribute is removed
de: Objektklasse löschen, wenn das Attribut entfernt wird

source: Required options
de: Benötigte Optionen

source: Reset Count Minutes
de: Fehlgeschlagene Anmeldeversuche zurücksetzen nach

source: Reset count minutes
de: Fehlgeschlagene Anmeldeversuche zurücksetzen nach

source: Restrict to host
de: Auf Rechner beschränken

source: Restrict visibility to groups
de: Sichtbarkeit auf Gruppen beschränken

source: Room number
de: Raumnummer

source: Samba Configuration
de: Samba-Konfiguration

source: Samba Configuration settings
de: Samba-Konfigurationseinstellungen

source: Samba Domain
de: Samba-Domänenname

source: Samba Domains
de: Samba-Domänennamen

source: Samba domain name
de: Samba-Domänenname

source: Schema data
de: Schema-Daten

source: Schema file name
de: Dateiname des LDAP-Schemas

source: Schema name
de: Name des LDAP-Schemas

source: Servers
de: Server

source: Servers with premium support.
de: Server mit Premiumsupport

source: Servers with standard support
de: Server mit Standardsupport

source: Servers with standard support.
de: Server mit Standardsupport

source: Service
de: Dienstname

source: Service Name
de: Dienstname

source: Services
de: Dienste

source: Settings for UMC
de: UMC-spezifische Einstellungen

source: Settings: Extended attribute
de: Einstellungen: Erweitertes Attribut

source: Settings: Extended option
de: Einstellungen: Erweiterte Option

source: Settings: LDAP ACL Extension
de: Einstellungen: LDAP ACL Erweiterung

source: Settings: LDAP Schema Extension
de: Einstellungen: LDAP-Schemaerweiterung

source: Settings: License
de: Einstellungen: Lizenz

source: Settings: Lock
de: Einstellungen: Sperrung

source: Settings: Package List
de: Einstellungen: Paketliste

source: Settings: Printer Driver List
de: Einstellungen: Druckertreiberliste

source: Settings: Printer URI List
de: Einstellungen: Drucker-URI-Liste

source: Settings: Prohibited user names
de: Einstellungen: Verbotene Benutzernamen

source: Settings: Samba Configuration
de: Einstellungen: Samba-Konfiguration

source: Settings: Samba Domain
de: Einstellungen: Samba-Domäne

source: Settings: Service
de: Einstellungen: Dienst

source: Settings: Syntax Definition
de: Einstellungen: Syntax-Definition

source: Settings: UDM Hook
de: Einstellungen: UDM Hook

source: Settings: UDM Module
de: Einstellungen: UDM Modul

source: Settings: UDM Syntax
de: Einstellungen: UDM Syntax

source: Settings: UMC operation set
de: Einstellungen: UMC-Operationen

source: Settings: User Template
de: Einstellungen: Benutzervorlage

source: Share Link
de: Freigabenverweis

source: Share, the user's home directory resides on
de: Freigabe, auf der sich das Heimatverzeichnis des Benutzers befindet

source: Shares Links
de: Freigabenverweise

source: Short description
de: Kurzbeschreibung

source: Short description for the option as shown on the Option tab.
de: Kurze Beschreibung für die Option, wie sie im Optionen-Reiter angezeigt wird.

source: Show Only
de: Nur anzeigen

source: Show apps
de: Apps anzeigen

source: Show login
de: Login anzeigen

source: Show menu
de: Menü anzeigen

source: Show on server
de: Auf Server anzeigen

source: Show search
de: Suche anzeigen

source: Show servers
de: Server anzeigen

source: Shown in the favorite section
de: In der Rubrik Favoriten zu sehen

source: Shown on portals
de: Gezeigt in Portalen

source: Shows links to all UCS servers
de: Links zu allen UCS-Servern zeigen

source: Shows links to locally installed Apps
de: Links zu lokale installierten Apps anzeigen

source: Signature
de: Signatur

source: Software package
de: Softwarepaket

source: Software package version
de: Version des Softwarepakets

source: Span both columns
de: Beide Spalten umfassen

source: Specifies that the option belongs to a UCS Application
de: Spezifiziert, dass die Option zu einer UCS-Anwendung gehört

source: Storage
de: Speicherung

source: Store plaintext passwords
de: Kennwort mit umkehrbarer Verschlüsselung speichern

source: Store plaintext passwords where account have "store passwords with reversible encryption" set.
de: Klartext Passwörter speichern, falls am Benutzerkonto "Kennwort mit umkehrbarer Verschlüsselung speichern" gesetzt ist.

source: Stored Attribute
de: Zu speicherndes Attribut

source: Stored LDAP Attribute
de: Zu speicherndes LDAP-Attribut

source: Street
de: Straße

source: Superior
de: Vorgesetzter

source: Syntax Definitions
de: Syntax-Definitionen

source: Syntax Description
de: Kurzbeschreibung

source: Syntax class
de: Syntax-Klasse

source: Tab layout
de: Karteikartendarstellung

source: Tab name
de: Name der Karteikarte

source: Tab with advanced settings
de: Karteikarte mit erweiterten Einstellungen

source: Telephone number
de: Telefonnummer

source: Template name
de: Name der Vorlage

source: The ABI number used by this extended attribute
de: Die von diesem erweiterten Attribut verwendete ABI-Nummer

source: The categories and entries that are shown on this portal
de: Die Kategorien und Einträge, die auf diesem Portal angezeigt werden

source: The categories are displayed side by side if there is enough space
de: Die Kategorien werden nebeneinander angezeigt, wenn genügend Platz vorhanden ist

source: The description
de: Kurzbeschreibung

source: The extended attribute is not shown in the UMC. It can only be used from the UDM CLI or the Python interface
de: Dieses erweiterte Attribut wird nicht in der UMC angezeigt. Es kann dann nur per UDM-CLI das Python-Interface verwendet werden

source: The layout element used to represent this extended attribute in the UMC spans both columns
de: Das Layoutelement welches verwendet wird um dieses erweiterte Attribut darzustellen erstreckt sich über beide Spalten

source: The name for the extended attribute as used by UDM CLI
de: Der vom UDM-CLI zu verwendende Name für dieses erweiterte Attribut

source: This Signature is used to verify the authenticity of the license.
de: Diese Signatur wird verwendet, um die Authentizität der Lizenz zu überprüfen.

source: This e-mail address serves only as contact information. This address has no effect on the UCS mail stack and is not related to a local mailbox.
de: Diese E-Mail Adresse dient nur zur Kontaktinformation. Sie hat keinen Einfluss auf den UCS Mail Stack und hat nichts mit der Mailbox zu tun.

source: This extended attribute can not be changed through UMC or UDM CLI, but only through the Python API or by hooks
de: Dieses erweiterte Attribut kann nicht über die UMC oder UDM-CLI geändert werden, sondern nur über die Python API und Hooks

source: This extended attribute can still be modified after the object has been created
de: Dieses erweiterte Attribute kann noch modifiziert werden nach dem das Objekt angelegt wurde

source: This extended attribute can store multiple values instead of only a single value
de: Dieses erweiterte Attribut kann mehrere Werte anstatt nur eines Wertes speichern

source: This extended attribute is only used when at least one of these options is enabled, e.g. "posix" or "samba"
de: Dieses erweiterte Attribut wird nur verwendet wenn eine dieser Optionen aktiviert ist, z.B. "posix" oder "samba"

source: This number specifies the position on which this extended attributes is placed on the tab or in the group. The numeration starts at 1
de: Diese Nummer legt die Position fest an welcher dieses erweiterte Attribut auf der Karteikarte oder in der Gruppe platziert wird. Die Nummerierung beginnt bei 1

source: This number specifies the position on which this group is placed on the tab. The numbering starts at 1
de: Position an der diese Gruppe auf der Karteikarte platziert wird. Die Nummerierung beginnt bei 1

source: Title
de: Anrede

source: Translations of group name
de: Übersetzung des Gruppennames

source: Translations of long description
de: Übersetzungen der ausführlichen Beschreibung

source: Translations of short description
de: Übersetzungen der Kurzbeschreibung

source: Translations of tab name
de: Übersetzung des Karteikartennamens

source: Translations of the group name for other languages
de: Übersetzung des Gruppennamens in andere Sprachen

source: Translations of the long description for the option as shown on the Option tab
de: Übersetzung der langen Beschreibung, wie sie im Optionen-Reiter angezeigt wird.

source: Translations of the long descriptive text for other languages
de: Übersetzungen des langen Beschreibungstextes in andere Sprachen

source: Translations of the name of the tab for other languages
de: Übersetzung des Namens der Karteikarte in andere Sprachen

source: Translations of the short description for other languages
de: Übersetzungen der Kurzbeschreibung in andere Sprachen

source: Translations of the short description for the option as shown on the Option tab
de: Übersetzung der kurzen Beschreibung, wie sie im Optionen-Reiter angezeigt wird.

source: UCS Version Dependencies
de: UCS-Versionsabhängigkeiten

source: UDM Module
de: UDM-Modul

source: UDM Modules
de: UDM-Module

source: UDM Syntaxes
de: UDM Syntaxen

source: UDM hook data
de: UDM Hook-Daten

source: UDM hook file name
de: Dateiname des UDM Hooks

source: UDM hook name
de: Name des UDM Hooks

source: UDM module data
de: UDM Moduldaten

source: UDM module file name
de: Dateiname des UDM Moduls

source: UDM module name
de: Name des UDM Moduls

source: UDM syntax data
de: UDM Syntaxdaten

source: UDM syntax file name
de: Dateiname der UDM Syntax

source: UDM syntax name
de: Name der UDM Syntax

source: UMC Operation Set
de: UMC-Befehlssatz

source: UMC commands
de: UMC-Kommandos

source: UMC operation set
de: UMC-Befehlssatz

source: UMC operation sets
de: UMC-Befehlssätze

source: UMC registration data
de: UMC-Registrierungsdaten

source: Unique name
de: Eindeutiger Name

source: Univention Corporate Server provides its own LDAP scheme for customer extensions. The LDAP object class univentionFreeAttributes can be used for extended attributes without restrictions. It offers 20 freely usable attributes (univentionFreeAttribute1 to univentionFreeAttribute20) and can be used in connection with any LDAP object (e.g., a user object)
de: Univention Corporate Server bringt ein eigenes LDAP-Schema für Kundenerweiterungen mit. Die LDAP-Objektklasse univentionFreeAttributes kann ohne Einschränkungen für erweiterte Attribute verwendet werden. Sie bringt 20 frei zu verwendende Attribute (univentionFreeAttribute1 bis univentionFreeAttribute20) mit und kann in Verbindung mit jedem beliebigen LDAP-Objekt (z.B. einem Benutzerobjekt) verwendet werden.

source: Univention License
de: Univention Lizenz

source: Univention Prohibited user names
de: Univention Verbotene Benutzernamen

source: Univention Setting
de: Univention-Einstellung

source: Univention Settings
de: Univention-Einstellungen

source: Unix home directory
de: UNIX-Heimatverzeichnis

source: User Link
de: Benutzerverweis

source: User Links
de: Benutzerverweise

source: User Template
de: Benutzervorlage

source: User Templates
de: Benutzervorlagen

source: User account
de: Benutzerkonto

source: User must Logon to Change Password
de: Änderung des Passwortes erfordert Anmeldung

source: User must logon to change password
de: Änderung des Passwortes erfordert Anmeldung

source: Users
de: Benutzer

source: Valid OEM product types
de: Gültige OEM Produkttypen

source: Valid product types
de: Gültige Produkttypen

source: Value is only managed internally
de: Wert wird nur intern verwaltet

source: Value required
de: Wert wird benötigt

source: Values of this extended attribute are automatically filled into the form when copying a object.
de: Werte dieses erweiterten Attributs werden beim Kopieren eines Objekts automatisch in das Formular eingesetzt.

source: Values of this extended attribute are not available for searching in the UMC
de: Nach Werten dieses erweiterten Attributs kann nicht in der UMC gesucht werden

source: Version 1 license
de: Univention Lizenz Version 1

source: Version 1 license informations
de: Lizenz-Informationen Version 1

source: Version 2 license
de: Univention Lizenz Version 2

source: Version 2 license informations
de: Lizenz-Informationen Version 2

source: Version format of this license.
de: Version dieser Lizenz

source: Version of extended attribute
de: Version des erweiterten Attributs

source: When values are entered, the UMC performs a syntax check. Apart from standard syntax definitions (string) and (integer), there are three possibilities for expressing a binary condition. The syntax TrueFalse is represented at LDAP level using the strings true and false, the syntax TrueFalseUpper corresponds to the OpenLDAP boolean values TRUE and FALSE and the syntax boolean does not save any value or the string 1
de: Bei der Eingabe von Werten nimmt die UMC eine Syntaxprüfung vor. Neben Standard-Syntaxdefinitionen für Zeichenketten (string), Zahlen (integer) gibt es drei Möglichkeiten einen binären Zustand auszudrücken: Die Syntax TrueFalse wird auf LDAP-Ebene durch die Zeichenketten true und false abgebildet, die Syntax TrueFalseUpper verwendet dagegen die Werte TRUE und FALSE. Die Syntax boolean dagegen speichert keinen Wert bzw. die Zeichenkette 1

source: Windows home drive
de: Laufwerk des Benutzerverzeichnises

source: Windows home path
de: Windows-Home-Verzeichnis

source: Windows logon path
de: Windows-Logon-Pfad

source: Windows profile directory
de: Profilverzeichnis

source: packageversion: Version must not be lower than the current one.
de: Paketversion: Der Wert darf nicht geringer sein als der aktuelle.
