Repository: univention/univention-corporate-server
Catalog: management/univention-management-console-module-udm/umc/*.po
Languages: de

source: Browsing and managing the LDAP tree
de: Durchsuchen und Verwalten des LDAP-Verzeichnisbaums

source: Change settings for the user currently logged in
de: Änderung der Benutzereinstellungen des angemeldeten Benutzers

source: Computers
de: Rechner

source: Configuration of DHCP settings in the domain
de: Konfiguration von DHCP-Einstellungen der Domäne

source: Configuration of DNS settings in the domain
de: Konfiguration von DNS-Einstellungen der Domäne

source: Configuration of Nagios settings in the domain
de: Konfiguration von Nagios-Einstellungen der Domäne

source: Configuration of network settings in the domain
de: Konfiguration von Netzwerkeinstellungen der Domäne

source: Contacts
de: Kontakte

source: Groups
de: Gruppen

source: Import new license
de: Neue Lizenz importieren

source: LDAP directory
de: LDAP-Verzeichnis

source: Mail
de: E-Mail

source: Management of computers in the domain
de: Verwaltung von Rechnern in der Domäne

source: Management of contacts
de: Verwaltung von Kontakten

source: Management of directory shares in the domain
de: Verwaltung von Verzeichnisfreigaben in der Domäne

source: Management of domain users
de: Verwaltung von Benutzern in der Domäne

source: Management of domain wide policies
de: Verwaltung von domänenweiten Richtlinien

source: Management of mail domains and mailing lists
de: Verwaltung von Mail-Domänen und Mailing-Listen

source: Management of portals and their entries
de: Verwaltung von Portalen und Portaleinträgen

source: Management of printers and printer groups in the domain
de: Verwaltung von Druckern und Druckergruppen in der Domäne

source: Management of user and computer groups in the domain
de: Verwaltung von Benutzer- und Rechnergruppen in der Domäne

source: Manages all UDM modules
de: Verwaltet alle UDM-Module

source: Networks
de: Netzwerke

source: Policies
de: Richtlinien

source: Portal settings
de: Portaleinstellungen

source: Printers
de: Drucker

source: Shares
de: Freigaben

source: UCS license import
de: UCS-Lizenz-Import

source: User settings
de: Benutzereinstellungen

source: Users
de: Benutzer

source: computers
de: Rechner

source: contacts
de: Kontakte

source: groups
de: Gruppen

source: ldap,directory,udm
de: LDAP,Verzeichnis,UDM

source: networks
de: Netzwerke

source: policy,policies
de: Richtlinien

source: printers
de: Drucker

source: shares
de: Freigaben

source: user,password
de: Benutzer,Passwort

source: users
de: Benutzer

source: UCS license request
de: UCS-Lizenz-Anfrage

source: Request new license
de: Neue Lizenz anfordern
