Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-join/umc/js/*.po
Languages: fr

source: %d scripts are pending to be run.
fr: %d scripts sont en attente d'exécution.

source: %d scripts selected
fr: %d scripts sélectionnés

source: ... loading log ...
fr: ... journal en cours de chargement ...

source: 1 script selected
fr: 1 script sélectionné

source: <p>Please enter credentials of a user account with administrator rights to run the selected join scripts.</p>
fr: <p>Veuillez saisir les preuves d'identité d'un compte utilisateur qui a les droits d'administrateur permettant d'exécuter les scripts de jonction sélectionnés.</p>

source: A DC master should be joined by the %s.
fr: Un contrôleur de domaine maître doit rejoint par le %s.

source: A join process is already running...
fr: Un processus de jonction est déjà en cours d'exécution...

source: A reboot of the server is recommended after joining the system.
fr: Il est recommandé de redémarrer le serveur après avoir fait rejoindre le système.

source: A restart of the UMC server components may be necessary for changes to take effect.
fr: Un redémarrage des composants du serveur UMC peut être nécessaire pour que les modifications prennent effet.

source: As %(root)s you do not have access to the App Center. For this you need to log in as %(administrator)s.
fr: En tant que %(root)s, vous n'avez pas accès à l'App Center. Pour cela, vous devez vous connecter en tant qu' %(administrator)s.

source: As %(root)s you have neither access to the domain administration nor to the App Center. For this you need to log in as %(administrator)s.
fr: En tant que %(root)s, vous n'avez accès ni à l'administration du domaine, ni à l'App Center. Pour cela, vous devez vous connecter en tant qu' %(administrator)s.

source: Basic settings module
fr: Module de réglages de base

source: Currently, software is being installed or uninstalled. Join scripts should not be run right now.
fr: Un logiciel est actuellement en cours d'installation ou de désinstallation. Ce n'est pas le bon moment pour exécuter des scripts de jonction.

source: Execute
fr: Exécuter

source: Execute all pending join scripts
fr: Exécuter tous les scripts de jonction en attente

source: Executes join scripts which are not properly configured.
fr: Exécute les scripts de jonction qui ne sont pas configurés correctement.

source: Executes this join script
fr: Exécute ce script de jonction

source: Force execute
fr: Forcer l'exécution

source: Forces execution of selected join scripts
fr: Force l'exécution des scripts de jonction sélectionnés

source: Hostname of domain controller master
fr: Nom d'hôte du contrôleur de domaine maître

source: Join error
fr: Erreur de jonction

source: Join log
fr: Journal de jonction

source: Join status ok, nothing to do.
fr: État de jonction OK, rien à faire.

source: Join system
fr: Joindre un système

source: Not all installed components have been registered. Please visit the %s to register the remaining components.
fr: Certains composants installés n'ont pas été enregistrés. Veuillez consulter la page %s pour enregistrer tous les composants restants.

source: One script is pending to be run.
fr: Un script attend d'être exécuté.

source: Only join scripts which are not successfully configured can be executed. To execute the selected scripts anyway the force execution option have to be used.
fr: Seuls les scripts de jonction qui ne sont pas configurés avec succès peuvent être exécutés. Pour exécuter les scripts sélectionnés malgré tout, il faut utiliser l'option d'exécution forcée.

source: Password
fr: Mot de passe

source: Password invalid
fr: Mot de passe non valide

source: Password of the domain administrator
fr: Mot de passe de l'administrateur du domaine

source: Please enter credentials of a user account with administrator rights to join the system.
fr: Veuillez saisir les peuves d'identité d'un compte utilisateur qui a les droits d'administrateur permettant que le système rejoigne le domaine.

source: Rejoin
fr: Rejoindre

source: Rejoin system
fr: Faire rejoindre le système

source: Rejoins the system
fr: Fait rejoindre le système

source: Run
fr: Exécuter

source: Run join scripts
fr: Exécuter les scripts de jonction

source: Script (package)
fr: Script (paquetage)

source: Script name (the same as the package it belongs to)
fr: Nom du script (identique au paquetage auquel il appartient)

source: Show Join status
fr: Afficher l'état de jonction

source: Shows the join log
fr: Afficher le journal de jonction

source: Starting the join process...
fr: Démarrage du processus de jonction...

source: State
fr: État

source: Status of this package
fr: État de ce paquetage

source: The DNS settings can be adjusted in the %s.
fr: Les réglages DNS peuvent être ajustés dans les %s.

source: The following join scripts will be executed:
fr: Les scripts de jonction suivants vont être exécutés :

source: The hostname of the domain controller master of the domain
fr: Le nom d'hôte du contrôleur maître du domaine

source: The join process was successful.
fr: Le processus de jonction a réussi.

source: The join scripts have successfully been executed.
fr: Les scripts de jonction ont été exécutés avec succès.

source: The password may not be empty.
fr: Le mot de passe ne peut pas être vide.

source: The username may not be empty.
fr: Le nom d'utilisateur ne peut pas être vide.

source: The username of the domain administrator
fr: Le nom d'utilisateur de l'administrateur du domaine

source: This page shows the status of all available join scripts on this system, along with all join-related actions.
fr: Cette page affiche l'état de tous les scripts de jonction disponibles sur ce système, ainsi que toutes les actions relatives aux jonctions.

source: Username
fr: Nom d'utilisateur

source: Username invalid
fr: Nom d'utilisateur non valide

source: View join log
fr: Afficher le journal de jonction

source: Warning:
fr: Avertissement :

source: pending
fr: en attente

source: successful
fr: réussi
