Repository: univention/univention-corporate-server
Catalog: management/univention-appcenter/python/*.po
Languages: de

source: Error while contacting Docker registry server %s
de: Fehler bei der Kontaktaufnahme mit dem Docker-Registry-Server %s

source: Manifest checksum mismatch
de: Prüfsumme für das Manifest weicht ab

source: %s could not be downloaded. This seems to be a problem with the App Center server. Please try again later.
de: Konnte %s nicht herunterladen. Das deutet auf ein Problem auf dem App Center-Server hin. Bitte versuchen Sie es später noch einmal.

source: This is a problem with the App Center server. Please try again later.
de: Das ist ein Problem auf dem App Center-Server. Bitte versuchen Sie es später noch einmal.

source: https://docs.software-univention.de/manual-%s.html#ip-config:Web_proxy_for_caching_and_policy_management__virus_scan
de: https://docs.software-univention.de/handbuch-%s.html#ip-config:Web-Proxy_fuer_Caching_und_Policy_Management_Virenscan

source: This may be a problem with the firewall or proxy of your system. You may find help at %s.
de: Dies kann auf ein Problem mit einer auf Ihrem System eingerichteten Firewall oder Proxy hindeuten. Sie finden Hilfe unter %s.

source: https://docs.software-univention.de/manual-%s.html#networks:dns
de: https://docs.software-univention.de/handbuch-%s.html#networks:dns

source: This is probably due to the DNS settings of your server. You may find help at %s.
de: Grund sind wahrscheinlich die DNS-Einstellungen Ihres Servers. Sie finden Hilfe unter %s.

source: The application needs a %(needs)s-bit operating system. This server is running a %(has)s-bit operating system.
de: Die Applikation benötigt ein %(needs)s-Bit-Betriebssystem. Dieser Server läuft mit einem %(has)s-Bit-Betriebssystem.

source: There is a problem with the certificate of the App Center server %s.
de: Es gibt ein Problem mit dem Zertifikat des App Center Servers %s.

source: An error occurred!
de: Es ist ein Fehler aufgetreten!

source: We are sorry for the inconvenience. Please help us to improve the App Center and the Apps by sending us the information below.
de: Wir entschuldigen uns für die Unannehmlichkeiten. Bitte helfen Sie uns, das App Center und die Apps zu verbessern, indem Sie uns die unten stehenden Informationen senden.

source: The docker container could not be started!
de: Der Docker Container konnte nicht gestartet werden!

source: There was a problem with the HTTP response of the server (BadStatusLine). Please try again later.
de: Es gab ein Problem mit der HTTP-Antwort des Servers (BadStatusLine). Bitte versuchen Sie es später noch einmal.

source: LDAP connection refused. There may be an issue with the certificate of the LDAP server. Please also check the proxy and firewall settings, if any.
de: LDAP-Verbindung wurde verweigert. Das kann an einem Problem mit dem Zertifikat des LDAP-Servers liegen. Bitte prüfen Sie auch die Proxy- und Firewall-Einstellungen, sofern vorhanden.
