Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/services/univention-s4-connector/modules/univention/admin/handlers/container/msgpo/*.po
Languages: fr

source: Basic settings
fr: Réglages de base

source: Container: MS Group Policy
fr: Conteneur : stratégie de groupe MS

source: Display name
fr: Nom d'affichage

source: GPO settings
fr: Réglages GPO

source: General
fr: Général

source: MS GPO settings
fr: Réglages GPO MS

source: MS Group Policy File Sys Path
fr: Emplacement système des fichiers de la stratégie de groupe MS

source: MS Group Policy Flags
fr: Drapeaux de la stratégie de groupe MS

source: MS Group Policy Functionality Version
fr: Version de la fonctionnalité de stratégie de groupe MS

source: MS Group Policy Machine Extension Names
fr: Noms des extensions machine de la stratégie de groupe MS

source: MS Group Policy System Flags
fr: Drapeaux système de la stratégie de groupe MS

source: MS Group Policy User Extension Names
fr: Noms des extensions utilisateur de la stratégie de groupe MS

source: MS Group Policy Version Number
fr: Numéro de version de la stratégie de groupe MS

source: MS Group Policy WQL Filter
fr: Drapeaux de la stratégie de groupe MS

source: Name
fr: Nom
