Repository: univention/univention-corporate-server
Catalog: management/univention-management-console-module-ucr/umc/js/*.po
Languages: de

source: Add
de: Hinzufügen

source: Add UCR variable
de: UCR-Variable hinzufügen

source: Adding a new UCR variable
de: Hinzufügen einer UCR-Variable

source: All
de: Alle

source: Are you sure to delete the %d selected UCR variable(s)?
de: Sind Sie sicher, dass %d ausgewählte UCR-Variable(n) gelöscht werden sollen?

source: Are you sure you want to save an empty string in this UCR variable or do you want to unset it?<br><br>UCR Variables that were created manually are fully removed from UCR when unsetting them. Any other UCR variable will be set to its default value.
de: Sind Sie sicher, dass Sie einen leeren String in dieser UCR-Variable speichern möchten oder möchten Sie diese UCR-Variable zurücksetzen?<br><br>UCR-Variablen, die manuell erstellt wurden, werden vollständig aus UCR entfernt, wenn sie zurückgesetzt werden. Alle anderen UCR-Variablen werden auf ihren Standardwert gesetzt.

source: Cancel
de: Abbrechen

source: Category
de: Kategorie

source: Category the UCR variable should be associated with
de: Kategorie, die der UCR-Variable zugeordnet sein soll

source: Default value (pattern)
de: Standardwert (Muster)

source: Delete
de: Löschen

source: Deleting the selected UCR variables
de: Löschen der ausgewählten UCR-Variablen

source: Description
de: Beschreibung

source: Description of the UCR variable
de: Beschreibung der UCR-Variable

source: Description:
de: Beschreibung:

source: Edit
de: Bearbeiten

source: Edit UCR variable
de: UCR-Variable bearbeiten

source: Name of UCR variable
de: Name der UCR-Variable

source: Save
de: Speichern

source: Search attribute
de: Suchattribut

source: Search...
de: Suche...

source: Select the attribute of a UCR variable that should be searched for the given keyword
de: Auswählen des Attributes einer UCR-Variable, das durchsucht werden soll

source: Setting the UCR variable, editing the categories and/or description
de: Setzen einer UCR-Variable und Bearbeiten der Kategorien und Beschreibung

source: Store empty string
de: Leeren String speichern

source: The Univention Configuration Registry (UCR) is the local database for the configuration of UCS systems to access and edit system-wide properties in a unified manner. Caution: Changing UCR variables directly results in the change of the system configuration. Misconfiguration may cause an unusable system!
de: Univention Configuration Registry (UCR) ist die lokale Datenbank zur Konfiguration von UCS-Systemen. Mit diesem Modul lassen sich UCR-Variablen anlegen, löschen und verändern. Achtung: Das Verändern von UCR-Variablen führt direkt zur Veränderung der Systemkonfiguration. Falsche Werte können das System unbrauchbar machen!

source: The default value of the UCR variable which is applied if the variable is not set. This might be a UCR pattern.
de: Der Standardwert der UCR-Variable, der angewendet wird, wenn die Variable nicht gesetzt ist. Der Wert kann ein UCR-Muster sein.

source: Unique name of the UCR variable
de: Eindeutiger Name für die UCR-Variable

source: Unset
de: Zurücksetzen

source: Unsetting a manually created UCR variable is equal to deleting it. More information about this topic can be found <a href="https://docs.software-univention.de/manual/5.0/en/computers/ucr.html?highlight=ucr#deleting-ucr-variables" target="_blank">here</a>.
de: Das Zurücksetzen einer manuell erstellten UCR-Variable ist gleichbedeutend mit ihrer Löschung.<br><a href="https://docs.software-univention.de/manual/5.0/de/computers/ucr.html?highlight=ucr#deleting-ucr-variables" target="_blank">Hier</a> gibt es mehr Informationen zu diesem Thema.

source: Value
de: Wert

source: Value of the UCR variable
de: Wert der UCR-Variable
