Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-web/js/*.po
Languages: fr

source: (required)
fr: (requis)

source: "${moduleName}" module
fr: Module « ${moduleName} »

source: %(label)s (retype)
fr: %(label)s (saisir à nouveau)

source: %(num)d entries of %(total)d selected
fr: %(num)d entrées sur %(total)d sélectionnées

source: %d entries found
fr: %d entrées trouvées

source: %s loaded
fr: %s chargé

source: 1 entry of %d selected
fr: 1 entrée sur %d sélectionnées

source: <b>Warning</b>: The current session with all opened modules and unsaved settings gets lost and a page reload is done when switching the language.
fr: <b>Avertissement </b>: la session en cours, y compris tous les modules ouverts et les réglages non enregistrés, sera perdue et un rafraîchissement de page a lieu lorsque vous changez de langue.

source: A reload of the Univention Management Console is required to use new modules.<br>Currently opened modules may not work properly.<br>Do you want to reload the page?
fr: Il faut recharger l’Univention Management Console pour utiliser les nouveaux modules.<br>Les modules ouverts actuellement peuvent ne pas fonctionner convenablement.<br>Voulez-vous recharger la page ?

source: Accept
fr: Accepter

source: Access
fr: Accès

source: Add
fr: Ajouter

source: Add objects
fr: Ajouter les objets

source: Advantages of the Enterprise Edition
fr: Avantages de l’Enterprise Edition

source: An assert statement failed
fr: Échec d'un assert (vérification)

source: An error occurred
fr: Une erreur est survenue

source: An error occurred while connecting to the server, please try again later.
fr: Une erreur inconnue est survenue en se connectant au serveur, veuillez réessayer plus tard.

source: An error occurred:
fr: Une erreur est survenue :

source: An unknown error with status code %s occurred while connecting to the server, please try again later.
fr: Une erreur inconnue avec le code d'état %s est survenue en se connectant au serveur, veuillez réessayer plus tard.

source: Back
fr: Retour

source: Back to start site
fr: Retour à la page d'accueil

source: Buy support package
fr: Acheter un forfait d’assistance

source: Cancel
fr: Annuler

source: Certificate revocation list
fr: Liste de révocation de certificats

source: Certificates
fr: Certificats

source: Changing language
fr: Changer de langue

source: Close
fr: Fermer

source: Cookie Settings
fr: Paramètres de cookies

source: Could not fulfill the request.
fr: Impossible de satisfaire la requête.

source: Could not load search results
fr: Impossible de charger les résultats de recherche

source: Could not process the request.
fr: Impossible de traiter la requête.

source: Do not show this notification again
fr: Ne plus afficher cette notification

source: End
fr: Fin

source: Enter
fr: Entrer

source: Feedback
fr: Impressions

source: Fetching information from the server failed!
fr: Échec en obtenant les informations sur le serveur !

source: Finish
fr: Terminer

source: Group
fr: Groupe

source: HTTP Error %s
fr: Erreur HTTP %s

source: Hard- and software certifications
fr: Certifications des matériels et logiciels

source: Help
fr: Aide

source: Hide server error message
fr: Masquer le message d'erreur du serveur

source: Home
fr: Accueil

source: Inform vendor
fr: Informer le vendeur

source: Information
fr: Informations

source: Information about the error will be sent to the vendor along with some data about the operating system.
fr: Les informations concernant l'erreur seront envoyées au vendeur avec quelques données concernant le système d'exploitation.

source: Internal UMC protocol error: The UMCP message body could not be parsed.
fr: Erreur du protocole interne UMC : impossible d'analyser le corps du message UMCP.

source: Internal UMC protocol error: The UMCP message header could not be parsed.
fr: Erreur du protocole interne UMC : impossible d'analyser l'entête du message UMCP.

source: Internal module error: An error occurred during command processing.
fr: Erreur interne du module : une erreur est survenue lors du traitement de la commande.

source: Internal module error: The initialization of the module caused a fatal error.
fr: Erreur interne du module : l'initialisation du module a provoqué une erreur fatale.

source: Internal server error.
fr: Erreur interne du serveur.

source: Internal server error: Could not connect to the module process.
fr: Erreur interne du serveur : impossible de se connecter au processus du module.

source: Internal server error: The SSL server certificate is not trustworthy. Please check your SSL configurations.
fr: Erreur interne du serveur : le certificat SSL du serveur n'est pas digne de confiance. Veuillez vérifier vos réglages SSL.

source: Internal server error: The module process died unexpectedly.
fr: Erreur interne du serveur : le processus du module s'est arrêté de façon inattendue.

source: Internal server error: The service is temporarily not available.
fr: Erreur interne du serveur : le service est temporairement indisponible.

source: Key
fr: Clé

source: Login
fr: Connexion

source: Logout
fr: Se déconnecter

source: Manufacturer warranty with product liability
fr: Garantie du fabricant et fiabilité du produit

source: Move between date cells
fr: Passer d’une cellule de date à l’autre

source: Move to first day in month
fr: Passer au premier jour du mois

source: Move to last day in month
fr: Passer au dernier jour du mois

source: Move to same day in next month
fr: Passer au même jour le mois suivant

source: Move to same day in next year
fr: Passer au même jour l’année suivante

source: Move to same day in previous month
fr: Passer au même jour le mois précédent

source: Move to same day in previous year
fr: Passer au même jour l’année précédente

source: New entry
fr: Nouvelle entrée

source: Next
fr: Suivant

source: No entries could be found
fr: Aucune entrée n'a été trouvée

source: No notifications
fr: Pas de notifications

source: Notification
fr: Notifications

source: Ok
fr: Valider

source: Others
fr: Autres

source: Owner
fr: Propriétaire

source: Please perform a search
fr: Veuillez effectuer une recherche

source: Please take a second to provide the following information:
fr: Veuillez prendre une seconde pour fournir les informations suivantes :

source: Prices and support
fr: Prix et assistance

source: Read
fr: Lecture

source: Reload
fr: Recharger

source: Remarks (e.g. steps to reproduce) (optional)
fr: Remarques (ex. : étapes pour reproduire le problème) (facultatif)

source: Remove
fr: Supprimer

source: Remove entry
fr: Supprimer l’entrée

source: Root certificate
fr: Certificat racine

source: Search results:
fr: Résultats de la recherche :

source: Search term
fr: Chercher un terme

source: Select all
fr: Tout sélectionner

source: Select file
fr: Sélectionner le fichier

source: Select the date
fr: Sélectionner la date

source: Send as email
fr: Envoyer par courriel

source: Send to vendor
fr: Envoyer au vendeur

source: Sending the information to the vendor failed
fr: Échec de l'envoi des informations au vendeur

source: Server error message:
fr: Message d'erreur du serveur :

source: Show error message
fr: Afficher le message d'erreur

source: Show server error message
fr: Afficher le message d'erreur du serveur

source: So far, the connection to the server could not be established after {time} seconds. This can be a normal behavior. In any case, the process will continue to establish the connection.
fr: Pour le moment, la connexion au serveur n'a pu aboutir après {time} secondes. Ce comportement est parfois normal. Dans tous les cas, le processus va continuer à établir la connexion.

source: Space
fr: Espace

source: Specified locale is not available.
fr: Les données de localisation demandées ne sot pas disponibles.

source: Starting at <b>290.- Euro/year</b> you can purchase a UCS Enterprise Edition. This license allows you to benefit from basic support services as well as individually bookable, additional support and professional services.
fr: À partir de <b>290 euros/an</b>, vous pouvez acheter une Enterprise Edition d’UCS. Cette licence vous permet de bénéficier des services d’assistance de base ainsi que de services d’assistance et professionnels supplémentaires réservables individuellement.

source: Submit
fr: Soumettre

source: Support and Professional Services
fr: Assistance et services professionnels

source: Switch language
fr: Changer langue

source: Thank you for your help
fr: Merci pour votre aide

source: The following files cannot be uploaded because they exceed the maximum file size:
fr: Impossible d'envoyer les fichiers suivants, ils dépassent la taille maximale des fichiers :

source: The maximum size of a file is %.1f MB.
fr: La taille maximale d'un fichier est de %.1f Mo.

source: The passwords do not match, please retype again.
fr: Les mots de passe ne correspondent pas, veuillez les saisir à nouveau.

source: UMC reload required
fr: Rechargement d'UMC nécessaire

source: Univention Blog
fr: Blog d’Univention

source: Univention Forum "Help"
fr: Forum d’aide d’Univention

source: Univention Website
fr: Site Internet Univention

source: Up to 7 years of maintenance (LTS)
fr: Jusqu’à 7 ans de maintenance (LTS)

source: Upload
fr: Envoyer

source: Uploading...
fr: Envoi...

source: Uploading... %(current)d of %(total)d files remaining.
fr: Envoi en cours... %(current)d sur %(total)d fichiers restants.

source: User settings
fr: Réglages utilisateur

source: Validation error
fr: Erreur de validation

source: Warning
fr: Avertissement

source: We use cookies in order to provide you with certain functions and to be able to guarantee an unrestricted service. By clicking on "Accept", you consent to the collection of information on this portal.
fr: Nous utilisons des cookies pour vous fournir certaines fonctionnalités et pouvoir garantir un service sans restriction. En cliquant sur « Accepter », vous consentez à la collecte d’informations sur ce portail.

source: Webfrontend error: The specified UMCP command arguments of the request are invalid.
fr: Erreur de l'interface Web : les arguments de la commande UMCP de la requête sont invalides.

source: Webfrontend error: The specified arguments for the UMCP module method are invalid or missing.
fr: Erreur de l'interface Web : les arguments de la méthode du module UMCP manquent ou sont invalides.

source: Webfrontend error: The specified request is unknown.
fr: Erreur de l'interface Web : le type de requête est inconnu.

source: Write
fr: Écriture

source: You are not authorized to perform this action.
fr: Vous ne pouvez pas effectuer cette action.

source: You can also send the information via mail:
fr: Vous pouvez également envoyer les informations par courriel :

source: You can extend the maintenance for your UCS version to up to 7 years and thanks to certifications and manufacturer warranty you are legally secured when operating your IT infrastructure.
fr: Vous pouvez prolonger la maintenance de votre version UCS jusqu’à 7 ans et grâce aux certifications et à la garantie du fabricant, vous êtes légalement assuré·e lors de l’exploitation de votre infrastructure IT.

source: Your browser is outdated! You may experience performance issues and other problems when using this site. The supported Browsers are Firefox (>=60), Chrome (>=71), Edge (>=18), Safari (>=12).
fr: Votre navigateur est obsolète ! Vous pouvez rencontrer des problèmes de performance et d’autres problèmes lors de l’utilisation de ce site. Les navigateurs pris en charge sont Firefox (> = 60), Chrome (> = 71), Edge (> = 18), Safari (> = 12).

source: Your email address (optional)
fr: Votre adresse de courriel (facultatif)

source: Your session has expired, please login again.
fr: Votre session a expiré, veuillez vous reconnecter.

source: actual result
fr: résultat obtenu

source: expected result
fr: résultat attendu

source: more
fr: plus

source: steps to reproduce the failure
fr: étapes pour reproduire l'erreur

source: {number} errors occurred:
fr: {number} erreurs survenues :
