Repository: univention/univention-corporate-server
Catalog: */univention-system-setup/usr/share/locale/*/LC_MESSAGES/univention-system-setup-scripts.po
Languages: de, fr

source: An error occurred while installing necessary software components.
de: Ein Fehler trat während der Installation von notwendigen Softwarekomponenten auf.
fr: Une erreur s'est produite lors de l'installation de composants logiciels requis.

source: Backing up old SSL certificate
de: Sichern der alten SSL-Zertifikate
fr: Sauvegarde de l’ancien certificat SSL

source: Configure
de: Einrichten von
fr: Configurer

source: Configuring Active Directory connection
de: Einrichten der Active-Directory-Verbindung
fr: Configuration de la connexion Active Directory

source: Configuring Administrator account...
de: Einrichten des Administrator-Kontos...
fr: Configuration du compte Administrator…

source: Configuring DNS entries...
de: Einrichten von DNS-Einträgen...
fr: Configuration des enregistrements DNS...

source: Configuring DNS server...
de: Einrichten des DNS-Servers...
fr: Configuration du serveur DNS...

source: Configuring IPvX network interfaces
de: Einrichten der IPvX-Netzwerkgeräte
fr: Configuration des interfaces réseau IPvX

source: Configuring Kerberos settings...
de: Einrichten von Kerberos-Einstellungen...
fr: Configuration des réglages Kerberos...

source: Configuring reverse DNS settings...
de: Einrichten von Reverse-DNS-Einstellungen...
fr: Configuration des réglages DNS inversé...

source: Configuring server role
de: Einrichten der Systemrolle
fr: Configuration du rôle du serveur

source: Configuring software components
de: Einrichten der Software-Komponenten
fr: Configuration des composants logiciels

source: Configuring software components...
de: Einrichten von Softwarekomponenten...
fr: Configuration des composants logiciels...

source: Configuring synchronization from AD...
de: Einrichten der Synchronisation von AD...
fr: Configuration de la synchronisation depuis AD...

source: Configuring time synchronization...
de: Einrichten der Zeitsynchronisation...
fr: Configuration de la synchronisation du temps...

source: Configuring time zones
de: Einrichten der Zeitzonen
fr: Configuration des fuseaux horaires

source: Could not connect to AD Server %s. Please verify that the specified address is correct.
de: Eine Verbindung zum AD-Server %s konnte nicht hergestellt werden. Bitte überprüfen Sie, ob die angegebene Adresse korrekt ist.
fr: Impossible de se connecter au serveur AD %s. Veuillez vérifier que l'adresse indiquée est correcte.

source: Could not connect to AD Server %s. Please verify that username and password are correct.
de: Eine Verbindung zum AD-Server %s konnte nicht hergestellt werden. Bitte überprüfen Sie Benutzername und Password.
fr: Impossible de se connecter au serveur AD %s. Veuillez vérifier que le nom d'utilisateur et le mot de passe sont corrects.

source: Could not recreate SSL certificate for %s.
de: Konnte keine SSL-Zertifikate für %s erstellen.
fr: Impossible de recréer le certificat SSL pour %s.

source: Could not synchronize the time between the UCS system and the Active Directory domain controller: %s
de: Die Zeit zwischen dem UCS-System und dem Active Directory Domänencontroller konnte nicht synchronisiert werden: %s
fr: Impossible de synchroniser l'heure entre le système UCS et le contrôleur de domaine Active Directory : %s

source: Domain setup (this might take a while)
de: Domäneneinrichtung (Dies kann einige Zeit dauern)
fr: Configuration du domaine (ceci peut prendre un certain temps)

source: Failed to add the Administrator account to the Domain Admins group.
de: Das Administrator Konto konnte nicht zur Gruppe der Domänenadministratoren hinzugefügt werden.
fr: Impossible d’ajouter le compte Administrator au groupe Domain Admins.

source: Failed to create the Administrator account in UCS.
de: Das Administrator Konto konnte in UCS nicht erstellt werden.
fr: Impossible de créer le compte Administrator dans UCS.

source: Failed to get package for Role %s
de: Kein Paket für Rolle %s gefunden
fr: Échec de la récupération du paquetage pour le rôle %s

source: Failed to search for the well known SID.
de: Die Suche nach der bekannten SID ist fehlgeschlagen.
fr: Impossible de rechercher le SID connu.

source: Failed to set the password of the UCS Administrator to the Active Directory Administrator password.
de: Eine Verbindung zum AD-Server %s konnte nicht hergestellt werden. Bitte überprüfen Sie Benutzername und Passwort.
fr: Échec de la définition du mot de passe pour le compte Administrator d’UCS à partir du mot de passe du compte d’administration d’Active Directory.

source: Generating SSL CA certificate.
de: Erstellen des SSL CA-Zertifikates.
fr: Génération du certificat d’autorité de certification SSL.

source: Generating SSL certificate
de: Erstellen der SSL-Zertifikate
fr: Génération du certificat SSL

source: Generating UUID
de: UUID generieren
fr: Génération de l’UUID

source: Generating locales
de: Erstellen der Locale-Daten
fr: Génération des paramètres régionaux

source: Installing univention-welcome-screen
de: Installiere univention-welcome-screen

source: Join has been finished successfully.
de: Der Domänenbeitritt wurde erfolgreich abgeschlossen.
fr: La jonction au domaine s'est terminé avec succès.

source: Preparing domain join
de: Vorbereitung des Domänenbeitritts
fr: Préparation de la jonction de domaine

source: Preparing package lists...
de: Vorbereiten der Paketlisten...
fr: Préparation de la liste des paquetages...

source: Recreate SSL certificate for %s
de: Erstellen von SSL-Zertifikate für %s
fr: Recréer un certificat SSL pour %s

source: Recreating SSH keys
de: Erstellen von SSH-Schlüsseln
fr: Recréation de clés SSH

source: Registering LDAP service entry...
de: Registrierung von LDAP-Service-Einträgen...
fr: Enregistrement de l'entrée du service LDAP...

source: Renaming well known SID objects...
de: Umbennen bekannter SID-Objekte...
fr: Renommage des objets SID bien connus...

source: Running Samba join script...
de: Ausführen des Samba Join-Skripts...
fr: Exécution du script de jonction Samba...

source: Running appliance scripts
de: Ausführen der Appliance-Skripte
fr: Exécution des scripts de l’Appliance

source: Setting IPv4 gateway
de: Setzen des IPv4-Gateways
fr: Définition de la passerelle IPv4

source: Setting IPv6 gateway
de: Setzen des IPv6-Gateways
fr: Définition de la passerelle IPv6

source: Setting LDAP base
de: Einrichten der LDAP-Basis

source: Setting Windows domain
de: Einrichten der Windows-Domäne

source: Setting domain name
de: Einrichten des Domänennamens

source: Setting external name servers
de: Einrichten des Rechnernamens
fr: Définition des serveurs de noms externes

source: Setting hostname
de: Einrichten des Rechnernamens

source: Setting keyboard layout
de: Einrichten des Tastaturlayouts
fr: Définition de la disposition du clavier

source: Setting name server
de: Einrichten des Rechnernamens
fr: Définition du serveur de noms

source: Setting primary network interface
de: Setzen des primären Netzwerkgerätes
fr: Définition de l’interface réseau principale

source: Setting proxy
de: Setzen des Proxys
fr: Définition du proxy

source: Setting root password
de: Einrichten des Root-Passworts
fr: Définition du mot de passe root

source: Setting the default locale
de: Setzen der Standard-Locale
fr: Définition des paramètres régionaux par défaut

source: Starting Active Directory connection service...
de: Active Directory-Verbindungsdienst wird gestartet...
fr: Démarrage du service de connexion Active Directory...

source: The AD member mode can only be configured on a DC master server.
de: Der AD-Member-Modus kann nur auf einem DC-Master-System konfiguriert werden.

source: The SSL certificate creation failed. The old certificates have been restored.
de: Die Erstellung der SSL-Zertifikate ist fehlgeschlagen. Die alten Zertifikate wurden wiederhergestellt.
fr: La création des certificats SSL a échoué. Les anciens certificats ont été restaurés.

source: The domain name of the AD Server (%(ad_domain)s) does not match the local UCS domain name (%(ucs_domain)s). For the AD member mode, it is necessary to setup a UCS system with the same domain name as the AD Server.
de: Der Domänenname des AD-Servers (%(ad_domain)s) unterscheidet sich von der lokalen UCS-Domäne ((%(ucs_domain)s).Für den AD-Member-Modus ist es notwendig, ein UCS-System mit dem gleichen Domänennamen wie der AD-Server aufzusetzen.
fr: Le nom de domaine du serveur AD (%(ad_domain)s) ne correspond pas au nom de domaine UCS local (%(ucs_domain)s). Pour le mode membre AD, il est nécessaire de configurer un système UCS avec le même nom de domaine que le serveur AD.

source: The sambaSID could not set for the Administrator account in UCS.
de: Die sambaSID für das Administrator Konto konnte in UCS nicht gesetzt werden.
fr: Le sambaSID n’a pas pu être défini pour le compte Administrator dans UCS.

source: This might take a moment...
de: Dies kann einen Moment dauern...
fr: Ceci peut prendre un moment…

source: This might take a while depending on the number of pending updates.
de: Abhängig von der Anzahl der austehenden Updates, kann dies einige Zeit dauern.
fr: Ceci peut prendre un certain temps selon le nombre de mises à jour en attente.

source: Upgrading the system
de: Aktualisiere das System
fr: Mise à niveau du système

source: The AD member mode can only be configured on a Primary Directory Node server.
fr: Le mode membre AD ne peut être configuré que sur un Primary Directory Node.
