Repository: univention/univention-corporate-server
Catalog: doc/quickstart/locales/*/LC_MESSAGES/index.po
Languages: de

source: Introduction
de: Einleitung

source: Univention Corporate Server (UCS) is a server operating system based on Debian GNU/Linux with integrated management system for the central administration of servers, services, clients, desktops and users.
de: Univention Corporate Server (UCS) ist ein auf Debian GNU/Linux basierendes Serverbetriebssystem mit integriertem Managementsystem für die zentrale Verwaltung von Servern, Diensten, Clients, Desktops und Benutzern.

source: This quickstart guide offers a short introduction on how to get started with UCS. Several features of UCS are only mentioned briefly with a reference to further documentation. The documentation on UCS is available at https://docs.software-univention.de/.
de: Dieser Quickstart-Guide stellt eine Kurzanleitung zur Inbetriebnahme und für erste Schritte mit UCS dar. Einige Funktionen von UCS werden hier nur kurz erwähnt und dann in weiterer Dokumentation beschrieben. Die Dokumentation zu UCS kann unter https://docs.software-univention.de/ abgerufen werden.

source: The installation DVD can be downloaded from the Univention website at https://www.univention.com/downloads/download-ucs. The installation DVD is only available for the host architecture *amd64* (64-bit). It has support for the Unified Extensible Firmware Interface-Standard (UEFI) including SecureBoot.
de: Die UCS-Installations-DVD steht unter https://www.univention.de/download/download-ucs/ zum Download bereit. Die Installations-DVD ist nur für die Rechnerarchitektur *amd64* (64 Bit) verfügbar. Sie unterstützt den Unified Extensible Firmware Interface-Standard (UEFI) inklusive SecureBoot.

source: Alternatively preinstalled images for VMware and VirtualBox can be used from the same download page.
de: Alternativ können auch vorinstallierte VMware und VirtualBox-Images von der gleichen Seite zum Herunterladen verwendet werden.

source: The system requirements vary considerably depending on the intended purpose and the number of users. The minimum requirements for the installation are 1 GB memory and 8 GB hard drive space.
de: Je nach geplantem Einsatzzweck und der Benutzeranzahl variieren die Systemanforderungen sehr stark. Mindestanforderungen für die Installation sind 1 GB Arbeitsspeicher und 8 GB Festplattenspeicher.

source: The installation is performed via a menu-driven installer and can be used both interactively and completely profile-based, see the `Extended installation documentation <ext-doc-inst_>`_.
de: Die Installation erfolgt per menügeführtem Installer und kann sowohl interaktiv, als auch vollständig profilbasiert durchgeführt werden, siehe dazu die `Extended installation documentation <ext-doc-inst_>`_.

source: The system language, keyboard layout and time zone can be selected in accordance with local requirements.
de: Die Systemsprache, die Tastaturbelegung und die Zeitzone können je nach lokalen Anforderungen gewählt werden.

source: A valid network configuration should be set during the installation. If, for example, a gateway and a name server are specified, but the name server cannot be reached, this may result in unnecessary timeouts. In these cases, it makes more sense not to specify a gateway. The network configuration can be employed using DHCP. If there is already a name server available in the local network, it should be used. If additional UCS systems are installed in the domain at a later point in time, the |UCSPRIMARYDN| and any |UCSBACKUPDN| systems should be entered as name servers.
de: Während der Installation sollte eine korrekte Netzwerkkonfiguration eingestellt werden. Wenn beispielsweise ein Gateway und ein Nameserver angegeben wird, der Nameserver aber nicht erreichbar ist, so kann es zu unnötigen Timeouts kommen. In solchen Fällen ist es sinnvoller, kein Gateway anzugeben. Die Netzkonfiguration kann auch über DHCP erfolgen. Sofern bereits ein Nameserver im lokalen Netzwerk vorhanden ist, sollte dieser verwendet werden. Werden später weitere UCS-Systeme in der Domäne installiert, sollte der |UCSPRIMARYDN| und gegebenenfalls vorhandene |UCSBACKUPDN|\ s als Nameserver eingetragen werden.

source: Selecting the domain setup
de: Auswahl der Domäneneinstellungen

source: During installation, the system can be used for various purposes which can only be configured at this point in the setup process.
de: Während der Installation kann das System für verschiedene Einsatzzwecke konfiguriert werden, die nur an dieser Stelle des Einrichtungsprozesses vorgenommen werden können.

source: The system is to be the first system in a new UCS domain and it is implicitly configured with the system role |UCSPRIMARYDN|.
de: Das System soll das erste System für eine eigene UCS-Domäne werden und es wird implizit als Systemrolle |UCSPRIMARYDN| aufgesetzt.

source: The system can be joined into an existing Active Directory domain. Select this option if UCS should not create a new domain. UCS then takes on the role of an Active Directory member server.
de: Das System kann einer vorhandenen Active Directory Domäne beitreten. Wählen Sie diese Option, wenn UCS keine eigene Domäne aufbauen soll. UCS übernimmt die Rolle eines Mitglieds in einer AD-Domäne.

source: All other systems are joining the UCS domain when they are installed.
de: Alle weiteren Systeme treten bei Ihrer Installation der UCS-Domäne bei.

source: An overview of the other different system roles can be found in :ref:`UCS Manual - System roles <uv-manual:system-roles>`.
de: Eine Übersicht über die verschiedenen weiteren Systemrollen findet sich im :ref:`UCS Handbuch - Systemrollen <uv-manual:system-roles>`.

source: With UCS and the *Active Directory Takeover* app an existing Active Directory domain can be migrated completely to UCS. For information on how to set up the UCS system for this scenario, see :ref:`UCS Manual - Migrating an Active Directory domain to UCS using Univention AD Takeover <uv-manual:windows-ad-takeover>`.
de: Mit UCS und der App *Active Directory Takeover* kann eine bestehende Active Directory Domäne vollständig nach UCS migriert werden. Wie das UCS-System dafür aufgesetzt wird, lesen Sie in :ref:`UCS Handbuch - Migration einer Active Directory-Domäne zu UCS mit Univention AD Takeover <uv-manual:windows-ad-takeover>`.

source: In the subsequent course of the installation, the fully qualified host name, under which the computer should be accessible in the network, is entered for a |UCSPRIMARYDN|. A local name should also be used as the domain name in this case, e.g. ``company.intranet``. (If the system is used as a mail server, for example, the mail domains can be used independently of the domain names). For example, to commission the *mailserver* host system in the ``company.intranet`` DNS domain, ``mailserver.company.intranet`` should be entered as the fully qualified host name. The *LDAP base* is suggested based on the fully qualified host name and only needs to be adjusted in exceptional cases. For all other systems roles it is normally sufficient to enter the host name only. The domain name will we fetched from the |UCSPRIMARYDN| when the domain is joined. The root password must be at least eight characters long and is also set as the password for the user *Administrator* during the installation of the first UCS system (|UCSPRIMARYDN|).
de: Im weiteren Verlauf der Installation wird bei einem |UCSPRIMARYDN| der vollqualifizierte Rechnername eingetragen, unter dem der Rechner im Netzwerk erreichbar sein soll. Hier kann als Domänenname auch ein lokaler Name verwendet werden, z.B. ``firma.intranet``. (Wenn das System etwa als Mailserver verwendet werden soll, können die Maildomänen unabhängig vom Domänennamen verwendet werden). Wenn also beispielsweise das Rechnersystem *mailserver* in der DNS-Domäne ``firma.intranet`` in Betrieb genommen werden soll, ist als vollständiger Rechnername ``mailserver.firma.intranet`` einzutragen. Die *LDAP-Basis* wird auf Basis des vollständigen Rechnernamens vorgeschlagen und muss nur in Ausnahmefällen angepasst werden. Bei allen anderen Systemrollen reicht es in der Regel nur den Rechnernamen anzugeben. Der Domänenname wird während des Domänenbeitritt vom |UCSPRIMARYDN| bezogen. Das Passwort muss mindestens acht Zeichen umfassen und wird bei der Installation des ersten UCS-Systems (|UCSPRIMARYDN|) auch als Passwort für den *Administrator*-Benutzer gesetzt.

source: An auto-partitioning feature can be used during the installation which creates an LVM volume group on the first hard drive by default.
de: Während der Installation kann eine automatisch Partitionierung verwendet werden, die standardmäßig die erste Festplatte im System als LVM Volume Group nutzt.

source: The installed software components can be adapted later at any time and subsequently installed from the Univention App Center.
de: Die installierten Software-Komponenten können später jederzeit angepasst und aus dem Univention App Center nachinstalliert werden.

source: After confirming the configuration settings the installation is initiated. Once completed, the system must be restarted. The further configuration is made using the |UCSUMC| (UMC). This is described in more detail in the following chapter.
de: Nach Bestätigung der Einstellungen startet die Installation. Nach Abschluss der Installation muss das System neu gestartet werden. Anschließend erfolgt die weitere Konfiguration über die UCSUMC (UMC). Sie wird im folgenden Kapitel beschrieben.

source: UCS web interface
de: UCS Web-Oberfläche

source: The web interface of an installed UCS system is directly available via its IP address (``https://server_ip`` or ``http://server_ip``, HTTPS is recommended). By default, a portal page is configured on the |UCSPRIMARYDN| where all applications are listed that are installed in the domain. For all other system roles, the start site consists of an overview of all locally installed applications. (View as well as the partitioning of entries can be customized in a very flexible manner, see also :ref:`UCS manual - Portal page as central view on the UCS domain <uv-manual:central-portal>`.)
de: Die Weboberfläche eines installierten UCS-Systems ist direkt unter seiner IP-Adresse erreichbar (``https://server_ip`` oder ``http://server_ip``, HTTPS wird empfohlen). Standardmäßig ist auf einem |UCSPRIMARYDN| als Startseite eine Portalseite eingerichtet, die alle in der Domäne installierten Applikationen und Dienste auflistet. Auf allen anderen Systemrollen beinhaltet die Startseite einen Überblick über die lokal installierten Applikationen. (Darstellung und genaue Aufteilung der Einträge können nachträglich sehr flexibel angepasst werden, siehe auch :ref:`UCS Handbuch - Portalseite als zentrale Sicht auf die UCS-Domäne <uv-manual:central-portal>`.)

source: Illustration of the portal page on the |UCSPRIMARYDN| with all domain wide available applications
de: Ansicht der Portalseite des |UCSPRIMARYDN| mit den in der Domäne verfügbaren Applikationen

source: On each start site of a UCS system, there is an entry :guilabel:`System and domain settings` in the section :guilabel:`Administration` (or :guilabel:`System settings`, respectively) that points to the |UCSUMC| (UMC) of the local system. |UCSUMC| is the central tool for web-based administration of a UCS domain. There are different modules available on the UCS system depending on the installation and system role selected. The login to |UCSUMC| is performed as user ``Administrator`` with the password specified for the user ``root`` during the installation.
de: Auf jeder Startseite eines UCS-Systems befindet sich im Bereich Verwaltung ein Eintrag System- und Domäneneinstellungen (beziehungsweise Systemeinstellungen), der auf die |UCSUMC| (UMC) des lokalen Systems verweist. |UCSUMC| ist das zentrale Werkzeug zur webbasierten Administration einer UCS-Domäne. Je nach Installations- und Systemrollenauswahl sind auf einem UCS-System unterschiedliche Module verfügbar. Die Anmeldung erfolgt als Benutzer ``Administrator`` mit dem während der Installation vergebenen Passwort für den Benutzer ``root``.

source: For administrating UCS, the LDAP directory is the central component of a UCS domain. In the LDAP, domain wide information such as the users, groups and computer accounts is saved. Depending on the settings, this information is replicated to the other Directory Nodes in the domain either completely or selectively. The UMC modules which edit the LDAP directory directly can be accessed only on the |UCSPRIMARYDN| via |UCSUMC|. Furthermore, they can also be controlled using the command line interface |UCSUDM|, see :ref:`UCS manual - Command line interface of domain management (Univention Directory Manager) <uv-manual:central-udm>`.
de: Für die Verwaltung von UCS ist das LDAP-Verzeichnis der zentrale Bestandteil einer UCS-Domäne. Im LDAP werden alle domänenweiten Informationen gespeichert, z.B. Benutzer, Gruppen oder Rechnerkonten. Diese Informationen werden, je nach Einstellung, komplett oder selektiv auf die anderen Directory Nodes in der Domäne repliziert. Die UMC-Module, die direkt das LDAP-Verzeichnis bearbeiten, können nur auf dem |UCSPRIMARYDN| über |UCSUMC| aufgerufen werden. Sie lassen sich darüber hinaus auch mit dem Kommandozeilen-Interface |UCSUDM| bedienen, siehe :ref:`UCS Handbuch - Kommandozeilenschnittstelle der Domänenverwaltung (Univention Directory Manager) <uv-manual:central-udm>`.

source: Modules in the UMC
de: Module in der UMC

source: UCS updates / Installing additional software
de: UCS-Updates / Installation weiterer Software

source: UCS updates can be installed in the UMC module :guilabel:`Software update`.
de: UCS-Updates (Sicherheits-Updates und kritische Bugfixes) können über das UMC-Modul :guilabel:`Software-Aktualisierung` installiert werden.

source: Additional software, like for example the Active Directory Connection, can be installed using the Univention App Center in the Univention Management Console:
de: Weitere Software, wie zum Beispiel die Active Directory Verbindung, kann über das Univention App Center in der Univention Management Console installiert werden:

source: Additional UCS software can be installed/removed using the category :guilabel:`UCS components`.
de: Weitere UCS-Software, kann nachträglich über die Kategorie UCS-Komponenten installiert oder entfernt werden.

source: Third-party software (e.g. various groupware solutions) and UCS-compatible add-on products (e.g. *UCS\@school* for school deployment can also be installed through the App Center.
de: Lösungen von Drittanbietern (z.B. verschiedene Groupwarelösungen) und UCS-kompatible Zusatzprodukte (z.B. *UCS\@school* für den Schuleinsatz) können ebenfalls über das App Center installiert werden.

source: Subsequent installation of UCS components
de: Nachträgliche Installation von UCS-Komponenten

source: Configuration management using Univention Configuration Registry
de: Konfigurationsmanagement mit Univention Configuration Registry

source: Univention Configuration Registry is the central tool for managing the local system configuration of a UCS system. Settings are specified in a consistent format, the so-called Univention Configuration Registry variables. These variables are used to generate the configuration files used effectively by the services/programs. Direct editing of the configuration files is only needed in exceptional cases.
de: Univention Configuration Registry ist das zentrale Werkzeug zur Verwaltung der lokalen Systemkonfiguration eines UCS-Systems. Einstellungen werden in einem einheitlichen Format festgelegt, den sogenannten Univention Configuration Registry-Variablen. Anhand dieser Variablen werden die effektiv von den Diensten/Programmen verwendeten Konfigurationsdateien generiert. Ein direktes Editieren der Konfigurationsdateien ist nur in Ausnahmefällen nötig.

source: |UCSUCR| variables are managed via the |UCSUMC| module :guilabel:`Univention Configuration Registry`. Configuration files are automatically updated when the UCR variables registered on them are changed.
de: Die Verwaltung der |UCSUCR|-Variablen erfolgt über das |UCSUMC|-Modul Univention Configuration Registry. Konfigurationsdateien werden bei Veränderung der für sie registrierten UCR-Variablen automatisch aktualisiert.

source: Managing |UCSUCR| variables
de: Verwaltung von |UCSUCR|-Variablen

source: In addition to the UCS systems, a UCS domain can also integrate different clients. The following clients are supported:
de: Eine UCS-Domäne kann neben UCS-Systemen auch verschiedene Clients integrieren. Die folgenden Clients werden unterstützt:

source: Microsoft Windows clients can join an AD-compatible Windows domain provided by the *Active Directory compatible domain controller* component (implemented using the software Samba). Further information on setting up Samba and the domain join of Windows clients can be found in :ref:`UCS Manual - Windows domain joins <uv-manual:windows-domain-join>`.
de: Microsoft Windows-Clients können einer AD-kompatiblen Windows-Domäne beitreten, die durch die Komponente *Active Directory-kompatibler Domänencontroller* (umgesetzt durch die Software Samba) bereitgestellt wird. Weitere Informationen zur Einrichtung von Samba und dem Domänenbeitritt von Windows-Clients findet sich in :ref:`UCS Handbuch - Windows-Domänenbeitritt <uv-manual:windows-domain-join>`.

source: macOS systems are also integrated via a Samba-based, AD-compatible Windows domain. Further information on setting up Samba and the domain join can be found in :ref:`UCS Manual - Mac OS X domain joins <uv-manual:macos-domain-join>`.
de: macOS-Systeme werden ebenfalls über eine AD-kompatible Windows-Domäne auf Basis von Samba integriert. Weitere Informationen zur Einrichtung von Samba und dem Domänenbeitritt findet sich in :ref:`UCS Handbuch - Mac OS X Domänenbeitritt <uv-manual:macos-domain-join>`.

source: Ubuntu systems (see `Integration of Ubuntu clients into a UCS domain <https://docs.software-univention.de/domain-5.0.html#ext-dom-ubuntu>`_) and other Linux distributions like Debian, SUSE or Red Hat can also be integrated into the domain, see `Integration of Linux/Unix systems into a UCS domain <https://docs.software-univention.de/domain-5.0.html#ext-dom-unix>`_.
de: Ubuntu-Systeme (siehe `Integration of Ubuntu clients into a UCS domain <https://docs.software-univention.de/domain-5.0.html#ext-dom-ubuntu>`) und andere Linux-Distributionen wie Debian, SUSE oder Red Hat können ebenfalls in die Domäne integriert werden, siehe `Integration of Linux/Unix systems into a UCS domain <https://docs.software-univention.de/domain-5.0.html#ext-dom-unix>`_.

source: Further expansion of the domain
de: Weiterer Ausbau der Domäne

source: This quickstart guide only provides an entry into UCS. UCS is very scalable, additional services can simply be installed on additional systems. This domain join is described in :ref:`UCS Manual - How UCS systems join domains <uv-manual:linux-domain-join>`.
de: Dieser Quickstart Guide beschreibt nur einen Einsteig in UCS. UCS ist sehr skalierbar, weitere Dienste können einfach auf weiteren Systemen installiert werden. Der Domänenbeitritt weiterer UCS-Systeme ist in :ref:`UCS Handbuch - Domänenbeitritt von UCS-Systemen <uv-manual:linux-domain-join>` beschrieben.

source: UCS offers various additional services which are covered by the UCS license and which can be integrated at a later point in time:
de: Darüber hinaus bietet UCS eine Vielfalt von weiteren Komponenten, die durch die UCS-Lizenz bereits abgedeckt sind und zu einem späteren Zeitpunkt integriert werden können, zum Beispiel:

source: Single-sign-on with web services using a SAML identity provider, see :ref:`UCS manual - SAML identity provider <uv-manual:domain-saml>`.
de: Single Sign-On mit Webdiensten über einen SAML Identity Providers siehe :ref:`UCS Handbuch - SAML identity provider <uv-manual:domain-saml>`.

source: :ref:`UCS manual - IP assignment via DHCP <uv-manual:module-dhcp-dhcp>`.
de: :ref:`UCS Handbuch - IP-Vergabe über DHCP <uv-manual:module-dhcp-dhcp>`.

source: :ref:`UCS manual - Web proxy for caching and policy management / virus scan <uv-manual:ip-config-web-proxy-for-caching-and-policy-management-virus-scan>`.
de: :ref:`UCS Handbuch - Web-Proxy für Caching und Policy Management/Virenscan <uv-manual:ip-config-web-proxy-for-caching-and-policy-management-virus-scan>`.

source: Hybrid cloud setups
de: Hybride Cloudumgebungen

source: Further information
de: Weitere Informationen

source: |UCSUCS| provides comprehensive documentation:
de: |UCSUCS| ist umfangreich dokumentiert:

source: The primary source of information on UCS is the `UCS Manual for users and administrators <https://docs.software-univention.de/manual-5.0.html>`_.
de: Primäre Dokumentationsquelle zu UCS ist das `UCS Handbuch für Benutzer und Administratoren <https://docs.software-univention.de/handbuch-5.0.html>`_.

source: Further documentation for advanced scenarios can be found in the extended documentation. The various documents are linked at https://docs.software-univention.de/.
de: Weiterführende Dokumentation für besondere Szenarien ist in der erweiterten Dokumentation zu finden. Die verschiedenen Dokumente sind unter https://docs.software-univention.de/ verlinkt.

source: The `Univention Wiki <https://wiki.univention.de/index.php/Hauptseite>`_ contains several HOWTOs and hands-on tips.
de: Im `Univention Wiki <https://wiki.univention.de/index.php/Main_Page>`_ finden sich u.a. verschiedene HOWTOs und Praxis-Tipps.

source: Answers to frequently asked questions can be found in the `support and knowledge database (SDB) <https://help.univention.com/c/knowledge-base/supported/48>`_.
de: Antworten auf häufig gestellte Fragen gibt es in der `Support und Knowledge Base (SDB) <https://help.univention.com/c/knowledge-base/supported/48>`_ zu finden.

source: Questions on UCS can be asked at `Univention Help <https://help.univention.com/>`_.
de: Fragen zu UCS können auch im `Univention Forum <https://help.univention.com/>`_ gestellt werden.
