Repository: univention/univention-corporate-server
Catalog: management/univention-management-console/src/univention/management/console/*.po
Languages: de, fr

source: %d error(s) occurred
de: %d Fehler aufgetreten
fr: %d erreur(s) survenue(s)

source: %s can only be used as UPLOAD
de: %s kann nur als UPLOAD genutzt werden
fr: %s ne peut être utilisé qu'avec « UPLOAD »

source: An unknown operating system error occurred (%s).
de: Ein unbekannter Betriebssystemfehler ist aufgetreten (%s).
fr: Une erreur inconnue du système d'exploitation est survenue (%s).

source: Argument required
de: Argument erforderlich
fr: Argument requis

source: Bad request
de: Fehlerhafte Anfrage
fr: Mauvaise requête

source: Cannot be converted to a boolean
de: Kann nicht in einen Wahrheitswert umgewandelt werden
fr: Impossible de convertir en booléen

source: Cannot be converted to a number
de: Kann nicht in eine Zahl umgewandelt werden
fr: Impossible de convertir en nombre

source: Cannot connect to the LDAP service.
de: Konnte nicht zum LDAP-Dienst verbinden.
fr: Impossible de se connecter au service LDAP.

source: Changing password failed.
de: Passwort ändern fehlgeschlagen.
fr: Échec du changement du mot de passe.

source: Check if enough hard disk space and free RAM is available on this server and on the Primary Directory Node or free some resources
de: Überprüfen Sie, ob auf diesem Server und auf dem Primary Directory Node genügend Festplattenspeicher und Arbeitsspeicher (RAM) verfügbar sind
fr: Vérifiez que ce serveur ainsi que le Primary Directory Node disposent de suffisamment d’espace disque et de RAM disponibles, sinon libérez des ressources

source: Check if enough hard disk space and free RAM is available on this server or free some resources
de: Überprüfen Sie, ob auf diesem Server genügend Festplattenspeicher und Arbeitsspeicher (RAM) verfügbar sind
fr: Vérifiez que ce serveur dispose de suffisamment d’espace disque et de RAM disponibles, sinon libérez des ressources

source: Check the SSL certificates, proxy and firewall settings
de: Überprüfen Sie die SSL Zertifikate, Proxy- und Firewall-Einstellungen
fr: Vérifiez les certificats SSL et les paramètres du proxy et du pare-feu

source: Choose a password which does not match any of your last %s passwords.
de: Wählen Sie ein Passwort, dass nicht den letzten %s Passwörtern entspricht.
fr: Choisissez un mot de passe différent des %s derniers mots de passe.

source: Connection to module process failed
de: Verbindung zum Modulprozess ist fehlgeschlagen
fr: Échec de connexion au processus du module

source: Could not open the module. %s Please try again later.
de: Konnte das Modul nicht öffnen. %s Bitte später erneut versuchen.
fr: Impossible d'ouvrir le module. %s Veuillez réessayer ultérieurement.

source: Could not pick an identity provider. You can specify one via the query string parameter %(param)r from %(idps)r
de: Konnte keinen Identity Provider auswählen. Sie können über den Query-String-Parameter %(param)r einen der folgenden %(idps)r auswählen.
fr: Impossible de choisir un fournisseur d’identité. Vous pouvez en spécifier un via le paramètre de chaîne de requête %(param)r parmi les %(idps)r

source: Cross Site Request Forgery attack detected. Please provide the "UMCSessionId" cookie value as HTTP request header "X-Xsrf-Protection".
de: Cross-Site-Request-Forgery-Attacke erkannt. Bitte geben Sie den Wert des "UMCSessionId" Cookies als HTTP-Request-Header "X-Xsrf-Protection" an.
fr: Attaque de type Cross Site Request Forgery détectée. Veuillez fournir la valeur du cookie "UMCSessionId" comme en-tête de requête HTTP "X-Xsrf-Protection".

source: Error message: %s
de: Fehlermeldung: %s
fr: Message d’erreur : %s

source: Failed to load module %(module)s: %(error)s %(traceback)s
de: Konnte das Modul %(module)s nicht laden: %(error)s %(traceback)s
fr: Impossible de charger le module %(module)s : %(error)s %(traceback)s

source: For using this module a login is required.
de: Für die Anfrage an dieses Modul ist eine Anmeldung erforderlich.

source: For using this request a login is required.
de: Für diese Anfrage ist eine Anmeldung erforderlich.
fr: Pour utiliser cette requête, vous devez vous identifier.

source: Forbidden
de: Verboten
fr: Interdit

source: Further information can be found in the logfile %s.
de: Weitere Informationen können der Protokolldatei %s entnommen werden.
fr: Des informations supplémentaires se trouvent dans le fichier journal %s.

source: Has more than the allowed keys
de: Hat mehr Schlüssel als erlaubt
fr: A plus que les clés autorisées

source: In case it helps, the raw error message will be displayed
de: Für den Fall, dass es hilft, hier die originale Fehlernachricht
fr: Si cela peut aider, le message d'erreur brut sera affiché

source: In case the SSL certificates are expired or a recent renewal of the root SSL CA has been done, please consider http://sdb.univention.de/1183
de: Falls die SSL Zertifikate abgelaufen sind oder das Wurzelzertifikat kürzlich erneuert worden ist, bitte ziehen Sie http://sdb.univention.de/1000 zu rat.
fr: Si les certificats SSL ont expiré ou si un renouvellement récent de l’autorité de certification SSL racine a été effectué, veuillez tenir compte de http://sdb.univention.de/1183

source: Install the latest software updates
de: Installieren Sie alle Softwareaktualisierungen
fr: Installer les dernières mises à jour des logiciels

source: Internal error
de: Interner Fehler
fr: Erreur interne

source: Internal server error during "%(command)s".
de: Interner Server-Fehler in "%(command)s".
fr: Erreur interne du serveur lors de « %(command)s ».

source: Invalid progress ID
de: Ungültige Fortschritt ID
fr: Id. de l'avancement invalide

source: Make sure the Primary Directory Node is running and reachable from %s
de: Stellen Sie sicher, dass der Primary Directory Node läuft und von %s aus erreichbar ist
fr: Veuillez vous assurer que le Primary Directory Node est lancé et accessible depuis %s

source: Make sure the kerberos service is functioning or inform an Administrator.
de: Stellen Sie sicher, dass der Kerberos Dienst läuft oder informieren Sie einen Administrator.
fr: Vérifiez que le service « kerberos » fonctionne ou informez un ou une responsable le cas échéant.

source: May have at most %(max_elements)d element(s)
de: Darf höchstens %(max_elements)d Element(e) haben
fr: Peut avoir au maximum %(max_elements)d élément(s)

source: Method %(method)r (%(path)r) in %(module)r does not exist. %(traceback)s
de: Methode %(method)r (%(path)r) in %(module)r existiert nicht. %(traceback)s
fr: La méthode %(method)r (%(path)r) dans %(module)r n'existe pas. %(traceback)s

source: Method not allowed
de: Methode nicht erlaubt
fr: Méthode non autorisée

source: Must have at least %(min_elements)d element(s)
de: Muss mindestens %(min_elements)d Element(e) haben
fr: Doit avoir au minimum %(min_elements)d élément(s)

source: No authentication provided to module process.
de: Keine Authentifizierung für den Modulprozess bereitgestellt.

source: No module found for this request.
de: Es wurde kein Modul für diese Anfrage gefunden.

source: Not a "dict"
de: Ist kein "dict"
fr: N'est pas un « dict »

source: Not a "list"
de: Ist keine "list"
fr: N'est pas une « list »

source: Not allowed to perform this request.
de: Es ist nicht erlaubt, diese Anfrage durchzuführen.

source: Not found
de: Nicht gefunden
fr: Non trouvé

source: Password successfully changed.
de: Passwort erfolgreich geändert.
fr: Le mot de passe a été modifié avec succès.

source: Please insert your one time password (OTP).
de: Bitte geben Sie ihr Einmalpasswort (OTP) ein.
fr: Veuillez saisir votre mot de passe à usage unique (one-time password).

source: Please relogin to the Univention Management Console to see if the error persists.
de: Bitte erneut an der Univention Management Console einloggen um zu sehen, ob der Fehler bestehen bleibt.
fr: Veuillez à nouveau vous authentifier sur l’Univention Management Console pour voir si l’erreur est toujours présente.

source: Please wait for operation to finish
de: Bitte warten, bis die Aktion durchgeführt wurde
fr: Veuillez patienter le temps que l'opération se termine

source: Received an unsolicited SAML response. Please try to single sign on again by accessing /univention/saml/. Error message: %s
de: Unaufgeforderte SAML-Antwort erhalten. Bitte versuchen Sie einen erneuten Single Sign-On durch aufrufen von /univention/saml/. Fehlernachricht: %s
fr: Réception d’une réponse SAML non sollicitée. Veuillez réessayer de vous connecter via l’authentification unique en ouvrant /univention/saml/. Message d’erreur : %s

source: Restart the LDAP service on the Primary Directory Node either via "service slapd restart" on command line or with the UMC module "System services"
de: Starten Sie den LDAP-Dienst entweder über "service slapd restart" per Kommandozeile oder mit dem UMC Modul "Systemdienste" auf dem Primary Directory Node neu
fr: Redémarrer le serveur LDAP sur le Primary Directory Node par le biais de la ligne de commande « service slapd restart » ou avec le module UMC « Services du système »

source: Should stay %s
de: Sollte %s bleiben
fr: Doit rester %s

source: Specified locale is not available
de: Angegebene Sprache ist nicht verfügbar
fr: L'identifiant de localisation n'est pas disponible

source: The "Referer" HTTP header must start with "/univention/".
de: Der "Referer" HTTP-Header muss mit "/univention/" beginnen.
fr: L'en-tête HTTP "Referer" doit commencer par "/univention/".

source: The Token contains an immature signature: %s
de: Das Token enthält eine unreife Signatur: %s

source: The Token contains an invalid audience: %s
de: Das Token enthält eine ungültige Audience: %s

source: The Token contains an invalid issuer: %s
de: Das Token enthält einen ungültigen Issuer: %s

source: The Token contains an invalid signature: %s
de: Das Token enthält eine ungültige Signatur: %s

source: The Token is missing a required claim: %s
de: In der OIDC-Antwort fehlt ein erforderliches Claim: %s

source: The Token signature is expired.
de: Das Token enthält eine ungültige Signatur: %s

source: The SAML message is invalid for this service provider.
de: Die SAML Nachricht ist ungültig für diesen Service Provider.
fr: Le message SAML n’est pas valide pour ce fournisseur de services.

source: The SAML response contained a invalid signature: %s
de: Die SAML-Antwort enthält eine ungültige Signatur: %s
fr: La réponse SAML contenait une signature invalide : %s

source: The SAML response could not be verified: %s
de: Die SAML-Antwort konnte nicht verifiziert werden: %s
fr: La réponse SAML n’a pas pu être vérifiée : %s

source: The UMC service is currently shutting down or restarting. Please retry soon.
de: Der UMC-Dienst ist gerade am Neustarten oder Herunterfahren. Bitte später erneut versuchen.
fr: Le service UMC est en train d'être arrêté ou de redémarrer. Veuillez réessayer très prochainement.

source: The account is expired and can not be used anymore.
de: Das Konto ist abgelaufen und kann nicht mehr verwendet werden.
fr: Le compte a expiré et ne peut plus être employé.

source: The authentication has failed, please login again.
de: Authentisierung ist fehlgeschlagen. Bitte melden Sie sich erneut an.
fr: Échec de l'authentification, veuillez vous authentifier à nouveau.

source: The current session is not valid with your IP address for security reasons. This might happen after switching the network. Please login again.
de: Die aktuelle Sitzung ist aus Sicherheitsgründen nicht mit Ihrer IP-Adresse gültig. Dies kann nach einem Wechsel des Netzwerks passieren. Bitte melden Sie sich erneut an.

source: The entered password does not match the current one.
de: Das eingegebene Passwort stimmt nicht mit dem aktuellen überein.
fr: Le mot de passe saisi ne correspond pas à l'actuel.

source: The executable was not found.
de: Das ausführbare Datei wurde nicht gefunden.

source: The following steps can help to solve this problem:
de: Die folgenden Schritte können helfen, das Problem zu beheben:
fr: Les étapes suivantes peuvent aider à résoudre ce problème :

source: The identity provider reported a status error: %s
de: Der Identity Provider hat einen Status-Fehler gemeldet: %s
fr: Le fournisseur d’identité a signalé une erreur d’état : %s

source: The initialization of the module failed: %s
de: Die Initialisierung des Moduls ist fehlgeschlagen: %s
fr: Échec de l'initialisation du module : %s

source: The issuer %r is not known to the SAML service provider. This is probably a misconfiguration and might be resolved by restarting the univention-management-console-server.
de: Der Ausgeber %r ist dem SAML-Dienstanbieter nicht bekannt. Dies ist wahrscheinlich eine Fehlkonfiguration und könnte durch einen Neustart des univention-management-console-server behoben werden.

source: The logout binding is not known.
de: Das SAML-Logout Binding ist unbekannt.
fr: La liaison de déconnexion n’est pas connue.

source: The logout token is missing a events claim
de: Im Logout-Token fehlt ein event Claim

source: The logout token is missing a sub or sid claim
de: Im Logout-Token fehlt ein sub oder sid Claim

source: The maximum number of asterisks (*) in the search string is %(max_number_of_asterisks)d
de: Die Höchstzahl an Sternen (*) im Suchwort ist %(max_number_of_asterisks)d
fr: Le nombre maximal d'astérisques (*) dans la chaîne de recherche est de %(max_number_of_asterisks)d

source: The minimum password age is not reached yet.
de: Das minimale Passwortalter wurde noch nicht erreicht.
fr: L'âge minimum du mot de passe n'est pas encore atteint.

source: The module may have been removed recently.
de: Das Modul könnte kürzlich entfernt worden sein.
fr: Le module a probablement été supprimé dernièrement.

source: The new password could not be set.
de: Das neue Passwort konnte nicht gesetzt werden.
fr: Le nouveau mot de passe n'a pas pu être défini.

source: The password contains parts of the full user name.
de: Das Passwort enthält Teile des vollen Benutzer*innennamens.
fr: Le mot de passe contient des parties du nom d’utilisateur complet.

source: The password contains user account name.
de: Das Passwort enthält den Benutzerkontonamen.
fr: Le mot de passe contient le nom du compte d’utilisateur.

source: The password does not contain enough different characters.
de: Das Passwort enthält nicht genügend unterschiedliche Zeichen.
fr: Le mot de passe ne contient pas suffisamment de caractères différents.

source: The password does not meet the password complexity requirements.
de: Das Passwort entspricht nicht den Komplexitätsanforderungen.
fr: Le mot de passe ne répond pas aux exigences de complexité du mot de passe.

source: The password has expired and must be renewed.
de: Das Passwort ist abgelaufen und muss erneuert werden.
fr: Le mot de passe a expiré et doit être renouvelé.

source: The password is a palindrome.
de: Das Passwort ist ein Palindrom.
fr: Le mot de passe est un palindrome.

source: The password is based on a dictionary word.
de: Das Passwort basiert auf einem Wörterbucheintrag.
fr: Le mot de passe est tiré d'un mot du dictionnaire.

source: The password is too long.
de: Das Passwort ist zu lang.
fr: Le mot de passe est trop long.

source: The password is too short.
de: Das Passwort ist zu kurz.
fr: Le mot de passe est trop court.

source: The password is too similar to the old one.
de: Das Passwort ist dem aktuellen zu ähnlich.
fr: Le mot de passe ressemble trop à l’ancien.

source: The password is too simple.
de: Das Passwort ist zu einfach.
fr: Le mot de passe est trop simple.

source: The password must consist of at least %s characters.
de: Das Passwort muss mindestens %s Zeichen lang sein.
fr: Le mot de passe doit comporter au moins %s caractères.

source: The password was already used.
de: Das Passwort wurde bereits genutzt.
fr: Le mot de passe a déjà été utilisé.

source: The principal is unknown: %s
de: Der SAML-Prinzipal ist unbekannt: %s
fr: Le commettant est inconnu : %s

source: The reason could not be determined
de: Der Grund konnte nicht festgestellt werden
fr: La raison n'a pu être déterminée

source: The requested Content-Type is not acceptable. Please use one of %s.
de: Der angeforderte Content-Type ist nicht akzeptabel. Bitte verwenden Sie einen von %s.
fr: Le Content-Type demandé n'est pas acceptable. Veuillez utiliser l'une des valeurs parmi %s.

source: The requested HTTP method is not allowed on this resource.
de: Die angeforderte HTTP-Methode ist auf dieser Ressource nicht erlaubt.
fr: La méthode HTTP demandée n'est pas autorisée sur cette ressource.

source: The requested SAML binding is not known: %s
de: Das angeforderte SAML-Binding ist unbekannt: %s
fr: La liaison SAML demandée n’est pas connue : %s

source: The requested module %r does not exist.
de: Das angefragte Modul %r existiert nicht.
fr: Le module %r demandé n'existe pas.

source: The session has expired.
de: Die Sitzung ist abgelaufen.

source: There are too many opened files on the server.
de: Auf dem Server sind zu viele offene Dateien.
fr: Trop de fichiers ouverts sur le serveur.

source: There is a configuration error in the service provider: No identity provider are set up for use.
de: Der Service Provider ist fehlkonfiguriert: Keine Identity Provider sind zur Benutzung eingerichtet.
fr: Il existe une erreur de configuration dans le fournisseur de services : aucun fournisseur d’identité n’est configuré pour être utilisé.

source: There is not enough free space on the server.
de: Auf dem Server ist nicht genügt freier Speicherplatz.
fr: Espace disque insuffisant sur le serveur.

source: There is not enough memory available on the server.
de: Auf dem Server ist nicht genügend freier Arbeitsspeicher verfügbar.
fr: Mémoire disponible insuffisante sur le serveur.

source: This action requires you to supply your password.
de: Diese Aktion erfordert die Eingabe Ihres Passwortes.
fr: Cette action requiert la saisie de votre mot de passe.

source: Unauthorized
de: Nicht authorisiert
fr: Non autorisé

source: Unknown request.
de: Unbekannte Anfrage.

source: Value has to be one of %(choices)r
de: Wert muss aus %(choices)r stammen
fr: La valeur doit être parmi %(choices)r

source: Value is invalid
de: Wert ist ungültig
fr: La valeur n'est pas correcte

source: Value is not a LDAP DN.
de: Wert ist kein LDAP-DN.
fr: La valeur n'est pas un DN LDAP.

source: Value is not a string
de: Wert ist keine Zeichenkette
fr: La valeur n'est pas une chaîne de caractères

source: Value is too long, it has to be at most of length %(maximum)d
de: Wert ist zu lang, seine Länge darf höchstens %(maximum)d Zeichen betragen
fr: La valeur est trop longue, elle doit au maximum avoir une taille de %(maximum)d

source: Value is too short, it has to be at least of length %(minimum)d
de: Wert ist zu kurz, seine Länge muss mindestens %(minimum)d Zeichen betragen
fr: La valeur est trop courte, elle doit au minimum avoir une taille de %(minimum)d

source: failed to cancel request.
de: Anfrage konnte nicht abgebrochen werden.

source: filesize is too large, maximum allowed filesize is %d bytes
de: Dateigröße ist zu groß, maximal erlaubte Dateigröße ist %d bytes

source: finished...
de: beended...

source: A hacking attempt was prevented.
fr: Une tentative de piratage a été évitée.

source: Error occurred during command processing
fr: Erreur lors du traitement de la commande

source: Invalid command arguments
fr: Paramètres de la commande invalides

source: Invalid length information
fr: Information de longueur invalide

source: Invalid message header encoding.
fr: Codage de l’en-tête de message invalide.

source: Invalid or missing command options
fr: Options de la commande manquantes ou invalides

source: Module process died unexpectedly
fr: Le processus du module s'est arrêté de manière inattendue

source: OK, operation successful
fr: OK, opération réussie

source: The execution of a command caused a fatal error
fr: L'exécution de la commande a provoqué une erreur fatale

source: The initialization of the module caused a fatal error
fr: L'initialisation du module a causé une erreur fatale

source: The issuer %r is now known to the SAML service provider. This is probably a misconfiguration and might be resolved by restarting the univention-management-console-web-server.
fr: L’émetteur %r est maintenant connu du fournisseur de services SAML. Il s’agit probablement d’une erreur de configuration qui pourrait être résolue en redémarrant univention-management-console-web-server.

source: The message body is not (yet) complete
fr: Le corps du message n'est pas (encore) complet

source: The message header is not (yet) complete
fr: L'entête du message n'est pas (encore) complet

source: The response lifetime has exceeded: %s. Please make sure the server times are in sync.
fr: La durée de vie de la réponse a dépassé : %s. Assurez-vous que les horloges des serveurs sont synchronisées.

source: Unknown mime type
fr: Type MIME inconnu

source: Unknown status code
fr: Code d'état inconnu

source: Unparsable message body
fr: Corps de message impossible à analyser

source: Unparsable message header
fr: Entête de message impossible à analyser

source: error parsing UMCP message body
fr: erreur lors de l'analyse du corps du message UMCP
