Repository: univention/univention-corporate-server
Catalog: management/univention-self-service/umc/python/passwordreset/*.po
Languages: de

source: Account could not be deleted
de: Account konnte nicht gelöscht werden

source: Changing contact data failed.
de: Ändern der Kontaktdaten fehlgeschlagen.

source: Either username or password is incorrect or you are not allowed to use this service.
de: Entweder stimmen Benutzername und Passwort nicht oder Sie haben keine Berechtigung diesen Dienst zu nutzen.

source: Error sending token: {}
de: Fehler beim Versenden des Tokens: {}

source: External
de: Extern

source: Failed to change password.
de: Passwortänderung fehlgeschlagen.

source: Mobile number
de: Mobilfunknummer

source: No address has been stored, where a password recovery token could be sent to.
de: Es wurden keine Kontaktadressen gefunden, an die ein Token (Sicherheitsschlüssel) zur Wiederherstellung des Password geschickt werden könnte.

source: No contact information is stored for this user. Resetting the password is not possible.
de: Für diesen Benutzer wurden keine Kontaktinformationen hinterlegt. Das Zurücksetzen des Passworts ist daher nicht möglich.

source: Service specific passwords were disabled for "%s".
de: Applikationsspezifische Passwörter wurden für "%s" deaktiviert.

source: Service specific passwords were disabled via the Univention Configuration Registry.
de: Applikationsspezifische Passwörter wurden durch die Univention Configuration Registry deaktiviert.

source: Successfully changed your password.
de: Ihr Passwort wurde erfolgreich geändert.

source: Successfully changed your profile data.
de: Ihre Profildaten wurden erfolgreich geändert.

source: Successfully send token.
de: Der Token wurde erfolgreich versendet.

source: The account could not be created: %s
de: Das Konto konnte nicht erstellt werden: %s

source: The account could not be created: Information provided is not sufficient. The following properties are missing: %s
de: Das Konto konnte nicht erstellt werden: Die angegebenen Informationen reichen nicht aus. Die folgenden Eigenschaften fehlen: %s

source: The account deregistration was disabled via the Univention Configuration Registry.
de: Die Deregistrierung von Konten wurde durch die Univention Configuration Registry deaktiviert.

source: The account protection was disabled via the Univention Configuration Registry.
de: Der Kontoschutz wurde durch die Univention Configuration Registry deaktiviert.

source: The account registration was disabled via the Univention Configuration Registry.
de: Die Kontoregistrierung wurde durch die Univention Configuration Registry deaktiviert.

source: The account verification was disabled via the Univention Configuration Registry.
de: Die Konto-Verifizierung wurde durch die Univention Configuration Registry deaktiviert.

source: The allowed maximum number of connections to the server has been reached. Please retry in {}.
de: Die erlaubte maximale Anzahl an Verbindungen zum Server wurde erreicht. Bitte versuchen Sie es in {} erneut.

source: The attributes could not be saved: %s
de: Die Attribute konnten nicht gespeichert werden: %s

source: The configuration of the password reset service is not complete. The UCR variables "ad/reset/username" and "ad/reset/password" need to be set properly. Please inform an administrator.
de: Die Konfiguration des Dienstes zum Passwort zurücksetzen ist nicht abgeschlossen. Die UCR Variablen "ad/reset/username" und "ad/reset/password" müssen auf einen geeigneten Wert gesetzt werden. Bitte informieren Sie einen Administrator.

source: The connection to the server could not be established. Please try again later. Error message was: %s
de: Die Verbindungen zum Server konnte nicht aufgebaut werden. Bitte versuchen Sie es später erneut. Fehlermeldung: %s

source: The password reset service is disabled via configuration registry.
de: Der Dienst zum Passwort zurücksetzen ist durch Configuration Registry deaktiviert.

source: The password reset was disabled via the Univention Configuration Registry.
de: Der Dienst zum Passwort zurücksetzen wurde durch die Univention Configuration Registry deaktiviert.

source: The token you supplied is either expired or invalid. Please request a new one.
de: Der Token (Sicherheitsschlüssel) den Sie angegeben haben ist entweder abgelaufen oder ungültig. Bitte fordern Sie einen neuen an.

source: The username is already taken
de: Der Benutzername ist bereits vergeben

source: This value is required
de: Dieser Wert ist erforderlich

source: Unknown recovery method '{}'.
de: Unbekannte Wiederherstellungsfunktion '{}'.

source: Your picture
de: Ihr Foto

source: one hour
de: einer Stunde

source: one minute
de: einer Minute

source: {} hours
de: {} Stunden

source: {} minutes
de: {} Minuten
