Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/virtualization/univention-virtual-machine-manager-daemon/src/*.po
Languages: fr

source: Cache options
fr: Options du cache

source: Command "%(command)s" is restricted
fr: L'utilisation de la commande « %(command)s » est restreinte

source: Connection options
fr: Options de la connexion

source: Could not open LDAP-Admin connection
fr: Impossible d'ouvrir une connexion LDAP-Admin

source: Could not open LDAP-Machine connection
fr: Impossible d'ouvrir une connexion LDAP-Machine

source: Could not open socket "%(path)s": %(errno)d
fr: Impossible d'ouvrir la socket « %(path)s » : %(errno)d

source: Could not query "%(uri)s"
fr: Impossible d'envoyer une requête à « %(uri)s »

source: Could not send request: %(errno)d
fr: Impossible d'envoyer la requête : %(errno)d

source: Daemon options
fr: Options du démon

source: Do not load cached state
fr: Ne pas charger l'état en cache

source: Domain "%(domain)s" already exists: %(uuid)s
fr: Le domaine « %(domain)s » existe déjà : %(uuid)s

source: Domain "%(domain)s" in state "%(state)s" can not be migrated
fr: Le domaine « %(domain)s » dans l'état « %(state)s » ne peut être migré

source: Domain "%(domain)s" is not shut off: %(state)d
fr: Le domaine « %(domain)s » n'est pas éteint : %(state)d

source: Domain name "%(domain)s" already used by "%(uuid)s"
fr: Le nom de domaine « %(domain)s » est déjà utilisé par « %(uuid)s »

source: EOS while waiting for answer.
fr: Signal « Fin de la connexion » reçu en attendant la réponse.

source: Error cloning "%(domain)s": %(error)s
fr: Erreur en dupliquant « %(domain)s » : %(error)s

source: Error creating "%(domain)s" snapshot: %(error)s
fr: Erreur en créant un instantané de « %(domain)s » : %(error)s

source: Error creating storage pool "%(pool)s": %(error)s
fr: Erreur en créant l'espace de stockage mis en commun « %(pool)s » : %(error)s

source: Error creating storage volume "%(name)s" for "%(domain)s": %(error)s
fr: Erreur en créant le volume de stockage « %(name)s » de « %(domain)s » : %(error)s

source: Error defining domain "%(domain)s": %(error)s
fr: Erreur en définissant le domaine « %(domain)s » : %(error)s

source: Error deleting "%(domain)s" snapshot: %(error)s
fr: Erreur en supprimant l'instantané « %(domain)s » : %(error)s

source: Error listing pools at "%(uri)s": %(error)s
fr: Erreur en obtenant la liste des espaces mis en commun de « %(uri)s » : %(error)s

source: Error listing volumes at "%(uri)s": %(error)s
fr: Erreur en obtenant la liste des volumes de « %(uri)s » : %(error)s

source: Error locating storage pool "%(pool)s" for "%(domain)s": %(error)s
fr: Erreur en localisant l'espace de stockage mis en commun « %(pool)s » pour « %(domain)s » : %(error)s

source: Error locating storage volume "%(volume)s" for "%(domain)s": %(error)s
fr: Erreur en localisant le volume de stockage « %(volume)s » pour « %(domain)s » : %(error)s

source: Error managing domain "%(domain)s"
fr: Erreur en gérant le domaine « %(domain)s »

source: Error managing domain "%(domain)s": %(error)s
fr: Erreur en gérant le domaine « %(domain)s » : %(error)s

source: Error migrating domain "%(domain)s": %(error)s
fr: Erreur en migrant le domaine « %(domain)s » : %(error)s

source: Error reading %(file)s: %(msg)s
fr: Erreur en lisant %(file)s : %(msg)s

source: Error reading incomplete %(file)s.
fr: Erreur en lisant le fichier incomplet %(file)s.

source: Error removing %(file)s.old: %(msg)s
fr: Erreur en supprimant %(file)s.old : %(msg)s

source: Error removing domain "%(domain)s": %(error)s
fr: Erreur en supprimant le domaine « %(domain)s » : %(error)s

source: Error renaming %(file)s.new: %(msg)s
fr: Erreur en renommant %(file)s.new : %(msg)s

source: Error renaming %(file)s: %(msg)s
fr: Erreur en renommant %(file)s : %(msg)s

source: Error restoring domain "%(domain)s": %(error)s
fr: Erreur en restaurant le domaine « %(domain)s » : %(error)s

source: Error retrieving list of active networks: %(error)s
fr: Erreur en obtenant la liste des réseaux actifs : %(error)s

source: Error retrieving list of networks: %(error)s
fr: Erreur en obtenant la liste des réseaux : %(error)s

source: Error retrieving old domain "%(domain)s": %(error)s
fr: Erreur en obtenant l'ancien domaine « %(domain)s » : %(error)s

source: Error reverting "%(domain)s" to snapshot: %(error)s
fr: Erreur en ramenant « %(domain)s » vers l'instantané : %(error)s

source: Error saving domain "%(domain)s": %(error)s
fr: Erreur en enregistrant le domaine « %(domain)s » : %(error)s

source: Error starting network %(name)s: %(error)s
fr: Erreur en démarrant le réseau %(name)s : %(error)s

source: Error undefining domain "%(domain)s": %(error)s
fr: Erreur en supprimant la définition du domaine « %(domain)s » : %(error)s

source: Error updating domain "%(domain)s"
fr: Erreur en actualisant le domaine « %(domain)s »

source: Error updating domain "%(domain)s": %(error)s
fr: Erreur en actualisant le domaine « %(domain)s » : %(error)s

source: Error while closing socket: %(errno)d
fr: Erreur en fermant la socket : %(errno)d

source: Error while waiting for answer: %(errno)d
fr: Erreur en attendant la réponse : %(errno)d

source: Failed to backup domain %(domain)s: %(xml)s
fr: Échec de la sauvegarde du domaine %(domain)s : %(xml)s

source: Failed to clone volume "%(volume)s": %(error)s
fr: Échec de la duplication du volume « %(volume)s » : %(error)s

source: Failed to fork daemon.
fr: Impossible de scinder le démon.

source: Failed to generate new name for disk "%(disk)s"
fr: Échec de génération d'un nouveau nom pour le disque « %(disk)s »

source: Failed to update device.
fr: Échec de mise à jour du périphérique.

source: Failed to update domain "%(domain)s"
fr: Échec d'actualisation du domaine « %(domain)s »

source: Failed to update the additionally information in the LDAP directory.
fr: Échec d'actualisation des informations supplémentaires dans l'annuaire LDAP.

source: Fork into background
fr: Scinder en arrière-plan

source: Hypervisor "%(uri)s" is already connected.
fr: L'hyperviseur « %(uri)s » est déjà connecté.

source: Hypervisor "%(uri)s" is not connected.
fr: L'hyperviseur « %(uri)s » n'est pas connecté.

source: Incompatible version: %(major)d.%(minor)d
fr: Version non compatible : %(major)d.%(minor)d

source: No SERVICES defined.
fr: Aucun SERVICE défini.

source: No nodes found.
fr: Aucun nœud trouvé.

source: Not a Packet: %(type)s
fr: N'est pas un paquet : %(type)s

source: Not a UVMM_Response.
fr: N'est pas une réponse UVMM.

source: Not a valid Packet: %(msg)s
fr: N'est pas un paquet valide : %(msg)s

source: Packet is no UVMM Request: %(type)s
fr: Le paquet n'est pas une requête UVMM : %(type)s

source: Path to the UNIX socket
fr: Emplacement de la socket UNIX

source: Path to the UNIX socket [%(default)s]
fr: Emplacement de la socket UNIX [%(default)s]

source: Path to the ini-file [%(default)s]
fr: Emplacement du fichier « ini » [%(default)s]

source: Path to the log-file
fr: Emplacement du fichier de journalisation

source: Path to the pid-file [%(default)s]
fr: Emplacement du fichier de PID [%(default)s]

source: Print additional information
fr: Afficher des informations supplémentaires

source: Skip reading ini-file
fr: Ignorer la lecture du fichier « ini »

source: Snapshot not supported "%(node)s"
fr: L'instantané n'est pas pris en charge « %(node)s »

source: The EC2 region returned an error for connection "%(connection)s": AuthFailure: The provided AWS access credentials could not be validated. Please ensure that you are using the correct access keys. Consult the AWS service documentation for details.
fr: La région EC2 a retourné une erreur pour la connexion « %(connection)s » : AuthFailure : les preuves d'identité pour l'accès à AWS fournies n'ont pu être validées. Veuillez vous assurer que vous utilisez des clés d'accès correctes. Consultez la documentation du service AWS pour plus de détails.

source: The EC2 region returned an error for connection "%(connection)s": RequestExpired: Please check your system time to interact with AWS.
fr: La région EC2 a retourné une erreur pour la connexion « %(connection)s » : RequestExpired: veuillez vérifier l'horloge de votre système pour interagir avec AWS.

source: The EC2 region returned an error for connection "%(connection)s": UnauthorizedOperation: The provided AWS access credentials are not authorized to perform this operation. Check your IAM policies, and ensure that you are using the correct access keys. Also, the IAM user must have appropriate access rights to interact with EC2, e.g. AmazonEC2FullAccess.
fr: La région EC2 a retourné une erreur pour la connexion « %(connection)s » : UnauthorizedOperation : les preuves d'identité pour l'accès à AWS fournies ne permettent pas d'effectuer cette opération. Vérifiez vos droits IAM et assurez-vous que vous utilisez des clés d'accès correctes. De plus, l'utilisateur IAM doit avoir des droits d'accès appropriés pour interagir avec EC2, par ex. AmazonEC2FullAccess.

source: The EC2 region returned an error for connection "%(connection)s": Your AWS account is currently blocked. If you have questions, please contact AWS Support.
fr: La région EC2 a retourné une erreur pour la connexion « %(connection)s » : Votre compte AWS est actuellement bloqué. Si vous avez des questions, veuillez contacter le service en ligne d'AWS.

source: Timed out while closing socket.
fr: Délai dépassé en fermant la socket.

source: Timed out while opening local socket "%(path)s".
fr: Délai dépassé en ouvrant une socket locale « %(path)s ».

source: Timed out while receiving data.
fr: Délai dépassé en recevant les données.

source: Timed out while sending data.
fr: Délai dépassé en envoyant les données.

source: Timeout in seconds for UVMM commands
fr: Délai à ne pas dépasser en secondes pour les commandes UVMM

source: Unknown command "%(command)s"
fr: Commande « %(command)s » inconnue

source: Unknown disk type: %(type)d
fr: Type de disque inconnu : %(type)d

source: Unknown disk/type='%(type)s'
fr: Type de disque inconnu='%(type)s'

source: Unknown domain "%s"
fr: Domaine inconnu « %s »

source: Unknown interface/type='%(type)s'
fr: Type d'interface inconnu='%(type)s'

source: Unknown os/type='%(type)s'
fr: Type de système d'exploitation inconnu='%(type)s'

source: Unsupported state transition %(cur_state)s to %(next_state)s
fr: Transition de l'état %(cur_state)s vers %(next_state)s non prise en charge

source: Unsupported storage-pool-type "%(pool_type)s" for "%(domain)s"
fr: storage-pool-type « %(pool_type)s » non pris en charge pour « %(domain)s »

source: Volume "%(volume)s" not found: %(error)s
fr: Volume « %(volume)s » non trouvé : %(error)s

source: args != dict: %(args)s
fr: args != dictionnaire : %(args)s

source: cache directory [%(default)s]
fr: Dossier de cache [%(default)s]

source: conn_name != string: %(conn_name)s
fr: conn_name != chaîne : %(conn_name)s

source: definition != Domain: %(domain)s
fr: definition != domaine : %(domain)s

source: domain != string: %(domain)s
fr: domain != chaîne : %(domain)s

source: freq != int: %(freq)s
fr: freq != entier : %(freq)s

source: group != string: %(group)s
fr: group != chaîne : %(group)s

source: hz != int: %(hz)s
fr: hz != entier : %(hz)s

source: instance_id != string: %(instance_id)s
fr: instance_id != chaîne : %(instance_id)s

source: name != string: %(name)s
fr: name != chaîne : %(name)s

source: pattern != string: %(pattern)s
fr: pattern != chaîne : %(pattern)s

source: snapshot != string: %(snapshot)s
fr: snapshot != chaîne : %(snapshot)s

source: statefile != string: %(file)s
fr: statefile != chaîne : %(file)s

source: subst != dict: %(subst)s
fr: subst != dictionnaire : %(subst)s

source: subst[] != string: %(subst)s
fr: subst[] != chaîne : %(subst)s

source: target_uri != string: %(uri)s
fr: target_uri != chaîne : %(uri)s

source: testconnection is not a bool %(testconnection)s
fr: testconnection n'est pas un booléen %(testconnection)s

source: unknown node %(uri)s
fr: nœud inconnu %(uri)s

source: unsupported state: %(state)s
fr: état non pris en charge : %(state)s

source: uri != string: %(uri)s
fr: uri != chaîne : %(uri)s

source: usage: %prog [options] [uri...]
fr: utilisation : %prog [options] [uri...]

source: volume != string: %(volume)s
fr: volume != chaîne : %(volume)s

source: volumes != list or None: %(volumes)s
fr: volumes != liste ou None: %(volumes)s

source: volumes[] != string: %(volume)s
fr: volumes[] != chaîne : %(volume)s
