Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/services/univention-s4-connector/modules/univention/admin/handlers/settings/msprintconnectionpolicy/*.po
Languages: fr

source: A bitmask of printer attributes.
fr: Un masque de bits des attributs de l'imprimante.

source: Basic settings
fr: Réglages de base

source: Display name
fr: Nom d'affichage

source: General
fr: Général

source: Name
fr: Nom

source: Print attributes
fr: Attributs d'impression

source: Printer connection settings
fr: Réglages de la connexion à l'imprimante

source: Printer name
fr: Nom de l'imprimante

source: Server name
fr: Nom du serveur

source: Settings: MS Print Connection Policy
fr: Réglages : stratégie MS de connexion à l'imprimante

source: The display name of an attached printer.
fr: Le nom d'affichage d'une imprimante branchée.

source: The name of a server.
fr: Le nom du serveur.

source: The universal naming convention name for shared volumes and printers.
fr: Le nom selon la convention de nommage universelle pour les volumes et les imprimantes partagé·es.

source: UNC name
fr: Nom UNC
