Repository: univention/univention-corporate-server
Catalog: management/univention-self-service/www/*.po
Languages: fr

source: (retype)
fr: (retaper)

source: A verification token could not be sent. Please verify your input.
fr: Un code de vérification n’a pas pu être envoyé. Veuillez vérifier votre saisie.

source: Account verification
fr: Vérification du compte

source: Activate renew options.
fr: Activer les options de renouvellement.

source: An error occurred while sending the verification token for your account. Please <a href="#page=verifyaccount&username=%s">request a new one</a>.
fr: Une erreur s’est produite lors de l’envoi du code de vérification pour votre compte. Veuillez en <a href="#page=verifyaccount&username=%s">demander un nouveau</a>.

source: Cancel
fr: Annuler

source: Change password
fr: Changer le mot de passe

source: Change your (expired) password.
fr: Changer le mot de passe (expiré).

source: Changing password failed. The username and/or the old password is not correct.
fr: La modification du mot de passe a échoué. L’identifiant et/ou l’ancien mot de passe sont incorrects.

source: Create account
fr: Créer le compte

source: Create an account
fr: Créer un compte

source: Customize your profile
fr: Personnaliser votre profil

source: Delete my account
fr: Supprimer mon compte

source: Do you really want to delete your account?
fr: Voulez-vous vraiment supprimer votre compte ?

source: Everyone forgets his password now and then. Protect yourself and activate the opportunity to set a new password.
fr: Il peut arriver à tout le monde d'oublier son mot de passe. Protégez-vous et activez la possibilité de réinitialiser le mot de passe.

source: Forbidden redirect to: {0} The url has to start with (only) one "/".
fr: Redirection interdite vers : {0} L'URL doit débuter avec un seul "/".

source: Forgot your password? Set a new one:
fr: Mot de passe oublié ? Définir un nouveau mot de passe :

source: Hello <b>%s</b>, we have sent you an email to <b>%s</b>. Please follow the instructions in the email to verify your account.
fr: Bonjour <b>%s</b>, nous vous avons envoyé un e-mail à l’adresse <b>%s</b>. Veuillez suivre les instructions dans l’e-mail pour vérifier votre compte.

source: Hello <b>%s</b>, we have sent you an email to your registered address. Please follow the instructions in the email to verify your account.
fr: Bonjour <b>%s</b>, nous vous avons envoyé un e-mail à votre adresse enregistrée. Veuillez suivre les instructions dans l’e-mail pour vérifier votre compte.

source: If you did not received an e-mail please check your spam directory or use this link to go back to step 2.
fr: Si vous n'avez pas reçu le courriel, veuillez vérifier votre dossier de pourriels ou utiliser ce lien pour revenir à l'étape 2.

source: New Password
fr: Nouveau mot de passe

source: New Password (retype)
fr: Nouveau mot de passe (saisir à nouveau)

source: Next
fr: Suivant

source: Old Password
fr: Ancien mot de passe

source: Page Not Found
fr: Page introuvable

source: Password
fr: Mot de passe

source: Password change
fr: Changer le mot de passe

source: Password forgotten
fr: Mot de passe oublié

source: Please choose an option to renew your password.
fr: Veuillez choisir une option pour renouveler votre mot de passe.

source: Protect account
fr: Protéger le compte

source: Request new token
fr: Demander un nouveau code

source: Save
fr: Enregistrer

source: Set a new password!
fr: Définir un nouveau mot de passe !

source: Set a new password:
fr: Définir un nouveau mot de passe :

source: Set new password
fr: Définir un nouveau mot de passe

source: The account could not be verified. Please verify your input.
fr: Le compte n’a pas pu être vérifié. Veuillez vérifier votre saisie.

source: The entries do not match, please retype again.
fr: Les entrées ne correspondent pas, veuillez les saisir à nouveau.

source: The page is deactivated or does not exist.
fr: La page est désactivée ou n’existe pas.

source: The password has been changed successfully.
fr: Le mot de passe a été modifié avec succès.

source: The passwords do not match, please retype again.
fr: Les mots de passe ne correspondent pas, veuillez les saisir à nouveau.

source: There is no profile data data defined that you can edit
fr: Vous ne pouvez modifier aucune des données de profil définies

source: Token
fr: Jeton

source: Username
fr: Nom d'utilisateur

source: Verify account
fr: Vérifier le compte

source: We have send you an e-mail to your alternative e-mail address, that you have provided on the page "Protect Account Access". Please check your mails and follow the link to renew your password.
fr: Nous vous avons envoyé un courriel à votre adresse électronique alternative, que vous avez renseignée à la page "Protéger l'accès au compte". Veuillez vérifier vos courriers et ouvrir le lien fourni pour changer votre mot de passe.

source: Welcome <b>%s</b>, %s.
fr: Bienvenue <b>%s</b>, %s.

source: You have mail!
fr: Vous avez du courrier !

source: Your account has been successfully deleted.
fr: Votre compte a été supprimé avec succès.

source: Your account has to be verified again after changing your email. We have sent you an email to <b>%s</b>. Please follow the instructions in the email to verify your account.
fr: Votre compte doit être à nouveau vérifié après avoir modifié votre adresse e-mail. Nous vous avons envoyé un e-mail à l’adresse <b>%s</b>. Veuillez suivre les instructions dans l’e-mail pour vérifier votre compte.

source: Your account is being verified.
fr: Votre compte est en cours de vérification.

source: Your contact data has been successfully changed.
fr: Vos données de contact ont été modifiées avec succès.

source: Your profile
fr: Votre profil

source: Your profile data is up to date
fr: Les données de votre profil sont à jour

source: your account has already been verified
fr: votre compte a déjà été vérifié

source: your account has been successfully verified
fr: votre compte a été vérifié avec succès
