Repository: univention/univention-corporate-server
Catalog: kolab2/horde-webmailer/horde-webmail/nag/po/*.po
Languages: fi_fi

source: (%s including sub-tasks)
fi_fi: (%s sis‰lt‰en aliteht‰v‰t)

source: %d hour
fi_fi: %d tunti

source: %d hour, %d minute
fi_fi: %d tunti, %d minuutti

source: %d hour, %d minutes
fi_fi: %d tunti, %d minuuttia

source: %d hours
fi_fi: %d tuntia

source: %d hours, %d minute
fi_fi: %d tuntia, %d minuutti

source: %d hours, %d minutes
fi_fi: %d tuntia, %d minuuttia

source: %d minute
fi_fi: %d minuutti

source: %d minutes
fi_fi: %d minuuttia

source: %s at %s
fi_fi: %s %s

source: %s is due in %s
fi_fi: %s pit‰isi valmistua %s

source: %s is due now.
fi_fi: %s pit‰isi olla valmis nyt.

source: %s is now incomplete.
fi_fi: %s on nyt kesken.

source: %s successfully imported
fi_fi: %s tuonti onnistui.

source: %s's Task List
fi_fi: %s:n teht‰v‰lista

source: (highest)
fi_fi: (korkein)

source: (lowest)
fi_fi: (matalin)

source: Access denied completing task %s.
fi_fi: Sinulla ei ole oikeuksia muuttaa teht‰v‰n suoritustietoja: %s.

source: Access denied deleting task.
fi_fi: Sinulla ei ole oikeuksia poistaa teht‰v‰‰.

source: Access denied editing task.
fi_fi: Sinulla ei ole oikeuksia muokata teht‰v‰‰.

source: Access denied editing task: %s
fi_fi: Sinulla ei ole muokata teht‰v‰‰: %s

source: Access denied moving the task to %s.
fi_fi: Sinulla ei ole oikeuksia siirt‰‰ teht‰v‰‰ %s:‰‰n.

source: Access denied removing task from %s.
fi_fi: Sinulla ei ole oikeuksia poistaa teht‰v‰‰ %s:st‰.

source: Access denied saving task to %s.
fi_fi: Sinulla ei ole oikeuksia tallettaa %s:‰‰n.

source: Access denied saving task: %s
fi_fi: Sinulla ei ole oikeuksia tallettaa teht‰v‰‰: %s

source: Alarm
fi_fi: H‰lytys

source: All tasks
fi_fi: Kaikki teht‰v‰t

source: Always show completed and future tasks?
fi_fi: N‰yt‰ aina valmistuneet ja tulevat teht‰v‰t.

source: Always show overdue tasks?
fi_fi: N‰yt‰ aina myˆh‰styneet teht‰v‰t.

source: Ascending
fi_fi: Nouseva

source: Assignee
fi_fi: M‰‰r‰tty

source: Block title
fi_fi: Lohkon otsikko

source: Calendar
fi_fi: Kalenteri

source: Cancel
fi_fi: Peruuta

source: Cat_egory
fi_fi: Kat_egoria

source: Category
fi_fi: Kategoria

source: Change Permissions
fi_fi: Muuta oikeuksia

source: Change your task sorting and display options.
fi_fi: Voit muuttaa teht‰vien j‰rjestely- ja n‰yttˆasetuksia.

source: Changed alarm from %s to %s
fi_fi: Muutettiin h‰lytyst‰ %s =>> %s

source: Changed assignee from "%s" to "%s"
fi_fi: Muutettiin m‰‰r‰tty‰ "%s" =>> "%s"

source: Changed category from "%s" to "%s"
fi_fi: Muutettiin luokitusta "%s" =>> "%s"

source: Changed completion from %s to %s
fi_fi: Muutettiin valmistumista %s =>> %s

source: Changed description
fi_fi: Muutettiin kuvausta

source: Changed due date from %s to %s
fi_fi: Muutettiin m‰‰r‰p‰iv‰‰ %s =>> %s

source: Changed estimate from %s to %s
fi_fi: Muutettiin arviota %s =>> %s

source: Changed name from "%s" to "%s"
fi_fi: Muutettiin nime‰ "%s" =>> "%s"

source: Changed parent task from "%s" to "%s"
fi_fi: Muutettiin ylemm‰n tason teht‰v‰‰ "%s" =>> "%s"

source: Changed priority from %s to %s
fi_fi: Muutettiin prioriteettia %s =>> %s

source: Changed start date from %s to %s
fi_fi: Muutettiin p‰iv‰m‰‰r‰‰ %s =>> %s

source: Changed task list from "%s" to "%s"
fi_fi: Muutettiin teht‰v‰listan nime‰ "%s" =>> "%s".

source: Changes made for this task:
fi_fi: T‰h‰n teht‰v‰‰n tehdyt muutokset

source: Choose how you want to receive reminders for tasks with alarms:
fi_fi: Valitse miten haluat saada muistutukset teht‰viin liitetyist‰ h‰lytyksist‰:

source: Choose if you want to be notified of new, edited, and deleted tasks by email:
fi_fi: Valitse haluatko saada ilmoituksia uusista, muokatuista tai poistetuista teht‰vist‰ s‰hkˆpostitse:

source: Choose if you want to be notified of task changes and task alarms.
fi_fi: Valitse haluatko saada ilmoituksia uusista, muokatuista tai poistetuista teht‰vist‰.

source: Choose your default task list.
fi_fi: Voit valita oletusteht‰v‰listasi.

source: Click or copy this URL to display this task list
fi_fi: Napsauta tai kopioi t‰m‰ URL n‰hd‰ksesi t‰m‰n teht‰v‰listan

source: Close
fi_fi: Sulje

source: Close Search
fi_fi: Sulje haku

source: Complete
fi_fi: Suoritettu

source: Complete "%s"
fi_fi: Valmistunut "%s"

source: Complete Task
fi_fi: Suorita teht‰v‰

source: Complete tasks
fi_fi: Suorita teht‰v‰t

source: Completed
fi_fi: Suoritettu

source: Completed %s.
fi_fi: Suoritettiin %s.

source: Completed Tasks
fi_fi: Valmistuneet teht‰v‰t

source: Completed parent task, mark it as incomplete first
fi_fi: Valmistunut yl‰teht‰v‰, merkitse sen tila ensin keskener‰iseksi

source: Completed tasks
fi_fi: Suoritetut teht‰v‰t

source: Completed?
fi_fi: Suoritettu?

source: Completion Date
fi_fi: Valmistumisp‰iv‰m‰‰r‰

source: Completion Status
fi_fi: Valmistumisen tila

source: Connection failed: %s
fi_fi: Yhteys ep‰onnistui: %s

source: Create
fi_fi: Luo

source: Create Task List
fi_fi: Luo teht‰v‰lista

source: Create a new Task List
fi_fi: Luo uusi teht‰v‰lista

source: Created
fi_fi: Luotu

source: Daily
fi_fi: P‰ivitt‰in

source: Day
fi_fi: P‰iv‰

source: Day(s)
fi_fi: P‰ivi‰

source: Default Task List
fi_fi: Oletusteht‰v‰lista

source: Defaults for new tasks
fi_fi: Oletukset uudelle teht‰v‰listalle

source: Delay Start Until
fi_fi: Viiv‰st‰ aloitusta kunnes

source: Delete
fi_fi: Poista

source: Delete %s
fi_fi: Poista %s

source: Delete Confirmation
fi_fi: Poiston varmistus

source: Delete button behaviour
fi_fi: Voit muuttaa Poista painikkeen toimintaa

source: Delete this task
fi_fi: Poista t‰m‰ teht‰v‰

source: Deleted %s.
fi_fi: Poistettiin %s.

source: Deleting entire tasklists is not supported.
fi_fi: Koko teht‰v‰listan poistaminen ei ole tuettu.

source: Descending
fi_fi: Laskeva

source: Description
fi_fi: Kuvaus

source: Display Options
fi_fi: N‰kym‰n asetukset

source: Display URL
fi_fi: N‰yt‰ URL

source: Do you want to confirm deleting entries?
fi_fi: Haluatko varmistuksen poistettavista merkinnˆist‰?

source: Due By
fi_fi: Valmiina viimeist‰‰n

source: Due Date
fi_fi: Valmistumisp‰iv‰m‰‰r‰

source: Due date specified.
fi_fi: Valmistumisp‰iv‰m‰‰r‰‰ ei ole m‰‰ritelty

source: Edit
fi_fi: Muokkaa

source: Edit "%s"
fi_fi: Muokkaa "%s"

source: Edit %s
fi_fi: Muokkaa %s

source: Edit Task
fi_fi: Muokkaa teht‰v‰‰

source: Edit categories and colors
fi_fi: Muokkaa kategorioita ja v‰rej‰

source: Edit: %s
fi_fi: Muokkaa %s

source: Error deleting task: %s
fi_fi: Tapahtui virhe poistettaessa teht‰v‰‰: %s

source: Estimated Time
fi_fi: Arvioitu aika

source: Export
fi_fi: Vie

source: Export Tasks
fi_fi: Vie teht‰v‰t

source: External Data
fi_fi: Ulkopuolista tietoa

source: Future tasks
fi_fi: Tulevat teht‰v‰t

source: General Options
fi_fi: Yleiset asetukset

source: Hour
fi_fi: Tunti

source: Hour(s)
fi_fi: Tuntia

source: Import Tasks, Step %d
fi_fi: Teht‰vien tuonti, askel %d

source: Import/Export Tasks
fi_fi: Tuo/Vie teht‰v‰t

source: Incom_plete tasks
fi_fi: Keske_ner‰iset teht‰v‰t

source: Incomplete Tasks
fi_fi: Keskener‰iset teht‰v‰t

source: Incomplete sub tasks, complete them first
fi_fi: Keskener‰isi‰ aliteht‰vi‰, suorita ne ensin valmiiksi

source: Incomplete tasks
fi_fi: Keskener‰iset teht‰v‰t

source: Invalid tasklist file requested.
fi_fi: Pyydetty teht‰v‰lista on ep‰kelpo.

source: Invalid tasklist name supplied.
fi_fi: Teht‰v‰listan nimi on ep‰kelpo.

source: Invalid tasklist requested.
fi_fi: Pyydetty teht‰v‰lista on ep‰kelpo.

source: Last Modified
fi_fi: Muokattu viimeksi

source: Manage Task Lists
fi_fi: Hallinnoi teht‰v‰listoja

source: Mark "%s" as incomplete
fi_fi: Merkitse "%s" keskener‰iseksi

source: Mark as incomplete
fi_fi: Merkitse keskener‰iseksi

source: Maximum Number of Tasks
fi_fi: Teht‰vien enimm‰ism‰‰r‰

source: Menu Alarms
fi_fi: Valikkoh‰lytykset

source: Menu List
fi_fi: Valikkolista

source: Minute
fi_fi: Minuutti

source: Minute(s)
fi_fi: Minuuttia

source: Month
fi_fi: Kuukausi

source: Monthly
fi_fi: Kuukausittain

source: More Options...
fi_fi: Lis‰‰ asetukset...

source: Multiple iCalendar components found; only one vTodo is supported.
fi_fi: Lˆytyi useita iCalendar komponentteja. vai yksi vTodo on tuettu.

source: My Task Lists:
fi_fi: Omat teht‰v‰listani:

source: My Tasks
fi_fi: Oma teht‰v‰listani

source: N_ame
fi_fi: N_imi

source: Na_me
fi_fi: Ni_mi

source: Nag/kolab: Did not find task %s
fi_fi: Nag/Kolab: Ei lˆytynyt teht‰v‰‰: %s

source: Name
fi_fi: Nimi

source: New Task
fi_fi: Uusi teht‰v‰

source: Next
fi_fi: Seuraava

source: No
fi_fi: Ei

source: No delay
fi_fi: Ei viivett‰

source: No due date.
fi_fi: Ei valmistumisp‰iv‰m‰‰r‰‰.

source: No iCalendar data was found.
fi_fi: Ei lˆytynyt iCalendar tietoja.

source: No parent task
fi_fi: Ei ylempi‰ teht‰v‰t

source: No recurrence
fi_fi: Ei toistoa

source: No task lists are available to guests.
fi_fi: Vierailijoille ei ole sallittu ainuttakaan teht‰v‰listaa.

source: No tasks match
fi_fi: Ei t‰sm‰‰vi‰ teht‰vi‰

source: No tasks to display
fi_fi: Ei teht‰vi‰ n‰ytett‰v‰ksi

source: None
fi_fi: Ei mit‰‰n

source: Not Completed
fi_fi: Ei suoritettu

source: Not Private
fi_fi: Ei yksityinen

source: Not configured
fi_fi: Ei asennettu.

source: Notifications
fi_fi: Ilmoitukset

source: On all shown task lists
fi_fi: Kaikille n‰kyville teht‰v‰listoille

source: On all task lists I have read access to
fi_fi: Kaikille teht‰v‰listoille, joihin minulla on lukuoikeus

source: On my task lists only
fi_fi: Vain omassa teht‰v‰listassani

source: Parent task
fi_fi: Yl‰teht‰v‰

source: Permission Denied
fi_fi: K‰yttˆ kielletty

source: Permission denied
fi_fi: K‰yttˆ kielletty

source: Priority
fi_fi: Prioriteetti

source: Private
fi_fi: Yksityinen

source: Private Task
fi_fi: Yksityinen teht‰v‰

source: Private?
fi_fi: Yksityinen?

source: Really delete the task list "%s"? This cannot be undone and all data on this task list will be permanently removed.
fi_fi: Haluatko poistaa teht‰v‰listan "%s"? T‰m‰ operaatio on peruuttamaton ja kaikki tiedot t‰ll‰ teht‰v‰listalla poistuvat lopullisesti.

source: Really delete this task?
fi_fi: Poistetaanko t‰m‰ teht‰v‰?

source: Save
fi_fi: Talleta

source: Saved %s.
fi_fi: Talletettiin %s.

source: Search
fi_fi: Haku

source: Search In:
fi_fi: Hae l‰hteest‰:

source: Search _Text:
fi_fi: Hae _teksti‰:

source: Search for Task Lists:
fi_fi: Hae teht‰v‰listoista:

source: Search:
fi_fi: Haku:

source: Search: Results for "%s"
fi_fi: Haun tulokset "%s":lle

source: Select a date
fi_fi: Valitse p‰iv‰m‰‰r‰

source: Select the columns that should be shown in the list view:
fi_fi: Valitse listan‰kym‰ss‰ n‰ytett‰v‰t sarakkeet:

source: Select the export format:
fi_fi: Valitse vienniss‰ k‰ytett‰v‰ muoto:

source: Select the file to import:
fi_fi: Valitse tiedosto, josta tuodaan tietoja:

source: Select the format of the source file:
fi_fi: Valitse l‰hdetiedoston muoto:

source: Select the task list(s) to export from:
fi_fi: Valitse teht‰v‰listojen vienniss‰ k‰ytett‰v‰ muoto:

source: Select the task states to export:
fi_fi: Valitse vienniss‰ k‰ytett‰v‰t teht‰v‰tilat:

source: Shared Task Lists:
fi_fi: Jaetut teht‰v‰listat:

source: Show action buttons?
fi_fi: N‰yt‰ toimintopainikkeet.

source: Show complete, incomplete, or all tasks in the task list?
fi_fi: N‰yt‰ suoritetut, keskener‰iset tai kaikki teht‰v‰t teht‰v‰listalla.

source: Show data from any of these other applications in your task list?
fi_fi: N‰yt‰ n‰iden ohjelmien tietoja teht‰v‰listallasi.

source: Show data from other applications or sources.
fi_fi: N‰yt‰ tietoja muista ohjelmista tai l‰hteist‰.

source: Show due dates?
fi_fi: N‰yt‰ valmistusp‰iv‰m‰‰r‰t.

source: Show priorities?
fi_fi: N‰yt‰ prioriteetit.

source: Show task alarms?
fi_fi: N‰yt‰ teht‰vien h‰lytykset.

source: Show task category?
fi_fi: N‰yt‰ teht‰v‰n kategoria.

source: Show task list options panel?
fi_fi: N‰yt‰ teht‰v‰listat asetuspaneelissa.

source: Show tasklist name?
fi_fi: N‰yt‰ teht‰v‰listojen nimet.

source: Show tasks from these categories
fi_fi: N‰yt‰ n‰ihin luokituksiin liittyv‰t teht‰v‰t

source: Show tasks from these tasklists
fi_fi: N‰yt‰ teht‰v‰t n‰ist‰ teht‰v‰listoista

source: Sort by Assignee
fi_fi: J‰rjest‰ m‰‰ritetyn mukaan

source: Sort by Category
fi_fi: J‰rjest‰ luokituksen mukaan

source: Sort by Completion Status
fi_fi: J‰rjest‰ suoritustilan mukaan

source: Sort by Due Date
fi_fi: J‰rjest‰ valmistumisp‰iv‰m‰‰r‰n mukaan

source: Sort by Name
fi_fi: J‰rjest‰ nimen mukaan

source: Sort by Priority
fi_fi: J‰rjest‰ prioriteetin mukaan

source: Sort by User Name
fi_fi: J‰rjest‰ k‰ytt‰j‰tunnuksen mukaan

source: Sort by estimated time
fi_fi: J‰rjest‰ aika-arvion mukaan

source: Sort direction:
fi_fi: J‰rjestyksen suuntaa

source: Sort tasks by:
fi_fi: J‰rjest‰ teht‰v‰t:

source: Start
fi_fi: Alkaa

source: Start Date
fi_fi: Aloitusp‰iv‰m‰‰r‰

source: Start date specified.
fi_fi: Aloitusp‰iv‰m‰‰r‰‰ m‰‰ritelty.

source: Subscription URL
fi_fi: Tilauksen URL

source: Task Alarm
fi_fi: Teht‰v‰n h‰lytys

source: Task Alarm?
fi_fi: Teht‰v‰n h‰lytys?

source: Task Defaults
fi_fi: Teht‰v‰n oletukset

source: Task ID not found
fi_fi: Teht‰v‰ ID:‰ ei lˆytynyt

source: Task List
fi_fi: Teht‰v‰lista

source: Task List Description
fi_fi: Teht‰v‰listan kuvaus

source: Task List Information
fi_fi: Teht‰v‰listan tiedot

source: Task List List
fi_fi: Teht‰v‰listalistaus

source: Task List Name
fi_fi: Teht‰v‰listan nimi

source: Task List and Share Options
fi_fi: Teht‰v‰listaan ja jakeluun liittyv‰t asetukset

source: Task List owned by %s.
fi_fi: %s:n omistamat teht‰v‰listat.

source: Task Lists
fi_fi: Teht‰v‰listat

source: Task Name
fi_fi: Teht‰v‰n nimi

source: Task Note
fi_fi: Teht‰v‰n huomautus

source: Task Note?
fi_fi: Teht‰v‰n huomautus?

source: Task Search
fi_fi: Teht‰v‰n haku

source: Task UID not found
fi_fi: Teht‰v‰ UID:a ei lˆytynyt.

source: Task added:
fi_fi: Teht‰v‰ lis‰tty:

source: Task deleted:
fi_fi: Teht‰v‰ poistettu:

source: Task description:
fi_fi: Teht‰v‰n kuvaus:

source: Task modified:
fi_fi: Teht‰v‰‰ muokattu:

source: Task not found.
fi_fi: Teht‰v‰‰ ei lˆytynyt.

source: Tasklist does not exist or no permission to delete
fi_fi: Teht‰v‰listaa ei ole olemassa tai sinulla ei ole oikeuksia poistaa sit‰

source: Tasklist does not exist or no permission to edit
fi_fi: Teht‰v‰listaa ei ole olemassa tai sinulla ei ole oikeusia muokata sit‰.

source: Tasks
fi_fi: Teht‰v‰t

source: Tasks Summary
fi_fi: Teht‰v‰t yhteenveto

source: Tasks from %s
fi_fi: Teht‰v‰t %s:st‰

source: The %s file didn't contain any tasks.
fi_fi: Tiedostossa %s ei ollut ainuttakaan teht‰v‰‰.

source: The Tasks backend is not currently available.
fi_fi: Teht‰vien taustaj‰rjestelm‰ ei ole k‰ytett‰viss‰.

source: The Tasks backend is not currently available: %s
fi_fi: Teht‰vien taustaj‰rjestelm‰ ei ole k‰ytett‰viss‰: %s

source: The alarm value must not be empty.
fi_fi: H‰lytyksen arvo ei saa olla tyhj‰.

source: The current hour
fi_fi: Kuluva tunti

source: The task "%s" has been added to task list "%s", with a due date of: %s.
fi_fi: Teht‰v‰ "%s" on lis‰tty teht‰v‰listaan "%s", valmistumisp‰iv‰m‰‰r‰ll‰: %s.

source: The task "%s" has been deleted from task list "%s".
fi_fi: Teht‰v‰ "%s" on poistettu teht‰v‰listasta "%s".

source: The task "%s" has been edited on task list "%s".
fi_fi: Teht‰v‰‰ "%s" on muokattu teht‰v‰listassa "%s".

source: The task list "%s" has been created.
fi_fi: Teht‰v‰lista "%s" on luotu.

source: The task list "%s" has been deleted.
fi_fi: Teht‰v‰lista "%s" on poistettu.

source: The task list "%s" has been renamed to "%s".
fi_fi: Teht‰v‰listan "%s" uusi nimi on "%s".

source: The task list "%s" has been saved.
fi_fi: Teht‰v‰lista "%s" on talletettu.

source: Then:
fi_fi: Niin:

source: There are no tasks matching the current criteria.
fi_fi: Ei ole teht‰vi‰ jotka vastaisivat kriteereit‰.

source: There was a problem completing %s: %s
fi_fi: Tapahtui virhe suoritettaessa valmiiksi %s: %s

source: There was a problem deleting %s: %s
fi_fi: Tapahtui virhe poistettaessa %s: %s

source: There was a problem saving the task: %s.
fi_fi: Tapahtui virhe talletettaessa teht‰v‰‰: %s.

source: There was an error importing the data: %s
fi_fi: Tapahtui virhe tuotaessa tietoa: %s

source: There was an error importing the iCalendar data.
fi_fi: iCalendar-tietojen tuonnissa tapahtui virhe.

source: There was an error removing tasks for %s. Details have been logged.
fi_fi: Tapahtui virhe poistettaessa teht‰v‰‰ %s. Tarkemmat tiedot on talletettu lokiin.

source: There were no tasks to export.
fi_fi: Ei ole teht‰vi‰ viet‰v‰ksi.

source: This file format is not supported.
fi_fi: T‰m‰ tiedostomuoto ei ole tuettu.

source: This task list cannot be deleted.
fi_fi: T‰t‰ teht‰v‰listaa ei voi poistaa.

source: To subscribe to this task list from another program, use this URL:
fi_fi: Tilataksesi t‰m‰n listan toisesta ohjelmasta k‰yt‰ t‰t‰ URL-osoitetta:

source: Turned privacy off
fi_fi: Yksityisyys pois p‰‰lt‰

source: Turned privacy on
fi_fi: Yksityisyys p‰‰lle

source: Unable to delete "%s": %s
fi_fi: Ei voida poistaa "%s": %s

source: Unable to delete tasklist "%s": %s
fi_fi: Ei voida poistaa teht‰v‰listaa "%s": %s

source: Unable to load the definition of %s.
fi_fi: Ei voi ladata m‰‰rityst‰ %s:lle.

source: Unable to save task list "%s": %s
fi_fi: Ei voida poistaa teht‰v‰listaa "%s": %s

source: Unfiled
fi_fi: Luokittelematon

source: Unique ID
fi_fi: Yksik‰sitteinen ID

source: Unsupported Content-Type: %s
fi_fi: Ei tuettu Content-Type: %s

source: We would like to remind you of this due task. %s Date: %s Time: %s %s
fi_fi: Miten haluat muistuttaa itse‰si er‰‰ntyvist‰ teht‰vist‰. %s P‰iv‰: %s Aika: %s %s

source: Week(s)
fi_fi: Viikkoa

source: Weekly
fi_fi: Viikoittain

source: What do you want to be the default due time for tasks?
fi_fi: Mit‰ haluat laittaa oletuksesi teht‰vien valmistumisajaksi?

source: When creating a new task, how many days in the future should the default due date be (0 means today)?
fi_fi: Kun luodaan uusi teht‰v‰, niin montako p‰iv‰‰ eteenp‰in pit‰isi oletus valmistumisp‰iv‰m‰‰r‰n olla (0 tarkoitaa t‰n‰‰n)?

source: When creating a new task, should it default to having a due date?
fi_fi: Kun luodaan uusi teht‰v‰, niin pit‰isikˆ sill‰ olla valmistumisp‰iv‰m‰‰r‰?

source: Which tasklist should the tasks be added to?
fi_fi: Mihin teht‰v‰listaan teht‰v‰t lis‰t‰‰n?

source: Year
fi_fi: Vuosi

source: Yearly
fi_fi: Vuosittain

source: You are not allowed to change this task list.
fi_fi: Et voi muuttaa t‰t‰ teht‰v‰listaa.

source: You are not allowed to create more than %d tasks.
fi_fi: Et voi luoda kuin enint‰‰n %d teht‰v‰‰.

source: You are not allowed to delete this task list.
fi_fi: Et voi poistaa t‰t‰ teht‰v‰listaa.

source: You are not allowed to remove user data.
fi_fi: Sinulla ei ole oikeuksia poistaa k‰ytt‰j‰tietoja.

source: You do not have permission to view this tasklist.
fi_fi: Sinulla ei ole oikeuksia selata teht‰v‰listaa.

source: You requested to be notified when tasks are added to your task lists.
fi_fi: Olet pyyt‰nyt, ett‰ saat ilmoituksen kun teht‰vi‰ lis‰t‰‰n teht‰v‰listoihisi.

source: You requested to be notified when tasks are deleted from your task lists.
fi_fi: Olet pyyt‰nyt, ett‰ saat ilmoituksen kun teht‰vi‰ poistetaan teht‰v‰listoistasi.

source: You requested to be notified when tasks are edited on your task lists.
fi_fi: Olet pyyt‰nyt, ett‰ saat ilmoituksen kun teht‰vi‰ poistetaan teht‰v‰listoistasi.

source: Your default task list:
fi_fi: Oletusteht‰v‰lista:

source: [Manage Task Lists]
fi_fi: [Hallinnoi teht‰v‰listoja]

source: [none]
fi_fi: [tyhj‰]

source: _All Tasks
fi_fi: _Kaikki teht‰v‰t

source: _All tasks
fi_fi: _Kaikki teht‰v‰t

source: _Category
fi_fi: _Kategoria

source: _Complete
fi_fi: _Suoritettu

source: _Completed tasks
fi_fi: _Suoritetut teht‰v‰t

source: _Delete
fi_fi: _Poista

source: _Description
fi_fi: K_uvaus

source: _Due Date
fi_fi: _Valmistumisp‰iv‰m‰‰r‰

source: _Edit
fi_fi: _Muokkaa

source: _Future tasks
fi_fi: _Tulevat teht‰v‰t

source: _Import/Export
fi_fi: _Tuo/Vie

source: _List Tasks
fi_fi: _Listaa teht‰v‰t

source: _New Task
fi_fi: _Uusi teht‰v‰

source: _Print
fi_fi: _Tulosta

source: _Search
fi_fi: _Haku

source: _Task List
fi_fi: _Teht‰v‰lista

source: by %s
fi_fi: %s

source: by me
fi_fi: itse

source: completed
fi_fi: suoritettu

source: in %s
fi_fi: %s

source: no due date
fi_fi: ei valmistumisp‰iv‰m‰‰r‰‰.

source: no parent
fi_fi: ei ylempi‰ teht‰v‰t

source: no start date
fi_fi: ei aloitusp‰iv‰m‰‰r‰‰

source: no time
fi_fi: ei aikatietoja

source: not completed
fi_fi: ei suoritettu
