Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/*/univention-lib/python/*.po
Languages: fr

source: Autoremove failed
fr: Échec de la suppression automatique

source: Could not initialize package manager.
fr: Impossible d'initialiser le gestionnaire de paquetages.

source: Deleting unneeded %s
fr: Suppression de %s superflus

source: Error:
fr: Erreur :

source: Failed to install
fr: Échec de l'installation

source: Failed to lock
fr: Échec du verrouillage

source: Failed to uninstall
fr: Échec de la désinstallation

source: Fetching failed
fr: Échec de la récupération

source: Further information regarding this error:
fr: Informations complémentaires au sujet de cette erreur :

source: No such package
fr: Paquetage inconnu

source: Probably another process is currently using it or the package sources are corrupt. Please try again later.
fr: Un autre processus est probablement en train de l'utiliser ou les sources des paquetages sont corrompues. Veuillez réessayer ultérieurement.

source: Some package conflicts could not be resolved. This was probably caused by packages with "hold" state.
fr: Certains conflits entre paquetages n'ont pas pu être résolus. Cela est probablement dû à des paquetages en état « suspendu ».

source: The package sources are probably corrupt.
fr: Les sources des paquetages sont probablement corrompues.

source: The sources.list entries could be repaired by executing the following commands as root on this server:
fr: Les déclarations de sources.list peuvent être réparées en exécutant sur ce serveur, en tant qu'utilisateur root, les commandes suivantes :

source: There is no free hard disk space left on the device.
fr: Il n'y a plus d'espace disponible sur le disque dur.

source: Untrusted origin
fr: Origine qui n'est pas de confiance

source: Warning:
fr: Avertissement :
