Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/*/univention-updater/umc/js/*.po
Languages: fr

source: %(name)s: Version %(old)s can be updated to %(new)s
fr: %(name)s : la version %(old)s peut être mise à jour vers la version %(new)s

source: ... loading data ...
fr: ... données en cours de chargement ...

source: ... loading log file ...
fr: ... fichier journal en cours de chargement ...

source: 1 package to be REMOVED
fr: 1 paquetage à SUPPRIMER

source: 1 package to be installed
fr: 1 paquetage à installer

source: 1 package to be updated
fr: 1 paquetage à mettre à jour

source: <b>Leave the system up and running</b> at any moment during the update!
fr: <b>Laissez le système en marche</b> pendant l'intégralité de la mise à jour !

source: <b>Warning</b>: You are currently using UCS {0}. No more regular security updates will be released for this version!<br>Update the system to a newer UCS version or, alternatively, request an extended maintenance for this version. <a target='_blank' href='https://www.univention.com/contact/'>Feel free to contact us if you want to know more</a>.
fr: <b>Avertissement </b>: vous utilisez actuellement UCS {0}. Désormais, cette version ne fait plus l'objet de mises à jour de sécurité régulières ! <br> Mettez votre système à niveau vers une nouvelle version d'UCS ou alors demandez une maintenance étendue pour cette version. <a target='_blank' href='https://www.univention.com/contact/'>N'hésitez pas à nous contacter si vous souhaitez plus d'informations</a>.

source: <b>Warning</b>: You are currently using UCS {0}. No more security updates will be released for this version. Please update the system to a newer UCS version!
fr: <b>Avertissement </b>: vous utilisez actuellement UCS {0}. Désormais, cette version ne fait plus l'objet de mises à jour de sécurité ! Mettez votre système à niveau vers une nouvelle version d'UCS !

source: <br>Enterprise subscriptions offer extended maintenance for some UCS versions. Detailed information can be found at the <a target='_blank' href='https://www.univention.com/products/prices-and-subscriptions/'>Univention Website</a>.
fr: <br>Les abonnements d'entreprise proposent une maintenance étendue pour certaines versions d'UCS. Vous pouvez trouver des informations détaillées sur le <a target='_blank' href='https://www.univention.com/products/prices-and-subscriptions/'>site web d'Univention</a>.

source: <p><b>Caution!</b> Currently a release update is performed!</p>
fr: <p><b>Attention !</b> Une mise à niveau de version est en cours !</p>

source: <p>Leave the system up and running until the update is completed!</p>
fr: <p>Laissez le système en marche jusqu'à ce que la mise à jour soit terminée !</p>

source: An update for UCS is available. Please visit the %s to install the updates.
fr: Une mise à jour d'UCS est disponible. Veuillez consulter %s pour installer les mises à jour.

source: An update for the app is available which may solve this issue.
fr: Une mise à jour susceptible de résoudre ce problème est disponible pour l'app.

source: An update of the system is being executed.
fr: Une mise à jour du système est en cours d'exécution.

source: App Center updates
fr: Mises à jour de l'App Center

source: Are you sure to close the updater log view?
fr: Souhaitez-vous vraiment fermer l’affichage du journal des mises à jour ?

source: Available system updates
fr: Mises à jour système disponibles

source: Back
fr: Retour

source: Cancel
fr: Annuler

source: Check for package updates
fr: Rechercher des mises à jour pour les paquetages

source: Closing not possible while running a update.
fr: Impossible de fermer pendant l'exécution d'une mise à jour.

source: Component '%(component)s' is not yet available for newer release versions.
fr: Le composant '%(component)s' n'est pas encore disponible pour les versions plus récentes.

source: Consider <a href="https://docs.software-univention.de/" target="_blank">release notes and changelogs</a> as well as references posted in the <a href="https://help.univention.com/" target="_blank">Univention Help</a>.
fr: Consultez aussi les <a href="https://docs.software-univention.de/" target="_blank">notes de version et listes de modifications</a> ainsi que les références publiées dans le <a href="https://help.univention.com/" targe="_blank">Help Univention</a>.

source: Consider <a href="https://docs.software-univention.de/release-notes-%s-en.html" target="_blank">release notes and changelogs</a> as well as references posted in the <a href="https://help.univention.com/" target="_blank">Univention Help</a>.
fr: Consultez aussi les <a href="https://docs.software-univention.de/release-notes-%s-en.html" target="_blank">notes de version et listes de modifications</a> ainsi que les références publiées dans le <a href="https://help.univention.com/" targe="_blank">Help Univention</a>.

source: Depending on the system performance, network connection and the installed software the update may take from 30 minutes up to several hours.
fr: La mise à jour peut prendre de 30 minutes à plusieurs heures suivant les performances du système, la qualité de la connexion réseau et les logiciels installés.

source: Detailed information about the updates.
fr: Informations détaillées sur les mises à jour.

source: Do you really want to perform the update/install/remove of the above packages?
fr: Souhaitez-vous vraiment mettre à jour / installer / supprimer les paquetages ci-dessus ?

source: Finish updates
fr: Terminer les mises à jour

source: For the changes to take effect, it is recommended to perform a restart of the UMC server components.
fr: Pour que les modifications prennent effet, il est recommandé de redémarrer les composants du serveur UMC.

source: Further release updates are available but cannot be installed.
fr: De nouvelles mises à niveau de version sont disponibles mais ne peuvent pas être installées.

source: In order to complete the recently executed action, it is required to reboot the system.
fr: Pour terminer l'action exécutée dernièrement, il est nécessaire de redémarrer le système.

source: Install
fr: Installer

source: Install package updates
fr: Installer les mises à jour de paquetages

source: Install release update
fr: Installer une mise à niveau de version

source: Investigate log further
fr: Analyser plus en détail le fichier journal

source: It is expected that the system may not respond (via web browser, SSH, etc.) during a period of up to several minutes during the update as services are stopped, updated, and restarted.
fr: Pendant la mise à jour, il est à prévoir que le système ne sera pas en mesure de répondre (à travers le navigateur, SSH, etc.) pour une période allant jusqu'à plusieurs minutes, du fait que des services sont arrêtés, mis à jour et redémarrés.

source: It is recommended to <b>test the update</b> in a separate test environment prior to the actual update.
fr: Il est recommandé de <b>tester la mise à jour</b> dans un environnement de test séparé, avant de mettre à jour en production.

source: Overview of all updates that affect the system as a whole.
fr: Aperçu de toutes les mises à jour affectant le système dans son ensemble.

source: Package update status not yet checked
fr: État de mise à jour des paquetages pas encore vérifié

source: Package updates
fr: Mises à jour de paquetages

source: Package updates are available. %(link)s
fr: Des mises à jour de paquetages sont disponibles. %(link)s

source: Please respect the following guidelines for UCS updates:
fr: Veuillez respecter les consignes suivantes pour les mises à jour d'UCS :

source: Reboot
fr: Redémarrer

source: Reboot required
fr: Un redémarrage est nécessaire

source: Release update
fr: Mise à niveau de version

source: Release updates
fr: Mises à niveau de version

source: Start Upgrade?
fr: Démarrer la mise à niveau ?

source: The App Center is not available or currently unreachable
fr: L'App Center n'est pas disponible ou actuellement injoignable

source: The Univention Updater action could not be started [Error {status}]: {message}
fr: L'action Univention Updater n'a pas pu être démarrée[Erreur {status}]: {message}

source: The components '%(components)s' are not yet available for newer release versions.
fr: Les composants '%(components)s' ne sont pas encore disponibles pour les versions plus récentes.

source: The currently installed release version is {ucs_version} errata{erratalevel}.
fr: La version actuellement installée est {ucs_version} correctifs {erratalevel}.

source: The currently installed release version is {ucs_version}.
fr: La version actuellement installée est {ucs_version}.

source: The currently installed version of the application %(name)s is not available for all newer UCS releases.
fr: La version actuellement installée de l'application %(name)s n'est pas disponible pour toutes les versions récentes d'UCS.

source: The currently used UCS version is out of maintenance. Please visit the %s for more information.
fr: La version d'UCS en cours d'utilisation n'est plus maintenue. Pour plus d'informations, veuillez consulter %s.

source: The log file exceeded {max} lines by {exceeded}. Please see the full logfile.
fr: Le fichier journal dépasse {max} lignes de {exceeded}. Veuillez consulter le fichier journal complet.

source: The update failed, please examine the log file for the exact cause. Press the "back" button to close this view.
fr: La mise à jour a échoué, veuillez consulter le fichier journal pour en déterminer la raison exacte. Appuyez sur le bouton « Retour » pour fermer cet affichage.

source: The update has been successfully finished. Press the "back" button to close this view.
fr: La mise à jour s'est terminée avec succès. Appuyez sur le bouton « Retour » pour fermer cet affichage.

source: The update is being executed.
fr: La mise à jour est en cours d'exécution.

source: The update should occur in a <b>maintenance window</b> as some services in the domain may not be available during the update.
fr: La mise à jour doit intervenir dans une <b>fenêtre de maintenance</b>, car certains services du domaine peuvent être indisponibles pendant la mise à jour.

source: The update to %s failed. Please visit the %s for more information.
fr: La mise à jour vers %s a échoué. Pour plus d’informations, veuillez consulter le %s.

source: The update to %s failed. The log file /var/log/univention/updater.log may contain more information about this.
fr: La mise à jour vers %s a échoué. Le fichier journal /var/log/univention/updater.log contient peut-être plus d’informations à ce sujet.

source: There are App Center updates available.
fr: Des mises à jour sont disponibles pour l'App Center.

source: There are no App Center updates available.
fr: Il n'y a pas de mise à jour disponible pour l'App Center.

source: There are no package updates available.
fr: Il n'y a pas de mises à jour disponibles pour les paquetages.

source: There are no release updates available.
fr: Il n'y a pas de mise à niveau de version disponible.

source: This also holds for:
fr: Ceci vaut également pour :

source: UCS is being updated
fr: UCS est en cours de mise à jour

source: UCS update failed
fr: La mise à jour d'UCS a échoué

source: UCS update successful
fr: La mise à jour d'UCS a réussi

source: Update availability could not be checked.
fr: Impossible de vérifier la disponibilité de mises à jour.

source: Update failed
fr: La mise à jour a échoué

source: Update notes
fr: Notes de mise à jour

source: Update progress
fr: Progression de la mise à jour

source: Update system up to release
fr: Mettre à jour le système vers cette version

source: Update to {release}
fr: Mettre à jour vers {release}

source: Updates
fr: Mises à jour

source: Using the %(app_center)s, you may also search for alternative apps or uninstall the application.
fr: Vous pouvez aussi rechercher des applications alternatives ou désinstaller cette application au moyen de l'%(app_center)s.

source: View log file
fr: Afficher le fichier journal

source: You may wait for the app to be released for the new UCS version.
fr: Vous pouvez attendre que l'app soit mise à jour pour la nouvelle version d'UCS.

source: a new UCS version
fr: une nouvelle version d’UCS

source: no update available yet
fr: pas encore de mise à jour disponible

source: update available
fr: mise à jour disponible

source: {count} packages to be REMOVED
fr: {count} paquetages à SUPPRIMER

source: {count} packages to be installed
fr: {count} paquetages à installer

source: {count} packages to be updated
fr: {count} paquetages à mettre à jour
