Repository: univention/univention-corporate-server
Catalog: doc/release-notes/locales/*/LC_MESSAGES/index.po
Languages: de

source: Release notes for the installation and update of Univention Corporate Server (UCS) |release|
de: Release Notes für die Inbetriebnahme und Aktualisierung von Univention Corporate Server (UCS) |release|

source: Publication date of UCS |release|: 2024-06-11
de: Veröffentlichungsdatum von UCS |release|: 2024-06-11

source: With |UCSUCS| 5.0-9, the ninth patch level release for |UCSUCS| (UCS) 5.0 is available. It provides several feature improvements and extensions, new properties, as well as, various improvements and bug fixes. Here is an overview of the most important changes:
de: Mit |UCSUCS| 5.0-9 steht das neunte Patchlevel-Update für |UCSUCS| (UCS) 5.0 zur Verfügung. Es umfasst Funktionserweiterungen und Verbesserungen, neue Eigenschaften sowie diverse Detailverbesserungen und Fehlerkorrekturen. Die wichtigsten Änderungen im Überblick:

source: Single sign-on (SSO) is a central element of integrated identity and access management (IAM). The Nubus Identity Provider already supports the most important protocols, SAML and OpenID Connect (OIDC). With Univention Corporate Server 5.0-9, OIDC is now also available for the UCS web interfaces, in particular the portal and the Univention Management Console (UMC). In addition to the migration to the newer SSO mechanism, OIDC in UCS 5.0-9 enables new functions such as the “Back-channel Logout”, which supports a Single Logout (SLO) without user interaction. To improve the user experience, an automatic update of the portal content in all open tabs after a logout ensures that the logged out state is displayed correctly everywhere.
de: ``Single Sign-on`` (SSO) ist ein zentraler Bestandteil eines integrierten Identity and Access Managements (IAM). Der Nubus Identity Provider unterstützt bereits die wichtigsten Protokolle SAML and OpenID Connect (OIDC). Mit Univention Corporate Server 5.0-9 wird OIDC nun auch für die UCS eigene Weboberfläche, insbesondere das Portal und die Univention Management Console (UMC), verfügbar gemacht. Neben der Migration auf den neueren Mechanismus für SSO ermöglicht OIDC in UCS 5.0-9 neue Funktionen wie den ``Back-channel Logout``, der einen Single Logout (SLO) ohne Nutzerinteraktion unterstützt. Zur Verbesserung der Benutzerfreundlichkeit sorgt eine automatische Aktualisierung der Portal Inhalte im Webbrowser dafür, dass der abgemeldete Zustand überall korrekt angezeigt wird.

source: The Active Directory Connection synchronizes users, groups, and computer objects between Nubus and Active Directory (AD). With UCS 5.0-9, selective synchronization has been fundamentally revised. It now enables flexible control of the synchronized objects on the basis of allow and deny filters, both at the level of entire sub trees and individual object types. The improved selection ensures that the AD Connection synchronizes only the needed objects, which avoids unwanted entries on both sides and minimizes manual effort.
de: Die Active Directory-Verbindung synchronisiert Benutzer, Gruppen und Computerobjekte zwischen Nubus und Active Directory (AD). Mit UCS 5.0-9 wurde die selektive Synchronisation grundlegend überarbeitet. Sie ermöglicht nun eine flexible Steuerung der synchronisierten Objekte auf Basis von ``Allow``- und ``Deny``-Filtern, sowohl auf Ebene ganzer Teilbäume als auch einzelner Objekttypen. Die verbesserte Selektion stellt sicher, dass die AD Verbindung nur die gewünschten Objekte synchronisiert, was unerwünschte Einträge auf beiden Seiten vermeidet und den manuellen Aufwand minimiert.

source: UCS 5.0-9 includes various security updates, for example for :program:`apache2`, :program:`BIND9`, :program:`OpenJDK-11`, :program:`dovecot`, :program:`postgresql`, :program:`systemd` and the :program:`Linux-5.10` kernel.
de: UCS 5.0-9 integriert diverse Security Updates, zum Beispiel für :program:`apache2`, :program:`BIND9`, :program:`OpenJDK-11`, :program:`dovecot`, :program:`postgresql`, :program:`systemd` und den :program:`Linux` Kernel 5.10.

source: Notes about the update
de: Hinweise zum Update

source: Run the update in a maintenance window, because some services in the domain may not be available temporarily. It's recommended that you test the update in a separate test environment before the actual update. The test environment must be identical to the production environment.
de: Führen Sie das Update in einem Wartungsfenster durch, da einige Dienste in der Domäne möglicherweise vorübergehend nicht verfügbar sind. Es wird empfohlen, die Aktualisierung in einer separaten Testumgebung zu testen, bevor Sie die eigentliche Aktualisierung durchführen. Die Testumgebung muss mit der Produktionsumgebung identisch sein.

source: Depending on the system performance, network connection, and installed software, the update can take anywhere from 20 minutes to several hours. For large environments, consult :cite:t:`ucs-performance-guide`.
de: Je nach Systemleistung, Netzwerkverbindung und installierter Software kann die Aktualisierung zwischen 20 Minuten und mehreren Stunden dauern. Für große Umgebungen konsultieren Sie bitte den :cite:t:`ucs-performance-guide`.

source: Recommended update sequence for environments with more than one UCS system
de: Empfohlene Update-Reihenfolge für Umgebungen mit mehr als einem UCS System

source: In environments with more than one UCS system, take the update sequence of the UCS systems into account.
de: Beachten Sie in Umgebungen mit mehr als einem UCS-System die Update-Reihenfolge der UCS-Systeme:

source: The authoritative version of the LDAP directory service operates on the |UCSPRIMARYDN| and replicates to all the remaining LDAP servers of the UCS domain. As changes to the LDAP schema can occur during release updates, you must always first update the |UCSPRIMARYDN| during a release update.
de: Die autoritative Version des LDAP Verzeichnisdienstes arbeitet auf dem |UCSPRIMARYDN| und repliziert auf alle übrigen LDAP-Server der UCS-Domäne. Da es bei Release-Updates zu Änderungen am LDAP-Schema kommen kann, müssen Sie bei einem Release-Update immer zuerst den |UCSPRIMARYDN| aktualisieren.

source: UCS only available for 64 bit
de: UCS nur noch als 64-Bit-Variante

source: UCS 5 is only available for the x86 64 bit architecture *amd64*. Existing 32 bit UCS systems can't update to UCS 5.
de: UCS 5 ist nur für die x86 64 Bit Architektur *amd64* verfügbar. Bestehende 32-Bit UCS-Systeme können nicht auf UCS 5 aktualisiert werden.

source: Simultaneous operation of UCS and Debian on UEFI systems
de: Gleichzeitiger Betrieb von UCS und Debian auf UEFI Systemen

source: Please note that simultaneous operation of UCS and Debian GNU/Linux on a UEFI system starting with UCS 5.0 isn't supported.
de: Beginnend mit UCS 5.0 wird ein gleichzeitiger Betrieb von UCS und Debian GNU/Linux auf einem UEFI System nicht unterstützt.

source: The reason for this is the GRUB boot loader of |UCSUCS|, which partly uses the same configuration files as Debian. An already installed Debian leads to the fact that UCS can't boot (anymore) after the installation of or an update to UCS 5.0. A subsequent installation of Debian results in UCS 5.0 not being able to boot. For more information, refer to :uv:kb:`17768`.
de: Ursache hierfür ist der Bootloader GRUB von |UCSUCS|, der teilweise die gleichen Konfigurationsdateien wie Debian verwendet. Ein bereits installiertes Debian führt dazu, dass UCS nach der Installation von bzw. einem Update auf UCS 5.0 nicht (mehr) startet. Eine nachträgliche Installation von Debian wird ebenfalls dazu führen, dass UCS 5.0 nicht mehr startet. Mehr Informationen finden Sie unter :uv:kb:`17768`.

source: Local package repository
de: Lokales Paket Repository

source: This section is relevant for environments with a :external+uv-manual:ref:`local repository <software-create-repo>`. The installed major version of UCS determines which packages a local repository provides. A repository running on a UCS server with version 4.x only provides packages up to UCS 4.x, a repository server running on UCS 5 only provides packages for UCS 5 and later.
de: Dieser Abschnitt ist relevant für Umgebungen mit einem :external+uv-manual:ref:`local repository <software-create-repo>`. Die installierte Hauptversion von UCS bestimmt, welche Pakete ein lokales Repository bereitstellt. Ein Repository, das auf einem UCS-Server mit Version 4.x läuft, stellt nur Pakete bis UCS 4.x zur Verfügung, ein Repository-Server, der auf UCS 5 läuft, nur Pakete für UCS 5 und höher.

source: To upgrade systems to UCS 5 in an environment with a local repository, consider the following options. First, you need to set up a local UCS 5 repository server.
de: Um in einer Umgebung mit lokalem Repository Systeme auf UCS 5 zu aktualisieren, bestehen unter anderem die folgenden Möglichkeiten. Zunächst muss ein lokaler UCS 5 Repository Server aufgesetzt werden.

source: Install a new UCS 5 system as a |UCSPRIMARYDN| from the DVD or from a virtualized base image. Then :external+uv-manual:ref:`setup a local repository on this system <software-create-repo>` as described in :cite:t:`ucs-manual`.
de: Installieren Sie ein neues UCS 5 System als |UCSPRIMARYDN| von der DVD oder aus einem virtualisierten Basisimage. Anschließend richten Sie :external+uv-manual:ref:`auf diesem System ein lokales Repository <software-create-repo>` ein, wie in :cite:t:`ucs-manual` beschrieben.

source: Install a new UCS 5 system with the system role |UCSBACKUPDN|, |UCSREPLICADN| or |UCSMANAGEDNODE| from the DVD or from a virtualized base image. In system setup, select that the system doesn't join a domain. Then :external+uv-manual:ref:`set up a local repository on this system <software-create-repo>` as described in :cite:t:`ucs-manual`. After you updated the |UCSPRIMARYDN| used in the domain to UCS 5, the UCS 5 repository server can join the domain through :command:`univention-join`.
de: Installieren Sie ein neues UCS 5 System in der Systemrolle |UCSBACKUPDN|, |UCSREPLICADN| oder |UCSMANAGEDNODE| von der DVD oder aus einem virtualisierten Basisimage. Wählen Sie im System-Setup aus, dass das System keiner Domäne beitritt. Richten Sie anschließend :external+uv-manual:ref:`auf diesem System ein lokales Repository <software-create-repo>` ein, wie in :cite:t:`ucs-manual` beschrieben. Nachdem Sie den |UCSPRIMARYDN| auf UCS 5 aktualisiert haben, der in der Domäne verwendet wird, kann der UCS 5 Repository Server der Domäne über :command:`univention-join` beitreten.

source: To upgrade a system in the domain to UCS 5, first update the server to the latest package level available for UCS 4.x. Then switch the repository server used by the system to the local UCS 5 repository by changing the |UCSUCRV| :external+uv-manual:envvar:`repository/online/server`. You can now upgrade the system to UCS 5 through the |UCSUMC| or through the command line.
de: Um ein System in der Domäne auf UCS 5 zu aktualisieren, aktualisieren Sie es zuerst auf den aktuellsten Paketstand unter UCS 4.x. Setzen Sie anschließend den vom System verwendeten Repository Server durch das Ändern der |UCSUCRV| :external+uv-manual:envvar:`repository/online/server` auf das lokale UCS 5 Repository. Das System kann nun über die |UCSUMC| oder über die Kommandozeile auf UCS 5 aktualisiert werden.

source: Preparation of update
de: Vorbereitung des Updates

source: This section provides more information you need to consider before you update.
de: In diesem Abschnitt finden Sie weitere Informationen, die Sie vor der Aktualisierung beachten müssen.

source: Python 3.7 compatibility
de: Python 3.7 Kompatibilität

source: Before you update, verify manually crafted Python code for compatibility with Python 3.7 and adjust it accordingly. This includes |UCSUCR| templates containing Python code. Customized AD-Connector mapping templates are an example for this. For advice, see also the :cite:t:`developer-reference`.
de: Überprüfen Sie vor der Aktualisierung manuell erstellten Python-Code auf Kompatibilität mit Python 3.7 und passen Sie ihn entsprechend an. Dies gilt auch für |UCSUCR| Vorlagen, die Python-Code enthalten. Angepasste AD-Connector Mapping Vorlagen sind ein Beispiel dafür. Für Ratschläge, siehe auch die :cite:t:`developer-reference`.

source: When you operate multiple instances of the :program:`AD Connector` as described in :ref:`uv-ext-windows:ad-multiple`, you need to adjust the mapping configuration and ensure Python 3.7 compatibility before the update. :uv:kb:`17754` describes the steps.
de: Wenn Sie mehrere Instanzen des :program:`AD Connector` betreiben, wie in :ref:`uv-ext-windows:ad-multiple` beschrieben, müssen Sie die Mapping-Konfiguration anpassen. Außerdem müssen Sie die Kompatibilität mit Python 3.7 vor dem Update sicher stellen. :uv:kb:`17754` beschreibt die Schritte.

source: Sufficient disk space
de: Ausreichender Festplattenplatz

source: Also verify that you have sufficient disk space available for the update. A standard installation requires a minimum of 6-10 GB of disk space. The update requires approximately 1-2 GB additional disk space to download and install the packages, depending on the size of the existing installation.
de: Prüfen Sie auch, ob ausreichend Festplattenplatz verfügbar ist. Eine Standard-Installation benötigt mindestens 6-10 GB Speicherplatz. Das Update benötigt je nach Umfang der vorhandenen Installation ungefähr 1-2 GB zusätzlichen Speicherplatz zum Herunterladen und Installieren der Pakete.

source: Console usage for update
de: Nutzung der Konsole für das Update

source: For the update, sign in on the system's local console as user ``root``, and initiate the update there. Alternatively, you can conduct the update using |UCSUMC|.
de: Melden Sie sich für das Update auf der lokalen Konsole des Systems mit dem Benutzer ``root`` an und starten Sie das Update dort. Alternativ können Sie das Update über |UCSUMC| durchführen.

source: If you want or have to run the update over a network connection, ensure that the update continues in case of network disconnection. Network connection interrupts may cancel the update procedure that you initiated over a remote connection. An interrupted update procedure affects the system severely. To keep the update running even in case of an interrupted network connection, use tools such as :command:`tmux`, :command:`screen`, and :command:`at`. All UCS system roles have these tools installed by default.
de: Wenn Sie das Update über eine Netzwerkverbindung durchführen möchten oder müssen, stellen Sie sicher, dass das Update im Fall einer Unterbrechung der Netzwerkverbindung weiterläuft. Unterbrechungen der Netzwerkverbindung können den Aktualisierungsvorgang abbrechen, den Sie über eine entfernte Verbindung ausgelöst haben. Ein unterbrochener Aktualisierungsvorgang kann Ihr System ernsthaft beeinträchtigen. Damit das Update auch bei einer unterbrochenen Netzwerkverbindung weiterläuft, verwenden Sie beispielsweise Werkzeuge wie :command:`tmux`, :command:`screen` oder :command:`at` einsetzen. Sie sind auf allen UCS Systemrollen installiert.

source: Script to check for known update issues
de: Skript zur Prüfung auf bekannte Update-Probleme

source: Univention provides a script that checks for problems which would prevent the successful update of the system. You can download the script before the update and run it on the UCS system.
de: Univention bietet ein Skript an, mit dem Probleme, die das Update des UCS Systems verhindern würden, schon vor dem Update erkannt werden können. Sie können das Skript vor dem Update manuell auf das System herunterladen und ausführen:

source: Post processing of the update
de: Nachbereitung des Updates

source: Following the update, you need to run new or updated join scripts. You can either use the UMC module *Domain join* or run the command :command:`univention-run-join-scripts` as user ``root``.
de: Nach dem Update müssen Sie die neuen oder aktualisierten Join-Skripte ausführen. Sie können dafür entweder das UMC-Modul *Domänenbeitritt* verwenden oder durch Befehl :command:`univention-run-join-scripts` als Benutzer ``root`` aufrufen.

source: Subsequently, you need to restart the UCS system.
de: Anschließend müssen Sie das UCS-System neu starten.

source: Notes on selected packages
de: Hinweise zum Einsatz einzelner Pakete

source: The following sections inform about some selected packages regarding the update.
de: Die folgenden Abschnitte informieren über einige ausgewählte Pakete im Zusammenhang mit dem Update.

source: Collection of usage statistics
de: Erfassung von Nutzungsstatistiken

source: When using the *UCS Core Edition*, UCS collects anonymous statistics on the use of |UCSUMC|. The modules opened get logged to an instance of the web traffic analysis tool *Matomo*. Usage statistics enable Univention to better tailor the development of |UCSUMC| to customer needs and carry out usability improvements.
de: Mit der *UCS Core Edition* werden anonyme Nutzungsstatistiken zur Verwendung von |UCSUMC| erzeugt. Die aufgerufenen Module werden dabei von einer Instanz des Web-Traffic-Analyse-Tools *Matomo* protokolliert. Nutzungsstatistiken ermögliche es Univention die Entwicklung von |UCSUMC| besser auf das Kundeninteresse zuzuschneiden und Usability-Verbesserungen vorzunehmen.

source: You can verify the license status through the menu entry :menuselection:`License --> License information` of the user menu in the upper right corner of |UCSUMC|. Your UCS system is a *UCS Core Edition* system, if the *License information* lists ``UCS Core Edition`` under *License type*.
de: Sie können den Lizenzstatus über den Menüeintrag :menuselection:`Lizenz --> Lizenzinformationen` des Benutzermenüs in der oberen rechten Ecke von |UCSUMC| überprüfen. Ihr UCS-System ist ein *UCS Core Edition*-System, wenn unter *Lizenzinformationen* unter *Lizenztyp* ``UCS Core Edition`` aufgeführt ist.

source: UCS doesn't collect usage statistics, when you use an `Enterprise Subscription <https://www.univention.com/products/prices-and-subscriptions/>`_ license such as *UCS Base Subscription* or *UCS Standard Subscription*.
de: UCS sammelt keine Nutzungsstatistiken, wenn Sie eine `Enterprise Subskription <https://www.univention.com/products/prices-and-subscriptions/>`_ wie *UCS Base Subscription* oder *UCS Standard Subscription* verwenden.

source: Independent of the license used, you can deactivate the usage statistics collection by setting the |UCSUCRV| :envvar:`umc/web/piwik` to ``false``.
de: Unabhängig von der verwendeten Lizenz, können Sie die Sammlung von Nutzungsstatistiken durch Setzen der |UCSUCRV| :envvar:`umc/web/piwik` auf ``false`` deaktivieren.

source: Recommended browsers for the access to |UCSUMC|
de: Empfohlene Browser für den Zugriff auf |UCSUMC|

source: |UCSUMC| uses numerous JavaScript and CSS functions to display the web interface. Your web browser needs to permit cookies. |UCSUMC| requires one of the following browsers:
de: |UCSUMC| verwendet für die Darstellung der Web-Oberfläche zahlreiche JavaScript- und CSS-Funktionen. Ihr Browser muss dafür Cookies zulassen. |UCSUMC| benötigt dafür einen der folgenden Browser:

source: Google Chrome as of version 85
de: Google Chrome ab Version 85

source: Mozilla Firefox as of version 78
de: Mozilla Firefox ab Version 78

source: Apple Safari and Apple Safari Mobile as of version 13
de: Apple Safari und Apple Safari Mobile ab Version 13

source: Microsoft Edge as of version 88
de: Microsoft Edge ab Version 88

source: Users running older browsers may experience display or performance issues.
de: Mit älteren Browsern können Darstellungs- oder Performanceprobleme auftreten.

source: You find the changes since UCS 5.0-8 in :external+uv-changelog-5.0-9:doc:`index`.
de: Die Änderungen seit UCS 5.0-8 finden Sie in :external+uv-changelog-5.0-9:doc:`index`.

source: Bibliography
de: Literaturverzeichnis
