Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/*/univention-system-setup/umc/js/*.po
Languages: fr

source: <i>Bond</i> interfaces allows two or more physical network interfaces to be coupled.
fr: Un <i>agrégat</i> (<i>bond</i>) permet de coupler deux interfaces réseaux physiques (ou davantage).

source: <i>Bridge</i> interfaces allows a physical network interface to be shared to connect one or more network segments.
fr: Un <i>pont</i> (<i>bridge</i>) permet à une interface réseau physique d'être partagée pour connecter un ou plusieurs segments de réseaux.

source: <i>Ethernet</i> is a standard physical interface.
fr: <i>Ethernet</i> est une interface physique standard.

source: <i>VLAN</i> interfaces can be used to separate network traffic logically while using only one or more physical network interfaces.
fr: Des interfaces <i>VLAN</i> peuvent être utilisées pour séparer logiquement le trafic réseau, tout en n'utilisant qu'une seule ou plusieurs interfaces réseau physiques.

source: Add
fr: Ajouter

source: Additional bonding options
fr: Options d'agrégation supplémentaires

source: Additional bridge options
fr: Options de pont supplémentaires

source: Additional options for this network interface
fr: Options supplémentaires pour cette interface réseau

source: Advanced configuration
fr: Configuration avancée

source: Apply changes
fr: Appliquer les modifications

source: Autoconfiguration (SLAAC)
fr: Configuration automatique (SLAAC)

source: Back to overview
fr: Retour à la vue d'ensemble

source: Bond configuration
fr: Configuration de l'agrégat

source: Bond interface configuration
fr: Configuration de l'interface d'agrégation

source: Bond primary
fr: Maître de l'agrégat

source: Bond slaves
fr: Esclaves de l'agrégat

source: Bonding
fr: Agrégation

source: Bridge
fr: Pont

source: Bridge configuration
fr: Configuration du pont

source: Bridge interface configuration
fr: Configuration de l'interface du pont

source: Bridge ports
fr: Ports du pont

source: Business unit
fr: Division opérationnelle (BU)

source: Cancel
fr: Annuler

source: Category
fr: Catégorie

source: Changes in the SSL certificate settings will result in generating new root SSL certificates. Note that this will require an update of all host certificates in the domain as the old root certificate is no longer valid. Additional information can be found in the <a href="http://sdb.univention.de/1183" target="_blank">Univention Support Database</a>.
fr: Modifier les réglages des certificats SSL aura pour conséquence de générer de nouveaux certificats SSL racines. Notez que cela nécessitera de mettre à jour tous les certificats des hôtes du domaine, du fait que l'ancien certificat racine ne sera plus valide. Vous pouvez trouver davantage d'informations à ce sujet dans la <a href="http://sdb.univention.de/1183" target="_blank">Base de données d'assistance Univention</a>.

source: Changing IP address configurations may result in restarting or stopping services. This can have severe side-effects when the system is in productive use at the moment.
fr: Changer la configuration des adresses IP peut avoir pour conséquence de redémarrer ou d'arrêter des services. Cela peut avoir de graves effets annexes lorsque le système est en cours d'utilisation.

source: Changing network settings is disabled due to specific UVMM settings. See %s for further information.
fr: Le réglage des paramètres réseau est désactivé du fait de réglages UVMM particuliers. Veuillez consulter %s pour davantage d'informations.

source: Changing network settings is disabled. It can be re enabled by unsetting the UCR variable "umc/modules/setup/network/disabled/by".
fr: Le réglage des paramètres réseau est désactivé. Vous pouvez le réactiver en réinitialisant la variable UCR "umc/modules/setup/network/disabled/by".

source: Choose interface type
fr: Choisissez le type d'interface

source: Common name for the root SSL certificate
fr: Nom courant pour le certificat SSL racine

source: Configuration finished
fr: Configuration terminée

source: Configuration of IPv4 and IPv6 adresses
fr: Configuration des adresses IPv4 et IPv6

source: Country
fr: Pays

source: Country code
fr: Code pays

source: Created:
fr: Créé :

source: DHCP query failed.
fr: La requête DHCP a échoué.

source: DHCP-Query
fr: Requête DHCP

source: Default system locale
fr: Paramètres locaux par défaut

source: Delete
fr: Supprimer

source: Domain name server
fr: Serveur de noms du domaine

source: Domain name server (max. 3)
fr: Serveurs de noms du domaine (max. 3)

source: Dynamic (DHCP)
fr: Dynamique (DHCP)

source: Each IPv6 interface must have an identifier
fr: Chaque interface IPv6 doit avoir un identifiant

source: Edit
fr: Modifier

source: Email address
fr: Adresse électronique

source: External name server
fr: Serveur de noms externe

source: External name server (max. 3)
fr: Serveurs de noms externes (max. 3)

source: Following the <i>certificate settings</i>, a new root certificate will be created for the domain.
fr: Un nouveau certificat racine va être créé pour le domaine suivant les <i>réglages des certificats</i>.

source: Forwarding delay
fr: Délai de transmission

source: Further information can be found in the <a href="http://docs.univention.de/manual-%s.html#computers:networkcomplex" target="_blank">UCS documentation</a>.
fr: Vous pouvez trouver davantage d'informations dans la <a href="http://docs.univention.de/ manual-%s.html#computers:networkcomplex" target="_blank"> documentation UCS</a>.

source: Gateway
fr: Passerelle

source: Gateway (IPv4)
fr: Passerelle (IPv4)

source: Gateway (IPv6)
fr: Passerelle (IPv6)

source: General settings
fr: Réglages généraux

source: Global network settings
fr: Réglages réseau globaux

source: HTTP proxy
fr: Serveur mandataire HTTP

source: IP network interfaces
fr: Interfaces réseau IP

source: IPv4 address
fr: Adresse IPv4

source: IPv4 network interface configuration
fr: Configuration de l'interface réseau IPv4

source: IPv6 address
fr: Adresse IPv6

source: IPv6 network interface configuration
fr: Configuration de l'interface réseau IPv6

source: IPv6 prefix
fr: Préfixe IPv6

source: Identifier
fr: Identifiant

source: Initialize the configuration process ...
fr: Initialiser le processus de configuration...

source: Installed system locales
fr: Données locales système installées

source: Interface "%s" already exists.
fr: L'interface « %s » existe déjà.

source: Interface type
fr: Type d'interface

source: Keyboard layout
fr: Disposition du clavier

source: Keyboard model
fr: Modèle de clavier

source: Keyboard variant
fr: Variante de clavier

source: Language
fr: Langue

source: Language (english)
fr: Langue (anglais)

source: Language code
fr: Code de langue

source: Language settings
fr: Réglages de langue

source: Location
fr: Lieu

source: Location settings
fr: Réglages de lieu

source: MII link monitoring frequency
fr: Fréquence de surveillance de liens par MII

source: Modified:
fr: Modifié :

source: Name
fr: Nom

source: Name of new bonding interface
fr: Nom de la nouvelle interface agrégée

source: Name of new bridge interface
fr: Nom de la nouvelle interface de pont

source: Name of new interface
fr: Nom de la nouvelle interface

source: Nameserver
fr: Serveur de noms

source: Netmask
fr: Masque de réseau

source: Network interface
fr: Interface réseau

source: Network interface configuration
fr: Configuration de l'interface réseau

source: Network interfaces
fr: Interfaces réseau

source: No changes have been made.
fr: Aucun changement n'a été apporté.

source: None
fr: Aucun

source: Not all changes could be applied successfully:
fr: Certains changements n'ont pas pu être appliqués avec succès :

source: Organization
fr: Organisation

source: Organization settings
fr: Réglages de l'organisation

source: Parent interface
fr: Interface parente

source: Please choose a network interface before querying a DHCP address.
fr: Veuillez choisir une interface réseau avant de demander une adresse DHCP.

source: Please confirm to apply these changes to the system. This may take some time.
fr: Veuillez confirmer l'application de ces modifications au système. Cela peut prendre un certain temps.

source: Please confirm to delete the following interfaces:
fr: Veuillez confirmer la suppression des interfaces suivantes :

source: Please specify the ports which will be added to the bridge.
fr: Veuillez indiquer les ports à ajouter au pont.

source: Primary network interface
fr: Interface réseau primaire

source: Removed:
fr: Supprimé :

source: SSL root certificate
fr: Certificat SSL racine

source: Setup for UCS Virtual Machine Manager
fr: Installation d'UCS Virtual Machine Manager

source: Several network types can be chosen.
fr: Vous pouvez choisir plusieurs types de réseaux.

source: Should the nameserver and gateway be set: %s
fr: Le serveur de noms et la passerelle doivent-ils être définis : %s

source: State
fr: État

source: Static
fr: Statique

source: Static (IPv6)
fr: Statique (IPv6)

source: The changes have been applied successfully.
fr: Les modifications ont été appliquées avec succès.

source: The connection to the server could not be established after {time} seconds. This problem can occur due to a change of the IP address. In this case, please login to Univention Management Console again at the {linkStart}new address{linkEnd}.
fr: La connexion au serveur n'a pas pu être établie au bout de {time} secondes. Ce problème peut survenir à cause d'un changement d'adresse IP. Dans ce cas, veuillez vous reconnecter à la console Univention Management Console à la {linkStart}nouvelle adresse{linkEnd}.

source: The following changes will be applied to the system:
fr: Les modifications suivantes seront appliquées au système :

source: The following entries could not be validated:
fr: Les entrées suivantes n'ont pas pu être validées :

source: The following interfaces are already used by other interfaces and can not be deleted:
fr: Les interfaces suivantes sont déjà utilisées par d'autres interfaces et ne peuvent donc pas être supprimées :

source: There are no more physical interfaces to create.
fr: Il n'y a plus d'interface physique à créer.

source: Time zone
fr: Fuseau horaire

source: Time zone and keyboard settings
fr: Réglages de fuseau horaire et de clavier

source: Unconfigured
fr: Non configuré

source: VLAN ID
fr: ID VLAN

source: Validation error
fr: Erreur de validation

source: Virtual LAN
fr: LAN virtuel

source: don't set
fr: ne pas définir

source: set
fr: définir
