Repository: univention/univention-corporate-server
Catalog: */univention-l10n-*/*/management/univention-directory-manager-modules/modules/univention/admin/handlers/dhcp/*.po
Languages: fr

source: A pool of dynamic addresses assignable to hosts.
fr: Un réservoir d'adresses dynamiques pouvant être assignées aux hôtes.

source: A shared physical network, where multiple IP address ranges are used.
fr: Un réseau physique partagé, où plusieurs plages d'adresses IP sont utilisées.

source: A unique name for this DHCP host entry. Using the hostname is recommended.
fr: Un nom unique pour cette entrée d'hôte DHCP. Il est recommandé d'utiliser le nom d'hôte.

source: A unique name for this DHCP pool object.
fr: Un nom unique pour cet objet réservoir DHCP.

source: A unique name for this DHCP service.
fr: Un nom unique pour ce service DHCP.

source: A unique name for this shared network.
fr: Un nom unique pour ce réseau partagé.

source: Additional options for DHCP
fr: Options supplémentaires pour DHCP

source: Additional statements for DHCP
fr: Déclarations supplémentaires pour DHCP

source: Address prefix length (or Netmask)
fr: Longueur du préfixe d'adresse (ou masque de réseau)

source: Addresses from this pool are given to clients using the old BOOTP protocol, which has no mechanism to free addresses again.
fr: Les adresses de ce réservoir sont attribuées aux clients utilisant l'ancien protocole BOOTP, qui ne dispose pas d'un mécanisme pour libérer ultérieurement les adresses.

source: Addresses from this pool are given to clients which have a DHCP host entry matching their MAC address, but with no IP address assigned.
fr: Les adresses de ce réservoir sont attribuées aux clients ayant une entrée d'hôte DHCP correspondant à leur adresse MAC mais aucune adresse IP assignée.

source: Addresses from this pool are given to clients, which do not have a DHCP host entry matching their MAC address.
fr: Les adresses de ce réservoir sont attribuées aux clients n'ayant pas d'entrée d'hôte DHCP correspondant à leur adresse MAC.

source: Advanced
fr: Avancé

source: Advanced DHCP pool options
fr: Options avancées du groupe DHCP

source: All DHCP services
fr: DHCP : service

source: All clients
fr: Tous les clients

source: Allow adding custom DHCP options. Experts only!
fr: Autoriser l'ajout d'options DHCP personnalisées. Pour experts uniquement !

source: Allow custom DHCP options
fr: Autoriser les options DHCP personnalisées

source: Allow dynamic BOOTP clients
fr: Autoriser les clients BOOTP dynamiques

source: Allow known clients
fr: Autoriser les clients connus

source: Allow unknown clients
fr: Autoriser les clients inconnus

source: An IP address range used in a shared network.
fr: Une plage d'adresses IP utilisée dans un réseau partagé.

source: Assign one or more fixed IP addresses. Each address should be either an IP address or a domain name that resolves to one or more IP addresses.
fr: Assigner une ou plusieurs adresses IP fixes. Chaque adresse sera une adresse IP ou un nom de domaine pointant vers une ou plusieurs adresses IP.

source: Associate a service with a server.
fr: Associer un service à un serveur.

source: Basic settings
fr: Réglages de base

source: Broadcast address
fr: Adresse de diffusion

source: Configure a host identified by its hardware MAC address.
fr: Configurer un hôte identifié par son adresse MAC matérielle.

source: Currently, only the ethernet and token-ring types are recognized. The hardware-address should be a set of hexadecimal octets (numbers from 0 through ff) separated by colons.
fr: Seuls les types Ethernet et Token Ring sont reconnus pour le moment. L'adresse matérielle est composée d'ensembles d'octets en hexadécimal (des nombres de 0 à ff), séparés par des doubles-points.

source: Custom DHCP options
fr: Options DHCP personnalisées

source: DHCP Statements
fr: Déclarations DHCP

source: DHCP host
fr: Hôte DHCP

source: DHCP hosts
fr: Hôtes DHCP

source: DHCP options
fr: Options DHCP

source: DHCP pool
fr: Pool DHCP

source: DHCP pools
fr: Pools DHCP

source: DHCP server
fr: Serveur DHCP

source: DHCP server description
fr: Description du serveur DHCP

source: DHCP servers
fr: Serveurs DHCP

source: DHCP service
fr: Service DHCP

source: DHCP service description
fr: Description du service DHCP

source: DHCP services
fr: Services DHCP

source: DHCP shared network description
fr: Description du réseau partagé DHCP

source: DHCP subnet
fr: Sous-réseau DHCP

source: DHCP subnets
fr: Sous-réseaux DHCP

source: DHCP: Host
fr: DHCP : hôte

source: DHCP: Pool
fr: DHCP : groupe

source: DHCP: Server
fr: DHCP : serveur

source: DHCP: Shared network
fr: DHCP : réseau partagé

source: DHCP: Shared subnet
fr: DHCP : sous-réseau partagé

source: DHCP: Subnet
fr: DHCP : sous-réseau

source: Define a pool of addresses available for dynamic address assignment.
fr: Définir un groupe d'adresses disponibles pour l'assignation automatique d'adresses.

source: Dynamic address assignment
fr: Assignation dynamique des adresses

source: Failover peer configuration
fr: Pair de secours

source: Fixed IP addresses
fr: Adresses IP fixes

source: General
fr: Général

source: General DHCP host settings
fr: Réglages généraux de l'hôte DHCP

source: General DHCP pool settings
fr: Réglages généraux du groupe DHCP

source: General DHCP shared subnet settings
fr: Réglages généraux du sous-réseau partagé DHCP

source: General DHCP subnet settings
fr: Réglages généraux du sous-réseau DHCP

source: General settings
fr: Réglages généraux

source: Globally enable or disable this pool.
fr: Activer ou désactiver ce réservoir globalement.

source: Hardware address
fr: Adresse matérielle

source: Hostname
fr: Nom d'hôte

source: IP range for dynamic assignment
fr: Plage d'IP pour l'assignation dynamique

source: Low-level DHCP configuration
fr: Configuration DHCP de bas niveau

source: Manage the Domain Host Configuration Protocol service.
fr: Gérer le service DHCP (Domain Host Configuration Protocol).

source: Name
fr: Nom

source: Neither DN nor position given.
fr: Ni nom de domaine, ni position n'ont été fournis.

source: Server name
fr: Nom du serveur

source: Service name
fr: Nom du service

source: Shared DHCP subnet
fr: Sous-réseau DHCP partagé

source: Shared DHCP subnets
fr: Sous-réseaux DHCP partagés

source: Shared network
fr: Réseau partagé

source: Shared network name
fr: Nom du réseau partagé

source: Subnet address
fr: Adresse de sous-réseau

source: The IP address range used in a dedicated (non-shared) physical network.
fr: La plage d'adresses IP utilisée dans un réseau physique dédié (non partagé).

source: The IP addresses used to send data to all hosts inside the network.
fr: Les adresses IP utilisées pour envoyer des données à tous les hôtes hébergés sur le réseau.

source: The name of the "failover peer" configuration to use.
fr: Le nom de la configuration "failover peer" (partenaire de gestion de panne) à utiliser.

source: The name of the server, which should handle this DHCP service.
fr: Le nom du serveur devant gérer ce service DHCP.

source: The network address.
fr: L'adresse de réseau.

source: The number of leading bits of the IP address used to identify the network.
fr: Le nombre de bits de tête, dans l'adresse IP, servant à identifier le réseau.

source: The subnet mask does not match the subnet.
fr: Le masque de sous-réseau ne correspond pas au sous-réseau.

source: The top-level container for a DHCP configuration.
fr: Le conteneur de plus haut niveau pour la configuration DHCP.
